{
    "id": "f090227a-3e00-4357-95c5-b92fc71a7ea2",
    "created_at": "2023-01-12T15:09:18.765127Z",
    "updated_at": "2025-03-27T02:05:26.384037Z",
    "deleted_at": null,
    "sha1_hash": "fd82b4d11285df96f4efcf12126737461838d7cf",
    "title": "2021-06-17 - Vigilante malware rats out software pirates while blocking ThePirateBay",
    "authors": "",
    "file_creation_date": "2022-05-27T21:51:53Z",
    "file_modification_date": "2022-05-27T21:51:53Z",
    "file_size": 1093306,
    "plain_text": "# Vigilante malware rats out software pirates while blocking ThePirateBay\n\n**[news.sophos.com/en-us/2021/06/17/vigilante-antipiracy-malware/](https://news.sophos.com/en-us/2021/06/17/vigilante-antipiracy-malware/)**\n\nAndrew Brandt June 17, 2021\n\nIn one of the strangest cases I’ve seen in a while, one of my Labs colleagues recently told\nme about a malware campaign whose primary purpose appears to stray from the more\ncommon malware motives: Instead of seeking to steal passwords or to extort a computer’s\nowner for ransom, this malware blocks infected users’ computers from being able to visit a\nlarge number of websites dedicated to software piracy by modifying the HOSTS file on the\ninfected system.\n\nThe malware also downloaded and delivered a second malware payload, an executable\nnamed ProcessHacker.jpg\n\nModifying the HOSTS file is a crude but effective method to prevent a computer from being\nable to reach a web address. It’s crude because, while it works, the malware has no\npersistence mechanism. Anyone can remove the entries after they’ve been added to the\nHOSTS file, and they stay removed (unless you run the program a second time). It was also\nvery familiar to me, personally, because I discovered a family of malware more than 10 years\n[ago that performed a nearly identical set of behaviors and wrote up an analysis.](https://www.webroot.com/blog/2010/11/24/troublesome-trojan-trammels-torrent-sites/)\n\nA Process Monitor log shows a fake Among Us malware executable modifying the HOSTS\nfile\nWe weren’t able to discern a provenance for this malware, but its motivation seemed pretty\nclear: It prevents people from visiting software piracy websites (if only temporarily), and\nsends the name of the pirated software the user was hoping to use to a website, which also\ndelivers a secondary payload. The file adds from a few hundred to more than 1000 web\ndomains to the HOSTS file, pointing them at the localhost address, 127.0.0.1.\n\n## Fake games on Discord\n\n\n-----\n\nAt least some of the malware, disguised as pirated copies of a wide variety of software\npackages, was hosted on game chat service Discord. Other copies, distributed through\nBittorrent, were also named after popular games, productivity tools, and even security\nproducts, accompanied by additional files (more on those lower down in the story) that make\nit appear to have originated with a well-known file sharing account on ThePirateBay.\n\nThe provenance of this file in VirusTotal was Discord\nThere seem to be hundreds of different software brands represented by the filenames found\nin a search on Virustotal for related samples. Files like “Left 4 Dead 2 (v2.2.0.1 Last Stand +\nDLCs + MULTi19)” and “Minecraft 1.5.2 Cracked [Full Installer][Online][Server List]” mimic\nthe naming conventions commonly used to label pirated software.\n\n\n-----\n\nThe files that appear to be hosted on Discord s file sharing tend to be lone executable files.\nThe ones distributed through Bittorrent have been packaged in a way that more closely\nresembles how pirated software is typically shared using that protocol: Added to a\ncompressed file that also contains a text file and other ancillary files, as well as an oldfashioned Internet Shortcut file pointing to ThePirateBay.\n\nMany, but not all the malware executables were digitally signed by a bogus code signer. This\nmight help it pass some rudimentary checks of whether the file is signed, regardless of the\ncryptographic validity, but these signed files don’t bear any scrutiny. The signatures have a\nSigner Name that’s just an 18-character long random string of upper-case letters. The\ncertificate validity began on or around the first day most of the files appeared for download,\nand are set to expire on December 31, 2039.\n\nLikewise, the properties sheets of the malware executables doesn’t align with what the\nfilename of the malware makes it appear to be. Most of the files represented themselves as\nbeing installers for full-featured, licensed copies of games or productivity software, but many\nof the actual files have completely different names in the File Description field, such as “AVG\nremediation exe,” “BitLocker Drive Encryption,” or “Microsoft Office Multi-Msi ActiveDirectory\nDeployment Tool.”\n\n\n-----\n\nProperties sheet data didn’t match the filenames of the binaries (in the title bar)\nThe creators don’t seem to have cared that these property sheets didn’t match the filenames,\nand weren’t too picky about . We found a few archives that were pretending to contain\ninstallers for different software packages, but that contained the same malware executable,\njust with a different name slapped on.\n\nThe same malware was\n\npackaged to look like many different programs\n\n## What the malware does\n\nThe end-user experience of running the malware is brief. When double-clicked, it triggers the\nappearance of a bogus error message that reads “The program can’t start because\nMSVCR100.dll is missing from your computer. Try reinstalling the program to fix this\nproblem.”\n\n\n-----\n\nUsing Process Monitor, I was able to determine that it never even queries the Windows API\nfor this file. To call the malware’s bluff, I dropped a valid copy of this older DLL (that checks\nout) into the folder with the program itself, but the bogus dialog appears anyway.\n\nThe malware does a few things upon execution. It checks to see whether it can make an\noutbound network connection. If it can, it attempts to contact a URI on the domain\n**1flchier[.]com. The domain appears to be a typosquat clone of the cloud storage provider**\n1fichier, spelled with an L as the third character in the name instead of an I.\n\nThe malware used the same User-Agent string for these requests: Mozilla/5.0 Gecko/41.0\n**Firefox/41.0 even though there were other User-Agent strings embedded in the files.**\n\nIronically, a few of the HOSTS file modifications prevented users from visiting the legitimate\n1fichier web domain.\n\nThe samples performed two HTTP GET requests to this domain: The first was to retrieve a\nsecondary executable payload named ProcessHacker.jpg; The second uses a query string\nto send the filename of the executable that was run to the website’s operators. Unfortunately,\nwe don’t know who owns the site, and it no longer responds to requests, nor has a DNS\nrecord. Nevertheless, the malware that tries to contact this site is still available from\ndownload links and torrents.\n\n\n-----\n\nThe ProcessHacker binary has some interesting characteristics of its own, including the fact\nit sets a mutex of whoareyoutellmeandilltellyouwho so it only runs one copy of itself.\n\nThe MITRE ATT&CK matrix of behaviors by the ProcessHacker.jpg payload\nSome samples, on execution, seemed to have a kill switch. When first run, these samples\nsearch for a couple of very specific filenames in any of the locations defined by the %PATH%\nenvironment variable. If it finds them both, the software quits.\n\nThe anti-piracy killswitch\n\n\n-----\n\nThe filenames it looks for are 7686789678967896789678 and 412412512512512. When I\ncreated zero-byte files named after each of those names, and stuck them in a %PATH%\nfolder, the software halted on launch and didn’t modify the HOSTS file.\n\nMany of the samples also performed a query of the Windows Registry for a specific key that\nisn’t normally a part of Windows:\n**HKLM\\System\\CurrentControlSet\\Control\\CI\\Disable26178932. Judging by the name, I**\nguessed that this might be another kill switch, but when I manually created that key and ran\nthose samples, I observed that the malware checked to see if the key was there, got an\naffirmative response from the operating system, then went right on executing.\n\n\n-----\n\nFinally, it modifies the HOSTS file. On modern Windows computers, the malware has to run\nas an elevated (administrator-privileges) user. Most of the malware triggered Windows to\nelevate its privileges, but not all of it did. The samples that didn’t automatically ask for the\nadditional privileges failed to modify the HOSTS file when I ran them normally, but did when I\nran them as an administrator.\n\n## Bittorrent bundles bear bogus bulk\n\nLooking more closely at these files bundled with the installer, it’s clear that they have no\npractical benefit other than to give the archive the appearance of files typically shared over\nBittorrent, and to modify hash values with the addition of random data.\n\nThe Readme!.txt file was identical with all samples\nEach archive includes a modified version of a Readme!.txt file that says (among other\nthings) the following:\n\nInstall using .EXE inside your folder. Everything will be activated using data.dat!\n\nIf you can’t find .EXE, then it seems like it got deleted by your Antivirus or Windows\nDefender.\n\nAntiviruses don’t like cracks, so disable it while you downloading and installing, then\nreenable after.\n\nThe archives also contain a file called data.dat, as mentioned in Readme!.txt. Upon closer\nexamination, it’s a JPEG image of an artist’s rendition of a pine forest. Hard to see how that\nactivates anything.\n\n\n-----\n\nThe archives also contain a file, ranging from about 90kb to more than 200kb in size, filled\nwith mostly gibberish data, with a randomized filename and the file suffix .nfo. In other\nBittorrent archives, these .nfo files are usually plain text files with additional information about\nthe particular software bundled in the archive.\n\nBut the .nfo files bundled with these malware contain some garbage data for the first 1150\nbytes, followed by a nonprintable character, which renders everything following that\ncharacter not visible in a text editor like Notepad.\n\n\n-----\n\nThe contents of a malicious archive shared via Bittorrent\nWhen viewed in a hex editor, the full contents are visible: following that first 1150 bytes, the\nfile contains a racial epithet that is repeated more than 1000 times (taking up roughly the\nnext 16kb of space), followed by a large, randomly-sized block of random alphabetic\ncharacters. Padding out the archive with purposeless files of random length may simply be\ndone to modify the archive’s hash value. Padding it out with racist slurs told me all I needed\nto know about its creator.\n\n## Detection and cleanup\n\nSophos endpoint products detect this threat by its unique runtime packer, which is the same\nas used by an unrelated malware family, Qbot, as Mal/EncPk-APV.\n\nUsers who have inadvertently run one of these files can clean up their HOSTS file manually,\nby running a copy of Notepad elevated (as administrator), and modifying the file at\nc:\\Windows\\System32\\Drivers\\etc\\hosts to remove all the lines that begin with “127.0.0.1”\nand reference the various ThePirateBay (and other) sites.\n\nSophosLabs has published IOCs relating to this article, including file hashes, to the\nSophosLabs Github. The labs thanks Senior Manager for Threat Research Richard Cohen\nfor his eagle eye finding this oddball malware.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-17 - Vigilante malware rats out software pirates while blocking ThePirateBay.pdf"
    ],
    "report_names": [
        "2021-06-17 - Vigilante malware rats out software pirates while blocking ThePirateBay.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536158,
    "ts_updated_at": 1743041126,
    "ts_creation_date": 1653688313,
    "ts_modification_date": 1653688313,
    "files": {
        "pdf": "https://archive.orkl.eu/fd82b4d11285df96f4efcf12126737461838d7cf.pdf",
        "text": "https://archive.orkl.eu/fd82b4d11285df96f4efcf12126737461838d7cf.txt",
        "img": "https://archive.orkl.eu/fd82b4d11285df96f4efcf12126737461838d7cf.jpg"
    }
}