{
    "id": "f09ec054-7c78-4f42-80ad-e44f9b8d7675",
    "created_at": "2023-01-12T15:01:43.383262Z",
    "updated_at": "2025-03-27T02:10:07.502464Z",
    "deleted_at": null,
    "sha1_hash": "e12a30c55fcf384c91d683ce1ac90f33ab50ce60",
    "title": "2021-08-24 - From Pearl to Pegasus Bahraini Government Hacks Activists with NSO Group Zero-Click iPhone Exploits",
    "authors": "",
    "file_creation_date": "2022-05-28T15:40:48Z",
    "file_modification_date": "2022-05-28T15:40:48Z",
    "file_size": 9769438,
    "plain_text": "# From Pearl to Pegasus Bahraini Government Hacks Activists with NSO Group Zero-Click iPhone Exploits\n\n**[citizenlab.ca/2021/08/bahrain-hacks-activists-with-nso-group-zero-click-iphone-exploits/](https://citizenlab.ca/2021/08/bahrain-hacks-activists-with-nso-group-zero-click-iphone-exploits/)**\n\nAugust 24, 2021\n\n[Research](https://citizenlab.ca/category/research/)\n\n\n-----\n\n[Targeted Threats](https://citizenlab.ca/category/research/targeted-threats/)\nBy [Bill Marczak,](https://citizenlab.ca/author/bmarczak/) [Ali Abdulemam,](https://citizenlab.ca/author/ali-abdulemam/) [Noura Al-Jizawi,](https://citizenlab.ca/author/noura/) [Siena Anstis,](https://citizenlab.ca/author/siena-anstis/) [Kristin Berdan,](https://citizenlab.ca/author/kristin-berdan/) John ScottRailton, and [Ron Deibert](https://citizenlab.ca/author/profd/)\n\n[1] Red Line for Gulf\n\nAugust 24, 2021\n\n## Summary & Key Findings\n\nWe identified nine Bahraini activists whose iPhones were successfully hacked with\nNSO Group’s Pegasus spyware between June 2020 and February 2021. Some of the\nactivists were hacked using two zero-click iMessage exploits: the 2020 **_[KISMET](https://citizenlab.ca/2020/12/the-great-ipwn-journalists-hacked-with-suspected-nso-group-imessage-zero-click-exploit/)_** exploit\nand a 2021 exploit that we call FORCEDENTRY.\n[The hacked activists included three members of Waad (a secular Bahraini political](https://www.aldemokrati.org/)\n[society), three members of the Bahrain Center for Human Rights, two exiled Bahraini](https://bahrainrights.net/)\n[dissidents, and one member of Al Wefaq (a Shiite Bahraini political society).](https://en.wikipedia.org/wiki/Al_Wefaq)\nAt least four of the activists were hacked by LULU, a Pegasus operator that we\nattribute with high confidence to the government of Bahrain, a well-known abuser of\nspyware. One of the activists was hacked in 2020 several hours after they revealed\nduring an interview that their phone was hacked with Pegasus in 2019.\nTwo of the hacked activists now reside in London, and at least one was in London\nwhen they were hacked. In our research, we have only ever seen the Bahrain\ngovernment spying in Bahrain and Qatar using Pegasus; never in Europe. Thus, the\nBahraini activist in London may have been hacked by a Pegasus operator associated\nwith a different government.\nWe shared a list of the targeted phone numbers we identified with Forbidden Stories.\nThey confirmed that numbers associated with five of the hacked devices were\n[contained on the Pegasus Project’s list of potential targets of NSO Group’s customers,](https://forbiddenstories.org/about-the-pegasus-project/)\ndata that Forbidden Stories and Amnesty International describe as dating from 2016 up\nto several years ago.\n\n\n-----\n\n## 1. Human Rights in Bahrain: A History of Brutal Repression\n\n_Bahrain is a constitutional monarchy on paper, though in practice, all key power is_\nconcentrated in the hands of the ruling Al-Khalifa family. Bahrain’s legislature consists\nof an upper house (Shura Council) appointed by the king, and a lower house (National\nAssembly) elected from districts of unequal population, drawn to ensure the opposition\ncannot attain a majority. Bahrain has a long history of political movements seeking\ngreater democratic political reform. More details.\n_Bahrain has a history of brutal repression of dissent. After King Hamad came to power_\nas Emir in 1999, the political and human rights situation briefly improved. The king\nallowed the formation of civil society organizations, including human rights groups,\nindependent newspapers, and political parties. However, these reforms were gradually\nundone, and by 2010, Bahrain had reverted to its long pattern of arrests, torture, and\naggressive silencing of political opposition. Little vestige of Bahraini civil society\nremains today. More details.\n_Bahrain employs a number of methods to block or suppress Internet content. Bahrain’s_\ngovernment implements Internet censorship using website-blocking technology from a\nCanadian company, Netsweeper, and also employs targeted Internet disruptions in\norder to stymie protests. Bahrainis who have posted critical content online have been\npursued by the Ministry of Interior’s Cyber Crime Unit and arrested. More details.\n_Bahrain surveils human rights activists, dissidents, and members of the political_\n_opposition. The government increasingly uses Internet controls and spyware, targeting_\nindividuals inside Bahrain and outside the country. Since 2010, Bahrain has purchased\nspyware from FinFisher, Hacking Team, and NSO Group. More details.\n\n## 2. Pegasus Hacking of Bahraini Activists\n\nThe government of Bahrain appears to have purchased NSO Group’s Pegasus spyware in\n2017. Our [Hide and Seek](https://citizenlab.ca/2018/09/hide-and-seek-tracking-nso-groups-pegasus-spyware-to-operations-in-45-countries/) report identified a Pegasus operator spying entirely in Bahrain and\nQatar that we referred to as PEARL, which had been active since July 2017.\n\nWe observed a massive global spike in Pegasus activity in July 2020, and began conducting\nresearch in a number of country contexts, including Bahrain. We hunted for Pegasus in\nBahrain by instructing targets to forward us their phone logs for analysis, and by setting up\nVPNs for key targets to monitor their Internet traffic. We analyzed the phone logs using our\nforensic process, and found that nine devices belonging to nine Bahraini activists had been\nhacked. In three cases, our forensic analysis concluded that the phones were hacked, but\nwe were unable to establish an approximate date of the hacking. Analysis is ongoing in these\ncases to see if a more precise date can be identified. In the remaining six cases, our analysis\nestablished some precise dates when Pegasus was active on the phones.\n\nThe two targets we identified in London consented to be named, though all of the targets in\nBahrain wished to be referred to by their affiliations only.\n\n\n-----\n\n**TargetTarget** **DescriptionDescription** **Date(s) of HackingDate(s) of Hacking**\n\n\n**Moosa Abd-**\n**Ali *** **Activist**\n\n**Yusuf Al-**\n**Jamri** **Blogger**\n\n\n**(Sometime before September**\n**2020)**\n\n**(Sometime before September**\n**2019)**\n\n\n**Activist A** **Member of Waad** **September 16, 2020**\n\n**June 3, 2020**\n**July 12, 2020**\n\n**July 19, 2020**\n\n**July 24, 2020**\n\n**August 6, 2020**\n\n\n**Activist B ***\n\n\n**Member of Waad, Labor Law**\n**Researcher**\n\n\n**September 15, 2020**\n\n\n**Activist C** **Member of Waad** **September 14, 2020**\n\n**Activist D *** **Member of BCHR** **September 14, 2020**\n\n**Activist E** **Member of BCHR** **February 10, 2021**\n\n**July 11, 2020**\n**July 15, 2020**\n\n**July 22, 2020**\n\n**October 13, 2020**\n\n**Activist F *** **Member of BCHR**\n\n\n**Activist G *** **Member of Al Wefaq**\n\n\n**(Sometime before October**\n**2019)**\n\n\n(*) = Forbidden Stories confirmed that the phone number currently associated with the device\nis on the Pegasus Project list, indicating that it was previously a potential target of NSO\nGroup’s customers.\n\n### Bahraini Targets\n\n_This section describes the Bahraini targets hacked with Pegasus that we identified._\n\n**Waad**\n\n\n-----\n\nThree targets are members of Waad, a center-left secular political society in Bahrain.\nPolitical parties are illegal in Bahrain, but “political societies,” which perform many of the\nfunctions of political parties, have been allowed since 2001.\n\nFigure 1: The logo of Bahrain’s Waad political society.\nThe Bahraini government banned Waad and seized its assets amidst a wave of repression in\nearly 2017. The government claimed that Waad had “support[ed] terrorism and sanction[ed]\n[violence,” despite the fact that Waad has never used violence, and has always committed](https://www.amnesty.org/en/latest/press-release/2017/05/bahrain-heading-for-total-suppression-of-human-rights-as-secular-opposition-group-banned/)\nitself to peaceful methods. Before it was banned, Waad’s headquarters was twice subjected\n[to arson, and was defaced by pro-government protesters in 2011 who wrote “Down with Iran”](https://www.aljazeera.com/news/2011/12/10/bahrain-opposition-party-office-walls-defaced)\nand slogans against Bahrain’s Shia muslims.\n\n**Bahrain Center for Human Rights**\n\nThree targets are members of the Bahrain Center for Human Rights, a Bahraini NGO formed\nin 2002, and banned since 2004, when the Center’s then-President blamed Bahrain’s Prime\nMinister for failing to address citizens’ economic concerns. Nevertheless, the organization\n[has continued to operate without government approval, and was awarded the 2013 Rafto](https://www.rafto.no/the-rafto-prize/bahrain-center-for-human-rights)\nPrize.\n\nFigure 2: The logo of the Bahrain Center for Human Rights.\n\n**Al Wefaq**\n\nOne target is a member of Al Wefaq, Bahrain’s largest opposition political society. All of the\nAl Wefaq members of Bahrain’s National Assembly resigned en masse in 2011 in protest of\nthe government’s violent repression of peaceful protesters. A Bahrain-based news channel\n_Al-Arab was shut down less than 24 hours after it was launched in February 2015 because_\nthe channel aired an interview with the Secretary General of Al Wefaq. In July 2016, the\nBahraini government dissolved Al Wefaq and seized its assets. Also in 2016, the Bahraini\ngovernment revoked the citizenship of Al Wefaq’s de-facto spiritual leader Sheikh Isa\nQassim, a Bahraini by birth.\n\n\n-----\n\nFigure 3: The logo of Bahrain’s Al-Wefaq political society.\nThe Bahrain government has clumsily attempted to link Al Wefaq to terrorism and violence\nfor a number of years. During the height of the protests in Bahrain in 2011, state television\naired a forced confession read by a detainee who had earlier died under torture. In the forced\n[confession, the detainee said that Matar Matar, a moderate member of Al Wefaq, had](https://www.hrw.org/news/2011/05/04/bahrain-arbitrary-arrests-escalate)\nordered him to murder policemen. Matar had earlier called for the establishment of a secular\ndemocracy in Bahrain, and had condemned the arrest of doctors that had treated protesters.\n\n**London Targets**\n\nTwo of the targets, Moosa Abd-Ali and Yusuf Al-Jamri, are Bahrainis currently living in exile\nin London.\n\n\n-----\n\nFigure 4: Bahraini blogger Yusuf Al-Jamri.\nAl-Jamri was granted asylum by the UK Home Office in 2018, based on his reports that he\nwas tortured in 2017 while in the custody of Bahrain’s main intelligence agency, the National\nSecurity Apparatus (ﺟﻬﺎز اﻷﻣﻦ اﻟﻮﻃﻨﻲ). Bahrain’s National Security Apparatus (NSA) is\n[infamous for torturing to death journalist Karim Fakhrawi in 2011, according to the findings of](https://cpj.org/data/people/karim-fakhrawi/)\nan independent inquiry (para. 877) that Bahrain’s king ordered under international pressure.\nAfter recommendations from the same commission of inquiry, Bahrain’s king in 2012 revoked\n[the NSA’s law enforcement powers, though he restored these powers in a January 2017](https://birdbh.org/2017/01/bahrain-restores-law-enforcement-powers-to-nsa-reversing-bici-recommendation/)\n[Royal Decree. A Royal Decree in 2020 changed the name of the NSA to the National](https://www.lloc.gov.bh/15426.aspx?cms=q8FmFJgiscJUAh5wTFxPQnjc67hw%2Bcd53dCDU8XkwhyDqZn9xoYKj1a78KJNx7dPZjJvLNo94N5YH7SCY6etmg%3D%3D)\nIntelligence Service (ﺟﻬﺎز اﻟﻤﺨﺎﺑﺮات اﻟﻮﻃﻨﻲ).\n\nAl-Jamri’s iPhone 7 appears to have been hacked with Pegasus at some point prior to\nSeptember 2019. We were unable to determine whether he was hacked while in Bahrain or\nLondon. Further forensic analysis may be able to establish a more precise date of hacking.\n\n\n-----\n\nFigure 5: Bahraini activist Moosa Abd-Ali protesting in front of the Bahraini Embassy in\nLondon.\n[Moosa Abd-Ali is a Bahraini activist living in exile in London. He sued FinFisher, another](https://www.theguardian.com/world/2018/oct/11/bahraini-arab-spring-dissidents-sue-uk-spyware-maker)\nspyware company, for supplying the Bahraini government with spyware that was used to\nhack his personal computer in 2011. The spying against Moosa’s computer was [first revealed](https://www.theverge.com/2015/1/21/7861645/finfisher-spyware-let-bahrain-government-hack-political-activist)\nin data leaked from FinFisher. Abd-Ali’s iPhone 8 appears to have been hacked with\nPegasus at some point prior to September 2020. Further forensic analysis may be able to\nestablish a more precise date of the hacking.\n\n### LULU: A Bahrain Government Operator\n\nWe attributed the hacking of Activists A-D (three members of Waad, and one member of\nBCHR) to a Bahrain government operator of Pegasus that we call LULU. Like PEARL,\n**_LULU appeared to be spying exclusively in Bahrain and Qatar. The LULU operator may in_**\nfact be the same operator as PEARL, which we identified in 2017 and 2018. While we did\nnot identify any IP addresses or domain names in common between LULU and PEARL, we\nwould not necessarily expect to identify any infrastructure in common, as NSO Group\nregistered servers with new domain names and new IP addresses for all its clients following\n2018 reports by Citizen Lab and Amnesty Tech. We have never observed more than one\nBahrain government operator active at a time.\n\n\n-----\n\nThe Pegasus spyware installed on the phones of Activists A-D used four IP addresses for\ncommand-and-control. Each IP address returned a TLS certificate for hooklevel[.]com,\nthough no DNS lookups were performed for this domain, and the spyware’s TLS Client Hello\nmessage did not contain an SNI. The infection server used was\n_*.api1r3f4.redirectweburl[.]com._\n\n**IPs** **CN in TLS Certificate**\n\n**172.105.89.243** **_*.api1r3f4.redirectweburl[.]com_**\n\n**64.227.121.213**\n**206.189.31.108**\n\n**195.181.213.122**\n\n**80.211.231.5**\n\n**_hooklevel[.]com_**\n\n**Table 1: Servers that LULU used to spy on Bahraini activists.**\n\nOur forensic analysis has not yet established which Pegasus operator hacked the remaining\nfive devices. Because we have never observed the Bahrain government successfully hack a\ntarget outside of Bahrain or Qatar with Pegasus, we suspect that Moosa Abd-Ali was hacked\nby a second Pegasus operator. That a foreign government may have been responsible for\nthe hacking does not preclude the possibility that the ultimate recipient of the hacked data\nwas the Bahraini government.\n\n### Mechanisms of Hacking\n\n_This section provides a high-level overview of the mechanisms by which the Bahraini targets_\n_were hacked. This section involves synthesis of data from multiple phones, including phones_\n_belonging to non-Bahraini targets._\n\n**July – September 2020: KISMET iMessage Zero-Click**\n\nWhen the KISMET exploit was being fired at one of the devices running iOS 13.5.1, the log\nshowed crashes associated with IMTranscoderAgent, which is responsible for transcoding\nand previewing images in iMessages. Specifically, the crashes were segfaults in the\n_com.apple.IMTranscoderPreviewGenerationQueue thread while apparently parsing ICC color_\nprofile data in a JPEG image received via iMessage. Unfortunately, we were only able to\nlocate crash summaries with abbreviated stack traces in the system logs.\n\n\n-----\n\nFigure 6: A symbolicated crash summary for KISMET on an iPhone Xs running iOS 13.5.1.\nAfter the crashes, IMTranscoderAgent then invoked WebKit to download and render items\nfrom the Pegasus infection server. The rendering triggered a memory pressure warning in\n_JavaScriptCore, and also triggered a Metal shader compilation._\n\nWe believe that KISMET was used as a zero-day exploit against at least iOS 13.5.1 and\n13.7.\n\n**September 2020: Back to One-Click Exploits**\n\nShortly after Activist B upgraded to iOS 14 in September 2020, they received an SMS link\nto Pegasus from “MailExpress,” indicating that the KISMET exploit was not supported on iOS\n14.\n\nFigure 7: Pegasus SMS message that Activist B received in September 2020 after updating\nto iOS 14.\nThe message was a fake DHL package tracking notification. The target may have\naccidentally previewed the link in the message while attempting to copy the message to send\nit to us. The target’s VPN recorded that the link in the message was opened, and redirected\nto a unique subdomain of api1r3f4.redirectweburl[.]com, confirming that it was a Pegasus link\n\n\n-----\n\nconnected to the Bahraini government operator of Pegasus, LULU. This action did not result\nin the infection of the phone; it is possible that the target closed the preview before the\nexploit ran.\n\nNSO Group may have temporarily switched back to one-click iOS exploits due to the new\n_BlastDoor security feature implemented by Apple. The BlastDoor feature was designed to_\nmake zero-click exploitation via iMessage harder.\n\n**February – July 2021: FORCEDENTRY iMessage Zero-Click**\n\nStarting in February 2021, we began to observe NSO Group deploying a new zero-click\niMessage exploit that circumvented Apple’s BlastDoor feature. We refer to the exploit as\n**_FORCEDENTRY, because of its ability to circumvent BlastDoor. Amnesty Tech_** also\nobserved zero-click iMessage exploitation activity around the same time, and referred to the\nactivity they observed as “Megalodon.” We confirmed with Amnesty Tech that the\n“Megalodon” activity they observed matches the characteristics of the FORCEDENTRY\nexploit that we observed.\n\nWhen the FORCEDENTRY exploit was being fired at a device, the device logs showed\ncrashes associated with IMTranscoderAgent. The crashes appeared to be segfaults\ngenerated by invoking the copyGifFromPath:toDestinationPath:error function on files\nreceived via iMessage.\n\nThe crashes appeared to be of two types. Type one crashes indicate that the chain of events\nset off by invoking copyGifFromPath:toDestinationPath:error ultimately crashed while\napparently invoking ImageIO’s functionality for rendering Adobe Photoshop PSD data.\n\nFigure 8: A Symbolicated Type One crash for FORCEDENTRY on an iPhone 12 Pro Max\nrunning iOS 14.6.\nType two crashes indicate that the chain of events set off by invoking\n_copyGifFromPath:toDestinationPath:error ultimately crashed while invoking CoreGraphics’_\nfunctionality for decoding JBIG2-encoded data in a PDF file.\n\n\n-----\n\nFigure 9: A Symbolicated Type Two crash for FORCEDENTRY on an iPhone 12 Pro Max\nrunning iOS 14.6.\nAfter the IMTranscoderAgent crashes, we noticed that the Apple thermal monitoring daemon,\n_thermalmonitord, returned a series of errors:_\n\nException caught during decoding of reply to message ‘propertiesOfPath:handler:’, dropping\nincoming message and calling failure block.\n\nThen, thermalmonitord invoked the tailspin process three times. The tailspin process caused\ntwo segfaults, but we ultimately found an invocation of tailspin running alongside the\nspyware:\n\n/usr/bin/tailspin test-symbolicate 1234567\n\nPhone logs indicated that the “responsible process” for the spyware was amfid, the Apple\nmobile file integrity daemon.\n\nWe saw the FORCEDENTRY exploit successfully deployed against iOS versions 14.4 and\n14.6 as a zero-day.\n\nWith the consent of targets, we shared these crash logs and some additional phone logs\nrelating to KISMET and FORCEDENTRY with Apple, Inc., which confirmed they were\ninvestigating.\n\n## 3. Hacked Again after Going Public\n\n**Activist D, a member of the Bahrain Center for Human Rights, was additionally targeted with**\nPegasus in March 2019 with a Pegasus SMS message from “BatelcoEsvc.” Activist D\ndiscussed the 2019 incident in a 2020 interview in which Activist D was interviewed\nalongside one of the authors of this report. The Bahraini goverment’s LULU operator hacked\n**Activist D with Pegasus using the KISMET zero-click exploit approximately six hours after**\nthe interview first aired. This case highlights the risks inherent in going public with instances\nof hacking.\n\n\n-----\n\nThe 2019 Pegasus SMS appeared in a thread with legitimate messages from Activist D s\nmobile provider, Batelco. The target was curious about the message, and contacted Batelco,\nwho told them that the message was not of a type sent by Batelco.\n\n\n-----\n\nFigure 10: The malicious text (bottom) and legitimate texts from Batelco (above). The text is\nunusual because it (1) is in Arabic, (2) contains a link, and (3) does not begin with “Dear\nCustomer.”\nThe link unshortens to a website on info-update[.]org, which redirected to the legitimate\n[Batelco e-services website (https://e.batelco.com/eservices/Login) when submitted to](https://e.batelco.com/eservices/Login)\nVirusTotal. When we checked it, the link returned a 404.\n\nThe info-update[.]org website is connected to the Pegasus spyware, as we show below.\n\n### Decoy Page Reveals 2019 Pegasus Sites\n\nNSO Group has occasionally made use of visible decoy pages, perhaps in an effort to make\ntheir Pegasus infrastructure appear as innocuous servers. We found an interesting server,\nstart-anew[.]net, which displayed an open directory listing that contained a decoy page.\n\nFigure 11: How start-anew[.]net looked in a web browser.The directory contained a file, 1,\nwhich contained HTML source code for a website maintenance decoy page. The page was\nentitled “While maintenance:” and contained the text “Working hard to create a new website\n_design. Stay in touch!”_\n\n\n-----\n\nFigure 12: How the decoy page (1) looks in a browser.\nThe title “While maintenance:” and the text “Working hard to create a new website design.\n_Stay in touch!” exactly matched pages returned by two Pegasus servers that matched a_\n[fingerprint we used in our Hide and Seek report. These two servers were part of a group of](https://citizenlab.ca/2018/09/hide-and-seek-tracking-nso-groups-pegasus-spyware-to-operations-in-45-countries/)\nPegasus servers that were spun up in 2018 after [Amnesty Tech and](https://www.amnesty.org/en/latest/research/2018/08/amnesty-international-among-targets-of-nso-powered-campaign/) [Citizen Lab published](https://citizenlab.ca/2018/07/nso-spyware-targeting-amnesty-international/)\nreports about the targeting of an Amnesty International staffer with Pegasus, but before\nCitizen Lab’s Hide and Seek report.\n\n\n**IP** **Domain**\n\n**209.250.237.55** **youneedjelly[.]net**\n\n**92.222.71.144** **visiblereminder[.]net**\n\n\n**Dates Matching** **Dates Matching Hide and**\n**Decoy Page1** **_Seek Fingerprint2_**\n\n**8/28/2018 –**\n**10/14/2018** **8/31/2018 – 9/6/2018**\n\n**8/28/2018 –**\n**9/11/2018** **8/31/2018 – 9/6/2018**\n\n\nFrom the contents of start-anew[.]net, we surmised that the following websites were part of\nthe new Pegasus infrastructure:\n\nreunionlove[.]net\nnews-now[.]co\nhelpusfind[.]biz\n\n### Scanning Shared Web Hosters\n\nWe noted that these three domains were hosted on shared web hosting providers. In other\nwords, the IP addresses that they pointed to had dozens of other innocuous domains also\npointing to them. In previous iterations of NSO Group’s Pegasus infrastructure, each domain\nname pointed to a separate IP address.\n\nScanning websites on shared web hosting required us to adjust our scanning infrastructure\nto use domain names rather than IP addresses. The usage of shared hosting providers\n[appears to have begun after we published our Hide and Seek report in September 2018. We](https://citizenlab.ca/2018/09/hide-and-seek-tracking-nso-groups-pegasus-spyware-to-operations-in-45-countries/)\ndisclose our fingerprinting and scanning pipeline below, because it is no longer capable of\ndetecting Pegasus servers.\n\n\n-----\n\n**Step** **Description**\n\n\n**Approx.**\n**#**\n**Domains**\n\n**~ 6**\n**million**\n\n\n**S1**\n\n**S2**\n\n**S3**\n\n\n**Generate a list of interesting domain names to scan using TLS**\n**certificates from specific issuers.**\n\n\n**For all domains above, send a GET request for /robots.txt, and**\n**check whether the response status line is 404 Not Found with a**\n**_Content-Type header mentioning text/html, but with no response_**\n**body. We also excluded any responses with an ETag or a Set-**\n**_Cookie header._** **~ 500**\n\n**For matching domains above, send a GET request for / and check**\n**whether the response is the same as above.** **175**\n\n\nWe devised these scanning steps based on the configuration of the three domain names\nfound on start-anew[.]net.\n\n### A Window into 2019 Pegasus SMS Infection Infrastructure\n\nOur scan results comprise 175 domain names, and included the domain name infoupdate[.]org from the SMS sent to Activist D. Our scan results also include one domain\nname that appears to be directly related to human rights (human-rights-news[.]com), as well\nas domain names that indicate potential targeting in the USA (washington-today[.]com,\nbreakingnewyork[.]info), as well as apparent targeting in relation to the Bahraini elections (ielection-online[.]com).\n\nWe also found several interesting websites linked to Azerbaijan, including\nsiyasimehbus[.]com (“political prisoners”) and mitinq23fevral[.]info, which is a reference to\n_“Rally 23rd February,” a_ [protest planned by the opposition Popular Front Party on February](http://www.turan.az/ext/news/2019/2/free/politics%20news/en/78997.htm)\n23, 2019. The protest was not authorized by authorities.\n\n## 4. Historical Context\n\n### Bahrain: One Monarchy, Two Constitutions\n\nThe Kingdom of Bahrain is an archipelago situated off the east coast of the Kingdom of\nSaudi Arabia. From the sixteenth century until the nineteenth century, Bahrain was occupied\nby a succession of ruling powers, until Sheikh Ahmed Bin Mohammed Al Khalifa (known in\n[Bahrain as “Ahmed the Conqueror”) seized control of Bahrain in 1783. The rule of the Al](https://www.worldcat.org/title/tribe-and-state-in-bahrain-the-transformation-of-social-and-political-authority-in-an-arab-state/oclc/6222622#borrow)\nKhalifa family has persisted until the present day, despite numerous internal and external\nchallenges to their authority, including during the period from 1820 to 1971 when Bahrain\n[was a British protectorate under the General Maritime Treaty of 1820.](https://en.wikipedia.org/wiki/General_Maritime_Treaty_of_1820)\n\n\n-----\n\nBahrain declared independence from Britain on August 15, 1971, after the withdrawal of\nBritish troops. Six months later, Bahrain’s then-Emir, Sheikh Isa bin Salman Al-Khalifa,\ndecreed that a constituent assembly would draft a new constitution. In 1973, the assembly\nissued [their constitution, which provided for an elected unicameral parliament with an](https://en.wikisource.org/wiki/Constitution_of_the_State_of_Bahrain_(1973))\nadvisory, rather than legislative role. However, after Bahrain’s first parliament saw a\ncontentious debate on a state security decree, the Emir dissolved the parliament in 1975,\nand suspended the Constitution.\n\nBetween 1975 and 2001, the Bahraini government engaged in numerous forms of\nrepression. Human Rights Watch [described abuses in the country during this time as “wide-](https://www.hrw.org/legacy/reports/1997/bahrain/)\nranging” and covering a broad spectrum of offences, including arbitrary detention, the\npsychological abuse of detainees, and the “broad denial of fundamental political and civil\nliberties.”\n\nFigure 13: A billboard along a major highway put up by an advertising company salutes\nBahrain’s King Hamad as “King of Glory.” (Author: Bill Marczak)\nSheikh Isa was succeeded by his son Sheikh Hamad Bin Isa Al Khalifa in 1999. Sheikh\n[Hamad’s rule began with reform measures including the release of political prisoners. Sheikh](https://www.amnesty.org/download/Documents/128000/mde110052001en.pdf)\nHamad also appointed a committee to draft a “National Action Charter” to address political\n\n\n-----\n\ngrievances. On February 14, 2001, Bahrainis approved the Charter with 98.4% of the vote.\nThe next year, Sheikh Hamad declared Bahrain a Kingdom and promulgated a new\nconstitution that broke one of the Charter’s key vows. While the Charter called for a\nbicameral parliament with sole legislative power vested in an elected lower house, Bahrain’s\n2002 constitution allowed the parliament’s appointed upper house to exercise a de-facto veto\nover legislation passed by the lower house. As a result, several political societies in Bahrain\nboycotted the first elections under the new constitution in 2002.\n\nAdditionally, electoral districts for the parliament’s lower house were drawn to be of unequal\nsizes, in order to diminish the opposition’s political power. For example, in Bahrain’s 2012\nparliamentary elections, the voting power of an individual in a pro-government district was\n[roughly 21 times the voting power of an individual in an opposition stronghold.](https://www.jadaliyya.com/Details/28083)\n\n### A Brutal History of Repression\n\nSince 1938, organized political movements have demanded greater popular representation\nin Bahrain. However, the government has responded with repression and violence that\ncontinues to the present day. Bahrain saw a brief period of improvement in human rights\nfollowing Sheikh Hamad’s reforms, though as is often the case in Bahrain, perceived\nchallenges to the monarchy led to the rollback of reforms.\n\nIn 2010, prior to the Arab Spring, the Haq Movement, the Islamic Wafa Movement, and the\nBahrain Freedom Movement called for a boycott of parliamentary elections that were\nscheduled to take place on October 23, 2010. In response, immediately before the elections,\n[the government cracked down on opposition activists.](https://www.hrw.org/news/2010/10/20/bahrain-elections-take-place-amid-crackdown)\n\n\n-----\n\nFigure 14: Protesters began to gather at Pearl Roundabout on February 15, 2011. (Author:\n[nbdbahrain2@gmail.com; Licensed under CC-BY-SA 3.0).](https://creativecommons.org/licenses/by-sa/3.0/)\nAs part of the Arab Spring uprising, Bahrainis took to the streets on the tenth anniversary of\nthe National Action Charter’s approval (February 14, 2011) demanding democratic political\nreform, freedom, justice, and equal distribution of wealth and power. The pace of protests\nincreased as security forces targeted and killed protesters.\n\nFigure 15: A montage of two stills from a state television broadcast show Saudi troops\ncheering and saluting television cameras as a convoy of armored vehicles rolls into Bahrain\n\n\n-----\n\nto suppress protests.\nDrawing inspiration from Egypt’s Tahrir Square, Bahraini demonstrators quickly occupied the\n[Pearl Roundabout, a major traffic circle located that contained a towering monument of six](https://en.wikipedia.org/wiki/Pearl_Roundabout)\nsails holding up a giant pearl. The pearl monument quickly became an opposition symbol.\nOn March 18, 2011, Bahraini forces, backed by troops from Saudi Arabia and the United\nArab Emirates, forcibly evicted the protesters. Security forces arrested and tortured hundreds\nof Bahrainis. The government also began a campaign to expunge the Pearl Roundabout and\nits symbolic monument from Bahrain. The government demolished the monument, paved\nover the roundabout, and even recalled coinage featuring the monument.\n\nFigure 16: After the demolition of the pearl monument, authorities converted the Pearl\nRoundabout into a traffic junction. (Author: nbdbahrain2@gmail.com; Licensed under CC-BYSA 3.0).\nUnder international pressure following the killings of dozens of protesters and detainees by\nsecurity forces, Bahrain’s king formed the [Bahrain Independent Commission of Inquiry to](http://www.bici.org.bh/)\ninvestigate the events of February to March 2011. The Commission’s report, issued on\nNovember 23, 2011, [concluded that the authorities were responsible for “grave violations of](http://www.bici.org.bh/BICIreportEN.pdf)\nhuman rights, including the arbitrary deprivation of life, torture, and arbitrary detention.”\n\n\n-----\n\nFigure 17: A 2011 political billboard against the Bahraini protests says: “We request of the\ngovernment.. The ultimate punishment. NO PARDON.. For the leaders of the sedition (fitna)\nand the deviant group.”\nIn 2016, the Bahraini authorities expanded their efforts to ban and dismantle opposition\n[movements. The government dissolved Al-Wefaq and jailed its leader Ali Salman for life. The](https://freedomhouse.org/country/bahrain/freedom-world/2017)\ngovernment also stripped the citizenship of Sheikh Isa Qassim, a natural born Bahraini and\nprominent Shia cleric regarded as the spiritual leader of Al-Wefaq. Bahrain stepped up\nrepression measures in 2017. The government reinstituted the death penalty and authorities\ncontinued to employ arbitrary revocation of citizenship as a new means of repression.\n[Hundreds of activists were stripped of their citizenship and remain stateless.](https://www.hrw.org/news/2018/07/27/bahrain-hundreds-stripped-citizenship)\n\n[In March 2017, the Bahraini Justice Ministry dissolved and then charged](https://www.amnesty.org/en/latest/news/2017/05/bahrain-heading-for-total-suppression-of-human-rights-as-secular-opposition-group-banned/) Waad with\n“advocating violence, supporting terrorism and incitement to encourage crimes and\n[lawlessness” after the political group issued a statement on the anniversary of the 2011](https://waad.me/details.php?artid=3190)\nuprising saying that Bahrain was suffering from a “constitutional political crisis.” This event\n[was followed by the permanent suspension of Al Wasat newspaper in June 2017. At the](https://www.hrw.org/news/2017/06/18/bahrain-only-independent-newspaper-shut-down)\ntime, Al Wasat was Bahrain’s only independent newspaper, and had been briefly suspended\nseveral times since its inception in 2002.\n\n\n-----\n\nFigure 18: Al Wasat’s sign is removed from its headquarters following the permanent\nsuspension of the newspaper by authorities in 2017.\nRecent events suggest that the government of Bahrain will continue its repressive policies.\nUnder the pretext of addressing COVID-19, the Bahraini government has imposed further\nrestrictions on freedom of expression. Further, while Bahrain released a number of prisoners\n[in March 2020 due to COVID-19, authorities excluded political prisoners from that release.](https://www.hrw.org/world-report/2021/country-chapters/bahrain)\n\n### Bahrain’s Internet Censorship\n\nFreedom of expression is enshrined in Articles 23, 24, and 26 of the 2002 Bahraini\nConstitution. Despite this veneer of legal protection, Bahrain ranks 168 out of 180 countries\n[on the 2021 World Press Freedom Index. The Bahraini government maintains tight control](https://rsf.org/en/ranking#)\nover the Internet by requiring all websites hosted in Bahrain to be registered with the\nInformation Affairs Authority (IAA). The government imposes strict filtering policies.\n\n[One of the first instances of website censorship in Bahrain was the 2002 blocking of popular](https://giswatch.org/en/country-report/communications-surveillance/bahrain)\nonline forum BahrainOnline.org. The website, which was hosted outside of Bahrain, was\ncentral in facilitating public debate and discussion critical of the Bahraini government, from\nplanning for the February 2011 protests to sharing videos and photos of human rights\nviolations and protests.\n\n\n-----\n\n[Figure 19: A 2005 screenshot from the OpenNet Initiative demonstrates censorship of](https://dash.harvard.edu/bitstream/handle/1/2794838/Internet+Filtering+in+Bahrain.pdf?sequence=2)\nBahrainOnline.org.\nBahrain formalized its Internet censorship regulations in 2009, when the Ministry of Culture\n[and Information issued a resolution requiring all ISPs to install website blocking software](https://www.legalaffairs.gov.bh/LegislationSearchDetails.aspx?id=8024)\nchosen by the Ministry, and to comply with requests from the Ministry to block specific\nwebsites. The websites of political opposition, human rights organizations, and online\n[newspapers were blocked in 2009. The same policies have been applied to social media](http://www.sahafi.jo/arc/art1.php?id=30ae1173676e6bd2ac81d7ef557adff2d5b5ae9a)\n[platforms. In late 2010, the authorities blocked the Facebook page of Abdul Wahab Hussien,](https://ifex.org/authorities-block-opposition-leaders-facebook-page/)\na Bahraini opposition leader.\n\nFigure 20: A Bahrain website blockpage from 2018.\n[After the uprising in 2011, the Bahraini authorities expanded Internet controls in the country](https://opennet.net/west-censoring-east-the-use-western-technologies-middle-east-censors-2010-2011)\nby targeting political and religious and human rights content. Websites, live-streaming\n[platforms, and some social media sites were censored.](https://rsf.org/sites/default/files/rapport-internet2012_ang.pdf)\n\n[In 2013, the Citizen Lab documented the presence of censorship and surveillance](https://citizenlab.ca/2013/01/planet-blue-coat-mapping-global-censorship-and-surveillance-tools/)\ntechnology (namely, ProxySG devices and PacketShaper devices) produced by Blue Coat\n[Systems in Bahrain. In 2016, the Citizen Lab reported that Internet-filtering technology](https://citizenlab.ca/2016/09/tender-confirmed-rights-risk-verifying-netsweeper-bahrain/)\nproduced by Netsweeper, Inc. was present on the networks of nine Bahrain-based ISPs.\n\n\n-----\n\nTesting on the ISP Batelco showed that at least one of these Netsweeper installations was\nbeing used to filter political content, including content related to human rights, opposition\npolitical websites, Shiite websites, and local and regional news sources.\n\nFigure 21: Astronomical latency was introduced into subscribers’ Internet traffic by a device\nlocated inside Bahrain, between the hours of 7:00PM and 1:00AM every night during a\nprotest in the village of Duraz.\nAlso in 2016, a nightly Internet disruption was reported in the Bahraini village of Duraz. The\ndisruption coincided with peaceful nightly protests outside the house of Al Wefaq’s de-facto\nspiritual leader, Isa Qassim, that started when the Bahraini government revoked his\ncitizenship. An investigation by Bahrain Watch [found that both landline and mobile Internet](https://web.archive.org/web/20190927183255/https://bahrainwatch.org/blog/2016/08/03/bahrain-internet-curfew/)\nservices were disrupted. Landline connections were disrupted by artificially introducing\nastronomical latency and packet loss between specific hours (Figure 21) on IP addresses\nassigned to subscribers in Duraz. During the same hours, all data services on cell towers\nserving Duraz were disabled. Outside of the disrupted hours, the Internet in Duraz appeared\nto function normally.\n\nAs of 2020, Bahrain continues to be categorized as “Not Free” by Freedom House. In its\nmost recent Freedom on the Net [report, Freedom House states “numerous websites](https://freedomhouse.org/country/bahrain/freedom-net/2020)\ncontinued to be blocked, social media users were continuously interrogated at the security\ndepartment and were pressured to remove content, and citizens were arrested and jailed for\ncontent posted online,” among other developments.\n\n### Surveillance of Bahraini Dissidents\n\nIn addition to the authorities expanding Internet controls in Bahrain, there have been\nnumerous reports regarding Bahrain’s use of surveillance technology against human rights\nactivists, dissidents, and members of the political opposition, domestically and\n\n\n-----\n\ntransnationally.\n\n[In 2011, Bloomberg reported that Trovicor GmbH (previously related to Nokia Siemens](https://www.bloomberg.com/news/articles/2011-08-22/torture-in-bahrain-becomes-routine-with-help-from-nokia-siemens-networking)\nNetworks) sold interception equipment to Bahrain, which the authorities then used to spy on\ndissidents’ communications. One such target was Abdul Ghani Al Khanjar, a Bahraini\n[activist, who publicly described how he was confronted with transcripts of his SMS text](https://www.dw.com/en/european-technology-company-accused-of-enabling-torture/a-15340523)\nmessages while being detained and tortured by the authorities between August 2010 and\nFebruary 2011. The transcripts of Al Khanjar’s text messages were reportedly obtained from\nTrovicor’s system.\n\nFigure 22: Emails like this one were sent to Bahraini activists. The attachments contained\nFinFisher spyware that sent information back to the Bahraini government.\n[In 2012, the Citizen Lab released a report describing the targeting of Bahraini activists and](https://citizenlab.ca/2012/07/from-bahrain-with-love-finfishers-spy-kit-exposed/)\nhuman rights defenders, using surveillance malware from a UK-German company, FinFisher.\n[A subsequent leak of files from FinFisher indicated that the Bahraini government used](https://theintercept.com/2014/08/07/leaked-files-german-spy-company-helped-bahrain-track-arab-spring-protesters/)\nFinFisher’s spyware to spy on large swathes of the opposition at home and abroad. A leaked\n[target list showed that the computer of a prominent Bahraini lawyer was hacked on the same](https://theintercept.com/2014/08/07/leaked-files-german-spy-company-helped-bahrain-track-arab-spring-protesters/)\nday as a blackmail attempt against him. The lawyer received a CD containing instructions\nthat the lawyer should stop defending activists, otherwise a video included on the CD would\nbe publicized. The lawyer viewed the CD on his computer, and found that it contained a\nprivate video of him with his wife, recorded from a hidden camera installed in the ceiling of\nhis house. A copy of the video was ultimately published when the lawyer refused to accede\nto the blackmail.\n\n[A 2013 report by Bahrain Watch documented how the Ministry of Interior’s Cyber Crime Unit](https://web.archive.org/web/20190424144417/https://bahrainwatch.org/ipspy/viewreport.php)\nwas deanonymizing pseudonymous Twitter activists by sending them IP logger links, and\nthen requesting subscriber data from local ISPs for the IP address that clicked on the link.\n\n\n-----\n\nActivists who clicked were arrested or fired from their jobs. For example, a high school\nstudent allegedly clicked on the IP logger link in the Facebook chat message in Figure\n**23 that was sent from the account of an arrested activist. The student was sentenced by a**\nBahraini court to one year in prison because the account to which the IP logger link was sent\nhad earlier published tweets deemed offensive to Bahrain’s king.\n\nFigure 23: IP Logger links included in messages like this one offering translation services\nwere used to identify those who clicked.\nLeaked documents and investigations have revealed a number of additional surveillance\ncontracts between Bahrain’s government and foreign companies. In 2013, Bahrain’s Ministry\nof Interior [acquired Hacking Team’s spyware in 2013, though no Bahraini targets of Hacking](https://globalvoices.org/2015/07/08/for-arab-human-rights-defenders-hacking-team-files-confirm-suspicions-of-state-surveillance/)\n[Team’s spyware were ever publicly identified. A 2016 investigation by Bahrain Watch and](https://theintercept.com/2016/12/08/phone-cracking-cellebrite-software-used-to-prosecute-tortured-dissident/)\n_The Intercept that reviewed Bahraini court documents showed that the Bahraini government_\nwas using phone forensics technology sold by Cellebrite to extract private data from arrested\nactivists’ phones. Finally, a 2018 [investigation by Haaretz revealed that Verint Systems Inc.](https://www.haaretz.com/israel-news/.premium.MAGAZINE-israel-s-cyber-spy-industry-aids-dictators-hunt-dissidents-and-gays-1.6573027)\nprovided Bahrain with technology for social media monitoring.\n\n## 5. Conclusion\n\nDespite a half-decade of being implicated in human rights abuses, NSO Group regularly\nclaims that they are, in fact, committed to protecting human rights. The company has even\n[published a “Human Rights Policy,” a “Transparency and Responsibility Report,” and claimed](https://www.nsogroup.com/governance/human-rights-policy/)\n[to subscribe to the United Nations Guiding Principles on Business and Human Rights.](https://www.ohchr.org/documents/publications/guidingprinciplesbusinesshr_en.pdf)\nHowever, this purported concern is contradicted by a growing mountain of evidence that its\nspyware is used by authoritarian regimes against human rights activists, journalists, and\nother members of civil society.\n\nMost recently, the [Pegasus Project, a collaboration between Amnesty International and the](https://forbiddenstories.org/about-the-pegasus-project/)\nForbidden Stories collective, has revealed that a wide range of countries have leveraged\nPegasus spyware to target and infect members of civil society, and their friends and family\nmembers, around the globe. In the context of this report, we shared a list of the targeted\nphone numbers we identified with Forbidden Stories. They confirmed that numbers\n[associated with five of the hacked devices were contained on the Pegasus Project’s list of](https://forbiddenstories.org/about-the-pegasus-project/)\npotential targets of NSO Group’s customers, data that Forbidden Stories and Amnesty\nInternational describe as dating from 2016 up to several years ago.\n\n\n-----\n\n### Bahraini Misuse of NSO Spyware was Tragically Predictable\n\nWhile NSO Group regularly attempts to discredit reports of abuse, their customer list\nincludes many notorious misusers of surveillance technology. The sale of Pegasus to\nBahrain is particularly egregious, considering that there is significant, longstanding, and\n[documented evidence of Bahrain’s serial misuse of surveillance products including Trovicor,](https://www.bloomberg.com/news/articles/2011-08-22/torture-in-bahrain-becomes-routine-with-help-from-nokia-siemens-networking)\n[FinFisher,](https://citizenlab.ca/2012/07/from-bahrain-with-love-finfishers-spy-kit-exposed/) [Cellebrite, and, now,](https://www.vice.com/en/article/ev3xme/israeli-spyware-is-helping-repressive-regimes-in-the-middle-east-oppress-dissidents) [NSO Group.](https://citizenlab.ca/2018/09/hide-and-seek-tracking-nso-groups-pegasus-spyware-to-operations-in-45-countries/)\n\nAs highlighted in this report, Bahrain’s human rights track record is equally notorious:\n\nAccording to [Freedom House, Bahrain “has become one of the Middle East’s most](https://freedomhouse.org/country/bahrain)\nrepressive states,” and has “systematically eliminated a broad range of political rights\nand civil liberties, dismantled the political opposition, and cracked down harshly on\npersistent dissent in the Shiite population.”\nIn 2019, [Human Rights Watch said that Bahrain’s authorities had engaged in “unabated](https://www.hrw.org/news/2019/01/17/bahrain-unabated-repression)\nrepression,” and were “virtually eliminating all opposition.”\nIn 2017, the UN High Commissioner for Human Rights, Zeid Ra’ad Al Hussein,\n[remarked that “the government of Bahrain has imposed severe restrictions on civil](https://www.ohchr.org/EN/NewsEvents/Pages/DisplayNews.aspx?NewsID=22044&LangID=E)\nsociety and political activism through arrests, intimidation, travel bans and closure\norders, with increasing reports of torture by the security authorities,” adding that “the\ndemocratic space in the country has essentially been shut down.”\nBahraini human rights advocates are imprisoned, monitored, and intimidated at home,\n[and those in exile are also subjected to digital and traditional means of repression.](https://www.gc4hr.org/news/view/1511)\n\nThese human rights abuses and prior sales of surveillance technologies are all a matter of\npublic record. These documented abuses should have been obvious “red flags” if NSO\nGroup was genuinely concerned about undertaking proper due diligence of its clients. The\nfact that Bahrain used NSO Group’s spyware to target political opposition and activists, given\nthe country’s track record, was predictable. For NSO Group to sell Pegasus to Bahrain in\nlight of this evidence is gross negligence in the name of profit.\n\n### Protecting against Zero-Click Attacks involves Tradeoffs\n\nWe believe that the specific attacks we mention in this report could have been prevented by\ndisabling iMessage and FaceTime. However, NSO Group has successfully exploited other\nmessaging apps in the past to deliver malware, such as WhatsApp. Thus, disabling\niMessage and FaceTime would not offer complete protection from zero-click attacks or\nspyware. Additionally, disabling iMessage means that messages exchanged via Apple’s builtin Messages app would be sent unencrypted (i.e., “green messages” instead of “blue\nmessages”), making them trivial for an attacker to intercept.\n\n## 6. Acknowledgements\n\n\n-----\n\nAli Abdulemam s work on this project was supported by Access Now. Financial support for\nthis research has been provided by the John D. and Catherine T. MacArthur Foundation, the\nFord Foundation, Open Societies Foundation, the Oak Foundation, and Sigrid Rausing Trust.\nThanks to Miles Kenyon and Mari Zhou for communications, graphics, and editing support,\nand Adam Senft and Bahr Abdul Razzak for editorial review.\n\n1. From Sonar-HTTPS scans.↩\n2. From our scans.↩\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-24 - From Pearl to Pegasus Bahraini Government Hacks Activists with NSO Group Zero-Click iPhone Exploits.pdf"
    ],
    "report_names": [
        "2021-08-24 - From Pearl to Pegasus Bahraini Government Hacks Activists with NSO Group Zero-Click iPhone Exploits.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535703,
    "ts_updated_at": 1743041407,
    "ts_creation_date": 1653752448,
    "ts_modification_date": 1653752448,
    "files": {
        "pdf": "https://archive.orkl.eu/e12a30c55fcf384c91d683ce1ac90f33ab50ce60.pdf",
        "text": "https://archive.orkl.eu/e12a30c55fcf384c91d683ce1ac90f33ab50ce60.txt",
        "img": "https://archive.orkl.eu/e12a30c55fcf384c91d683ce1ac90f33ab50ce60.jpg"
    }
}