{
    "id": "f0c7df71-15d7-4331-a6dd-8483ab2bcc3c",
    "created_at": "2023-04-18T02:09:17.629211Z",
    "updated_at": "2025-03-27T02:17:11.305204Z",
    "deleted_at": null,
    "sha1_hash": "59060ce826df58285a90a8198d06fcdd5e7e6987",
    "title": "",
    "authors": "",
    "file_creation_date": "2023-03-28T03:19:28Z",
    "file_modification_date": "2023-03-28T03:19:31Z",
    "file_size": 3360082,
    "plain_text": "# Threat Horizons\n\n### April 2023 Threat Horizons Report\n\n\nApril 2023\n\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n#### Table of contents\n\n### Mission statement 03\n\n Letter from the editor Strategic Perspective—Government-Backed Hackers  04\n Likely to Look to Criminals for Inspiration Targeting Cloud\n\n Credentials, API Issues Continue  07\n to Lead Compromise Factors\n\n HOODOO Uses Public Tooling, Google Workspace  09 to Target Taiwanese Media\n\n Compromised Customer Websites Hosted on  11\n IT Service Providers’ Infrastructure\n\n Cloud-Hosted Encrypted ZIP Files Evading Detection 13\n\n Customer Challenges and Solutions When  14\n Security Patching Google Kubernetes Engine\n\n The low hanging fruit: leaked service account keys  19\n and the impact to your organization\n\n Mitigations 23\n\n2\n\n\n-----\n\n## Mission statement\n\nThe Google Cloud Threat Horizons Report\nbrings decision-makers strategic intelligence on\nthreats to cloud enterprise users and the best\noriginal cloud-relevant research and security\nrecommendations from throughout Google’s\nintelligence and security teams.\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n3\n\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n### Letter from the Editor\n\n## Strategic Perspective—\n Government-Backed Hackers\n Likely to Look to Criminals for Inspiration Targeting Cloud\n\n\nWhen one thinks about the proliferation of military\nor espionage technology, the typical image is of\n“spin off,” where once-futuristic fighter jets and spy\ngadgets gradually become available for public use and\ncommercialized. Sometimes there’s an intermediary\nstep, where non-state groups including organized\ncrime are early adopters and have a mismatch with\nthe defenses of their targets stuck in a previous\ngeneration of civil conflict. The spread of the AK47\nas a rifle meant to spread Communist revolution is\none example, which was soon adopted by a variety of\nstate- and non-state organizations. More recently we\ncan see the adoption of unmanned aerial systems, or\ndrones, that not too long ago were the sole province\nof the world’s most advanced military and intelligence\norganizations, but now deliver drugs to prisoners or\ngroceries to your home.\n\nThe process works in the other direction, too.\nJapanese defense industries are perhaps the best\nexample of this over recent decades, taking in aircraft\nand other systems shared by their American allies\nand enhancing them beyond the capabilities of\nsimilar models in the U.S. by adding radar systems\n\n\nor advanced electronics developed by Japanese\nindustry. This can be an effective mechanism to cut\n[development costs or speed rapid prototyping (as with](https://www.amazon.com/Skunk-Works-Personal-Memoir-Lockheed/dp/0316743003)\nthe famed F-117 Nighthawk, the first truly stealth plane)\nor to tap into the advanced software capabilities of\n[Silicon Valley through the Defense Innovation Unit.](https://www.diu.mil/)\n\nThe use of technology in military conflict and\nintelligence competition means state-sponsored\ncyber threat actors seek options from which to build\never-growing replacements for their cyber armories,\nincluding adapting tools from the cybercriminal\nunderground, ingesting published vulnerability\nresearch, or augmenting exploits used in the wild to\nsupplement the more bespoke tools they develop\nin-house. Noting the undeniable value of cloud\nservices, for improving enterprise defenses, bolstering\ncybersecurity capabilities, and improving resilience\nto a host of cyber threats (and the resulting volume\nof enterprises leveraging cloud capabilities), it is only\nprudent to consider that state-sponsored cyber threat\nactors may steal from the playbooks of cyber criminals\nto target such systems:\n\n4\n\n\n-----\n\n###### (Letter from the editor, cont’d.)\n\n- **“Trusted” source of malware: Broadly speaking,**\n\ncyber threat actors have to defeat two kinds of\nsystems when planning an operation that targets\nyour organization: the people making singular\ndecisions about whether and how to interact with\nthe attackers, and the technical systems which\nautomate decision-making across the network\nat large scale. Cybercriminals and nation-states\nalike have long known the value of compromising\nlegitimate websites for use in continuing operations\n\nagainst the suppliers, partners, and competitors that\nare their ultimate target. A familiar domain name\ndisarms many of the natural defenses we all have\nwhen viewing a suspicious email, and the degree\nto which it is trusted will often be hard-coded into\nsecurity systems screening for spam or malware\n\nCloud providers are useful targets for these kind of\noperations, either as hosts for malware or providing\nthe infrastructure for command-and-control\n[(C2). Indeed, an independent study by Netskope](https://www.netskope.com/wp-content/uploads/2023/01/cloud-and-threat-report-2022-year-in-review.pdf)\nindicates that malware delivery via cloud services\nhas steadily increased to make up nearly half of\nall malware downloads they observed in 2022,\nprobably reflecting both the trusted state of those\ndomains by other organizations and the sheer scale\nof operations originating from them overall.\n\nNation-states are paying attention: in May 2022,\nGoogle’s Threat Analysis Group disrupted an\n[operation by APT29, previously attributed by the](https://www.ncsc.gov.uk/files/Advisory%20Further%20TTPs%20associated%20with%20SVR%20cyber%20actors.pdf)\n[US and UK Governments to the Russian Foreign](https://www.ncsc.gov.uk/files/Advisory%20Further%20TTPs%20associated%20with%20SVR%20cyber%20actors.pdf)\nIntelligence Service (SVR), that was controlling\ncompromised websites by means of C2 on Google\nDrive to deliver ISO files containing a malicious\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\nDLL. Google disabled the relevant accounts, and\ndeveloped signatures to identify similar tooling,\nprotect users, and prevent the group–and future\nimitators–from abusing Google’s services. It’s the\nkind of operation we expect to see attempted more\noften in the future, including by nation-states keen\nto bypass traditional security controls.\n\n- **The Importance of Identity: Our research has**\n\nshown that the most common vector used to\ncompromise any network, including cloud instances\nis to take over an account’s credentials directly:\neither because there is no password, as with some\ndefault configurations, or because a credential has\nbeen leaked or recycled or is generally so weak\nas to be guessable. This is especially problematic\nfor accounts with unnecessarily powerful IAM\npermissions, which can be used to move laterally,\nstart new instances for cryptomining and other\nmalicious activities, or to create new Service\nAccounts for maintaining persistence.\n\nThis is overwhelmingly a cybercriminal phenomenon\ntoday. However,for cyber operations sponsored\nby nation-states for espionage purposes where\npersistence is paramount, the utility of taking\nover legitimate accounts or starting new Service\nAccounts for persistence in a compromised\nenvironment will be prioritized. Additionally,\nappearing to be an American or other Western\ncitizen can be helpful for complicating attribution\nof follow-on operations, or limiting the collection of\nWestern intelligence agencies.\n\n5\n\n\n-----\n\n###### (Letter from the editor, cont’d.)\n\nNation-state cyber threat groups will not only\nemphasize persistence in their operations, but can\ntap an array of tools–human intelligence, analysis,\nsignals collection, diplomatic intelligence–to go\nafter their targets over a long period of time.\nFinding a recycled password from a compromised\ncommercial service being used by an account\nadministrator in the cloud becomes more feasible\nwith large, sustained operational investments.\n\n- **The Convenience of Being a Non-state Actor:**\n\nMany of today’s most troubling cyber threats\noriginated as criminal- or hacktivist techniques\nthat were later turned to geopolitical advantage:\nhack-and-leaks of private emails by public officials,\ndoxxing of political opponents’ records held by\ncommercial companies, targeted deployment of\nransomware, swarming social media propaganda,\npastebins, even the recruitment of insiders via\nforum postings all originated or were popularized\nby non-state actors, typically with ideologically vice\nprofit-seeking motivations.\n\nEventually this evolved from the use of non-state\nhacking groups by the state, as in the case of the\n[Syrian Electronic Army’s targeting of the West that](https://www.justice.gov/opa/pr/computer-hacking-conspiracy-charges-unsealed-against-members-syrian-electronic-army)\nlanded members on the FBI’s Most Wanted List,\ninto the use of entirely false hacktivist groups as a\n[front for nation-state activity, as when the Russian](https://www.wired.com/story/russian-hackers-false-flags-iran-fancy-bear/)\n[military posed as the Cyber Caliphate to disable](https://www.wired.com/story/russian-hackers-false-flags-iran-fancy-bear/)\noperations at a French TV station. North Korea and\nIran have similar histories of using non-state hacking\ngroups as cover for their intelligence operations or\npressing real hackers into state service. Russia and,\nincreasingly, China have each cultivated ecosystems\nthat allow cybercrime to fester so long as it is\nfocused on targets outside their own countries.\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\nAs the next article in our Report points out,\nbecause of the security of the GCP platform most\ncompromises in the cloud are simply from lack\nof passwords, poor password strength, reused\nand leaked credentials, or straightforwardly\nmisconfigured software: all techniques within the\ngrasp of even the most unsophisticated actors.\nAn actual state-sponsored APT group, however,\nwould have greater persistence and means of\nmaintaining and quietly expanding access over long\n\nperiods of time, possibly coupled with more resilient\ncommand-and-control infrastructure compared to\nmost non-state groups.\n\nPosing as a non-state actor in those circumstances\nwould be a viable cover, complicating attribution\nor at least deflecting geopolitical blowback to\nthe apparent proxy instead of themselves, while\npermitting states with a history of working with\ncriminal groups to perhaps simply purchase the\naccess they need for their operations. Cloud-based\nenterprises can reduce this risk with the same basic\nsecurity blocking-and-tackling they use to counter\nless targeted, criminal threats every day, ideally\ncoupled with cyber threat intelligence to help with\nspeedy and authoritative attribution in the event\nthey are targeted this way.\n\n_Christopher Porter is the Head of Threat Intelligence_\n_for Google Cloud._\n\n6\n\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n## Credentials, API Issues\n Continue to Lead\n Compromise Factors\n\n\n##### Compromise Factors Remain\n On Track in Q4\n\nWeak passwords accounted for nearly half of\nobserved incidents in the fourth quarter of 2022, a\ncontinuation of the activity pattern tracked in the\nprior three month period. In addition, the rise in\nAPI compromise in Q3 maintained course, being a\nfactor in nearly 1/5th of incidents. A slight decrease\n\n##### Cloud Compromise Factors (Q4 2022)\n\n\nin misconfiguration and software issues provided\nsome positive news for the quarter, with the lost share\ntaken up in part by an increase in the use of leaked\ncredentials. The continued focus by threat actors on\nleveraging credential-based access remains a key\nconcern point in 2023 (see article 7 of this report\nfor a deeper dive) and should be of top priority for\norganizations to address.\n\n7\n\n\n##### Cloud Compromise Factors (Q4 2022)\n\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n\n###### (Credentials, cont’d.)\n\n### Case Study: Ransomware\n in the Cloud\n\nThreat actors often use ransomware in the cloud to\nextort companies in a different manner than traditional\non-premises environments, threatening to release or\ndelete data rather than simply encrypt it. This variation\non ransomware approach ties directly to the benefit\ncloud usage provides in prompt reconstitution of\nencrypted resources. In September 2022, an attacker\n\ncompromised a small number of insecurely configured\nGoogle Cloud SQL database instances, corrupted the\ndata, and left behind a ransom note. The compromise\nwas due to poor hygiene and lack of basic control\nimplementation, not a specific bug in GCP or Cloud\nSQL. The attacker left a ransom note demanding\npayment in Bitcoin and threatening that if the ransom\nwas not paid, they would leak the stolen data to\ndarkweb marketplaces. The note included a specific\nTor .onion address and instructions for payment.\n\n\nRansom note left on insecurely configured Cloud SQL instances\n\nAffected MySQL instances created a window of\nopportunity for the attacker due to misconfigurations\n(public IP addresses configured to allow inbound and\noutbound traffic from any IPv4 address and port) and\nlikely weak passwords or no password at all. While\nransomware impacts can be mitigated through cloud\nusage in different ways, threat actors continue to\nevolve their techniques to target this environment and\nit should remain a key concern for organizations.\n\n8\n\n```\n### UPDATE `Z_README_TO_\nRECOVER`.`RECOVER_YOUR_DATA`\n### @1=’All your data is a backed\nup. You must pay 0.2 BTC to [Bitcoin\naddress] 48 hours for recover it.\nAfter 48 hours expiration we will\nsell all your data on dark markets\nand the database dump will be\ndropped from our server!’\n\n```\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n## HOODOO Uses Public Tooling,\n Google Workspace to Target Taiwanese Media\n\n\nIn October 2022, Google’s Threat Analysis Group (TAG)\ndisrupted a campaign from HOODOO, a Chinese\ngovernment-backed attacker also known as APT41, that\ntargeted a Taiwanese media organization by sending\nphishing emails that contained links to a passwordprotected file hosted in Drive. The payload was an open\nsource red teaming tool called “Google Command\nand Control” (GC2). Written in Go, the tool gets\n\n\ncommands from Google Sheets, likely to obfuscate the\nmalicious activity, and exfiltrates data to Google Drive.\nAfter installation on the victim machine, the malware\nqueries Google Sheets to obtain attacker commands.\nIn addition to exfiltration via Drive, GC2 enables the\nattacker to download additional files from Drive onto\nthe victim system. HOODOO previously used GC2 in\nJuly 2022 to target an Italian job search website.\n\n\n**Figure 1. Publicly Available GC2 Workflow Documentation (source: GitHub)**\n\n\nand Control” (GC2). Written in Go, the tool gets July 2022 to target an Italian job search website.\n\n### Attack Workflow\n\nPublicly Available GC2 Workflow Documentation (source: GitHub)\n\n\n9\n\n\n-----\n\n###### (HOODOO Uses Public Tooling, cont’d.)\n\nThese incidents highlighted a few key threat trends\nby China-affiliated threat actors. First, as opposed to\ndeveloping their own custom tools, Chinese APT groups\nare increasingly using publicly available tooling such as\nCobalt Strike and other “pentest” software available for\npurchase or on sites like Github. HOODOO’s use of GC2\nis an example of this trend. Second, the proliferation\nof tools written in the Go programming language has\ncontinued to expand, likely due to the flexibility of\nthe Go language and its convenience for adding and\n\nremoving module components. Finally, the targeting\nof Taiwanese media illustrates the continued overlap\nof public sector threat actors targeting private sector\norganizations with limited government ties.\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n10\n\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n## Compromised Customer Websites Hosted on IT Service Providers’ Infrastructure\n\n\n### Issue Description\n\nAs of February 2023, Google discovered 14\ncompromised customer websites hosted on Google\nCloud having bi-directional communication to\nmalware–which was originally identified using 2022\nVirusTotal (VT) data. All the sites were set up through IT\nService Providers (ITSP), who had resold GC services\n\nto the 14 clients. Each site hosted malicious files, had\nexternal malware communicating with it, and had its\ndomain embedded into the source code of various\nexternal malware. We also confirmed the suspicious\nnature of these sites using independent security tools.\n\nGoogle Cloud ITSP customers can prevent such types\nof environment misuse by:\n\n- properly segregating clients, and limiting all-client\n\naccess granted to individual admins, within multitenant environments;\n\n\n\n- logging and monitoring for potential compromises\n\non endpoint servers exposed to clients as well as on\ncommon ITSP infrastructure;\n\n- and patching vulnerabilities found using vulnerability\n\nscans to prevent threats via common ITSP\ninfrastructure.\n\nTo identify compromised sites, we looked for malware\nfirst submitted to VT in 2022 having actual Cloud\nService Provider “interactions” rather than just benign\n“one way communications”. We were not looking for\nmalware that just checked whether it had Internet\nconnectivity or was conducting port scans, but only\nactivity with bidirectional communication we associate\nwith potentially malicious behavior.\n\n11\n\n\n-----\n\n###### (Compromised Customer Websites, cont’d.)\n\nWe found 38 domains meeting our overall criteria, and\namong these, identified 14 customer sites that were live\nas of early February 2023. When we further explored\npotential patterns of compromise, we found that all\n14 sites were related to ITSPs. The ITSPs purchased\nthe Google Cloud services, and resold them—helping\nthese 14 clients set up domains—and acquire Google\nCloud IP addresses. We also confirmed these 14 sites’\nsuspicious nature by searching for their domains and\ncorresponding IPs in the independent AlienVault and\n\nShodan security platforms.\n\nAlthough we cannot comment on the root cause\nfor these compromises, we recommend that ITSPs\nusing Google Cloud should consider the following\nsuggestions to mitigate compromises or hinder\nproliferation to other environments hosted by ITSPs.\n\n### Suggested Mitigations for Google Cloud ITSP Customers\n\n1. ITSPs should ensure role based access, with\n\nsegregation of duties, so that one internal company\nadmin does not have access to all of an ITSP’s\nclients. If such an admin were to be compromised,\nnot all ITSP clients would be at risk. Such admins\nshould also use a hardware second factor in the\nform of security keys, for authentication.\n\n2. ITSPs should provide guidance to clients on how\n\nto securely set up websites, web applications,\nand domains in their resold assets. Clients should\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\nbe recommended to follow best practices such\n[as the OWASP Top 10 guidelines (using proper](https://owasp.org/www-project-top-ten/)\nauthentication protocols, like MFA, when needed;\nprotecting against injection attacks, such as by\nvalidating user-supplied data for suspicious content;\nand analogous controls) to secure websites and\nweb applications. They should also be reminded\nto be vigilant against employee phishing attacks,\nwhich can prevent domain administration portal\ncredentials from being stolen–that could lead to\n\ndomain misuse.\n\n3. Where ITSPs employ multi-tenancy by hosting\n\nmultiple customers in a single organization,\ndesign isolation boundaries between tenants.\nConsider segregating customers into isolated\nprojects or folders, isolated VPC networks, and\nisolated VPC Service Control (VPCSC) perimeters.\nVPCSC could help to mitigate the threat of a\ncompromise in one customer perimeter spreading\nthrough Google services to resources in a separate\ncustomer perimeter.\n\n12\n\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n## Cloud-Hosted Encrypted\n ZIP Files Evading Detection\n\n\nResearch by Google Cybersecurity Action Team\n(GCAT) and Mandiant into threat actor use of Google\nDrive for malware hosting highlighted threat actors\nstoring malware in Google Drive as encrypted ZIP files,\nlikely in an effort to evade detection. For example, in\nQ4 2022 Mandiant observed a campaign distributing\nURSNIF malware, a well-established general intrusion\nsoftware with history as a banking bot, by hosting\nthe URSNIF binary on Google Drive. The threat actors\nused a phishing email to convince victims to download\na password protected ZIP file hosting the malicious\n\ncontent which was then installed on their machine.\n\nAn expansion of this technique was seen later in Q4\n2022 by threat actors using DICELOADER malware,\nanother general intrusion malware which could be used\nfor many different purposes. In this campaign, Mandiant\nidentified phishing emails using a malicious Google\nDrive link that downloaded a ZIP file that contained a\nLNK file. The LNK file then subsequently downloaded\nand installed a Trojanized Zoom MSI installer, which led\nto the eventual DICELOADER infection. This campaign\nappeared to target the financial services sector\n\n\nbased on the phishing emails found by Mandiant. By\nseparating the malware binary from the downloaded\nZIP file, the actors even further obfuscated their\nmalicious intention from the Google Drive download.\nGoogle took multiple steps to halt this activity at the\ntime, as well as implementing additional detective\ncapabilities to spot and stop similar malicious use of\nGoogle Drive in the future.\n\nThese techniques highlight the risk posed by threat\nactors using cloud services to host malicious\ncontent and their continued development of evasion\ntechniques to avoid detection, moving from encrypted\nZIP files containing malware to encrypted ZIP files\nlinking to trojanized legitimate installers. This continued\nevolution suggests that organizations need to carefully\nmonitor downloads from even legitimate-seeming\nsites. While Google Cloud continues to implement a\nhost of controls for all customers in order to detect\nand prevent this activity, targeted organizations should\nalso consider using tools like Chronicle detection\nengine to identify and stop malware activity faster.\n\n13\n\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n## Customer Challenges and Solutions When Security Patching Google Kubernetes Engine\n\n\nCloud customers are increasingly running their\nworkloads in Kubernetes clusters due to the availability,\nflexibility, and security they provide. But like other IT\nassets, these clusters need to be routinely patched,\ntoo, to keep their features current and to install security\nand bug fixes. Reviewing 2021-2022 data, Google has\nfound that Google Kubernetes Engine (GKE) customers\nsometimes delay security patching their clusters,\noften from concern that patching might inadvertently\ninterrupt production operations. Yet delaying security\npatching introduces its own challenges–as a number\nof vulnerabilities can be identified in unpatched GKE\nenvironments over time.\n\nGKE customers can maintain workload availability\nand security patching currency by configuring and\norchestrating Kubernetes environments to speed up\npatching while maintaining business continuity; specify\nappropriate maintenance windows and maintenance\nexclusions windows to align with business needs; and\nuse several notification and scanning services to find\nvulnerabilities, and plan for security patch installations.\n\n\nGKE customers are concerned with tradeoffs\nbetween Kubernetes cluster availability and security\npatching. Customer workloads need to run during\nproduction timeframes–especially during key periods\nsuch as Black Friday, New Year’s Eve, etc. Security\npatching might impact this availability, as systems\ncan be down during patching–and there might even\nbe outages after patching. (For example, across\nany IT environment, patches could inadvertently\neven introduce new bugs). Across a number of\nconversations between GKE teams and GKE\ncustomers during 2021-22, customers provided the\nfollowing main reasons why they prolonged or delayed\nsecurity patching, as they balanced security and\navailability. (Solutions to these concerns are described\nat the bottom of this article).\n\n- Customers of applications that need to\n\nmaintain “state”—such as via sessions or similar\nmechanisms—worried that unexpected patching\nwould break the states (for example by recycling\na node-hosted load balancer or web server\n\n14\n\n\n-----\n\n###### (Customer Challenges and Solutions, cont’d.)\n\ncontaining a pinned session), undermining\ntheir applications’ execution. (This issue can\nbe addressed by a Pod Disruption Budget and\nTermination Grace Policy, as explained at the\nbottom of the article).\n\n- Similar to the “stateful” customers, were other\n\nclients executing batch and AI/ML applications. They\nworried that patching might interrupt work like ML\n“training”, as not-yet-completed workloads could\nbe restarted during patching. Although for such\nclients, non-interruption, rather than patching per\nse, was the aim. If the cluster nodes (i.e., the virtual\nmachines making up Kubernetes clusters where\ncustomers run their workloads) can finish without\ninterruption, they could be terminated without\npatching. These workloads were, in effect, ‘onetime’ jobs. (Patching concerns for such workloads\ncan be mitigated via maintenance exclusion\nconfigurations, as below).\n\n- Customers delayed security upgrades because\n\nthey worried that such upgrades might also bring\nunanticipated API changes, which might undermine\ntheir applications’ functionality. Yet, APIs do not\nchange when security upgrades occurs within\na minor version (the version of the Kubernetes\ncluster’s overall operating environment); and\nupdates can be configured to only upgrade the\ncurrent minor version, and not upgrade to a newer\nminor version (i.e., the scope of the updates can be\ncontrolled). Customers were not always aware of\nthis configuration option, however.\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n- For customers with very large node fleets, patching\n\ncould take more time, and possibly maintain a weak\nsecurity posture longer. The default GKE node\npatching method is surge upgrade, with a default\nnode-update parameter, maxSurge, of 1.\nCustomers can modify this parameter to make\npatching go faster, but the default value creates\na longer patching process, as only one node\ncan be updated at a time. The environment will,\nconsequently, run with vulnerable nodes longer.\n\nProlonging or delaying security patching has its\nown challenges, however. Clusters running on\nolder GKE patch releases had 2X, 3X, or more open\nCVEs compared to those on newer patch releases.\nEffectively, unmanaged risk accumulates over time. We\nlooked at a year’s worth of node patching data, ending\nin October 2022. Customers were running several\nGKE minor versions and various Container-Optimized\nOperating Systems (COS, the actual OS image\ndeployed within the minor version) in this timeframe.\nThe relative number of High and Moderate COS CVEs\nin one of the earlier GKE minor versions, 1.20, as well as\none of the later minor versions, 1.22, in this timeframe,\nis illustrated below.\n\n15\n\n\n-----\n\n###### (Customer Challenges and Solutions, cont’d.)\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n16\n\n\n-----\n\n###### (Customer Challenges and Solutions, cont’d.)\n\nThe graphs show the patch lifecycle over time when\nusing the “auto-upgrade” process, wherein Google\nautomatically deploys patches in customer clusters\nwithin the same minor version at a regular cadence.\nThe graphs show relative CVE percentages, i.e. the\nCVE count for a given auto-upgrade release, as\ncompared to the CVE count for the first auto-upgrade\nrelease in the same minor version. As seen, the\npercentages generally decreased by 2X, 3X, or higher\nmultiples, as clusters were being patched towards\n\nmore current releases–as less CVEs were found in\nmore current releases.\n\nThe suggestions below explain how customers can\nachieve availability and security patching in a more\nunified manner.\n\n### Solutions for balancing availability and security patching within GKE\n\n[1. Ensure that your clusters are in a release channel,](https://cloud.google.com/kubernetes-engine/docs/concepts/release-channels)\n\nwhich are Google-managed rollout policies\nallowing customers to choose the appropriate,\nrelevant upgrade path for them. And the channels\nautomatically maintain customer clusters with new\nKubernetes features and security and bug fixes. Of\nthe three available release channels (Rapid, Regular,\nand Stable), Google recommends the Regular\nchannel for a useful balance between security\npatch speed and availability. Still–security fixes are\nautomatically published and patched in all three\nchannels in due time.\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n[2. Use regularly-occurring maintenance windows](https://cloud.google.com/kubernetes-engine/docs/how-to/maintenance-windows-and-exclusions#maintenance-window)\n\n(specifying when environment upgrades are\nallowed), of proper duration, to ensure that nodes\nare patched when production processing permits.\n(However, note–short maintenance windows may\nbe insufficient for large clusters, to fully complete\npatching in one cycle).\n\n[3. Use maintenance exclusion windows (MEW,](https://cloud.google.com/kubernetes-engine/docs/concepts/maintenance-windows-and-exclusions#exclusions)\n\nspecifying when environment upgrades are\nprohibited), to prevent patching from occurring\n\nduring non-interruptible work periods. The\ntimeframe for the exclusion, as well as its scope, can\nbe specified. For example, a given minor version can\ncontinue to be updated, but migrating to a newer\nminor version–where, for instance, API functionality\ncould change–can be excluded via a MEW.\n\n4. The default node pool patching method is surge\n\nupgrade, as before. If using surge upgrade for very\nlarge clusters, consider increasing the maxSurge\nparameter beyond the default of 1. More than one\nnode will be patched simultaneously, allowing\nfor faster node fleet patching. If the deployed\napplication(s) can also withstand some disruption\nduring patching, increase the maxUnavailable\nparameter beyond its default 0. This might take\n\ndown some production nodes–which by definition,\nshould be tolerable–but will also finish the patching\nfaster.\n\n17\n\n\n-----\n\n###### (Customer Challenges and Solutions, cont’d.)\n\n[5. For stateful and similar workloads, set a Pod](https://cloud.google.com/kubernetes-engine/docs/best-practices/upgrading-clusters#set-tolerance)\n\n[Disruption Budget (PDB). Pods are subtasks of](https://cloud.google.com/kubernetes-engine/docs/best-practices/upgrading-clusters#set-tolerance)\na workload running within a node. Setting an\nappropriate PDB will ensure that for sessionbased and similar applications, the “minimum\navailable” pods specified in the Budget will continue\nexecuting–while the patching is occurring. The\n[Termination Grace Period can be increased if](https://cloud.google.com/blog/products/containers-kubernetes/ensuring-reliability-and-uptime-for-your-gke-cluster)\nnecessary (the default is 30 second) to ensure that\nas pods get shutdown during the patching process\n\na sufficient amount of time is allotted for a graceful\nshutdown of workload tasks, if needed.\n\n6. For additional production workload availability,\n\n[customers should set up regional clusters rather](https://cloud.google.com/kubernetes-engine/docs/concepts/planning-scalability#best_practices_for_availability)\n[than zonal clusters when creating their GKE](https://cloud.google.com/kubernetes-engine/docs/concepts/planning-scalability#best_practices_for_availability)\nenvironment. While a zonal cluster is being patched,\naccess to the Kubernetes API is not available, which\ncan impact production applications dependent\nupon it. Regional clusters don’t have this limitation,\nhowever. The zonal cluster has only one control\nplane, the software infrastructure managing the\nKubernetes cluster. While the zonal cluster is\npatched, the Kubernetes API cannot be used, as\nthe API’s manager (the control plane) is unavailable.\nRegional clusters, in contrast, have control plane\n\nredundancy of three–and when they are patched,\n\none control plane will be unavailable, while the\nothers will be available. The available control planes\nwill, among other functionality, keep the Kubernetes\nAPI operating.\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n[7. Use the security posture dashboard (SPD), currently](https://cloud.google.com/kubernetes-engine/docs/concepts/about-security-posture-dashboard)\n\nin Public Preview, to find various security concerns\nwith your clusters. Through the SPD, vulnerability\nscans looking for workload misconfigurations, or\nCVEs in the OS images used on nodes, can be\ninitiated–and the results provided in a dashboard.\nVulnerability scan results are also placed into Cloud\nLogging for additional reportability.\n\n8. Utilize various notification services for additional\n\nsecurity awareness regarding your clusters. View\n\n[deprecation insights and recommendations to](https://cloud.google.com/kubernetes-engine/docs/deprecations/viewing-deprecation-insights-and-recommendations#what_are_deprecation_insights_and_recommendations)\ndetermine which APIs or other GKE features will be\nchanging in the future, including suggestions how\nto mitigate the changes within your environment.\n[Subscribe to the GKE pub/sub to receive security](https://cloud.google.com/kubernetes-engine/docs/concepts/cluster-notifications#securitybulletin)\nbulletins and patch release information tailored to\nthe specific cluster versions you’re running. Both\nnotifications can be used for planning and change\nmanagement purposes.\n\n18\n\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n## The low hanging fruit:\n leaked service account keys and the impact to your organization\n\n\nLeaked, or inadvertently shared, service account\ncredentials continue to be one of the leading factors\nof abuse on Google Cloud. The Cloud Security\n[Alliance’s (CSA) 2022 “Top Threats to Cloud Computing](https://cloudsecurityalliance.org/artifacts/top-threats-to-cloud-computing-pandemic-eleven/)\n\n[- Pandemic Eleven” report identified “Insufficient](https://cloudsecurityalliance.org/artifacts/top-threats-to-cloud-computing-pandemic-eleven/)\nIdentity, Credentials, Access, and Key Management” as\nthe #1 security issue facing cloud customers. In 42% of\nleaked key incidents detected by our abuse systems,\ncustomers did not take action after Google attempted\nto contact the project owner, so the key remained\nvulnerable to abuse. While there are many instances\nof new accounts or developers testing code exposing\nservice account keys, our teams have observed\ncompromises distributed across varying sizes and\nmaturities of organizations. Organizations seeking to\nreduce and mitigate the risk must take into account\nkey management, principle of least privilege with\nscoped IAM policies, policies and controls to prevent\nkeys from leaking, as well as continually scanning and\nmonitoring for keys that have already been exposed.\n\n\n### Attackers Shifting Tactics\n to Conceal API Calls\n\nOur teams fighting fraud and abuse on the platform\nhave observed attackers continually changing their\ndefense evasion techniques to conceal the origin of\nAPI calls. Attackers have attempted to use Tor nodes,\nopen proxies, other compromised cloud instances,\nand even other cloud service providers. Oftentimes\nattackers don’t know what IAM permissions or\nresources are associated with a service account and\ninstead try to maximize fraudulent profits by utilizing\nautomation tools to spin up cloud resources such as\nhigh cpu instances as quickly as possible and across\nseveral Google Cloud zones before they’re detected\nand instances shutdown. However, depending on\nthe IAM permissions granted, an attacker that has\ndiscovered a service account key could cause more\ndetrimental harm to customers.\n\n19\n\n\n-----\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n###### (The low hanging fruit, cont’d.)\n\n**Figure 1. Snapshot distribution of IAM roles of confirmed compromised service account keys.**\n\n\nIAM roles control who (identity) has what access\n(role) for which resource. Taking a closer look at\nIAM roles and permissions associated with leaked\nand compromised service account keys, our abuse\ndata surfaces that 67.6% of keys in confirmed\nincidents of customer compromise used basic IAM\nroles (23.5% had Owner roles, and 44.1% had Editor\nroles). These basic roles increase an organization’s\n\nrisk by including thousands of permissions across\n[all Google Cloud services. Palo Alto’s Unit42 Cloud](https://www.paloaltonetworks.com/prisma/unit42-cloud-threat-research)\n[Threat Research reported “99% of cloud users, roles,](https://www.paloaltonetworks.com/prisma/unit42-cloud-threat-research)\nservices, and resources were granted excessive\npermissions.” Among Unit 42’s observations, AWS’s\nAdminstratorAccess and Azure’s Owner were among\nthe top 5 most used policies, similar to what our\nFraud and Abuse teams have reported with IAM roles\nassigned on Google Cloud.\n\n\n### Hardcoded credentials checked into code repositories\n\nOne of the most common situations observed when\nkeys are discovered leaked includes a developer\ndownloading a service account key, which is a RSA\nprivate/public key pair that grants long-lived access,\n\nand checking code into a public code repository with\nthe key hardcoded. Similarly, there are instances of\ndevelopers checking in code into private repositories\nwhich at some point were updated to become public\nand therefore exposing keys that currently exist or\nhave at any point in the repository’s history. Bad\nactors are continually scanning for this low hanging\nfruit to spin up cloud resources. As noted in the\n[January 2023 Threat Horizons Report, one of the](https://services.google.com/fh/files/blogs/gcat_threathorizons_full_jan2023.pdf)\nmost targeted software in Q3 2022 was IT automation\n\n20\n\n\n-----\n\n###### (The low hanging fruit, cont’d.)\n\nsoftware Jenkins which is used in CI/CD infrastructure.\nWhat is less obvious is that these keys, among other\ncredentials, are also found in an organization’s commit\nhistory and even CI/CD logs such as when they’re\npassed as a command line argument going unnoticed\n[for an extended period of time. IBM’s Cost of Data](https://www.ibm.com/reports/data-breach)\n[breach 2022 found stolen or compromised credentials](https://www.ibm.com/reports/data-breach)\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\nto be the most common cause of a breach, 19% of\nbreaches, and the longest life cycle of 243 days to\nidentify. A developer scanning the Python Package\n[Index (PyPi) recently identified 57 valid AWS keys,](https://tomforb.es/i-scanned-every-package-on-pypi-and-found-57-live-aws-keys/)\nincluding from Amazon themselves, and found the\noldest active key to be uploaded 10 years ago.\n\n\n**[Figure 2. Image of a Github repo with an AWS key found in the commit history of an Organization from the PingSafe blog.](https://blog.pingsafe.com/shiba-inu-cloud-credentials-leaked-in-a-major-security-breach-394ad54382c1)**\n\n\n21\n\n\n-----\n\n###### (The low hanging fruit, cont’d.)\n\nMandiant has observed service account keys being\nused in other concerning ways such as insider risk,\ncross-cloud breaches, as well as reconnaissance in\nGoogle Workspace. In one such example a disgruntled\nemployee downloaded AWS service account keys\nahead of a termination and later used those keys to\ndelete data from a production database in Amazon’s\nRelational Database Service.\n\nIn another instance, an attacker was able to breach\ntwo clouds with one service account key. The attacker\nscanned a public code repository and discovered\na hard coded AWS service account key and using\nthat credential they were able to gain access to a\ncustomer’s AWS instance which in turn hosted an\ninternal code repository. Next the attacker was able\nto discover a hard coded Azure credential within the\ninternally hosted code repository and use that key to\ngain access to the customer’s Azure environment.\n\nAccess to service account credentials can also allow\nattackers to span across services such as when a GCP\nservice account is granted domain wide delegation\nauthority to an organization’s Google Workspace\nenvironment. In one instance, a developer had their\nlaptop compromised and an attacker gained access to\nthe service account key which was downloaded and\nhad been granted domain-wide delegation with an API\nscope that could access Gmail and Drive. The attacker\nwas able to perform reconnaissance within Workspace\nwith access to that organization’s emails and files.\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\nLeaked service account keys, and persistent\ncredentials in general, expose organizations to risk\nand can lead to serious consequences. Though keys\nare predominantly found in code repositories they\ncan be harvested in several other locations such as\nwithin archive files, emails, slack messages, pastebin,\nprevious leaks/disclosures, open storage buckets, and\nmore. Organizations should reduce their reliance on\nlong-term credentials and where this isn’t feasible,\nemploy the strategy of defense in depth in conjunction\n\nwith other practices such as the principle of least\nprivilege to reduce and mitigate the risk of leaked\nkeys. There are several mitigation strategies below\norganizations could leverage in Google Cloud and their\nown environment to strengthen their security posture\nand reduce their exposure.\n\n22\n\n\n-----\n\n## Mitigations\n\n##### Assess the need for Service Accounts and follow best practices\n\n- Assess whether service accounts with long-lived\n\ncredentials are needed - most scenarios don’t\nrequire a downloaded service account key.\n\n» For local development, use your user credentials\n\n[to create and authenticate with application default](https://cloud.google.com/docs/authentication/provide-credentials-adc#gcloud-credentials)\n[credentials or service account impersonation.](https://cloud.google.com/docs/authentication/provide-credentials-adc#gcloud-credentials)\n\n» For production workloads, assess which\n\n[authentication method is appropriate.](https://cloud.google.com/iam/docs/best-practices-service-accounts#choose-when-to-use)\n\n- Create service account keys only when you have\n\na scenario that cannot be met with the previous\n[options, and follow best practices for Service](https://cloud.google.com/iam/docs/best-practices-service-accounts)\n[accounts and best practices for managing Service](https://cloud.google.com/iam/docs/best-practices-service-accounts)\n[Account keys.](https://cloud.google.com/iam/docs/best-practices-for-managing-service-account-keys)\n\n##### Keep an inventory and audit usage\n\n- Introduce a naming convention when creating\n\nservice accounts with a name or description that is\nindicative of the purpose such as <team_name>```\n <resources_accessed>-<purpose>.\n\n```\n- Audit who has access to the service account and\n\n[how they’re being used.](https://cloud.google.com/iam/docs/service-account-monitoring#find-single-key)\n\n[» For service account usage, use the IAM Policy](https://cloud.google.com/policy-intelligence/docs/analyze-iam-policies)\n\n[Analyzer to check which identities can use or](https://cloud.google.com/policy-intelligence/docs/analyze-iam-policies)\nimpersonate a service account.\n\n» For service account key usage, you can monitor\n\n[authentication activities with Activity Analyzer.](https://cloud.google.com/policy-intelligence/docs/service-account-usage-tools)\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n- Create a policy to disable accounts not used\n\nin a while and revoke employee access during\noffboarding.\n\n- [Monitor Audit Logs and leverage pre-built queries to](https://cloud.google.com/iam/docs/audit-logging/examples-service-accounts)\n\nidentify anomalous behavior with service accounts.\n\n##### Have a plan in place when keys are exposed and test your assumptions\n\n- Create or update playbooks and run tabletop\n\nexercises within your organization to respond to a\nleak by disabling, rotating keys, and revoking access.\n\n- Document the process of rotating keys (what will\n\nbreak, what are the dependencies, who are the\n[owners). CACAO Security Playbooks is a community](https://docs.oasis-open.org/cacao/security-playbooks/v1.0/security-playbooks-v1.0.html)\nstandard that helps organizations create such\nplaybooks in a structured and standardized manner.\n\n- Partner with your red teams to test and validate\n\nyour assumptions of preventing, detecting, and\nremediating exposed credentials.\n\n[• Assure all essential contacts are up to date so the](https://cloud.google.com/resource-manager/docs/managing-notification-contacts)\n\nright stakeholders receive important Google Cloud\nnotifications and action them in a timely manner.\n\n23\n\n\n-----\n\n##### (Mitigations, cont’d.)\n\n Enforce Organizational policies, scope IAM permissions and use IAM recommender\n\n- Consider applying organization policies\n\nbroadly across your organization, particularly\n```\n iam.automaticIamGrantsForDefault\n ServiceAccounts, constraints/iam.\n\n```\n[serviceAccountKeyExpiryHours and](https://cloud.google.com/resource-manager/docs/organization-policy/restricting-service-accounts#limit_key_expiry)\n```\n iam.disableServiceAccountKeyCreation.\n\n```\nThese policies help prevent the proliferation of\nunmanaged keys and the default Editor role granted\n[to default service accounts. Apply these policies as](https://cloud.google.com/resource-manager/docs/cloud-platform-resource-hierarchy#inheritance)\n[high in your hierarchy as possible (the organization](https://cloud.google.com/resource-manager/docs/cloud-platform-resource-hierarchy#inheritance)\nnode) and grant limited project-level policy\nexceptions only for well-vetted exceptions that must\nuse a service account key.\n\n- Don’t use Basic roles such as Owner, Editor, and\n\n[Viewer. `Use the IAM recommender to evaluate](https://cloud.google.com/policy-intelligence/docs/role-recommendations-overview)\npermissions and identify which permissions could\nbe removed.\n\n\n**[For more information, visit gcat.google.com](http://gcat.google.com)**\n\n##### Prevent keys from being checked in and monitor for exposed keys\n\n- Introduce automation into your build system such as\n\npre-commit checks to prevent keys from ever being\n[checked in. Cloud Build can create build triggers](https://cloud.google.com/build/docs/automating-builds/create-manage-triggers)\nand there are also open source projects such as\n[git-secrets which use Git hooks.](https://github.com/awslabs/git-secrets)\n\n[• Use Security Command Center’s Anomaly](https://cloud.google.com/security-command-center/docs/concepts-security-sources#anomaly_detection)\n\n[detection to view findings for leaked service](https://cloud.google.com/security-command-center/docs/concepts-security-sources#anomaly_detection)\naccount credentials. Google Cloud’s DLP offering\n[can also detect credentials and secrets from GCP,](https://cloud.google.com/dlp/docs/infotypes-reference#credentials_and_secrets)\nAWS, and Azure.\n\n[• Consider open source tools such as Trufflehog](https://github.com/trufflesecurity/trufflehog)\n\n[and ScoutSuite to identify exposed keys or open](https://github.com/nccgroup/ScoutSuite)\nstorage buckets to assess your organization’s\n[security posture. BFG Repo Cleaner can help](https://rtyley.github.io/bfg-repo-cleaner/)\norganizations cleanse git commit history including\nremoving credentials.\n\n24\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/blogs/gcat_threathorizons_full_apr2023.pdf"
    ],
    "report_names": [
        "gcat_threathorizons_full_apr2023.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ea4f255b-346d-4907-a801-1f797a99d4b0",
            "created_at": "2023-01-06T13:46:38.693529Z",
            "updated_at": "2025-03-27T02:00:02.893459Z",
            "deleted_at": null,
            "main_name": "Cyber Caliphate Army",
            "aliases": [
                "UUC",
                "CyberCaliphate",
                "Islamic State Hacking Division",
                "CCA",
                "United Cyber Caliphate"
            ],
            "source_name": "MISPGALAXY:Cyber Caliphate Army",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "76fc6d92-0710-4640-bfa7-3000fe3940a5",
            "created_at": "2022-10-25T16:07:24.251595Z",
            "updated_at": "2025-03-27T02:02:10.151254Z",
            "deleted_at": null,
            "main_name": "Syrian Electronic Army (SEA)",
            "aliases": [
                "ATK 196",
                "Deadeye Jackal",
                "Syria Malware Team",
                "Syrian Electronic Army",
                "TAG-CT2"
            ],
            "source_name": "ETDA:Syrian Electronic Army (SEA)",
            "tools": [
                "AndoServer",
                "CypherRat",
                "SLRat",
                "SandroRAT",
                "SilverHawk",
                "SpyNote",
                "SpyNote RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1681783757,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1679973568,
    "ts_modification_date": 1679973571,
    "files": {
        "pdf": "https://archive.orkl.eu/59060ce826df58285a90a8198d06fcdd5e7e6987.pdf",
        "text": "https://archive.orkl.eu/59060ce826df58285a90a8198d06fcdd5e7e6987.txt",
        "img": "https://archive.orkl.eu/59060ce826df58285a90a8198d06fcdd5e7e6987.jpg"
    }
}