{
    "id": "f0cf7cc1-8c92-46f0-bbc7-cd637082e42b",
    "created_at": "2023-01-12T15:05:24.664749Z",
    "updated_at": "2025-03-27T02:08:57.08251Z",
    "deleted_at": null,
    "sha1_hash": "fdff1bbcb4e5704a61534b9607a56218a37a9352",
    "title": "2020-09-29 - TA2552 Uses OAuth Access Token Phishing to Exploit Read-Only Risks",
    "authors": "",
    "file_creation_date": "2022-05-28T22:07:03Z",
    "file_modification_date": "2022-05-28T22:07:03Z",
    "file_size": 814814,
    "plain_text": "# TA2552 Uses OAuth Access Token Phishing to Exploit Read-Only Risks\n\n**[proofpoint.com/us/blog/threat-insight/ta2552-uses-oauth-access-token-phishing-exploit-read-only-risks](https://www.proofpoint.com/us/blog/threat-insight/ta2552-uses-oauth-access-token-phishing-exploit-read-only-risks)**\n\nSeptember 29, 2020\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nTA2552 Uses OAuth Access Token Phishing to Exploit Read-Only Risks\n\n\n-----\n\nSeptember 29, 2020 The Proofpoint Threat Research Team\n\nSince January 2020, Proofpoint researchers have tracked an actor\nabusing Microsoft Office 365 (O365) third-party application (3PA) access, with suspected\nactivity dating back to August 2019. The actor, known as TA2552, uses wellcrafted Spanish language lures that leverage a narrow range of themes and brands. The\nlures entice users to click a link in the message, taking them to the legitimate Microsoft thirdparty apps consent page. There they are prompted to grant a third-party application readonly user permissions to their O365 account via OAuth2 or other token-based authorization\nmethods. TA2552 seeks access to specific account resources like the user’s\ncontacts and mail. Requesting read-only permissions for such account resources could be\nused to conduct account reconnaissance, silently steal data, or to intercept password reset\nmessages from other accounts such as those at financial institutions. While organizations with\nglobal presence have received messages from this group, they appear to choose recipients\nwho are likely Spanish speakers.\n\n## Attack Technique Overview\n\nThe campaigns from TA2552 follow a similar attack flow. Upon clicking the link in the\nmessage, the recipient is redirected to the authentic Microsoft third-party application consent\npage at login.microsoftonline.com and asked to grant or deny the requested permissions. If\nthe browser is not already authenticated to O365, the user is prompted to authenticate. If\nconsent is granted, the third-party application will be allowed to access the currently\nauthenticated O365 account. The list of permissions we have observed in these\ncampaigns allows read-only access to items such as the user's contacts, profile, and\nmail. Even if consent is denied, the browser is still redirected to an attacker-controlled\npage, giving the actor the opportunity to present more attack techniques to the visitor.\n\n\n-----\n\n_Figure 1: Overview of attack flow_\n\nThe consent URL used during the OAuth authorization flow has a predictable structure.\nValues of interest are indicated in Figure 2.\n\n\n-----\n\n_Figure 2: Relevant components of a consent URL_\n\nThrough some campaigns, we have observed the same phish URLs leading to consent URLs\nwith different values for client_id, redirect_uri, and scope options. Some campaigns have used\nmultiple phish URLs. Samples listed below should not be considered representative of the\ncomplete list of 3PA IDs and URLs used by this actor over time.\n\n## Message Overview\n\nIn addition to the lures, there are several important components to the\nattacks described below. Below each message sample, we’ve included several relevant\nattributes:\n\n**OAuth Access Token Phish Lure Theme: Branding or entity being impersonated.**\n**OAuth Access Token Phish URL Sample: Sample of the URL linked in the message**\nbody.\n**ClientID Sample: Sample of the observed client_id value from consent URLs.**\n**Consent redirect URL Sample: A sample of the redirect_uri value from observed**\nconsent URLs where the user’s browser is sent post-consent, regardless of the user’s\nchoice to consent or not. The request may contain an authorization code if the user\nchooses to consent, or an error code if the consent request was denied.\n**Scope values observed in consent URL: A sample of the scope value from the**\nconsent URL. It describes the permissions requested by the third-party application\n\nImpersonation of the Servicio de Administración Tributaria (SAT), Mexico’s tax authority, is a\ncommon message theme for this actor. When SAT is used in the phish lure, the email\nsuggests that the recipient needs to update their contact information and is presented with\nwhat appears to be a link to do so (Figures 3, 4). Some subjects, like\n“Аcսse dе Сіta - Aсlaracіоոes 2020. (Acknowledgment of Appointment – Clarifications\n2020.),” make use of non-ASCII characters, possibly to evade simple spam filters (Figure 3).\n\n\n-----\n\n_Figure 3: Mexican tax authority lure_\n\nOAuth Access Token Phish Lure Theme: update your information with SAT of Mexico\nOAuth Access Token Phish URL Sample: hxxp://akglass[.]in/menu/redirect.php\nClientID Sample: 13f33779-fe8e-4f64-8252-79e8ec962fb4\nConsent redirect URL Sample: hxxps://www-registros-appsmx.e18220[.]com/1/autoriza.php\nScope values observed in consent\nURL: User.Read, User.ReadBasic.All, Contacts.Read, Contacts.Read.Shared, People.Read\n\n\n-----\n\n_Figure 4: Mexican tax authority lure with accurate branding_\n\nOAuth Access Token Phish Lure Theme: update your information with SAT of Mexico\nOAuth Access Token Phish URL Sample: hxxps://app452-satmx.i3720[.]xyz/leap/983.php\nClientID Sample: 4f641680-a8cd-4f96-8181-08efaf2563b1\nConsent redirect URL Sample: hxxps://www-registros-appsmxsat.x030720[.]xyz/regs/autoriza.php\nScope values observed in consent\nURL: User.Read, Contacts.Read, Contacts.Read.Shared, People.Read, Mail.Read\n\nMexican tax- and government-themed messages are regularly observed with this actor,\nthough they have occasionally deviated from this messaging and impersonated popular\nconsumer brands. In July, we observed this actor’s lures impersonating Netflix Mexico (Figure\n5) and Amazon Prime Mexico (Figures 6, 7).\n\n\n-----\n\n_Figure 5: Netflix Mexico lure offering 6 free months of service_\n\nOAuth Access Token Phish Lure Theme: Netflix Mexico free trial\nOAuth Access Token Phish URL Sample: hxxps://485online.rs10720[.]xyz/xPsY\nClientID Sample: d76c652c-7ba7-4205-8666-059985a0ec54\n\n\n-----\n\nConsent redirect URL Sample: hxxps://www-netfflixregistros.i10720[.]xyz/regs/autoriza.php\nDomain reused in Amazon Prime free trial phish below\nScope values observed in consent\nURL: User.Read, Contacts.Read, Contacts.Read.Shared, People.Read, Mail.Read\n\n\n-----\n\n_Figure 6: Amazon Prime Mexico lure offering 6 months of free service_\n\n\n-----\n\n_Figure 7: 3PA consent request, featuring H&M branding incongruent with the Amazon Prime_\n_lure_\n\nPhish Lure Theme: Amazon Prime Mexico free trial\nOAuth Access Token Phishing URL Sample:\nhxxps://printstockphoto[.]com/img/01/redirect.html\nClientID Sample: f6b5e94d-f5d8-4f4e-9a68-4c06aa2e4cba\nConsent redirect URL Sample: hxxps://apps-registros-mx.is15720[.]xyz/1/auth.php\nNotable brand mismatch between the email lure (Amazon Prime) and the consent page\n(H&M)\n\n\n-----\n\n## Third-Party Applications and Permission Risks\n\nIt’s important to understand the scope and risk of permissions requested by the third-party\napps linked in these messages. The official consent page presents a list of permissions\nrequested by the third-party application (Figure 8 is an example).\n\n_Figure 8: Itemized permission list for a third-party application_\n\nAll permissions we’ve observed requested thus far have been read-only. While that might\nseem relatively benign, even allowing an actor read access to a user’s inbox and contacts can\nhave significant regulatory and privacy consequences. The minimal permissions requested by\nthese apps also likely help them appear\ninconspicuous if an organization’s O365 administrator audits connected apps for their\nusers’ accounts. The apps don’t request many permissions, and those they do might not\nappear particularly far-reaching, allowing them to blend in with other benign apps.\n\n_Figure 9: Commonly observed requested permissions_\n\nContacts.Read and People.Read could be used for email address harvesting. Obtaining\nemail addresses in this way can help ensure addresses are valid and active.\n\n\n-----\n\nUser.Read can help an actor determine potential value of an account, or the value of\ncompromising the user’s other accounts.\nMail.Read allows an actor to read a user’s mail, potentially offering a more subtle\nmanner of collecting credentials. If an actor completes the ‘forgot password’ flow on a\nsite connected to the email address and a password reset link is sent via email, they\ncould effectively steal the account. This also assumes that the user’s account does not\nhave multifactor authentication measures independent of the readable account’s\ninbox enabled.\n\n## Infrastructure and Hosting\n\nThe phish URL in the lure is usually a compromised site that takes the recipient to\nthe official O365 login page if they’re not authenticated. Once signed into their O365 account,\nthe user is redirected to the official O365 consent process that prompts them to grant\npermissions to the actor’s application. The domains that catch the OAuth tokens are often\nregistered via Namecheap and hosted on Cloudflare.\n\n## Conclusion\n\nThreat actors often find creative ways to harvest information. In these attacks, TA2552 doesn't\nrely on techniques like more traditional credential phishing or dropping malware on a\nsystem. Instead, they gain permissions to view the content and activity of resources available\nthrough a user’s O365 account. The departure from such traditional techniques gives this\nactor an advantage, as users likely aren’t trained to spot or inspect suspicious\napplications. Even read-only access comes with considerable risk. The ability to perform\nreconnaissance on an O365 account supplies an actor with valuable information that can later\nbe weaponized in business email compromise (BEC) attacks or account takeovers.\n\n**IOCs**\n\n**Phish URL Domains:**\n\nThe actor has used a blend of what appear to be compromised sites and custom domains.\n\ncasperinfosystem[.]com\nultimatetravel[.]in\nnivedafoundation[.]org\ncalyss[.]in\nmucla[.]in\nakglass[.]in\ni3720[.]xyz\nrs10720[.]xyz\nphotobalkan[.]com\nprintstockphoto[.]com\n\n\n-----\n\nccgdm[.]org\nal-thawiya[.]com\ndev.tvs[.]st\n\n**ClientIDs:**\n\n13f33779-fe8e-4f64-8252-79e8ec962fb4\n4f641680-a8cd-4f96-8181-08efaf2563b1\nd76c652c-7ba7-4205-8666-059985a0ec54\n2c8cd500-52d3-4b88-8d0b-1f8ad8a3b714\n1ed6cd93-7682-4584-9e1e-f9251f056cbd\n2385bb0e-b757-4b1c-830b-c5076d1c8ca2\n41b33fb0-7a42-4f9a-a649-62fa456e85ea\n6337785c-1c50-4b4f-befa-9b70b9fd78ad\n81f521a0-8db3-42cc-a3ff-9756474c7d14\na04f33b3-efee-4d74-93ce-59b157381c0b\na972fde8-6e7a-41bb-9c63-d3cc6c0603fe\nab6df806-cd0e-462d-af11-3c51bccc6ba3\nb8d51b1a-f464-4ab4-ac0d-9d8dc190cb9e\nf6b5e94d-f5d8-4f4e-9a68-4c06aa2e4cba\n\n**Redirect URL Domains:**\n\nx030720[.]xyz\ne10220[.]com\nxs1920[.]xyz\ni10720[.]xyz\ne1920[.]xyz\nis15720[.]xyz\ne29120[.]com\nrr020920[.]xyz\ne180320[.]xyz\ne18220[.]com\ni5320[.]xyz\nr25820[.]xyz\nex171019[.]com\n16720s[.]xyz\ne18220[.]com\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-29 - TA2552 Uses OAuth Access Token Phishing to Exploit Read-Only Risks.pdf"
    ],
    "report_names": [
        "2020-09-29 - TA2552 Uses OAuth Access Token Phishing to Exploit Read-Only Risks.pdf"
    ],
    "threat_actors": [
        {
            "id": "6b88f18e-81b7-46b6-a20d-79e03220447d",
            "created_at": "2024-02-06T02:00:04.101887Z",
            "updated_at": "2025-03-27T02:00:03.316982Z",
            "deleted_at": null,
            "main_name": "TA2552",
            "aliases": [],
            "source_name": "MISPGALAXY:TA2552",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75febd40-3628-491d-be18-366270cb33b1",
            "created_at": "2022-10-25T16:07:24.267099Z",
            "updated_at": "2025-03-27T02:02:10.15549Z",
            "deleted_at": null,
            "main_name": "TA2552",
            "aliases": [],
            "source_name": "ETDA:TA2552",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535924,
    "ts_updated_at": 1743041337,
    "ts_creation_date": 1653775623,
    "ts_modification_date": 1653775623,
    "files": {
        "pdf": "https://archive.orkl.eu/fdff1bbcb4e5704a61534b9607a56218a37a9352.pdf",
        "text": "https://archive.orkl.eu/fdff1bbcb4e5704a61534b9607a56218a37a9352.txt",
        "img": "https://archive.orkl.eu/fdff1bbcb4e5704a61534b9607a56218a37a9352.jpg"
    }
}