{
    "id": "f103642a-7e9b-473f-b1ee-d1479f5dd0c3",
    "created_at": "2023-01-12T15:08:32.199997Z",
    "updated_at": "2025-03-27T02:05:35.021284Z",
    "deleted_at": null,
    "sha1_hash": "08d98dd754a66f842c0dd3cded17dfe1fc4f6173",
    "title": "2019-07-17 - Who is Mr Guo-",
    "authors": "",
    "file_creation_date": "2022-05-28T03:23:26Z",
    "file_modification_date": "2022-05-28T03:23:26Z",
    "file_size": 2202764,
    "plain_text": "# Who is Mr Guo?\n\n**[intrusiontruth.wordpress.com/2019/07/17/who-is-mr-guo/](https://intrusiontruth.wordpress.com/2019/07/17/who-is-mr-guo/)**\n\nintrusiontruth July 17, 2019\n\nIn our last post, we stated that a source whose identity we had verified had named an MSS\nOfficer in Jinan who was believed to be involved in Cyber operations. We are now in a\nposition to reveal that the name provided to us is 郭林 (Guo Lin). Open source research\nconducted by analysts working for Intrusion Truth quickly revealed a potential candidate for\nGuo Lin.\n\n**Guo Lin, Masters Student**\n\nAn [IT security paper from 2007 called ‘基于多维角度的攻击分类方法‘ (Method of Classifying](http://www.arocmag.com/getarticle/?aid=983b85ec68aa77e9)\nAttacks Based on Multi-dimension) was authored by a Guo Lin in which he described himself\nas a Masters student conducting research into network and information security and\nmalicious code detection. Guo was a Computer Science student at Nanjing University (not\nJinan), making it uncertain whether he is indeed the same individual in Jinan named in our\ntip.\n\nThere is nothing wrong with being a Masters student, of course. So let’s take a look at what\nelse Guo has been up to.\n\n**glince[at]163.com**\n\n\n-----\n\nOur high confidence that we have the right person comes from the e-mail address used by\nGuo in the paper – glince[at]163.com. We will show how the e-mail address links Guo to\nJinan.\n\nGuo Lin’s academic paper showing his e-mail address\n**antorsoft[.]com**\n\n\n-----\n\nHistorical WHOIS data shows that the e-mail address glince[at]163.com was the original\nregistrant of a number of domain names and was the admin contact for antorsoft[.]com.\n\nAntorsoft historical WHOIS\n**Jinan Quanxin Fangyuan Technology Co. Ltd.**\n\nDomain registration information for antorsoft[.]com names the registrant as Jinan Quanxin\nFangyuan Technology Co. Ltd, which translates into Chinese as 济南全欣方沅科技有限公司.\nThe address is listed as 238, Jing Shi Dong Lu, Jinan, 250000, Shandong, China.\nImportantly, this company is based in Jinan, just where our tip said Guo Lin was based.\n\n[Another Chinese website lists a different address for the same company at No. 12, Qilihe](https://www.huangyeso.com/company/10325595.html)\nRoad, Licheng District, Jinan, Shandong:\n\n\n-----\n\nSecond address for Jinan Quanxin Fangyuan\n**Jinan Anchuang Information Technology Co. Ltd.**\n\nHowever, the website for [Antorsoft, which was still active at the time of writing, names the](http://www.antorsoft.com/)\ncompany as 济南安创信息科技有限公司, which in English is rendered Jinan Anchuang\nInformation Technology Co. Ltd. It claims to be a ‘state-level high-tech enterprise that\nintegrates development, productions, management and technical services with scientific\nresearch as the guide’. It claims to ‘strive to become an excellent supplier of global\ninformation security services and communications products’.\n\n\n-----\n\nAntorsoft website showing Jinan Anchuang as the company name\nOn a second page Antorsoft claims to look at Cyber Security issues from the perspective of\nthose committing Cyber attacks. What an interesting perspective to have chosen…\n\n\n-----\n\nAntorsoft description of services offered\n**A healthcare company? With MSS links?**\n\nSo far, so good. We’ve got a likely MSS Officer running and Information Technology\ncompany, or two, on the side. Why, then, in this brochure (left) – which we were passed by a\nfriend – does Jinan Anchuang claim to be a healthcare company focusing on child health\ndevelopment? It is definitely the same company – you’ll see that the brochure is signed by 郭\n林 (Guo Lin) using both his name and his ‘Glince’ nickname.\n\nAll becomes clear in a second version of the same document (right). No headed paper, no\nsignature, but the same company name and founding date.\n\n\n-----\n\nBut. The description is different. Now it’s an IT company. And at the bottom is a list of clients,\nincluding 四川省国家安全厅, the Sichuan State Security Department. For those not experts in\nChinese national security departments, the SSSD is the provincial department of the Ministry\nof State Security in Sichuan.\n\nOops.\n\nSichuan isn’t Shandong, where Jinan is located, but perhaps we will find more links later.\n\n**Use of alias names?**\n\nThis is one of our favourite discoveries. Using (previously hacked and released) data from\nChinese messaging service QQ, we were able to find Guo Lin’s QQ account, which is\n21213804. At the time that the data was released, 21213804 was a member of a number of\nQQ groups. In many of these, the name he used was 郭林, which is transliterated ‘Guo Lin’.\nSo far so good.\n\nBut the QQ data shows that he was also a member of an ‘Antorsoft’ group (QQ number\n7043291) created in 2004. In that group he used the name 林子 (Lin Zi), Lin being his first (or\n‘given’) name and Zi, in this instance, being used to extend a single syllable name into a\nnicer sounding two syllable word (Zi roughly translates to ‘thing’). For the purposes of our\nanalysis we will translate ‘Zi’ as ‘Mr’ – think [Reservoir Dogs and you’ll see why.](https://www.imdb.com/title/tt0105236/fullcredits?ref_=tt_ql_1)\n\n\n-----\n\nLooking at the other members of the Antorsoft group in the QQ data, a pattern begins to\nemerge. Each of them was a single name – some connected to their real name, some\napparently random – with ‘Zi’ appended. In many cases, it seems to form a sort of nickname\nor ‘codeword’ – 林子, for example, means ‘Mr Forest’. Here is the complete list:\n\nQQ 21213804 uses ‘Mr Forest’ 林子 (Linzi) in the Antorsoft group but normally uses the\nname 郭林 (Guo Lin)\nQQ 10832991 uses ‘Mr Ocean’ 海子 (Haizi) in the Antorsoft group but normally uses\nthe names 龙海 (Long Hai) ‘Dragon Ocean’ and Fei Long (飞龙) ‘Flying Dragon’\nQQ 23793808 uses ‘Mr Bamboo’ 竹子 (Zhuzi) in the Antorsoft group but also the name\n‘Zhuyuzi’\nQQ 87414156 uses ‘Mr Monkey’ 猴子 (Houzi) in the Antorsoft group\nQQ 369782831 uses ‘Mr Pine’ 松子 (Songzi) in the Antorsoft group\nQQ 1137938323 uses 亮子 (Liangzi) in the Antorsoft group\nQQ 26250040 uses ‘Mr Chen’ 陈子 (Chenzi) in the Antorsoft group but also the name\n雨巷 (Yuxiang) or ‘Rain Alley’\n\nInterestingly, Yuxiang was also in a QQ group called 江苏公务员考试交流 (Jiangsu Civil\nService Examination Exchange), created in 2009. The group description is the 南京大学公务\n员考试群 (Nanjing University Civil Service Examination Group), giving us another link to\nNanjing.\n\n**In summary, we discovered two IT Security Companies based in Jinan, affiliated with a**\n**Chinese individual who studied Information Security to Masters level. Our source**\n**claims that individual is an active MSS Officer involved in Cyber operations. One of**\n**the companies appears to have some sort of healthcare company front, whilst**\n**simultaneously claiming to be an SSSD InfoSec contractor. And employees use alias**\n**names on QQ when dealing with Antorsoft.**\n\n**What we still don’t know is: who else works in these companies and do they have any**\n**connections to APT attacks?**\n\n**#guoknowswherethisleads**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-07-17 - Who is Mr Guo-.pdf"
    ],
    "report_names": [
        "2019-07-17 - Who is Mr Guo-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536112,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1653708206,
    "ts_modification_date": 1653708206,
    "files": {
        "pdf": "https://archive.orkl.eu/08d98dd754a66f842c0dd3cded17dfe1fc4f6173.pdf",
        "text": "https://archive.orkl.eu/08d98dd754a66f842c0dd3cded17dfe1fc4f6173.txt",
        "img": "https://archive.orkl.eu/08d98dd754a66f842c0dd3cded17dfe1fc4f6173.jpg"
    }
}