{
    "id": "f10509d2-fbf7-4c85-8ad2-b41b4bb0174a",
    "created_at": "2023-01-12T15:03:54.440073Z",
    "updated_at": "2025-03-27T02:05:30.82418Z",
    "deleted_at": null,
    "sha1_hash": "9eb81ae4c661d72f89e608627198a79a1caf4ab3",
    "title": "2021-07-22 - The Fraud Family Fraud-as-a-Service operation targeting Dutch residents",
    "authors": "",
    "file_creation_date": "2022-05-28T15:43:04Z",
    "file_modification_date": "2022-05-28T15:43:04Z",
    "file_size": 5977839,
    "plain_text": "# The Fraud Family\n\n**blog.group-ib.com/fraud_family_nl/**\n\n22.07.2021\n\nFraud-as-a-Service operation targeting Dutch residents\n\n\n-----\n\nRoberto Martinez\n\nSenior Threat Intelligence Analyst at Group-IB Europe\n\n\n-----\n\nAnton Ushakov\n\nDeputy Head of the High-Tech Crime Investigation Department at Group-IB Europe\n\n**Introduction**\n\nSince the beginning of 2020, Dutch and Belgian residents have been increasingly targeted\nby financially motivated cybercriminals looking to obtain access to their bank accounts. In\nmany strikingly similar cases, fraudsters reach out to victims via email, SMS, or WhatsApp\nmessages to deliver fake notifications containing malicious links pointing to a phishing site.\n[The phishing pages, detected by Group-IB Threat Intelligence & Attribution system, are](https://www.group-ib.com/intelligence-attribution.html)\nalmost identical and disguised to look like legitimate banking websites of the biggest local\nfinancial organizations with the goal of tricking unsuspecting victims into providing their\npersonal and banking information.\n\nHaving analyzed the technical infrastructure and phishing templates used in these fraudulent\ncampaigns, Group-IB Threat Intelligence and Cyber Investigations teams uncovered a\nmassive Fraud-as-a-Service operation. Our researchers identified a Dutch-speaking criminal\nsyndicate, codenamed Fraud Family by Group-IB, which develops, sells and rents\nsophisticated phishing frameworks to other cybercriminals targeting users mainly in the\n**Netherlands and Belgium. The phishing frameworks allow attackers with minimal skills to**\noptimize the creation and design of phishing campaigns to carry out massive fraudulent\noperations all the while bypassing 2FA.\n\nFraud Family advertises their services and interacts with fellow cybercriminals on Telegram\nmessenger. The criminal syndicate is likely to be active since at least 2020. However,\nphishing kits similar to those advertised by the group were already used to target Dutch\nresidents as early as 2018. Group-IB shared its findings with the Dutch Police immediately\n\n\n-----\n\nupon discovery and notified the organizations whose names are being abused by fraudsters.\n**The probe initiated as a consequence resulted in the** **[arrest of two individuals by the](https://www.politie.nl/nieuws/2021/juli/22/11-ontwikkelaar-en-verkoper-phishing-software-opgepakt.html)**\n**Dutch Police. The arrested suspects, a 24-year-old man and a 15-year-old man, are thought**\nto be the developer and seller of the Fraud Family phishing framework. The 24-year-old\nsuspect will be arraigned before the examining magistrate in Rotterdam on Friday, July 23,\nwhile his 15-year-old accomplice has since been released pending further investigation.\n\nThe blog post analyzes the methods and techniques used by Fraud Family's shady\ncustomers, Fraud Family's technical infrastructure, and their phishing panels. Group-IB\nresearchers also described how Fraud Family attracts customers and interacts with fellow\ncriminals. The post provides comprehensive recommendations to regular users on how not\nto fall prey to this type of attack.\n\n**Fraudulent journey**\n\nA typical attack of fraudsters who use Fraud Family's phishing infrastructure starts with an\nemail, SMS, or WhatsApp message impersonating a real company. The examples below are\nfraudsters' emails and SMS masked as legitimate messages from a local company that\nconnects home seekers with the housing supply.\n\nSuch messages can be both targeted or sent out to multiple contacts at once. The victims'\ncontact details are usually obtained from leaked databases or from other criminals that\nspecialize in providing compromised personal information for social engineering attacks.\n\nThe tactic of using well-known brands allows fraudsters to gain users' immediate trust. These\nfake notifications contain malicious links to adversary-controlled payment info-stealing\nphishing websites.\n\n\n-----\n\nFigure 1 Phishing email impersonating a local company _company that connects home_\n_seekers with the housing supply_\n\n_Source: fraudehelpdesk.nl_\n\n\n-----\n\nFigure 2 SMS messages containing malicious links\n\nSource: fraudehelpdesk.nl\n\n_Figure 3 Phishing site_ _impersonating a local company that connects home seekers with the_\n_housing supply_\n\nAnother tactic that we observed recently is when fraudsters contact a seller on a Dutch\nclassified advertising platform pretending to be a buyer. The miscreants first move the\nconversation to a third-party messenger, WhatsApp in this case, and then proceed to ask the\nseller to make a small payment using an e-commerce payment system used in the\nNetherlands, to \"verify the seller is not a scammer\". The real scammer provides a payment\n[link that is none other than a phishing site. This method was well documented by Opgelicht?!](https://opgelicht.avrotros.nl/alerts/artikel/verificatieverzoek-via-marktplaats-oplichters-zetten-nieuwe-variant-van-een-levensechte-nepsite-online/)\n\n\n-----\n\nThe phishing website (Fig.4) impersonates a well-known marketplace first, then pretends to\nuse Dutch e-commerce payment system to handle the payment and finally lands on the fake\nbanks' pages. After the seller, now a victim, clicks on the phishing site they get to select\nwhich bank they would like to use to send the \"small payment\".\n\nFigure 4 Phishing site using Dutch online _Marketplace lure_\n\n\n-----\n\nThese phishing websites offer a high level of personalization. Once the victim selects a bank\nfrom the list, which includes all known local financial organizations, a very convincing online\nbanking interface will be shown asking for their banking credentials: username and password\nor the bank card number, depending on what they need to access a particular bank account.\n\nFigure 5 Phishing website _impersonating_ _login interface of a Dutch bank_\n\n\n-----\n\nFigure 6 Phishing website _impersonating_ _login interface of a Dutch bank_\n\n\n-----\n\nFigure 7 Phishing website _impersonating_ _login interface of a Dutch bank_\n\n\n-----\n\nFigure 8 Phishing website _impersonating_ _login interface of a Dutch bank_\n\n\n-----\n\nFigure 9 Phishing website _impersonating_ _login interface of a Dutch bank_\n\n\n-----\n\nFigure 10 Phishing website _impersonating_ _login interface of a Dutch bank_\n\nThe developers of these phishing kits made sure their customers, fellow cybercriminals,\ncould bypass 2FA. The crooks who use this phishing infrastructure get access to a web\npanel that interacts, in real time, with the phishing site. When victims submit their banking\ncredentials, the phishing site sends them to the fraudster-controlled web panel. This one\nactually notifies the miscreants that a new victim is online. The scammers can then request\nadditional information that will help them to gain access to the bank accounts, including two\nfactor authentication tokens, and personal identifiable information. While the phishing site is\nwaiting for further instructions from the attackers, the unsuspecting victim is looking at a\n\"Please wait…\" screen.\n\n\n-----\n\nFigure 11 Splash screen showing \"Please wait...\" message\n\nGroup-IB researchers discovered that many of these phishing pages have been developed\nand supported by a single Dutch-speaking cybercriminal collective, codenamed Fraud\nFamily. In the next section we take a deep dive into Fraud Family's business model, modus\noperandi and technical analysis of the gang's infrastructure.\n\n**Fraud Family's business**\n\nMembers of the Fraud Family developed a sophisticated fraud-as-a-service infrastructure\nresilient to conventional takedown efforts. This infrastructure combines ready-to-use phishing\nframeworks, domains and hosting services that Fraud Family takes care of for less skilled\ncyber crooks.\n\nThe phishing frameworks allow attackers with minimal skills to optimize the creation and\ndesign of phishing campaigns to carry out automated fraudulent operations on a mass scale.\nPhishing frameworks include phishing kits — tools and resources used to steal information\n— and web panels that allow cybercriminals to interact with the actual phishing site in real\ntime and are used to collect and manage the stolen user data. The complete \"plug and play\"\nphishing service keeps the framework under control and prevents it from leaking to the\npublic.\n\nMembers of the Fraud Family actively use Telegram as a way to advertise their services to\nother less skilled fraudsters. These services include the sale of phishing tools, or the rent of\n\"ready to use\" infrastructure that comes equipped with the phishing framework and anti-bot\n\n\n-----\n\ntools to prevent crawlers, automated analysis tools and services like VirusTotal and\nURLScan, and researchers from accessing the phishing sites. Any fraudster can rent the\nExpress Panel for €200 per month or the Reliable Panel for €250, as seen in Figure 14.\n\nFigure 12 Advertisement promoting the rent of phishing infrastructure\n\nGroup-IB cyber investigations team discovered at least 8 Telegram channels operated by the\nFraud Family gang. The whole network of channels has close to 2,000 subscribers. Their\nmost popular group has 640 members. According to Group-IB assessment, half of these\nusers could be actual buyers.\n\nGroup-IB's research revealed that there are many cybercriminals who are using Telegram to\noffer phishing frameworks that include fake Dutch and Belgian banks pages and web panels\nfor managing these sites. Many of those plug and play frameworks are being offered with\ndifferent names and variations.\n\nDeeper analysis showed that the majority of such phishing web panels traded on Telegram\nare based on U-Admin, which is the panel initially developed by Ukrainian threat actor\n[nicknamed Kaktys.](https://krebsonsecurity.com/2021/02/arrest-raids-tied-to-u-admin-phishing-kit)\n\n\n-----\n\nFigure 13 Web panel U-Admin\n\nAccording to Group-IB's findings, all of the panels designed to target customers of the Dutch\nand Belgian banks are different versions, or forks, of U-Admin. It turned out that the market\nof phishing frameworks in the Netherlands and Belgium is being dominated by the Fraud\nFamily. The gang tunes and customizes phishing frameworks like U-Admin and gives them\nnew names.\n\nThe most common name given to the panels modified by Fraud Family is NL Multipanel. Two\nmore panels being offered for sale, or rent by Fraud Family are Express Panel and Reliable\nPanel, developed by the syndicate in 2021.\n\nGroup-IB found that the attacks that rely on Fraud Family's infrastructure increased toward\nthe final months of 2020. This trend continues in 2021 with the appearance of Express Panel\nand Reliable Panel.\n\nThe conclusion about the growth of their operations has been drawn from the fact that\nGroup-IB researchers detected more posts and discussion about Fraud Family's business on\nTelegram.\n\nThe detailed analysis of the web panels, modified and customized by the Fraud Family is\npresented below.\n\n**NL Multipanel**\n\n\n-----\n\nNL Multipanel is almost fully based on U-Admin panel, which is offered to a wide range of\nExploit.in forum (one of the most popular hacker forums) users. NL Multipanel got its name\nafter being refined and customized by members of Fraud Family to fit the Dutch\ncybercriminal scene.\n\nFigure 14 Welcome screen of U-Admin fork \"PaneLVanLahsj\"\n\nWith U-Admin comes a plugin called Token. Because this plugin allows the attackers to\ninteract with their victims in real time, it is the one used to target clients of banks that use any\nsort of multi-factor authentication.\n\nFigure 15 U-Admin Token plugin\n\nWhen a new victim is online, the attackers use O-Panel to execute a number of operations.\nThis is useful to request any information needed from the victims. While the miscreants use\nand request new data, victims are waiting for the phishing site to show a new screen asking\nfor this information.\n\n\n-----\n\nFigure 16 U-Admin O-Panel plugin\n\nO-Panel is very flexible and can be fully customized, by adding new, or modifying existing\noperations.\n\nFigure 17 Different operations that can be used with O-Panel\n\n**Express Panel**\n\nPresumably, this made its public appearance in November 2020. Some of its features\ninclude:\n\nIt is not based on U-Admin and sellers make sure to advertise that well\n\n\n-----\n\nA very light panel, with a simple user interface\nIt is optimized to be used with a mobile phone\nAllows live interaction with victims\n\nFigure 18 Express Panel as advertised by sellers\n\n\n-----\n\nFigure 19 Older version of Express Panel as advertised by sellers\n\n**Reliable Panel**\n\nIt was developed in parallel to the Express Panel by the same developer and also made its\npublic appearance in November 2020.\n\nNew features provided by sellers include:\n\nDeveloped from scratch and based on Nodejs instead of PHP\n\"Lifetime\" of about 2 weeks (average time from deployment to take-down)\nFaster that NL Multipanel and its variants\nFully customizable\nAllows live interaction with victim\n\n\n-----\n\nReliable Panel removed many of the weaknesses U-Admin has and is especially crafted for\nthe Dutch and Belgian markets. This phishing framework has the potential to become one of\nthe main tools Dutch cybercriminals can count on.\n\nFigure 20 Reliable Panel as advertised by sellers\n\n_Figure 21 Reliable Admin panel login interface_\n\n\n-----\n\nIt looks like in a more recent version from 2021, the panel was renamed to Reliable Admin .\n\n**Conclusion**\n\nGroup-IB is actively and closely monitoring the attacks that involve Fraud Family's\ninfrastructure and provides information obtained from them to affected organizations whose\nbrands are being abused by the fraudsters, including leading Dutch financial organizations to\nhelp them minimize the amount of fraudulent activity. Group-IB is collaborating with the Dutch\nPolice and also providing information to them on the alleged identities of the Fraud Family\nmembers.\n\n**In order to help regular users avoid falling prey to Fraud Family's affiliates, Group-IB**\n**team prepared a set of simple recommendations:**\n\nAlways be cautious and fully aware of anything sent to you, even if you think it may be\nlegitimate.\nDo not click on any links that you are not 100% confident are real\nDouble check the address of a website is the official one before you submit any\ninformation\nIf the link comes from someone you know, confirm with that person using another way\nof communication\nContact the organization which sent you a link to confirm they have really sent you that\nmessage\n[If in doubt, use services like URLScan or](https://urlscan.io/) [VirusTotal to quickly scan the URL you have](https://www.virustotal.com/)\nbeen sent, and look for red flags\nIf you think you may be a victim of a phishing attack, quickly communicate with your\nbank, the organization being impersonated by the fraudsters and the police. They can\nissue an alert which may umlimately raise awareness and reduce the victim count\nKeep in mind that usually official organizations do not use URL shorteners, so links\nleading to bit.ly, s.id, tny.sh and others, are very suspicious and you should double\ncheck the final destination\nReport any identified phishing email or SMS to fraudehelpdesk.nl, scamadviser.com.\nThese reports aid cybersecurity professionals to investigate and take action against\nfraudulent websites, in addition to helping protect other victims.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-22 - The Fraud Family Fraud-as-a-Service operation targeting Dutch residents.pdf"
    ],
    "report_names": [
        "2021-07-22 - The Fraud Family Fraud-as-a-Service operation targeting Dutch residents.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535834,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653752584,
    "ts_modification_date": 1653752584,
    "files": {
        "pdf": "https://archive.orkl.eu/9eb81ae4c661d72f89e608627198a79a1caf4ab3.pdf",
        "text": "https://archive.orkl.eu/9eb81ae4c661d72f89e608627198a79a1caf4ab3.txt",
        "img": "https://archive.orkl.eu/9eb81ae4c661d72f89e608627198a79a1caf4ab3.jpg"
    }
}