{
    "id": "f109c174-36ea-42d4-afae-c5c27d3daf09",
    "created_at": "2023-01-12T15:05:05.989908Z",
    "updated_at": "2025-03-27T02:16:39.914156Z",
    "deleted_at": null,
    "sha1_hash": "c556a8fa36fba850f0e816e63368c89eaf65ea59",
    "title": "2022-11-09 - BlackCat Ransomware- Tactics and Techniques From a Targeted Attack",
    "authors": "",
    "file_creation_date": "2022-11-28T19:06:57Z",
    "file_modification_date": "2022-11-28T19:06:57Z",
    "file_size": 1771340,
    "plain_text": "# BlackCat Ransomware: Tactics and Techniques From a Targeted Attack\n\n**[netskope.com/blog/blackcat-ransomware-tactics-and-techniques-from-a-targeted-attack](https://www.netskope.com/blog/blackcat-ransomware-tactics-and-techniques-from-a-targeted-attack)**\n\nGustavo Palazolo November 9, 2022\n\nNov 09 2022\n\n## Summary\n\n[BlackCat (a.k.a. ALPHV and Noberus) is a Ransomware-as-a-Service (RaaS) group that](https://id-ransomware.blogspot.com/2021/12/blackcat-ransomware.html)\n[emerged in November 2021, making headlines for being a sophisticated ransomware written](https://www.bleepingcomputer.com/news/security/alphv-blackcat-this-years-most-sophisticated-ransomware/)\nin Rust. It has both [Windows and](https://malpedia.caad.fkie.fraunhofer.de/details/win.blackcat) [Linux variants and the payload can be customized to adapt](https://malpedia.caad.fkie.fraunhofer.de/details/elf.blackcat)\n[to the attacker’s needs. BlackCat is also believed to be the successor of the](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/noberus-blackcat-ransomware-ttps) [Darkside and](https://www.netskope.com/pt/blog/netskope-threat-coverage-darkside)\n[BlackMatter ransomware groups. They work with a double-extortion scheme, where data is](https://www.netskope.com/blog/netskope-threat-coverage-blackmatter)\nstolen, encrypted, and leaked if the ransom isn’t paid, which is a common methodology\nimplemented by RaaS groups.\n\n[According to Microsoft, BlackCat was found targeting different countries and regions in](https://www.microsoft.com/security/blog/2022/06/13/the-many-lives-of-blackcat-ransomware/)\nAfrica, the Americas, Asia, and Europe, having at least two known affiliates: [DEV-0237](https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/#DEV-0237)\n[(previously associated with Ryuk, Conti, and Hive), and DEV-0504 (previously associated](https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/#DEV-0504)\nwith Ryuk, REvil, BlackMatter, and Conti). However, due to the diversity of affiliates and\ntargets, BlackCat may present different TTPs across the attacks. Recently, in September\n[2022, BlackCat claimed to have breached a contractor that provides services to the U.S.](https://www.theregister.com/2022/10/02/in-brief-security/)\nDepartment of Defense and other government agencies.\n\n\n-----\n\nIn this blog post, we will analyze BlackCat and show some of the tactics and techniques we\nfound in a recent ransomware incident analyzed by Netskope Threat Labs. The evidence\nshows that this was a targeted attack, where the attackers were mainly focused on stealing\nsensitive data from the organization and infecting as many devices as possible.\n\n## Initial Foothold and Lateral Movements\n\nIn a recent incident analyzed by Netskope Threat Labs, the attackers breached a contractor\nwho had access to a virtual desktop machine within the corporate network.\n\nThe attacker used a malicious browser extension to capture the contractor’s account. Since\nthere was no MFA required, the attacker was able to login to the virtual desktop, escalate\nprivileges, and move to other devices in the corporate network.\n\n## Payload Execution\n\nAfter scanning the corporate network, BlackCat attackers created multiple text files, each\none containing the names of identified machines in the network.\n\n_Files with names of machines_\n\n_identified by the attackers._\n[Then, they used PsExec and a compromised domain account to deploy ExMatter to more](https://learn.microsoft.com/en-us/sysinternals/downloads/psexec)\nthan 2,000 machines in the network.\n\n\n-----\n\n_Details of PsExec binary used by BlackCat attackers._\nThe attackers used batch files to execute multiple PsExec commands to deploy payloads to\nthe identified machines.\n\n_Batch file executed by BlackCat attacker._\nBelow is an example of the command line executed by the attacker to remotely execute\ncommands and payloads using PsExec and the compromised account:\n\nstart PsExec.exe -d -n 5 @C:\\temp\\list01.txt -accepteula -u <REDACTED_USER> -p\n<REDACTED_PASSWORD> cmd /c <COMMAND_LINE>\n\nThe description for the PsExec arguments used by the attacker can be found below:\n\n**Argument** **Description**\n\n-d Don't wait for process to terminate (non-interactive)\n\n\n-----\n\n**Argument** **Description**\n\n-n 5 Wait 5 seconds when connecting to remote computers\n\n@C:\\temp\\list01.txt File containing the names of the computers in which PsExec will\nexecute the command\n\n-accepteula Automatically accept the EULA to avoid displaying the dialog\n\n-u Username of the compromised account used by the attacker\n\n-p Password of the compromised account used by the attacker\n\ncmd /c Command-line executed by the attacker\n\nAmong other evidence, it’s possible to confirm whether PsExec was successfully executed in\na device by checking the following registry key.\n\n_Key added_\n\n_by PsExec when the tool is executed._\n\n## Data Exfiltration\n\n[In this incident, the attackers used a .NET data exfiltration tool known as ExMatter, which](https://malpedia.caad.fkie.fraunhofer.de/details/win.exmatter)\n[was the same tool used by BlackMatter ransomware and recently adopted by BlackCat. It’s](https://www.bleepingcomputer.com/news/security/blackcat-ransomware-s-data-exfiltration-tool-gets-an-upgrade/)\nworth mentioning that the server used for data exfiltration in this incident was stood up by the\nattackers one day before the attack.\n\nThe specific sample from this incident was compiled close to the attack and contains a\n[popular .NET protection named Confuser.](https://github.com/mkaring/ConfuserEx)\n\n\n-----\n\n_Some details about the ExMatter tool used by BlackCat attackers._\nThe attacker tried to deploy this tool to over 2,000 machines in the network using PsExec,\nlike described earlier. ExMatter will iterate over the drives of infected machines to search for\nfiles that will be exfiltrated.\n\n_Logs from the_\n\n_ExMatter tool used by BlackCat._\nAs described earlier, this tool was [recently updated by BlackCat, containing code refactoring](https://www.bleepingcomputer.com/news/security/blackcat-ransomware-s-data-exfiltration-tool-gets-an-upgrade/)\nand new functionalities. Despite the code changes, we can clearly observe similarities\n[between a known ExMatter sample and the tool used in this attack.](https://www.virustotal.com/gui/file/8eded48c166f50be5ac33be4b010b09f911ffc155a3ab76821e4febd369d17ef)\n\n\n-----\n\n_Comparing a known ExMatter tool with the binary found in the attack._\nExMatter contains a list with details about the types of files it will try to exfiltrate and\ndirectories to avoid. Also, this tool is only stealing files between 4 KB and 64 MB.\n\n\n-----\n\n_Types of_\n\n\n_files ExMatter will try to exfiltrate._\nIt will not exfiltrate data from the following directories:\n\nAppData\\Local\\Microsoft\nAppData\\Local\\Packages\nAppData\\Roaming\\Microsoft\nC:$Recycle.Bin\nC:\\Documents and Settings\nC:\\PerfLogs\nC:\\Program Files\nC:\\Program Files (x86)\n\n\n-----\n\nC:\\ProgramData\nC:\\Users\\All Users\\Microsoft\nC:\\Windows\n\n_ExMatter skipping directories from the pre-_\n\n_defined list._\nAs previously mentioned, it will only exfiltrate files that contains the following extensions and\nare within the file size threshold:\n\n*.bmp\n*.doc\n*.docx\n*.dwg\n*.ipt\n*.jpeg\n*.jpg\n*.msg\n*.pdf\n*.png\n*.pst\n*.rdp\n*.rtf\n*.sql\n*.txt\n*.txt\n*.xls\n*.xlsx\n*.zip\n\n\n-----\n\n_ExMatter function that searches for files to exfiltrate._\n[By default, this specific sample is trying to communicate with an IP address via WebDav,](http://www.webdav.org/)\n[initially sending a PROPFIND request.](https://learn.microsoft.com/en-us/previous-versions/office/developer/exchange-server-2003/aa142960(v=exchg.65))\n\n_Exfiltration tool sending an initial request to the attacker’s server._\n[The WebDav methods implemented by this tool are: PROPFIND,](https://learn.microsoft.com/en-us/previous-versions/office/developer/exchange-server-2003/aa142960(v=exchg.65)) [PROPPATCH,](https://learn.microsoft.com/en-us/previous-versions/office/developer/exchange-server-2003/aa142976(v=exchg.65)) [MKCOL,](https://learn.microsoft.com/en-us/previous-versions/office/developer/exchange-server-2003/aa142923(v=exchg.65))\n[COPY,](https://learn.microsoft.com/en-us/previous-versions/office/developer/exchange-server-2003/aa142816(v=exchg.65)) [MOVE,](https://learn.microsoft.com/en-us/previous-versions/office/developer/exchange-server-2003/aa142926(v=exchg.65)) [LOCK, and](https://learn.microsoft.com/en-us/previous-versions/office/developer/exchange-server-2003/aa142897(v=exchg.65)) [UNLOCK.](https://learn.microsoft.com/en-us/previous-versions/office/developer/exchange-server-2003/aa143146(v=exchg.65))\n\n\n-----\n\n_WebDav_\n\n_methods implemented in ExMatter._\nThis tool can also be executed in background (without showing the console) if “**background” or “-b” is specified.**\n\n_Checking if the_\n\n_“background” parameter was specified._\n\n## Data Encryption\n\nLike the ExMatter tool, the BlackCat payload was also compiled in July 2022. The attackers\ndeployed the ransomware to over 2,000 machines with the same technique described earlier,\nby using PsExec with a compromised domain account.\n\n\n-----\n\n_Some of the binary details of BlackCat ransomware._\nBlackCat can be executed with different parameters, which can be found in its “help” menu.\n\n_BlackCat ransomware help menu._\nThe options offered by BlackCat ransomware are:\n\n**Parameter** **Description**\n\n\n--accesstoken\n\n\nString used by BlackCat to validate the execution. It’s also used to decrypt\nBlackCat configuration in the latest version\n\n\n--bypass This parameter doesn’t seem to be implemented\n\n--child Run as child process\n\n\n-----\n\n**Parameter** **Description**\n\n\n--drag-anddrop\n\n--dropdrag-anddrop-target\n\n--extraverbose\n\n\nInvoked with drag and drop\n\nDrop drag and drop target batch file\n\nLog more to console (Also forces process to run in attached mode)\n\n\n-h, --help Print help information\n\n--log-file Enable logging to specified file\n\n\n--noimpers\n\n\nDo not spawn impersonated processes on Windows\n\n\n--no-net Do not discover network shares on Windows\n\n--no-prop Do not self propagate (worm) on Windows\n\n\n--no-propservers\n\n\nDo not propagate to defined servers\n\n\n--no-vm-kill Do not stop VMs on ESXi\n\n\n--no-vmkill-names\n\n--no-vmsnapshotkill\n\n\nDo not stop defined VMs on ESXi\n\nDo not wipe VMs snapshots on ESXi\n\n\n--no-wall Do not update desktop wallpaper on Windows\n\n-p, --paths Only process files inside defined paths\n\n--prop-file Propagate specified file\n\n\n-propagated\n\n\nRun as propagated process\n\n\n--safeboot Reboot in Safe Mode before running on Windows\n\n\n--safebootinstance\n\n--safebootnetwork\n\n\nRun as safeboot instance on Windows\n\nReboot in Safe Mode with Networking before running on Windows\n\n\n-----\n\n**Parameter** **Description**\n\n\n--sleeprestart\n\n--sleeprestartduration\n\n--sleeprestart-until\n\n\nSleep for duration in seconds after a successful run and then restart. (This is\nsoft persistence, keeps process alive no longer then defined in --sleeprestart-duration, 24 hours by default)\n\nKeep soft persistence alive for duration in seconds. (24 hours by default)\n\nKeep soft persistence alive until defined UTC time in millis. (Defaults to 24\nhours since launch)\n\n\n--ui Show user interface\n\n\n-v, -verbose\n\n\nLog to console\n\n\nAt this point, two versions of BlackCat’s encryptor were found in the wild. The first one was\nstoring the ransomware’s configuration in plain-text within the binary, which could be easily\n[extracted and parsed. The second one started to encrypt the configuration, where the](https://github.com/f0wl/blackCatConf)\ndecryption key is passed via an argument named “access token”. In other words, the latest\nversion of BlackCat cannot be executed or have its configuration extracted if the access\ntoken is unknown.\n\nThe version used in this specific attack is the latest one, which can be confirmed by running\nthe sample without the access key or with an random key, generating an “invalid config”\nerror.\n\n_BlackCat cannot be executed_\n\n_without the correct token created by the attacker._\nOnce running, the access key is then parsed and used to decrypt the configuration in\nruntime, using AES-128.\n\n\n-----\n\n_BlackCat ransomware decrypting the configuration with the token provided by the attacker._\nBlackCat ransomware’s configuration contains 23 fields:\n\n**Value** **Description**\n\nconfig_id Configuration ID (used by BlackCat to identify the target)\n\nextension Extension added to encrypted files\n\npublic_key RSA public key\n\nnote_file_name Name of the ransom note\n\nnote_full_text Full version of the ransom note\n\nnote_short_text Short version of the ransom note\n\ncredentials Array of compromised credentials used by BlackCat for\nprivilege escalation and propagation via PsExec\n\ndefault_file_mode File encryption mode, usually set as “Auto”. The\n[“SmartPattern” value was also found in the wild, which](https://www.varonis.com/blog/blackcat-ransomware)\nresulted in just some megabytes of the file being\nencrypted.\n\n\n-----\n\n**Value** **Description**\n\ndefault_file_cipher File encryption cipher, usually defined as “Best”, which\nuses AES.\n\nkill_services List of services to be terminated\n\nkill_processes List of processes to be terminated\n\nexclude_directory_names List of directories to exclude from the encryption process\n\nexclude_file_names List of files to exclude from the encryption process\n\nexclude_file_extensions List of extensions to exclude from the encryption process\n\nexclude_file_path_wildcard File paths to be excluded from the encryption process\nusing wildcard\n\nenable_network_discovery Enable/disable network discovery\n\nenable_self_propagation Enable/disable self propagation via PsExec\n\nenable_set_wallpaper Enable/disable the wallpaper change\n\nenable_esxi_vm_kill Enable/disable VM termination on ESXi\n\nenable_esxi_vm_snapshot_kill Enable/disable snapshot deletion on ESXi\n\nstrict_include_paths Hardcoded file paths to encrypt\n\nesxi_vm_kill_exclude List of VMs to exclude on ESXi hosts\n\nsleep_restart Sleep time before restart\n\nAccording to the decrypted configuration of this specific sample, the ransomware tries to kill\nthe following services:\n\nagntsvc\ndbeng50\ndbsnmp\nencsvc\nexcel\nfirefox\ninfopath\nisqlplussvc\nmsaccess\nmspub\nmydesktopqos\nmydesktopservice\n\n\n-----\n\nnotepad\nocautoupds\nocomm\nocssd\nonenote\noracle\noutlook\npowerpnt\nsqbcoreservice\nsql\nsteam\nsynctime\ntbirdconfig\nthebat\nthunderbird\nvisio\nwinword\nwordpad\nxfssvccon\n*sql*\n\nbedbh\nvxmon\nbenetns\nbengien\npvlsvr\nbeserver\nraw_agent_svc\nvsnapvss\nCagService\nQBIDPService\nQBDBMgrN\nQBCFMonitorService\nSAP\nTeamViewer_Service\nTeamViewer\ntv_w32\ntv_x64\nCVMountd\ncvd\ncvfwd\nCVODS\n\n\n-----\n\nsaphostexec\nsaposcol\nsapstartsrv\navagent\navscc\nDellSystemDetect\nEnterpriseClient\nVeeamNFSSvc\nVeeamTransportSvc\nVeeamDeploymentSvc\n\nThe ransomware does not encrypt files in the following directories:\n\nsystem volume information\nintel\n$windows.~ws\napplication data\n$recycle.bin\nmozilla\n$windows.~bt\npublic\nmsocache\nwindows\n\ndefault\nall users\ntor browser\nprogramdata\nboot\nconfig.msi\ngoogle\nperflogs\nappdata\nwindows.old\n\nIt has the following file name exclusion list:\n\ndesktop.ini\nautorun.inf\nntldr\nbootsect.bak\nthumbs.db\nboot.ini\n\n\n-----\n\nntuser.dat\niconcache.db\nbootfont.bin\nntuser.ini\nntuser.dat.log\n\nIt also skips the encryption on files with these extensions:\n\nthemepack\nnls\ndiagpkg\nmsi\nlnk\nexe\ncab\nscr\nbat\ndrv\nrtp\nmsp\nprf\nmsc\nico\nkey\nocx\n\ndiagcab\ndiagcfg\npdb\nwpx\nhlp\nicns\nrom\ndll\nmsstyles\nmod\nps1\nics\nhta\nbin\ncmd\nani\n386\n\n\n-----\n\nlock\ncur\nidx\nsys\ncom\ndeskthemepack\nshs\nldf\ntheme\nmpa\nnomedia\nspl\ncpl\nadv\nicl\nmsu\n\nThe following settings are also enabled according to the config file:\n\nNetwork Discovery\nSelf Propagation\nSet Wallpaper\nESXi VM Kill\nESXi VM Snapshot kill\n\n[BlackCat also contains a “self propagation” functionality (worm), by using PsExec and](https://learn.microsoft.com/en-us/sysinternals/downloads/psexec)\ncompromised credentials specified in the configuration. The PsExec binary is encrypted and\nstored within the ransomware executable.\n\n\n-----\n\n_PsExec binary embedded within the ransomware payload._\nThere’s also an option named “drag-and-drop”, which creates a batch file that can be used to\nexecute the ransomware. The content of this file is decrypted at runtime.\n\n_Batch_\n\n_file created by BlackCat._\nAdditional commands ran by BlackCat:\n\n1. Get device UUID\n\n“C:\\Windows\\system32\\cmd.exe” /c “wmic csproduct get UUID”\n\n2. Stop IIS service\n\n“C:\\Windows\\system32\\cmd.exe” /c “iisreset.exe /stop”\n\n3. Clean shadow copies\n\n“C:\\Windows\\system32\\cmd.exe” /c “vssadmin.exe Delete Shadows /all /quiet”\n\n“C:\\Windows\\system32\\cmd.exe” /c “wmic.exe Shadowcopy Delete”\n\n4. List Windows event logs names and try to clear them all.\n\n“C:\\Windows\\system32\\cmd.exe” /c “wevtutil.exe el”\n\n“C:\\Windows\\system32\\cmd.exe” /c “wevutil.exe cl \\”<NameHere>\\”\n\nIn this attack, we noticed that the attacker listed all the logs with the correct binary (wevtutil),\nbut there’s a typo in the commands that actually clear the logs (wevutil). In other words, the\nattacker failed to clean the Windows event logs.\n\n\n-----\n\n_Typo in command line executed by the ransomware._\nThis ransomware encrypts files using AES or ChaCha20 depending on the configuration,\nand the key used to encrypt the file is encrypted with a public RSA key contained within its\nconfiguration.\n\nOnce done, the extension defined in the configuration is appended to encrypted files and,\nlike other ransomware, BlackCat created the ransom note with information about the attack\nand contact instructions.\n\n_BlackCat ransom note._\n\n\n-----\n\nIf enabled in the configuration, the ransomware also changes the user s wallpaper with the\nfollowing message.\n\n_BlackCat wallpaper message._\n\n## BlackCat’s Website\n\nLike other RaaS groups operating in the double-extortion scheme, BlackCat maintains a\nwebsite hosted on the deep web where they leak stolen data if the ransom isn’t paid by the\nvictims.\n\n_BlackCat “collections” website._\nThey are likely the first ransomware group that allows you to search leaked data through\nkeywords, even supporting wildcards.\n\n## Conclusions\n\nBlackCat and other Ransomware-as-a-Service (RaaS) groups often exploit basic flaws in\nsecurity policies and network architecture to infect as many devices as possible, stealing and\nencrypting data to extort organizations and individuals. As demonstrated in this analysis,\nthese groups often use legitimate tools throughout the attack, such as PsExec.\n\n\n-----\n\nWe strongly recommend companies revisit password policies and avoid using default\npasswords for new accounts. Technologies such as Microsoft LAPS can help to generate\nunique passwords for local administrator accounts. Implementing a security policy to enforce\nmulti-factor authentication and using strong passwords for domain accounts is also\nrecommended.\n\nImplementing strong monitoring and blocking known tools like PsExec can also help the\nsecurity of your organization. User training is also strongly recommended as social\nengineering could be exploited by these groups to gain access to networks. Lastly, we also\nrecommend using a secure web gateway to protect your network against malware and data\nexfiltration.\n\n## Tactics and Techniques\n\nAll the tactics and techniques observed in this analysis can be mapped with the MITRE\nATT&CK knowledge base as follows:\n\n\n**Tactic**\n\n\n**ATT&CK**\n**ID** **Description**\n\n\n[Reconnaissance](https://attack.mitre.org/tactics/TA0043/) [T1589.001](https://attack.mitre.org/techniques/T1589/001/) Gather Victim Identity Information: Credentials\n\n\nResource\nDevelopment\n\nResource\nDevelopment\n\n\n[T1587.001](https://attack.mitre.org/techniques/T1587/001/) Develop Capabilities: Malware\n\n[T1588.002](https://attack.mitre.org/techniques/T1588/002/) Obtain Capabilities: Tool\n\n\n[Initial Access](https://attack.mitre.org/tactics/TA0001/) [T1078.002](https://attack.mitre.org/techniques/T1078/002/) Valid Accounts: Domain Accounts\n\n[Execution](https://attack.mitre.org/tactics/TA0002/) [T1059.003](https://attack.mitre.org/techniques/T1059/003/) Command and Scripting Interpreter: Windows Command\nShell\n\n\nPrivilege\nEscalation\n\nDefense\nEvasion\n\nDefense\nEvasion\n\n\n[T1548.002](https://attack.mitre.org/techniques/T1548/002/) Abuse Elevation Control Mechanism: Bypass UAC\n\n[T1222.001](https://attack.mitre.org/techniques/T1222/001/) File and Directory Permissions Modification: Windows File\nand Directory Permissions Modification\n\n[T1070.001](https://attack.mitre.org/techniques/T1070/001/) Indicator Removal on Host: Clear Windows Event Logs\n\n\n[Discovery](https://attack.mitre.org/tactics/TA0007/) [T1087.002](https://attack.mitre.org/techniques/T1087/002/) Account Discovery: Domain Account\n\n[Discovery](https://attack.mitre.org/tactics/TA0007/) [T1083](https://attack.mitre.org/techniques/T1083/) File and Directory Discovery\n\n\nLateral\nMovement\n\n\n[T1570](https://attack.mitre.org/techniques/T1570/) Lateral Tool Transfer\n\n\n-----\n\n**Tactic**\n\nCommand and\nControl\n\n\n**ATT&CK**\n**ID** **Description**\n\n[T1071.001](https://attack.mitre.org/techniques/T1071/001/) Application Layer Protocol: Web Protocols\n\n\n[Exfiltration](https://attack.mitre.org/tactics/TA0010/) [T1048](https://attack.mitre.org/techniques/T1048/) Exfiltration Over Alternative Protocol\n\n[Impact](https://attack.mitre.org/tactics/TA0040/) [T1486](https://attack.mitre.org/techniques/T1486/) Data Encrypted for Impact\n\n[Impact](https://attack.mitre.org/tactics/TA0040/) [T1491.001](https://attack.mitre.org/techniques/T1491/001/) Defacement: Internal Defacement\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-11-09 - BlackCat Ransomware- Tactics and Techniques From a Targeted Attack.pdf"
    ],
    "report_names": [
        "2022-11-09 - BlackCat Ransomware- Tactics and Techniques From a Targeted Attack.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2864e40a-f233-4618-ac61-b03760a41cbb",
            "created_at": "2023-12-01T02:02:34.272108Z",
            "updated_at": "2025-03-27T02:02:10.209072Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "ETDA:WildCard",
            "tools": [
                "RustDown",
                "SysJoker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "76e1fb02-1ceb-4fe5-8a68-456f0d4c62a4",
            "created_at": "2024-02-02T02:00:04.037062Z",
            "updated_at": "2025-03-27T02:00:03.295909Z",
            "deleted_at": null,
            "main_name": "Velvet Tempest",
            "aliases": [
                "DEV-0504"
            ],
            "source_name": "MISPGALAXY:Velvet Tempest",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "256a6a2d-e8a2-4497-b399-628a7fad4b3e",
            "created_at": "2023-11-30T02:00:07.299845Z",
            "updated_at": "2025-03-27T02:00:03.257794Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "MISPGALAXY:WildCard",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535905,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1669662417,
    "ts_modification_date": 1669662417,
    "files": {
        "pdf": "https://archive.orkl.eu/c556a8fa36fba850f0e816e63368c89eaf65ea59.pdf",
        "text": "https://archive.orkl.eu/c556a8fa36fba850f0e816e63368c89eaf65ea59.txt",
        "img": "https://archive.orkl.eu/c556a8fa36fba850f0e816e63368c89eaf65ea59.jpg"
    }
}