{
    "id": "f137b505-74a2-4a6b-bc67-4337b1e53154",
    "created_at": "2023-01-12T15:05:45.120236Z",
    "updated_at": "2025-03-27T02:05:24.885722Z",
    "deleted_at": null,
    "sha1_hash": "eaef76579f50cf711dd9db663926fce05b96fff7",
    "title": "2021-07-18 - Revealed- leak uncovers global abuse of cyber-surveillance weapon",
    "authors": "",
    "file_creation_date": "2022-05-28T03:56:26Z",
    "file_modification_date": "2022-05-28T03:56:26Z",
    "file_size": 1691312,
    "plain_text": "# Revealed: leak uncovers global abuse of cyber- surveillance weapon\n\n**theguardian.com/world/2021/jul/18/revealed-leak-uncovers-global-abuse-of-cyber-surveillance-weapon-nso-group-**\npegasus\n\nStephanie Kirchgaessner, Paul Lewis, David Pegg, Sam Cutler, Nina Lakhani, Michael Safi July 18, 2021\n\nThis article is more than 10 months old\nThis article is more than 10 months old\n\nSpyware sold to authoritarian regimes used to target activists, politicians and journalists,\ndata suggests\n\n\n-----\n\nThe investigation by the Guardian and 16 other media organisations suggests widespread\nand continuing abuse of NSO’s hacking spyware. Illustration: Guardian Design\nThe investigation by the Guardian and 16 other media organisations suggests widespread\nand continuing abuse of NSO’s hacking spyware. Illustration: Guardian Design\nHuman rights activists, journalists and lawyers across the world have been targeted by\nauthoritarian governments using hacking software sold by the Israeli surveillance company\nNSO Group, according to an investigation into a massive data leak.\n\nThe investigation by the Guardian and 16 other media organisations suggests widespread\nand continuing abuse of NSO’s hacking spyware, Pegasus, which the company insists is\nonly intended for use against criminals and terrorists.\n\nPegasus is a malware that infects iPhones and Android devices to enable operators of the\ntool to extract messages, photos and emails, record calls and secretly activate microphones.\n\nThe leak contains a list of more than 50,000 phone numbers that, it is believed, have been\nidentified as those of people of interest by clients of NSO since 2016.\n\nForbidden Stories, a Paris-based nonprofit media organisation, and Amnesty International\ninitially had access to the leaked list and shared access with media partners as part of the\nPegasus project, a reporting consortium.\n\nThe presence of a phone number in the data does not reveal whether a device was infected\nwith Pegasus or subject to an attempted hack. However, the consortium believes the data is\nindicative of the potential targets NSO’s government clients identified in advance of possible\nsurveillance attempts.\n\n\n-----\n\nQuick Guide\n\n**What is in the Pegasus project data?**\n\nShow\n**What is in the data leak?**\n\nThe data leak is a list of more than 50,000 phone numbers that, since 2016, are believed to\nhave been selected as those of people of interest by government clients of NSO Group,\nwhich sells surveillance software. The data also contains the time and date that numbers\nwere selected, or entered on to a system. Forbidden Stories, a Paris-based nonprofit\njournalism organisation, and Amnesty International initially had access to the list and shared\naccess with 16 media organisations including the Guardian. More than 80 journalists have\nworked together over several months as part of the Pegasus project. Amnesty’s Security\nLab, a technical partner on the project, did the forensic analyses.\n\n**What does the leak indicate?**\n\nThe consortium believes the data indicates the potential targets NSO’s government clients\nidentified in advance of possible surveillance. While the data is an indication of intent, the\npresence of a number in the data does not reveal whether there was an attempt to infect the\nphone with spyware such as Pegasus, the company’s signature surveillance tool, or whether\nany attempt succeeded. The presence in the data of a very small number of landlines and\nUS numbers, which NSO says are “technically impossible” to access with its tools, reveals\nsome targets were selected by NSO clients even though they could not be infected with\nPegasus. However, forensic examinations of a small sample of mobile phones with numbers\non the list found tight correlations between the time and date of a number in the data and the\nstart of Pegasus activity – in some cases as little as a few seconds.\n\n**What did forensic analysis reveal?**\n\nAmnesty examined 67 smartphones where attacks were suspected. Of those, 23 were\nsuccessfully infected and 14 showed signs of attempted penetration. For the remaining 30,\nthe tests were inconclusive, in several cases because the handsets had been replaced.\nFifteen of the phones were Android devices, none of which showed evidence of successful\ninfection. However, unlike iPhones, phones that use Android do not log the kinds of\ninformation required for Amnesty’s detective work. Three Android phones showed signs of\ntargeting, such as Pegasus-linked SMS messages.\n\nAmnesty shared “backup copies” of four iPhones with Citizen Lab, a research group at the\nUniversity of Toronto that specialises in studying Pegasus, which confirmed that they showed\nsigns of Pegasus infection. Citizen Lab also conducted a peer review of Amnesty’s forensic\nmethods, and found them to be sound.\n\n**Which NSO clients were selecting numbers?**\n\n\n-----\n\nWhile the data is organised into clusters, indicative of individual NSO clients, it does not say\nwhich NSO client was responsible for selecting any given number. NSO claims to sell its\ntools to 60 clients in 40 countries, but refuses to identify them. By closely examining the\npattern of targeting by individual clients in the leaked data, media partners were able to\nidentify 10 governments believed to be responsible for selecting the targets: Azerbaijan,\nBahrain, Kazakhstan, Mexico, Morocco, Rwanda, Saudi Arabia, Hungary, India, and the\nUnited Arab Emirates. Citizen Lab has also found evidence of all 10 being clients of NSO.\n\n**What does NSO Group say?**\n\nYou can read NSO Group’s [full statement here. The company has always said it does not](https://www.theguardian.com/news/2021/jul/18/response-from-nso-and-governments)\nhave access to the data of its customers’ targets. Through its lawyers, NSO said the\nconsortium had made “incorrect assumptions” about which clients use the company’s\ntechnology. It said the 50,000 number was “exaggerated” and that the list could not be a list\nof numbers “targeted by governments using Pegasus”. The lawyers said NSO had reason to\nbelieve the list accessed by the consortium “is not a list of numbers targeted by governments\nusing Pegasus, but instead, may be part of a larger list of numbers that might have been\nused by NSO Group customers for other purposes”. They said it was a list of numbers that\nanyone could search on an open source system. After further questions, the lawyers said the\nconsortium was basing its findings “on misleading interpretation of leaked data from\naccessible and overt basic information, such as HLR Lookup services, which have no\nbearing on the list of the customers' targets of Pegasus or any other NSO products ... we still\ndo not see any correlation of these lists to anything related to use of NSO Group\ntechnologies”. Following publication, they explained that they considered a \"target\" to be a\nphone that was the subject of a successful or attempted (but failed) infection by Pegasus,\nand reiterated that the list of 50,000 phones was too large for it to represent \"targets\" of\nPegasus. They said that the fact that a number appeared on the list was in no way indicative\nof whether it had been selected for surveillance using Pegasus.\n\n**What is HLR lookup data?**\n\nThe term HLR, or home location register, refers to a database that is essential to operating\nmobile phone networks. Such registers keep records on the networks of phone users and\ntheir general locations, along with other identifying information that is used routinely in\nrouting calls and texts. Telecoms and surveillance experts say HLR data can sometimes be\nused in the early phase of a surveillance attempt, when identifying whether it is possible to\nconnect to a phone. The consortium understands NSO clients have the capability through an\ninterface on the Pegasus system to conduct HLR lookup inquiries. It is unclear whether\nPegasus operators are required to conduct HRL lookup inquiries via its interface to use\nits software; an NSO source stressed its clients may have different reasons – unrelated to\nPegasus – for conducting HLR lookups via an NSO system.\n\nForensics analysis of a small number of phones whose numbers appeared on the leaked list\nalso showed more than half had traces of the Pegasus spyware.\n\n\n-----\n\nThe Guardian and its media partners will be revealing the identities of people whose number\nappeared on the list in the coming days. They include hundreds of business executives,\nreligious figures, academics, NGO employees, union officials and government officials,\nincluding cabinet ministers, presidents and prime ministers.\n\nThe list also contains the numbers of close family members of one country’s ruler, suggesting\nthe ruler may have instructed their intelligence agencies to explore the possibility of\nmonitoring their own relatives.\n\nThe disclosures begin on Sunday, with the revelation that the numbers of more than 180\njournalists are listed in the data, including reporters, editors and executives at the Financial\nTimes, CNN, the New York Times, France 24, the Economist, Associated Press and Reuters.\n\n[The phone number of a freelance Mexican reporter, Cecilio Pineda Birto, was found in the](https://www.theguardian.com/news/2021/jul/18/revealed-murdered-journalist-number-selected-mexico-nso-client-cecilio-pineda-birto)\nlist, apparently of interest to a Mexican client in the weeks leading up to his murder, when his\nkillers were able to locate him at a carwash. His phone has never been found so no forensic\nanalysis has been possible to establish whether it was infected.\n\nNSO said that even if Pineda’s phone had been targeted, it did not mean data collected from\nhis phone contributed in any way to his death, stressing governments could have discovered\nhis location by other means. He was among at least 25 Mexican journalists apparently\nselected as candidates for surveillance over a two-year period.\n\nWithout forensic examination of mobile devices, it is impossible to say whether phones were\nsubjected to an attempted or successful hack using Pegasus.\n\nNSO has always maintained it “does not operate the systems that it sells to vetted\ngovernment customers, and does not have access to the data of its customers’ targets”.\n\nIn [statements issued through its lawyers, NSO denied “false claims” made about the](https://www.theguardian.com/news/2021/jul/18/response-from-nso-and-governments)\nactivities of its clients, but said it would “continue to investigate all credible claims of misuse\nand take appropriate action”. It said the list could not be a list of numbers “targeted by\ngovernments using Pegasus”, and described the 50,000 figure as “exaggerated”.\n\nThe company sells only to military, law enforcement and intelligence agencies in 40\nunnamed countries, and says it rigorously vets its customers’ human rights records before\nallowing them to use its spy tools.\n\n[bar graph grey version](https://interactive.guim.co.uk/uploader/embed/2021/07/customers_breakdown-zip/giv-825oIv2FDR5AfPE/)\nThe Israeli minister of defence closely regulates NSO, granting individual export licences\nbefore its surveillance technology can be sold to a new country.\n\nLast month, NSO released a transparency report in which it claimed to have an industryleading approach to human rights and published excerpts from contracts with customers\nstipulating they must only use its products for criminal and national security investigations.\n\n\n-----\n\nThere is nothing to suggest NSO s customers did not also use Pegasus in terrorism and\ncrime investigations, and the consortium also found numbers in the data belonging to\nsuspected criminals.\n\nHowever, the broad array of numbers in the list belonging to people who seemingly have no\nconnection to criminality suggests some NSO clients are breaching their contracts with the\ncompany, spying on pro-democracy activists and journalists investigating corruption, as well\nas political opponents and government critics.\n\nThat thesis is supported by forensic analysis on the phones of a small sample of journalists,\nhuman rights activists and lawyers whose numbers appeared on the leaked list. The\nresearch, conducted by Amnesty’s Security Lab, a technical partner on the Pegasus project,\nfound traces of Pegasus activity on 37 out of the 67 phones examined.\n\nQ&A\n\n**What is the Pegasus project?**\n\nShow\nThe Pegasus project is a collaborative journalistic investigation into the NSO Group and its\nclients. The company sells surveillance technology to governments worldwide. Its flagship\nproduct is Pegasus, spying software – or spyware – that targets iPhones and Android\ndevices. Once a phone is infected, a Pegasus operator can secretly extract chats, photos,\nemails and location data, or activate microphones and cameras without a user knowing.\n\nForbidden Stories, a Paris-based nonprofit journalism organisation, and Amnesty\nInternational had access to a leak of more than 50,000 phone numbers selected as targets\nby clients of NSO since 2016. Access to the data was then shared with the Guardian and 16\nother news organisations, including the Washington Post, Le Monde, Die Zeit and\nSüddeutsche Zeitung. More than 80 journalists have worked collaboratively over several\nmonths on the investigation, which was coordinated by Forbidden Stories.\n\nThe analysis also uncovered some sequential correlations between the time and date a\nnumber was entered into the list and the onset of Pegasus activity on the device, which in\nsome cases occurred just a few seconds later.\n\nAmnesty shared its forensic work on four iPhones with Citizen Lab, a research group at the\nUniversity of Toronto that specialises in studying Pegasus, which confirmed they showed\nsigns of Pegasus infection. Citizen Lab also conducted a peer-review of Amnesty’s forensic\nmethods, and found them to be sound.\n\nThe presence of a number in the data does not mean there was an attempt to infect the\nphone. NSO says there were other possible purposes for numbers being recorded on the list.\n\n\n-----\n\n[Rwanda, Morocco, India and Hungary denied having used Pegasus to hack the phones of](https://www.theguardian.com/news/2021/jul/18/response-from-nso-and-governments)\nthe individuals named in the list. The governments of Azerbaijan, Bahrain, Kazakhstan,\nSaudi Arabia, Mexico, the UAE and Dubai did not respond to invitations to comment.\n\nThe Pegasus project is likely to spur debates over government surveillance in several\ncountries suspected of using the technology. The investigation suggests the Hungarian\ngovernment of Viktor Orbán appears to have deployed NSO’s technology as part of his socalledwar on the media, targeting investigative journalists in the country as well as the close\ncircle of one of Hungary’s few independent media executives.\n\nThe leaked data and forensic analyses also suggest NSO’s spy tool was used by Saudi\nArabia and its close ally, the UAE, to target the phones of close associates of the murdered\nWashington Post journalist Jamal Khashoggi in the months after his death. The Turkish\nprosecutor investigating his death was also a candidate for targeting, the data leak suggests.\n\nClaudio Guarnieri, who runs Amnesty International’s Security Lab, said once a phone was\ninfected with Pegasus, a client of NSO could in effect take control of a phone, enabling them\nto extract a person’s messages, calls, photos and emails, secretly activate cameras or\nmicrophones, and read the contents of encrypted messaging apps such as WhatsApp,\nTelegram and Signal.\n\n[Explainer graphic grey version](https://interactive.guim.co.uk/uploader/embed/2021/07/mobile-explainer-zip/giv-825y7Y0FN3v6Ty5/)\nBy accessing GPS and hardware sensors in the phone, he added, NSO’s clients could also\nsecure a log of a person’s past movements and track their location in real time with pinpoint\naccuracy, for example by establishing the direction and speed a car was travelling in.\n\nViktor Orbán accused of using Pegasus to spy on journalists and critics\n\nRead more\n\nThe latest advances in NSO’s technology enable it to penetrate phones with “zero-click”\nattacks, meaning a user does not even need to click on a malicious link for their phone to be\ninfected.\n\nGuarnieri has identified evidence NSO has been exploiting vulnerabilities associated with\niMessage, which comes installed on all iPhones, and has been able to penetrate even the\nmost up-to-date iPhone running the latest version of iOS. His team’s forensic analysis\ndiscovered successful and attempted Pegasus infections of phones as recently as this\nmonth.\n\nApple said: “Security researchers agree iPhone is the safest, most secure consumer mobile\ndevice on the market.”\n\nNSO declined to give specific details about its customers and the people they target.\n\n\n-----\n\nHowever, a source familiar with the matter said the average number of annual targets per\ncustomer was 112. The source said the company had 45 customers for its Pegasus spyware.\n\n_Additional reporting: Dan Sabbagh in London, Shaun Walker in Budapest, Angelique_\n_Chrisafis in Paris and Martin Hodgson in New York._\n\n**[Show your support for the Guardian’s fearless investigative journalism today so](https://support.theguardian.com/contribute?acquisitionData=%7B%22source%22%3A%22GUARDIAN_WEB%22%2C%22componentType%22%3A%22ACQUISITIONS_EDITORIAL_LINK%22%2C%22componentId%22%3A%22pegasus_project_footnote%22%2C%22campaignCode%22%3A%22pegasus_project%22%7D&INTCMP=pegasus_project)**\n**we can keep chasing the truth**\n\nTopics\n[Reuse this content](https://syndication.theguardian.com/automation/?url=https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2021%2Fjul%2F18%2Frevealed-leak-uncovers-global-abuse-of-cyber-surveillance-weapon-nso-group-pegasus&type=article&internalpagecode=world/2021/jul/18/revealed-leak-uncovers-global-abuse-of-cyber-surveillance-weapon-nso-group-pegasus)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-18 - Revealed- leak uncovers global abuse of cyber-surveillance weapon.pdf"
    ],
    "report_names": [
        "2021-07-18 - Revealed- leak uncovers global abuse of cyber-surveillance weapon.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535945,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1653710186,
    "ts_modification_date": 1653710186,
    "files": {
        "pdf": "https://archive.orkl.eu/eaef76579f50cf711dd9db663926fce05b96fff7.pdf",
        "text": "https://archive.orkl.eu/eaef76579f50cf711dd9db663926fce05b96fff7.txt",
        "img": "https://archive.orkl.eu/eaef76579f50cf711dd9db663926fce05b96fff7.jpg"
    }
}