{
    "id": "f1474057-a77f-478c-8f03-0f4cceae6b32",
    "created_at": "2023-01-12T14:59:45.788342Z",
    "updated_at": "2025-03-27T02:05:33.760961Z",
    "deleted_at": null,
    "sha1_hash": "97dcc3a81ffc97349afb9867152ce622e2c8acec",
    "title": "2021-12-01 - Smishing Botnets Going Viral in Iran",
    "authors": "",
    "file_creation_date": "2022-05-27T22:55:55Z",
    "file_modification_date": "2022-05-27T22:55:55Z",
    "file_size": 3000976,
    "plain_text": "# Smishing Botnets Going Viral in Iran\n\n**[research.checkpoint.com/2021/smishing-botnets-going-viral-in-iran/](https://research.checkpoint.com/2021/smishing-botnets-going-viral-in-iran/)**\n\nDecember 1, 2021\nResearch by: Shmuel Cohen\n\n## Introduction\n\n\nDecember 1, 2021\n\n\n[In the last few months, multiple Iranian media and social networks have published warnings](https://www.iribnews.ir/fa/news/3181066/%DA%A9%D9%84%D8%A7%D9%87%D8%A8%D8%B1%D8%AF%D8%A7%D8%B1%DB%8C-%D8%A7%D8%B2-%D8%B7%D8%B1%DB%8C%D9%82-%D8%A7%D8%B1%D8%B3%D8%A7%D9%84-%D9%BE%DB%8C%D8%A7%D9%85%DA%A9-%D8%AC%D8%B9%D9%84%DB%8C-%D8%A8%D8%A7-%D9%86%D8%A7%D9%85-%D8%B3%D8%A7%D9%85%D8%A7%D9%86%D9%87-%D8%AB%D9%86%D8%A7)\nabout ongoing SMS phishing campaigns impersonating Iranian government services. The\nstory is as old as time: victims click on a malicious link, enter their credit card details, and in\na matter of hours their money is gone. What is noteworthy about these campaigns is the\nsheer scale of the attack. An unprecedented number of victims have shared similar stories in\nthe comment sections of news outlets and social networks about how their bank accounts\nwere emptied.\n\n[As opposed to previously spotted attacks such as the Flubot Trojan that steals sensitive data](https://www.ncsc.gov.uk/guidance/avoiding-banking-malware)\nfrom devices by injecting code and displaying overlay screens, the malicious applications\npresented in this research rely on social engineering to lure victims into handing over their\ncredit cards details. The modus operandi is always the same. The victims receive a\nlegitimate-looking SMS with a link to a phishing page that is impersonating government\nservices, and lures them to download a malicious Android application and then pay a small\n\n\n-----\n\nfee for the service. The malicious application not only collects the victim s credit card\nnumbers, but also gains access to their 2FA authentication SMS, and turn the victim’s device\ninto a bot capable of spreading similar phishing SMS to other potential victims. The technical\nevidence and the public reports show tens of thousands of victims were affected, and billions\nof Iranian Rials stolen, with sums reaching up to $1000-2000 per victim.\n\nThis article describes technical details about how these campaigns are constructed, their\nbusiness model, and how they became so successful despite utilizing unsophisticated tools.\nIn addition, the investigation shows that due to the attackers’ own low OPSEC (operations\nsecurity) level, the victims’ data is not protected and is freely accessible to third parties.\n\nAlthough the prevalence and danger of these campaigns were raised by the media and\ncaught the attention of the Iranian cyber-police, the attackers are still thriving and continue to\nupdate their malicious applications and underlying infrastructure on almost a daily basis.\n\n## Infection Chain\n\nFigure 1: The infection chain\n\nThe attack starts with a phishing SMS message. In many cases, it’s a message from an\nelectronic judicial notification system that notifies the victim that a new complaint was opened\nagainst them. The seriousness of such an issue might explain why the campaign has gone\n\n\n-----\n\nviral. When official government messages are involved, most citizens do not think twice\nbefore clicking the links.\n\nFigure 2: Examples of phishing SMS sent to the Iranian citizens\n\n[As reported by multiple Twitter users, the SMS contains a fake notification from the Iranian](https://twitter.com/mohebatre/status/1440401410017742851)\nJudiciary about a new file/complaint and suggests clicks on the link to review the full\ncomplaint. The link from the SMS leads to a phishing site which usually mimics an official\ngovernment site. The user is notified of the complaint filed against them, and personal\ninformation is requested in order to proceed to the electronic system and avoid visiting the\noffline branch due to COVID limitations.\n\n\n-----\n\n_Figure 3: The phishing site notifies the victim about the complaint against them (on the left)_\n_and asks for personal information like name, phone number, and national code to proceed to_\n_a fake electronic system_\n\nAfter entering personal information, the victim is redirected to a page to download a\nmalicious .apk file. Once installed, the Android application shows a fake login page for the\nSana (Iranian electronic judicial notification system) authentication service requesting the\nvictim’s mobile phone number and national identity number. It also notifies the victim that\nthey need to pay a fee to proceed. It is only a small amount (20,000, or sometimes 50,000\nIranian Rials – around $1), which reduces the suspicion and makes the operation look more\nlegitimate.\n\n\n-----\n\nFigure 4: Fake authentication page (on the left) and the phishing page collecting credit card\n_details (on the right)_\n\nAfter entering the details, the victim is redirected to a payment page. Similar to most phishing\npages, after credit card data is submitted the site shows a “payment error” message, but the\nmoney is already gone. Of course, the sum of 20,000 Iranian Rials is not the attackers’\nultimate goal. The attacker has the victim’s credit information, and the Android application –\nthe backdoor still installed on the victim’s device – can facilitate additional theft whenever a\n2FA bypass or additional verification is required from the credit card company.\n\n**These Android backdoor capabilities include:**\n\n**SMS stealing. Immediately after the installation of the fake app, all the victim’s SMS**\nmessages are uploaded to the attacker’s server.\n**Hiding to maintain persistence. After the credit card information is sent to the threat**\nactor, the application can hide its icon, making it challenging for the victim to control or\nuninstall the app.\n\n\n-----\n\n**Bypass 2FA. Having access to both the credit card details and SMS on the victim s**\ndevice, the attackers can proceed with unauthorized withdrawals from the victim’s bank\naccounts, hijacking the 2FA authentication (one-time password).\n**Botnet Capabilities. The malware can communicate with the C&C server via FCM**\n(Firebase Cloud Messaging) which allows the attacker to execute additional commands\non the victim’s device, such as stealing contacts and sending SMS messages.\n**Wormability. The app can send SMS messages to a list of potential victims, using a**\ncustom message and a list of phone numbers both retrieved from the C&C server. This\nallows the actors to distribute phishing messages from the phone numbers of typical\nusers instead of from a centralized place and not be limited to a small set of phone\nnumbers that could be easily blocked. This means that technically, there are no\n“malicious” numbers that can be blocked by the telecommunication companies or\ntraced back to the attacker.\n\nThe following technical analysis explains in more detail how these backdoor features are\nimplemented.\n\n## Technical analysis\n\n Android Package\n\nThe typical malicious Android application from this campaign is built using Basic for Android\n[(b4a), an open-source project from Anywhere Software that helps develop native Android](https://www.b4x.com/b4a.html)\napps.\n\nThe malware requires some permissions to perform its malicious activity, including access to\nSMS and contacts and Internet connectivity. It also needs some permissions defined by\nGoogle Firebase: the `RECEIVE is used to receive push notifications and the`\n```\nBIND_GET_INSTALL_REFERRER_SERVICE is used by Firebase to recognize from where the\n\n```\napp was installed.\n\nFigure 5: Android manifest for the example malicious application\n(7767659fab29de6412402d9ea38670b3d32b088fa29e7b457a770433845dc550)\n\n\n-----\n\nWhen it is first launched, the app requests 4 permissions: `PERMISSION_RECEIVE_SMS,`\n```\nPERMISSION_READ_SMS, PERMISSION_SEND_SMS, PERMISSION_READ_CONTACTS . For each\n\n```\npermission, the function `_activity_permissionresult is called:`\n\nFigure 6: The malware notifies the panel about the newly installed bot and uploads all the\n_SMS from the newly infected device_\n\nFirst, the function creates some kind of mutex: it checks if the file `set.txt exists and`\ncreates it if it is not found. Then it reads the `port (the campaign name) from the file`\n```\n/assets/port.txt . The campaign’s panel URL is used later throughout the application:\nhttps://hardcoded_panel_domain/ + port + /panel.php .\n\n```\nThe app sends the panel the Android ID of the victim’s device, announcing that a new device\ninstalled the malware. It then collects all the SMS from the device to the file `sms.txt and`\nuploads it to the same panel with the Android ID as a parameter. To start the phishing flow,\nthe malware loads a layout from the `assets/mon.bal file and retrieves the URL of the`\nfraudulent site from the file `assets/url.txt . It loads the phishing URL in web-view and`\npasses the device’s android_id as a parameter to this URL. This way, after the victim enters\nhis credit card details on the phishing page, the attackers have the android_id as an identifier\nfor the later steps when they’ll need to fetch 2FA SMS from the victim’s device and match it\nwith the credit card number.\n\nNeedless to say, the credit card details from the phishing page are handled by PHP code\nand sent directly to the attackers.\n\n## SMS and 2FA theft\n\nIn addition to retrieving and uploading the SMS messages to the server, as soon as the\napplication is installed and the permission to access SMS is granted, the malware monitors\nnew SMS messages and sends them to the C&C server. For this purpose, they use the\nfollowing receiver:\n\n\n-----\n\nFigure 7: Part of the malware Android manifest describing the SMS receiver\n\nThe newly received SMS message body and the sender number are sent in plaintext as\nparameters of a GET request to the C&C server:\n\n```\n/panel.php?message=message_body&number=sender_number&id=android_id\n\n```\n\nFigure 8: The malware sends the newly received SMS to the panel\n\nIn some of the later versions of the malware, there is a code that can send an additional\nparameter: the flag `isbank indicating that the SMS came from any bank. This simple check`\nis done by matching the body with a predefined list of words related to “bank” in the Persian\nlanguage.\n\n## Botnet C&C communication\n\nThe devices with the installed malware send the output of all the operations to the panel, and\nreceive the commands to run from the C&C using FCM (Firebase Cloud Messaging).\n\n\n-----\n\nFigure 9: Firebase configuration from the malware sample\n\nThe malware uses FCM topic messaging which allows it to broadcast a message to multiple\ndevices that have opted into a particular topic. The topic used in each specific sample is the\n```\nport value.\n\n```\nFigure 10: The malware subscribes to the FCM topic according to the “port” value from the\n_app_\n\n## Phishing SMS Distribution\n\nOne of the most interesting and critical features is the ability of the malware to distribute the\nphishing campaign to other potential victims. The C&C server sends the “send” command,\nand the app requests two files from the actor-controlled panel:\n```\n   Message.oliver, which is the content of the SMS message to be sent;\n   Numbers.oliver, a list of numbers to distribute this message.\n\n```\nThe infected device distributes the phishing message and notifies the C&C server if the\nmalicious SMS indeed was sent successfully. This is done by comparing it to the last of the\noutgoing SMS messages on the device.\n\n\n-----\n\nFigure 11: The piece of malware code that handles sending the SMS and reporting to the\n_server if the operation succeeded (red) or not (yellow)_\n\nThis botnet capability might raise suspicion among potential victims, as the phishing SMS\narrives from some residential phone number and not the short numbers that governmental\nservices usually use. On the other hand, this approach doesn’t require the actors to maintain\nspecific numbers, which can be blocked on the phone operator level or traced back to the\nattackers.\n\nThis is a summary of the commands supported by malware:\n\nMessage Description Resulting communication with the panel\n\nonline Get all online bots. Send android id to: `panel.php?`\n```\n                        online=android_id\n\n```\n\nallsms Get all SMS from a specific\ndevice.\n\nhide Hide app icon for a specific\ndevice.\n\nsend Send SMS from a specific device\nto a list of numbers with a\nspecified message.\n\n\nCollect SMS to sms.txt file and upload it via\nPOST request to: `panel.php?`\n```\nuploadsms=android_id\n\n```\nSend android id to: `panel.php?`\n```\nhide=android_id\n\n```\nGet from the C&C the message\n```\nMessage.oliver and the numbers list\n\n```\nfrom `Numbers.oliver`\n\nUpdate the panel of the result of SMS\ndistribution: `panel.php?smsw=get or`\n\n\n-----\n\nMessage Description Resulting communication with the panel\n\ncontacts Get all contacts from a specific Collect contacts to `Contacts.txt file`\ndevice. and send it to: `panel.php?`\n```\n                        uploadcon=android_id\n\n```\nTable 1: Full list of FCM C&C commands\n\n## Infrastructure\n\nPhishing operations that require maintaining both web and mobile infrastructure are quite\nuncommon. To carry out this malicious operation, the threat actors need to maintain several\ndifferent components:\n\nA web page with the right lure to distribute the mobile application and phishing pages\nwith the same lure theme to collect credit card data.\nThe panel where the stolen data is stored.\nFirebase domain for C&C communication.\nAndroid applications with all the above defined in the code and configuration files.\n\n## Phishing web pages\n\nThe web infrastructure responsible for phishing sites mostly utilize free domain registrar\nservices with .tk, .ml, .cf, xyz, .gq TLDs to register multiple lookalike domains of the services\nthey try to impersonate. This allows them to update domains and URLs on an almost daily\nbasis with no cost, and short-lived domains decrease the chances that the malicious URLs\nwill be blocked. The source code of the phishing page is publicly available on multiple\n[Telegram channels and Github. This code is usually customizable per the user’s needs and](https://github.com/HUSSEINZANGIYE/MOHAMMAD/tree/master/Mellat)\ncontains additional features to assist the operator. For example, it might provide alerts each\ntime a new victim submits his credit card data. To do this, the source code of the PHP page\nthat handles the stolen credit card data contains a template to automatically submit the data\nvia API to a Telegram bot:\n\n\n-----\n\nFigure 12: Example of the phishing page integration with Telegram: part of the opt.php script\n_that handles all the user data sends this data to the configured Telegram group_\n\n## The panels\n\nThe main panel domains are hardcoded in the mobile samples, but they change together\nwith the applications over time. In some campaigns, the panel stayed on the same IP\naddress which was also shared with the phishing page domains, indicating that the entire\nweb infrastructure belongs to the same actor:\n\n\n-----\n\nFigure 13: Fragment of DNS resolutions for one of the panel IPs, 45.153.241[.]194. It also\n_includes short-lived phishing site domains._\n\n## Victims’ Data leaked\n\nNot only do the malicious actors steal data and money from the victims, but their total lack of\nOPSEC enables the stolen SMS data to be leaked and freely available on the attacker’s\npanels. One of the panels, oliverdnssop[.]cf, had over 10 different campaigns reporting to it.\nOne opendir exposing the structure of the files and folders of a particular campaign is\nenough to be able to get access to the data stolen from the victims of any other campaign by\ndirectly accessing URLs of other campaigns, even those that are not exposed directly via\nopendir.\n\n\n-----\n\nFigure 14: Opendir on one specific port (campaign) on the attackers’ panel\n\nThe files located in each campaign folder include already mentioned ones:\n\nContacts.txt – The list of all contacts stolen from the last device added to the botnet.\nSms.txt – All the SMS stolen from the bot.\nMessage.oliver – The phishing message to be distributed by the bots.\nNumbers.oliver – The list of phone numbers where the bots should send this message.\nOn.oliver – The list of all the online bots.\nUsers.oliver – The full list of android_ids participating in this botnet.\n\nThe leaked data shows that in less than 10 days, more than a thousand victims installed the\napp from one campaign, which scores around a hundred daily victims of one campaign out of\nmultiple campaigns running simultaneously. This means that the estimated number of\nvictims, not necessarily those who provided the credit card information but at least those who\ninstalled the malicious application and became a part of the botnet, are in the tens of\nthousands during the few months of these campaigns.\n\n\n-----\n\nFigure 15: A fragment of the SMS dump from one of the victims shows how the stolen credit\n_card was used to withdraw money in very small installments multiple times in a short_\n_time (rough translation on the left)_\n\n## Business models and actors\n\n Multiple mobile packages\n\nWhile tracking the specific type of malware that we described earlier, we found several other\ncampaigns that impersonated not only Iranian government services but also Iranian social\nsecurity services, device tracking systems used in case of phone theft or loss, Iranian banks,\ndating and shopping sites, cryptocurrency exchanges and more.\n\n\n-----\n\nFigure 16: Screenshot of one of the phishing sites impersonating the Divar shopping site and\n_its translation (on the left), and a censored fake dating site (on the right)_\n\nIn total, we found several hundred different phishing Android applications distributed in the\nlast few months. They use different code base, but they all contain similar features and utilize\nthe same method of a botnet spreading SMS messages to other devices based on\ncommands received from Firebase Cloud Messaging.\n\nThese applications’ packages names include but are not limited to:\n```\n   com.psiphone3 – The app we discuss in this article, with more than 50 applications\n\n```\nuploaded to VirusTotal. The campaign using this type of application started in early\nOctober 2021.\n```\n   caco333.ca – The most widespread application, with more than 250 different\n\n```\napplications in the wild since the beginning of its distribution in July. The extensive\n[technical details of this campaign were shared by researchers from the Iranian Anti-](https://threats.amnpardaz.com/malware/trojan-android-smspay-caco333/)\nVirus company Amnpardaz;\n```\n   ir.PluTus.pluto package – Seen in the wild since the end of September.\n\n```\nFrom a technical point of view, the level of these other two applications is not much more\ncomplicated than what we discussed earlier. Some of these apps contain more features that\ncan be used for evasion and stealth, including those that send the C&C the clipboard data, or\ncrash the app or mute the notifications, so the victim won’t notice the incoming 2FA SMS\nmessage.\n\n\n-----\n\nFigure 17: Fragment of the malware code responsible for additional features\n\n## Popular underground business\n\nThe analysis of the infrastructure and different types of malicious Android packages\nassociated with it suggests the botnets are sold as a service. Further research in Telegram\ngroups showed that phishing is a developing industry in the Iranian market. An example is\nthe Telegram group called “Zalem Phishing”. This group was created in July and is mostly\ndedicated to sharing jokes and cat memes, however, it also sells phishing pages with\ndifferent themes for $20-$40 and has almost 60,000 subscribers. Another channel, more\nserious and fully dedicated to phishing, called “Source phish”, has almost 1,000 subscribers\nand contains a lot of source code for various phishing pages.\n\nIn private discussions with active sellers in the channel, for a price ranging between\n$50-$100 (depending on the seller), anyone can acquire a ready-to-use mobile campaign kit\nwith control panels that can be easily managed by an unskilled attacker via a simple\nTelegram bot interface:\n\n\n-----\n\nFigure 18: Sample screenshots of Telegram bot panels\n\nMore advanced applications that include RAT capabilities, like caco333.ca, are more\nexpensive and can reach a price of $100-$150:\n\nFigure 19: Sample screenshots of Telegram bot panel containing advanced features\n\n[In September, the news reported that the Iranian police caught the person involved in Sana](https://www.mehrnews.com/news/5311178/%D9%86%D9%88%D8%AC%D9%88%D8%A7%D9%86-%DB%B1%DB%B7-%D8%B3%D8%A7%D9%84%D9%87-%DA%AF%D8%B1%DA%AF%D8%A7%D9%86%DB%8C-%D8%A8%D8%A7-%D9%BE%DB%8C%D8%A7%D9%85%DA%A9-%D8%AB%D9%86%D8%A7-%DB%B8%DB%B0%DB%B0-%D9%85%DB%8C%D9%84%DB%8C%D9%88%D9%86-%DA%A9%D9%84%D8%A7%D9%87%D8%A8%D8%B1%D8%AF%D8%A7%D8%B1%DB%8C-%DA%A9%D8%B1%D8%AF)\nphishing. The botnet as a service scheme described above explains why his arrest didn’t\nchange the landscape. Even if the arrested individual is responsible for one or two small\ncampaigns, there are a lot more of them out there that are still running, and each one causes\nsimilar monetary losses to the general population.\n\n\n-----\n\nFigure 20: A rough translation of the news report of the arrest of one of the phishing\n_operators behind this kind of campaign_\n\n## Conclusion\n\n\n-----\n\nThis research provides an example of a monetarily successful campaign that exploits social\nengineering and causes major financial loss to its victims, despite the low quality and\ntechnical simplicity of its tools. This campaign may also cause data leaks from the victims’\nphones and the stolen information is easily accessible online.\n\nThere are a few key reasons why this operation is financially successful and attracts a lot of\nattention:\n\nIt causes an SMS “storm” as multiple botnets operated by different people constantly\ndistribute the phishing links across numerous lists of contacts.\nLure themes contain a wide range of topics, including sensitive ones such as\ncomplaints and arrest warnings from the Iranian Judiciary service, and cause the\npotential victims to focus on the lure message and not on their security.\nStealing 2FA dynamic codes allows the actors to slowly but steadily withdraw\nsignificant amounts of money from the victims’ accounts, even in cases when due to\nthe bank limitations each distinct operation might garner only tens of dollars.\n\nSmishing botnets use the phone numbers of the existing infected devices, and the phishing\ndomains constantly change. This makes it harder, if not impossible, to block phishing SMS\nmessages on the level of the telecommunications company, or even trace them back to the\nattackers. Together with the easy adoption of the “botnet as a service” business model, it\nshould come as no surprise that the number of such applications for Android and the number\nof people selling them is growing. At this time, the only scalable and long-term solution for\nthis problem seems to be raising security awareness among the general public.\n\nBy extending Check Point Software’s industry-leading network security technologies to\n[mobile devices, Check Point Harmony Mobile offers a broad range of network security](https://www.checkpoint.com/harmony/mobile-security/mobile/)\ncapabilities, ensuring devices are not exposed to compromise with real-time risk\nassessments detecting attacks, vulnerabilities, configuration changes, and advanced rooting\nand jailbreaking.\n\n## IOCs\n\nPanel domains:\n\noliverhome[.]ml\n\npapaoliver[.]com\n\noliverdnssop[.]cf\n\neblagh-sana126[.]cf\n\ngoogleadvercap[.]ml\n\n\n-----\n\ncaloprkds[.]ml\n\ndu-shaparak[.]tk\n\noliverhome[.]cf\n\nsana-panelr6s[.]cf\n\nPhishing domains:\n\niraeblagh[.]tk\n\naccount-tamin-ejtemai-ir[.]cf\n\ndivaar[.]xyz\n\nmyeblaghye[.]tk\n\nshprk-melli-ir[.]cf\n\nblaghmalet-shapark[.]tk\n\nsana-adliran[.]site\n\nedalatiran[.]cf\n\nadllliran[.]ml\n\nedalatiran[.]ga\n\nibligo[.]com\n\nekop[.]shop\n\neblaghonline[.]tk\n\ntaminaccount-ir[.]ml\n\nadlliran-ir[.]ml\n\nadleiran-ir[.]tk\n\nadllirani[.]ml\n\niranadll[.]ml\n\nFirebase C&C:\n\nmeraf-c128a.appspot[.]com\n\n\n-----\n\nApplications:\n\nc1ce62605f2caa31a180b7d309228d40dc3c4793\nec943116146b7479e14d4810f8a1e6005358b0d3\ne7c4133a80cc591b7ae1b13d1b5f35c204167934\ne3f904671342821a863da1a99fe4cd9c5d1d47c7\nc4c59c075d43dff252e8920adef5b3a53c3d5ad5\n236cecc10e2e8880f41f5f90a7455d28928b0189\n75e792fb39936685110d867a9280e8d3848724a7\n9e11fc9b0444161dac6b0fc6219848749ac47de7\ndba1f2a07854aae8d449b1c75dd62a858a82a81a\n23f169d43730d126a35c3a8b3d5e4dd36959926a\n5398ada047884e9998929977d6e0d553cc7f8cce\n6a2933aca9f3f3e4eb74b94ff693f0f55eae6a92\nc44227d5519017b56f03b48fe7baeab51af6a42f\nfbada462f1ff1c3f94a71d1ea8b035c8d0eb0535\n8bf26ae8df15c00bef353e8ff42e0efca728644d\na26aa548ca20587acf5e1214fff5b0488e3804b3\n2fb3142e380744df555a455f4ed4acd7f7480047\n3f420f9972335be58c793854782c64d35d842ac5\n740d1e5d90163ddfe31bb6322b6c3ee1b66ec3d4\n8aabe2dc0050988252d89fe706ab753c2aa4f7c3\ncf42932372d77255bb855ff644aeba19220efd67\n539da81e0d4e05da538fdacb3a39a31de2068bbc\n8bc921bc19f821e1c72f9dec3ac17efb2313d437\na94d7a3b61b23c45269ac704f6438a60af0da50a\n63fcedad2a71ca04f16e1cffa25f5088aa3ec982\nd2d165eb8bfe6865f42c8bf7ebb17808ba0ab2e1\n1b981194a136de152be073a1e24e04aaaa0edb8f\n636e048cb23411f9e92a3ffa667b9c41b3576dd9\na86bab952751fdb7ac218aa6c6404c2ddae5d3c6\n14f043cbde465a33647c6333caaf6594014052e1\nb917cdc733a947f1413c012f190325266597351a\n49f53101ace333666b4264e2afd8a34485c498f4\n5b8b6c899afda69b127776a0f87844f10c940033\nc75d5a0404a5bf6476a22d7d60dd45d426d59ca5\n280b78b576463b0100424260b98b74f71bf29919\nb1db046e462725d26892413c3583f0512d2cab80\ncb2bb4c463b8e8a3f4201036fb167fa3dc8dd385\nbcdf01b4eff9a610ead51e3f6f6959d3040ad2f9\n4e7b52e1a47702b2887543b5974802cbad6cb009\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-01 - Smishing Botnets Going Viral in Iran.pdf"
    ],
    "report_names": [
        "2021-12-01 - Smishing Botnets Going Viral in Iran.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535585,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653692155,
    "ts_modification_date": 1653692155,
    "files": {
        "pdf": "https://archive.orkl.eu/97dcc3a81ffc97349afb9867152ce622e2c8acec.pdf",
        "text": "https://archive.orkl.eu/97dcc3a81ffc97349afb9867152ce622e2c8acec.txt",
        "img": "https://archive.orkl.eu/97dcc3a81ffc97349afb9867152ce622e2c8acec.jpg"
    }
}