{
    "id": "f157b2d7-9db3-4467-b30d-9c5cb18c0b29",
    "created_at": "2023-01-12T15:05:41.654578Z",
    "updated_at": "2025-03-27T02:05:23.885542Z",
    "deleted_at": null,
    "sha1_hash": "27f972088e52a62f1d8483e647a25d0ed6d6ac94",
    "title": "2017-03-29 - Explained- Sage ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T04:56:26Z",
    "file_modification_date": "2022-05-28T04:56:26Z",
    "file_size": 1072966,
    "plain_text": "# Explained: Sage ransomware\n\n**[blog.malwarebytes.com/threat-analysis/2017/03/explained-sage-ransomware/](https://blog.malwarebytes.com/threat-analysis/2017/03/explained-sage-ransomware/)**\n\nMalwarebytes Labs March 29, 2017\n\n[Sage is yet another ransomware that has become a common threat nowadays. Similarly to Spora, it has](https://www.malwarebytes.com/ransomware)\ncapabilities to encrypt files offline. The malware is actively developed and currently, we are facing an\noutbreak of version 2.2. of this product.\n\n## Analyzed samples\n\n[3686b6642cf6a3d97e368590557ac3f2 – JS downloader](https://virustotal.com/en/file/6709cd1d5f0998ca9355b7f3bb86edc7d6ae7dd44598c18a8eb6d6dbe185eb12/analysis/)\n\n## Distribution method\n\nMost often, Sage is dropped by downloader scripts distributed via phishing e-mails (office documents with\nmalicious macros or standalone JS files). In the analyzed case, the sample was dropped via a JavaScript file.\n\n## Behavioral analysis\n\nAfter being deployed, Sage deletes the original sample and runs another copy, dropped in %APPDATA%\n(names of the dropped files are different for different machines – probably generated basing on GUID):\n\n\n-----\n\nThe dropped copy deploys itself once again, with a parameter g . Example:\n```\n\"C:\\Users\\tester\\AppData\\Roaming\\FkGtk5ju.exe\" g\n\n```\nAfter finishing its work, that dropped copy is also being deleted with the help of a batch script dropped in the\n%TEMP% folder.\n\nThe content dropped in %TEMP% is shown on the below picture. We can see the batch scripts and the BMP\nthat is being set as a wallpaper:\n\nSample contents of the batch scripts is given below. As we can see, the ping command is used to delay\noperations.\n\nJust in case the system gets restarted before the encryption finished, Sage sets a link in the Startup folder,\nso that it can continue after the reboot:\n\nHowever, if the ransomware successfully completed encryption process and deleted itself, the link is left\nabandoned.\n\nAfter finishing, the wallpaper is changed. In version 2.2 the wallpaper looks very similar to 2.0, except the\nfont is green instead of red:\n\n\n-----\n\nAt the end of the execution, the ransom note !HELP_SOS.hta opens automatically:\n\nIn addition to the written information, Sage 2.2 plays a voice message informing about the infection. It is\n[deployed via WScript running the default Microsoft voice-to-speech service – just like in the case of Cerber.](https://blog.malwarebytes.com/threat-analysis/2016/03/cerber-ransomware-new-but-mature/)\n\nSome content is left in %APPDATA%:\n\n\n-----\n\nEncrypted files are added to the “sage”extension and their icons are changed:\n\nVisualization of a file – before and after encryption:\n\nFiles with the same plaintext produce different ciphertexts, that leads to the conclusion that each file is\nencrypted with a new key.\n\nSage can work well without internet connection, however, if connected it sends data via UDP (similarly to\n[Cerber):](https://blog.malwarebytes.com/threat-analysis/2016/03/cerber-ransomware-new-but-mature/)\n\n\n-----\n\nThe traffic is encrypted:\n\n## Page for the victim\n\nThe ransom note contains a link to the page for the victim. Encrypted and Base64 encoded key of the victim\nis passed via URL to the server of attackers. Example:\n_http://7gie6ffnkrjykggd.onion/login/AQAAAAAAAAAAv4NRzsVPkfwPPWixq2mqtFwGWlZTeCDpL_BGPyeJFhDA_\n\nThe key can be also pasted via field on the website:\n\nKeep in mind that the first login on the page for the victim triggers the timer to start. From this moment, the\ncountdown to the price increment is running.\n\nThe website is protected by a simple captcha and allows for a simple customization – the victim can choose\none of the supported languages (currently 17):\n\n\n-----\n\nThe page contains typical information, such as the amount of ransom to be paid and further instructions:\n\n\n-----\n\nThe malware allows to test decryption capabilities by permitting the victim to upload some encrypted files\n(the size of the file must be lesser than 15 KB):\n\n\n-----\n\nHowever, the result is not available instantly:\n\nAfter some hours, the decrypted version of the uploaded file is indeed available to download:\n\n## Inside\n\n\n-----\n\nSage is delivered packed by various crypters. After defeating the first layer we obtain second PE file – the\nmalicious core, that is not further obfuscated.\n\nAt the beginning of the execution, Sage generates the Victim ID/key and saves it in the .tmp file dropped in\n%APPDATA% folder. Then, it removes backups from the system:\n\nExecuted commands:\n```\nvssadmin.exe delete shadows /all /quiet\nbcdedit.exe /set {default} recoveryenabled no\nbcdedit.exe /set {default} bootstatuspolicy ignoreallfailures\n\n```\nSage enumerates through the files, and if they matched the defined criteria, they are getting encrypted. First,\nthe malware creates a file with the same name as the attacked one, but with three dots at the end.\n\nBoth files coexist in the system until the encrypting is finished.\n\nThen, the original file is deleted and the newly created one – renamed with the extension .sage:\n\n\n-----\n\nAt the end, only the .sage file is left:\n\n**What is attacked?**\n\nSage comes with a long list of the attacked extensions, that is hard-coded in the binary:\n```\ndat mx0 cd pdb xqx old cnt rtp qss qst fx0 fx1 ipg ert pic img cur fxr \nslk m4u mpe mov wmv mpg vob mpeg 3g2 m4v avi mp4 flv mkv 3gp asf m3u m3u8 \nwav mp3 m4a m rm flac mp2 mpa aac wma djv pdf djvu jpeg jpg bmp png jp2 lz \nrz zipx gz bz2 s7z tar 7z tgz rar ziparc paq bak set back std vmx vmdk vdi \nqcow ini accd db sqli sdf mdf myd frm odb myi dbf indb mdb ibd sql cgn dcr \nfpx pcx rif tga wpg wi wmf tif xcf tiff xpm nef orf ra bay pcd dng ptx r3d \nraf rw2 rwl kdc yuv sr2 srf dip x3f mef raw log odg uop potx potm pptx rss\npptm aaf xla sxd pot eps as3 pns wpd wps msg pps xlam xll ost sti sxi otp \nodp wks vcf xltx xltm xlsx xlsm xlsb cntk xlw xlt xlm xlc dif sxc vsd ots \nprn ods hwp dotm dotx docm docx dot cal shw sldm txt csv mac met wk3 wk4 \nuot rtf sldx xls ppt stw sxw dtd eml ott odt doc odm ppsm xlr odc xlk ppsx \nobi ppam text docb wb2 mda wk1 sxm otg oab cmd bat h asx lua pl as hpp clas \njs fla py rb jsp cs c jar java asp vb vbs asm pas cpp xml php plb asc lay6 \npp4 pp5 ppf pat sct ms11 lay iff ldf tbk swf brd css dxf dds efx sch dch \nses mml fon gif psd html ico ipe dwg jng cdr aep aepx 123 prel prpr aet \nfim pfb ppj indd mhtm cmx cpt csl indl dsf ds4 drw indt pdd per lcd pct \nprf pst inx plt idml pmd psp ttf 3dm ai 3ds ps cpx str cgm clk cdx xhtm \ncdt fmv aes gem max svg mid iif nd 2017 tt20 qsm 2015 2014 2013 aif qbw \nqbb qbm ptb qbi qbr 2012 des v30 qbo stc lgb qwc qbp qba tlg qbx qby 1pa \nach qpd gdb tax qif t14 qdf ofx qfx t13 ebc ebq 2016 tax2 mye myox ets \ntt14 epb 500 txf t15 t11 gpc qtx itf tt13 t10 qsd iban ofc bc9 mny 13t \nqxf amj m14 _vc tbp qbk aci npc qbmb sba cfp nv2 tfx n43 let tt12 210 \ndac slp qb20 saj zdb tt15 ssg t09 epa qch pd6 rdy sic ta1 lmr pr5 op sdy \nbrw vnd esv kd3 vmb qph t08 qel m12 pvc q43 etq u12 hsr ati t00 mmw bd2 \nac2 qpb tt11 zix ec8 nv lid qmtf hif lld quic mbsb nl2 qml wac cf8 vbpf \nm10 qix t04 qpg quo ptdb gto pr0 vdf q01 fcr gnc ldc t05 t06 tom tt10 \nqb1 t01 rpf t02 tax1 1pe skg pls t03 xaa dgc mnp qdt mn8 ptk t07 chg \n#vc qfi acc m11 kb7 q09 esk 09i cpw sbf mql dxi kmo md u11 oet ta8 efs \nh12 mne ebd fef qpi mn5 exp m16 09t 00c qmt cfdi u10 s12 qme int? cf9 \nta5 u08 mmb qnx q07 tb2 say ab4 pma defx tkr q06 tpl ta2 qob m15 fca eqb \nq00 mn4 lhr t99 mn9 qem scd mwi mrq q98 i2b mn6 q08 kmy bk2 stm mn1 bc8 \npfd bgt hts tax0 cb resx mn7 08i mn3 ch meta 07i rcs dtl ta9 mem seam \nbtif 11t efsl $ac emp imp fxw sbc bpw mlb 10t fa1 saf trm fa2 pr2 xeq \nsbd fcpa ta6 tdr acm lin dsb vyp emd pr1 mn2 bpf mws h11 pr3 gsb mlc \nnni cus ldr ta4 inv omf reb qdfx pg coa rec rda ffd ml2 ddd ess qbmd \nafm d07 vyr acr dtau ml9 bd3 pcif cat h10 ent fyc p08 jsd zka hbk bkf \nmone pr4 qw5 cdf gfi cht por qbz ens 3pe pxa intu trn 3me 07g jsda \n2011 fcpr qwmo t12 pfx p7b der nap p12 p7c crt csr pem gpg key\n\n```\nIn order to access all the files without any interference, Sage searches and terminates any associated\nprocesses. Processes are identified by their names:\n```\nmsftesql.exe sqlagent.exe sqlbrowser.exe sqlservr.exe sqlwriter.exe \noracle.exe ocssd.exe dbsnmp.exe synctime.exe mydesktopqos.exe agntsvc.exe\nisqlplussvc.exe xfssvccon.exe mydesktopservice.exe ocautoupds.exe \nencsvc.exe firefoxconfig.exe tbirdconfig.exe ocomm.exe mysqld.exe\nmysqld-nt.exe mysqld-opt.exe dbeng50.exe sqbcoreservice.exe\n\n```\nAs it is common in ransomware, some paths are excluded from the attack. In this case, blacklisted are not\nonly system directories, but also others, related to popular games like “League of Legends”, “steamapps”,\n“GOG Games”, and etc.\n\n\n-----\n\n```\n p p pp pp g\n'Program Files (x86)' 'Program Files' '$Recycle Bin' \n'$RECYCLE BIN' Windows.old $WINDOWS.~BT DRIVER DRIVERS \n'System Volume Information' Boot Windows WinSxS DriverStore \n'League of Legends' steamapps cache2 httpcache GAC_MSIL \nGAC_32 'GOG Games' Games 'My Games' Cookies History IE5 \nContent.IE5 node_modules All Users AppData ApplicationData \nnvidia intel Microsoft System32 'Sample Music' \n'Sample Pictures' 'Sample Videos' 'Sample Media' Templates\n\n```\nSome countries (recognized by keyboard layouts) are also excluded from the attack. Below is the function\nchecking if the selected keyboard layout is present in the system:\n\n[Systems with the following keyboard layouts are omitted by Sage 2.2: Belarusian, Kazak, Ukrainian, Uzbek,](https://github.com/FreeRDP/FreeRDP/blob/master/winpr/include/winpr/locale.h)\nSakha, Russian, Latvian.\n\n**How does the encryption works?**\n\nSage uses two cryptographic algorithms: Elliptic Curves and ChaCha20. ChaCha20 is used to encrypt\ncontent of each file, while ECC is used to protect the randomly generated keys.\n\n[Each random key is retrieved using a cryptographically secure generator (SystemFunction036). The filled](https://msdn.microsoft.com/en-us/library/windows/desktop/aa387694(v=vs.85).aspx)\nbuffer is preprocessed by a simple algorithm:\n\n\n-----\n\nVictim ID\n\nAt the beginning of the execution, Sage creates a random buffer and encrypts it using ECC. The buffer\ncreated in the first round of encryption we will refer as a Victim ID and the output of the next rounds – as\nEncrypted Victim ID.\n\nIn the first round, the random value is encrypted using ECC, producing the Victim ID.\n\nIn the second round, the same random value is encrypted using ECC along with another buffer, that is\nhardcoded in the binary. The output is processed in the similar way like the random buffer:\n\nIn the third round, the resulting buffer is again encrypted by ECC – producing the Encrypted Victim ID.\n\nBoth output buffers are kept in the memory of the application and used further (also they are saved in the\nTMP file dropped in %APPDATA% folder).\n\n\n-----\n\nThe part highlighted on the screenshot is the Victim ID (after that, next 32 bytes are the Encrypted Victim ID):\n\nThe victim ID is also saved in the ransom note, in Base64* version:\n\n_*The character set is slightly modified in comparison to the classic Base64. In order to decode it as Base64_\n_we must replace ‘-‘ with ‘+’ and ‘_’ with ‘/’ for example the ID: AQAAAAAAAAAAGwsZ-_\n_IAO5_pntzI3UnC8VweSZXaKQ0gTJ9PRS8AkiAnA is Base64:_\n_AQAAAAAAAAAAGwsZ+IAO5/pntzI3UnC8VweSZXaKQ0gTJ9PRS8AkiAnA_\n\nIn addition, the Victim ID is also saved in each and every encrypted file:\n\n\n-----\n\nThe Encrypted Victim ID takes part in encrypting file’s content (as a key unique per victim).\n\nFile encryption\n\nAt the beginning of the file encrypting function, a new 32 bytes long key is generated (unique per each file).\n\nThe random number is encrypted with the help of ECC twice:\n\nIndividually – to make the key1 that is stored in the file\nAlong with the Encrypted Victim’s ID – to make the key2, used by ChaCha20\n\nAs we can see, the key2 is used to initialize the cryptographic function’s context. ChaCha20 can be\n[recognized by typical constants used in the initialization function:](https://tools.ietf.org/html/rfc7539)\n\n\n-----\n\nThe file is encrypted chunk by chunk (the maximal chunk size is 0x20000) with the help of ChaCha20:\n\nAt the end of the file, the first derived key (key1) and some additional data is appended:\n\nAppended data is separated from the encrypted file’s content by two hard-coded markers: 0x5A9EDEAD and\n0x5A9EBABE\n\nMarkers at the end of the encrypted file:\n\n\n-----\n\nAfter the first marker Sage stores the following information: Victim ID, Key1, size of the original file.\n\n**Network communication**\n\nSage does not need any data from the CnC in order to work. However, as mentioned before, it may generate\nsome UDP traffic. It is because it has capabilities to send some data about the attacked system. Depending\non the configuration, the data may be sent either via UDP or via HTTP POST request. The data is encrypted\nbefore being sent – also with the help of ChaCha20 algorithm. In the observed case, the ChaCha20 key was\na buffer filled with 0 bytes.\n\nExamples of the data sent to the CnC\n\nSage sends the generated keys to the CnC, i.e.:\n\nCompare with the buffer before encryption:\n\nThe same data is also formatted into a human-readable form, like shown below. However, so far we didn’t\nobserved any use of this data. It may be some unfinished feature, that will be developed further in new\nversions of this product. Formatted equivalent of the above buffer:\n\n\n-----\n\n```\n[ ( ),, {\n  \"v\": 1,\n  \"gpk\": bin(32) CB3B94D965A389978A16035ED700C87A780088730989C24C581325340A866C4B,\n  \"pk\": bin(32) 2BB7BD5394B845629C90BB2B43D9655DC9C86347C4C695AB18150D7031B9E41F,\n }]\n\n```\nOther examples – collected information about the attacked machine:\n```\n[bin(33) 01CB3B94D965A389978A16035ED700C87A780088730989C24C581325340A866C4B, 3, {\n  \"s\": {\n   \"w\": {\n    \"v\": [\n     6,\n     1,\n     false,\n     false,\n     7601,\n     1,\n     0,\n    ],\n    \"u\": \"tester\",\n    \"p\": \"TESTMACHINE\",\n   },\n   \"c\": \"    Intel(R) Core(TM) i5-3210M CPU @ 2.50GHz\",\n   \"m\": 232,\n   \"k\": [68486165, 4026598409, 4026991637],\n  },\n  \"i\": 12288,\n  \"w\": null,\n }]\n\n```\n**Adding icons**\n\nInteresting and uncommon feature deployed by Sage is the change of icons for the used datatypes. Padlock\nicon is added to the encrypted files with the .sage extension and the key icon is added to the files with .hta\nextensions (that are used for the ransom notes). Icon change is implemented via setting appropriate registry\nkeys:\n\n## Conclusion\n\n\n-----\n\nSage, similar to Spora, uses a complex way of deriving keys. So far, there is no solution that would allow\nrecovering files without paying the ransom – that’s why we recommend focusing on prevention instead.\n[Malwarebytes 3.0 Premium users are protected from Sage ransomware as long as it is installed prior to](https://www.malwarebytes.com/premium/)\nbeing infected.\n\n## Appendix\n\n[https://blog.fortinet.com/2017/02/02/a-closer-look-at-sage-2-0-ransomware-along-with-wise-mitigations –](https://blog.fortinet.com/2017/02/02/a-closer-look-at-sage-2-0-ransomware-along-with-wise-mitigations)\nFortinet about Sage 2.0\n\n_This was a guest post written by Hasherezade, an independent researcher and programmer with a strong_\n_interest in InfoSec. She loves going in details about malware and sharing threat information with the_\n_[community. Check her out on Twitter @hasherezade and her personal blog: https://hshrzd.wordpress.com.](https://twitter.com/hasherezade)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-03-29 - Explained- Sage ransomware.pdf"
    ],
    "report_names": [
        "2017-03-29 - Explained- Sage ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535941,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1653713786,
    "ts_modification_date": 1653713786,
    "files": {
        "pdf": "https://archive.orkl.eu/27f972088e52a62f1d8483e647a25d0ed6d6ac94.pdf",
        "text": "https://archive.orkl.eu/27f972088e52a62f1d8483e647a25d0ed6d6ac94.txt",
        "img": "https://archive.orkl.eu/27f972088e52a62f1d8483e647a25d0ed6d6ac94.jpg"
    }
}