{
    "id": "f161c5ea-5da3-412a-8f2e-2ec4039482a2",
    "created_at": "2023-01-12T15:10:59.700624Z",
    "updated_at": "2025-03-27T02:15:59.312228Z",
    "deleted_at": null,
    "sha1_hash": "a1c1d57c328513d14aae3f6792da49c4afd830c6",
    "title": "2022-05-09 - REvil Development Adds Confidence About GOLD SOUTHFIELD Reemergence",
    "authors": "",
    "file_creation_date": "2022-05-28T18:18:00Z",
    "file_modification_date": "2022-05-28T18:18:00Z",
    "file_size": 610651,
    "plain_text": "# REvil Development Adds Confidence About GOLD SOUTHFIELD Reemergence\n\n**[secureworks.com/blog/revil-development-adds-confidence-about-gold-southfield-reemergence](https://www.secureworks.com/blog/revil-development-adds-confidence-about-gold-southfield-reemergence?linkId=164334801)**\n\nCounter Threat Unit Research Team\n\n[Secureworks® Counter Threat Unit™ (CTU) researchers analyzed REvil ransomware](https://www.secureworks.com/research/revil-sodinokibi-ransomware)\n[samples that were uploaded to the VirusTotal analysis service after the GOLD SOUTHFIELD](https://www.secureworks.com/research/threat-profiles/gold-southfield)\n[threat group's infrastructure resumed activity in April 2022. The infrastructure had been](https://www.bleepingcomputer.com/news/security/revils-tor-sites-come-alive-to-redirect-to-new-ransomware-operation/)\nshuttered since October 2021. Analysis of these samples indicates that the developer has\n\n\n-----\n\naccess to REvil s source code, reinforcing the likelihood that the threat group has reemerged.\nThe identification of multiple samples containing different modifications and the lack of an\nofficial new version indicate that REvil is under active development.\n\n[The March 22 sample contains artifacts in its configuration that indicate a likely link to a](https://www.virustotal.com/gui/file/861e2544ddb9739d79b265aab1e327d11617bc9d9c94bc5b35282c33fcb419bc)\n[victim published to the REvil leak site in April. Despite a version value of 1.00, the sample](https://twitter.com/3xp0rtblog/status/1518177677122973698)\nhas a compile timestamp of 2022-03-11 14:30:49 and includes functionality from a version\n2.08 [sample identified by CTU™ researchers in October 2021. The March 2022 sample](https://www.virustotal.com/gui/file/09d2d12c8e93b183c8272a7ed821f173594952691d161e8c2e7fa0e332f82cc9)\nincludes the following modifications that distinguish it from the October 2021 sample:\n\n\n-----\n\n**Updates string decryption logic to rely on new command-line argument: A**\nchange to the string decryption logic impacts REvil's ability to successfully execute. To\nrun successfully, the threat actor must provide REvil with a pre-determined four-byte\ninteger value between 0 and 4294967295 (0xFFFFFFFF). REvil uses this value during\nthe string decryption process to calculate the RC4 decryption key length and the\nencrypted string offset. Prior REvil samples used hard-coded lengths and offset\nreferences. Figure 1 shows a comparison between the original logic and the logic\nimplemented in the March 2022 sample.\n\n_Figure 1. String decrypt logic changes in the March 2022 sample. (Source:_\n_Secureworks)_\n\nThis value is passed to the REvil executable via a new \"-t\" command-line argument.\nFailure to provide the argument and the correct value results in the executable's\ntermination. Without the correct value, REvil cannot decrypt essential strings such as\nlibrary and function names that are dynamically resolved at runtime. While this feature\nprevents network defenders from detonating the REvil sample in a sandbox\nenvironment if they do not know the pre-defined value, the unique command-line\npattern could make the samples easier to detect and block.\n\nCTU researchers determined that the integer value for the March 2022 sample shown\nin Figure 1 is 798690758 (e.g., \"<REvil executable filename> -t=798690758\"). The\n[REvil code applies a bitwise XOR operation to the hex equivalent of 798690758](https://www.loginradius.com/blog/engineering/how-does-bitwise-xor-work/)\n(0x2F9B0DC6) and the hard-coded value 0x2F9B0DCA, resulting in a calculated key\nlength of 12. Because the key offset is known (0x41555C), the RC4 key and encrypted\ndata can be extracted and processed using this calculated key length. Figure 2 shows\nan encrypted string structure in the March 2022 sample that starts with the RC4 key\n(EF916A059DD98FC8B3AC6747) followed by an encrypted string at the calculated\noffset (BB17AD3083FA3A84D943F1F6F3F3DD1891F544EC5D) that decrypts to\nCreateStreamOnHGlobal.\n\n_Figure 2. Encrypted string storage structure at calculated offset. (Source: Secureworks)_\n\n\n-----\n\n**Updates hard-coded public keys: The malware author changed the two 32-byte**\nhard-coded public keys used to secure artifacts compiled during the encryption\nsession. GOLD SOUTHFIELD may have lost access to the original private key pairs, or\nthose keys may have been exposed. The first key is stored at the start of the sample's\n.data section at offset 0x10. This key is used to encrypt the session's private key, which\nis generated at runtime and used to encrypt files. The ASCII representation of this key\nis\n83449D3C46A7946EA2E130C46EE88D6933DD3F9E3CDCAC9E8EB42792F713F60A.\nThe second key is stored in the sample's .data section at offset 0x30. This key is used\nto encrypt the \"stats\" JSON data that contains information about the encryption session\n(e.g., affiliate tracking information, encrypted session private key, victim's username,\nsystem's locale, drive details). The ASCII representation of this key is\n84A44FF8FAC498117B469EE8AE2A33A67308E0192A5650FF0501482A3B03BE15.\n\n\n-----\n\n**Changes the configuration storage location: The encrypted configuration structure**\nis stored at offset 0x50 relative to the start of the sample's .data section. The decryption\nkey stored at the start of this offset consists of 32 bytes ranging from 0x00 to 0xFF (see\nFigure 3).\n\n_Figure 3. Configuration storage location in the March 2022 REvil sample. (Source:_\n_Secureworks)_\n\nPrior REvil versions stored the configuration structure at the start of the section (offset\n0x00). In most cases, the structure was stored within a non-standard section (e.g.,\n.kjmxo0e). The key in prior versions was limited to alphanumeric characters (e.g.,\ngobpsd6RudAzmGciEytyLAjeGAk5H8Yd) as opposed to any byte value.\n\nThe overall configuration structure remains unchanged. It contains the decryption key\n(32 bytes), the precalculated CRC32 hash of the encrypted configuration (4 bytes), the\nencrypted configuration data length (4 bytes), and the RC4-encrypted configuration\ndata.\n\n\n-----\n\n**Changes affiliate tracking data format: When first introduced, REvil s affiliate**\ntracking \"pid\" and \"sub\" values were stored as integers within the configuration. In\n[February 2020, GOLD SOUTHFIELD started using bcrypt to hash these values to](https://en.wikipedia.org/wiki/Bcrypt)\n[prevent researchers from tracking affiliates. The March 2022 sample changed the pid](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-the-all-stars/)\n[and sub value format to a globally unique identifier (GUID). The analyzed sample](https://en.wikipedia.org/wiki/Universally_unique_identifier)\nincludes the following pid and sub values in its configuration:\n\npid: b78ad33f-32e9-4756-8c7b-83d46f8a0e19\nsub: bb9ced79-3e79-4649-8fcc-3d4295fabc08\nThe pid configuration element is never used, as the function that processed this\nconfiguration element was removed from the codebase. The only reference to the pid\nvalue was replaced with a duplicate sub reference (see Figure 4).\n\n_Figure 4. Comparison of stats data showing replacement of pid variable with duplicate_\n_sub variable in March 2022 sample. (Source: Secureworks)_\n\n\n-----\n\n**Removes prohibited region check: The October 2021 REvil sample removed code**\nthat verified the ransomware was not executing on a system that resided within a\nprohibited region. This removal enabled REvil to execute on any system regardless of\nits location. The isProhibitedRegion variable that was assigned the result of this check\nwas still present in the code but was assigned a hard-coded value of \"false\" (see\nFigure 5).\n\n_Figure 5. Prohibited region variable assigned hard-coded value of false in October_\n_2021 sample. (Source: Secureworks)_\n\nThe March 2022 sample removes this variable and no longer includes it in the stats\ndata.\n\n\n-----\n\n**Leverages accs configuration element: The accs configuration element introduced**\nin the October 2021 sample did not contain a value, but CTU researchers determined\nthat it should contain a list of strings that represent username and password\ncombinations separated by the percent (\"%\") sign. If this value is defined, the\nransomware uses the credentials to attempt authentication to protected network\nresources prior to encrypting their contents. However, it was unclear if the threat actor\nintended to list common username and password combinations or include credentials\nextracted from the targeted environment.\n\nThe March 2022 sample includes values in the accs configuration element, and the\ncredentials appear to be targeted. Most of the credentials were for specific\nadministrative accounts (see Figure 6). A typo in one of the credentials (\"5\" instead of\n\"%\") suggests that the threat actors may manually format the values before including\nthem in the configuration.\n\n_Figure 6. Targeted credentials listed in the accs configuration element of the March_\n_2022 sample. (Source: Secureworks)_\n\n\n-----\n\n**Includes new Tor domains in ransom note: The ransom note dropped on a victim s**\nsystem (see Figure 7) was updated to reference Tor domains that became active on\nApril 19, 2022 when GOLD SOUTHFIELD's infrastructure resumed activity:\n\nREvil leak site: blogxxu75w63ujqarv476otld7cyjkq4yoswzt4ijadkjwvg3vrvd5yd .\nonion\nREvil ransom payment site:\nlandxxeaf2hoyl2jvcwuazypt6imcsbmhb7kx3x33yhparvtmkatpaad . onion\n\n_Figure 7. REvil ransom note containing updated Tor domains for payment and leak_\n_sites. (Source: Secureworks)_\n\n\n-----\n\n**Changes safe-mode option values: The March 2022 sample modified safe-mode**\nreboot details:\n\nThe password for the current user was set to \"k$UqZy9zIC\".\nThe RunOnce registry values used for post-reboot operations were set to\n\"*AqfNn6\" and \"*SrTITZ\" (see Figure 8).\n\n_Figure 8. Updated RunOnce registry values associated with REvil's safe-mode_\n_reboot. (Source: Secureworks)_\n\n**Updates registry key and values: The registry key that stores encryption-related**\ninformation was set to SOFTWARE\\JnX5ywJ. The value names stored within this key\nalso changed, which is consistent with the author's pattern of renaming registry values\nin each version. Table 1 lists the registry values in the March 2022 sample.\n\n\nRegistry\nValue\n\n\nPurpose\n\n\n3OG Threat actor's public key in REvil's configuration\n\nb2vr Session public key\n\nElnzo Session private key encrypted with the threat actor's public key in\nREvil's configuration\n\n16uKrF7 Random extension generated at runtime and appended to encrypted\nfiles\n\nE7w3RRdi Encrypted 'stat' JSON data structure that contains information about the\nsystem and the malware\n\n_Table 1. REvil registry values used to store encryption data in the analyzed March 2022_\n_sample._\n\n[On April 29, 2022, Twitter user @JakubKroustek detected a REvil](https://twitter.com/JakubKroustek/status/1520135975262957568) [sample with a compile](https://www.virustotal.com/gui/file/0c10cf1b1640c9c845080f460ee69392bfaac981a4407b607e8e30d2ddf903e8/)\ntimestamp of 2022-04-26 19:39:04 and a version value of 1.00. CTU analysis of the April\n2022 sample revealed that its functionality is nearly identical to the March 2022 sample.\nHowever, the April 2022 sample does not contain the string decryption changes implemented\nin the March 2022 sample.\n\n\n-----\n\n[Third-party reporting claimed that the April 2022 sample did not encrypt files but instead](https://www.bleepingcomputer.com/news/security/revil-ransomware-returns-new-malware-sample-confirms-gang-is-back/)\nrenamed them to a random extension. CTU researchers determined that a bug caused this\nbehavior. The malware author modified the functionality that renames files being encrypted.\nThe bug resides within a test that determines if the file rename operation was successful\n(see Figure 9, line 13).\n\n_Figure 9. Code associated with file rename bug preventing file encryption in April 2022_\n_sample. (Source: Secureworks)_\n\nBecause the malware author used \"if ( !result )\" instead of \"if ( result )\", the file is successfully\nrenamed on the first loop iteration but never breaks out of the loop. On the second loop\niteration, the source file is missing because it has been renamed. As a result, the second file\nrename attempt fails and the file is never encrypted.\n\nTo mitigate exposure to this threat, CTU researchers recommend that organizations use\navailable controls to review and restrict access using the indicators listed in Table 2. The\ndomains may contain malicious content, so consider the risks before opening them in a\nbrowser.\n\nIndicator Type Context\n\n\ndb2401798c8b41b0d5728e5b6bbb94cf MD5\nhash\n\n6620f5647a14e543d14d447ee2bd7fecc03be882 SHA1\nhash\n\n\n861e2544ddb9739d79b265aab1e327d11617bc9d\n9c94bc5b35282c33fcb419bc\n\n\nSHA256\nhash\n\n\nMarch 2022 REvil sample\n\nMarch 2022 REvil sample\n\nMarch 2022 REvil sample\n\nApril 2022 REvil sample\n\n\nad49374e3c72613023fe420f0d6010d9 MD5\nhash\n\n\n-----\n\nIndicator Type Context\n\n\neb563ab4caca7e19bdeee807b025ab2d54e23624 SHA1\nhash\n\n\n0c10cf1b1640c9c845080f460ee69392bfaac981a4\n407b607e8e30d2ddf903e8\n\nblogxxu75w63ujqarv476otld7cyjkq4yoswzt4ijadk\njwvg3vrvd5yd.onion\n\nlandxxeaf2hoyl2jvcwuazypt6imcsbmhb7kx3x33yh\nparvtmkatpaad.onion\n\n\nSHA256\nhash\n\nDomain\nname\n\nDomain\nname\n\n\nApril 2022 REvil sample\n\nApril 2022 REvil sample\n\nREvil leak site in April\n2022\n\nREvil ransom payment site\nin April 2022\n\n\n_Table 2. Indicators for this threat._\nTo learn more about how ransomware groups adapt, read our Ransomware\n[Evolution analysis and watch our Ransomware Trends: The Evolution of Threat webinar.](https://www.secureworks.com/resources/wc-ransomware-trends-the-evolution-of-threat)\n\nIf you need urgent assistance with an incident, contact the Secureworks Incident Response\nteam.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-09 - REvil Development Adds Confidence About GOLD SOUTHFIELD Reemergence.pdf"
    ],
    "report_names": [
        "2022-05-09 - REvil Development Adds Confidence About GOLD SOUTHFIELD Reemergence.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "02ef8063-7ad4-42ba-a646-97210000f6b5",
            "created_at": "2024-06-19T02:03:08.117993Z",
            "updated_at": "2025-03-27T02:05:17.397211Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                ""
            ],
            "source_name": "Secureworks:GOLD SOUTHFIELD",
            "tools": [
                "REvil"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "7961bf6e-e429-484c-93e2-bd1d36fa5588",
            "created_at": "2023-01-06T13:46:39.275053Z",
            "updated_at": "2025-03-27T02:00:03.037764Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [],
            "source_name": "MISPGALAXY:GOLD SOUTHFIELD",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536259,
    "ts_updated_at": 1743041759,
    "ts_creation_date": 1653761880,
    "ts_modification_date": 1653761880,
    "files": {
        "pdf": "https://archive.orkl.eu/a1c1d57c328513d14aae3f6792da49c4afd830c6.pdf",
        "text": "https://archive.orkl.eu/a1c1d57c328513d14aae3f6792da49c4afd830c6.txt",
        "img": "https://archive.orkl.eu/a1c1d57c328513d14aae3f6792da49c4afd830c6.jpg"
    }
}