{
    "id": "f16ea0a7-73fa-44b2-b5d0-362137119c22",
    "created_at": "2023-01-12T15:03:15.083532Z",
    "updated_at": "2025-03-27T02:09:29.952223Z",
    "deleted_at": null,
    "sha1_hash": "d2f277bc64facc7d70a0363191b1419b85e3c465",
    "title": "2020-03-20 - 5 Times More Coronavirus-themed Malware Reports during March",
    "authors": "",
    "file_creation_date": "2022-05-27T19:59:37Z",
    "file_modification_date": "2022-05-27T19:59:37Z",
    "file_size": 1572461,
    "plain_text": "# 5 Times More Coronavirus-themed Malware Reports during March\n\n**[labs.bitdefender.com/2020/03/5-times-more-coronavirus-themed-malware-reports-during-march/](https://labs.bitdefender.com/2020/03/5-times-more-coronavirus-themed-malware-reports-during-march/?utm_campaign=twitter&utm_medium=twitter&utm_source=twitter)**\n\n[Anti-Malware Research](http://10.10.0.46/blog/labs/tag/antimalware-research/)\n\n5 min read\n\n[Liviu ARSENE](http://10.10.0.46/blog/labs/author/larsene/)\nMarch 20, 2020\n\nOne product to protect all your devices, without slowing them down.\n\n[Free 90-day trial](http://10.10.0.46/media/html/consumer/new/get-your-90-day-trial-opt/index.html)\n\n\n-----\n\nGovernment, Hospitality, Healthcare, Education & Research, and Retail are among the\nverticals most targeted on the Coronavirus heatmap.\n\nAs the Coronavirus pandemic continues, cybercriminals have started piggybacking news of\nthe crisis to deliver malware, conduct phishing, and even perform online fraud by preying on\nthe panic caused by a dearth of medical supplies and reliable information about the\npandemic.\n\nThe most recent Bitdefender telemetry shows unusual activity regarding Coronavirusrelated threats: the number of malicious reports related to Coronavirus has increased by\nmore than 475% in March, compared to February. And we still have about two more weeks\nto go until April.\n\nThese campaigns were likely mostly targeted at countries that have started suffering an\nincrease in Coronavirus infections, leveraging the fear on everyone’s mind.\n\nWith officials struggling to come up with plans and quarantine procedures, threat actors\nseem to have mobilized quickly and started luring victims with the promise of new and\nexclusive information on protection procedures.\n\n## Malicious Reports Soar in March\n\nFrom 1,448 malicious reports in February to 8,319 reports until March 16th, the number has\nsharply increased, as the real COVID-19 virus spreads aggressively around the world.\n\n\n-----\n\nSome of the most-targeted verticals seem to be government, retail, hospitality,\ntransportation and education & research. While it may seem odd, it does make sense that\nthese verticals are targeted as they actively interact with large groups of individuals and are\nmost interested in learning more about measures to be taken to prevent a Coronavirus\ninfection.\n\nConsequently, one reason why cybercriminals have been actively targeting these verticals\nwith phishing emails impersonating the WHO (World Health Organization), NATO, and even\nUNICEF is that employees likely expect official information from known, global\norganizations.\n\n\n-----\n\nA breakdown into which Government institutions seem targeted most reveals that education\nministries, health ministries and departments, and fire services have been attacked most.\n\nIn [healthcare, hospitals & clinics, pharmaceutical institutions, and distributors of medical](https://www.bitdefender.com/business/help-healthcare-fight-coronavirus.html)\nequipment, were mostly targeted, potentially with messages of procedures that need to be\ntaken, drugs that could work on preventing or treating infection, and even medical supplies\nthat were allegedly still in stock.\n\n\n-----\n\nFor example, the email above seems to target Healthcare services in Thailand judging from\nthe title, which is translated from Thai (“Fwd: Re: CoronaVirus Express Information”), and\nthe name of the attached file (“Ministry of Public Health Corona Virus Information Urgent\n2020.gz”). It promises new and exclusive information to medical staff. To make the email\nseem more legitimate, it uses the official logos of the Thailand Establishment of National\nInstitute of Health.\n\nIn rough translation, the email (seen above) urges citizens, schools, commissioners and\nbusiness owners to follow the instructions in the attached document to stay “safe and free\nfrom the viruses.” It also claims the file contains a list of pharmacies that distribute “a\nqualified protective drug.” Needless to say, anyone opening the tainted attachment will be\ninfected with a Trojan, specifically the NanoBot Trojan.\n\nEducation & Research verticals, where messages reached universities, schools, and\ntechnical institute, are all crowded places eagerly awaiting instructions on how to prepare\nfor the Coronavirus outbreak. They too have been selectively targeted with spearphishing\nemails.\n\nA look at some of the tainted documents received by government institutions shows all\nfilenames, naturally, share the same “coronavirus” string and promise to offer new and\nexclusive information regarding the outbreak.\n\nFor example, popular document booby traps range from claiming the email attachments are\nPDF documents when in fact they’re everything from “.exe” to “.bat” files. That means that,\nunless users have the “File name extensions” option ticked in the View menu of File\nExplorer; they’ll likely fall for this double extension scam. Of course, the files are laced with\nmalware and, as soon as they’re executed, they start deploying threats ranging from\nLokiBot and HawkEye to Kodiac and NanoBot (see the table below).\n\nMost of these Trojans, including NanoBot, are designed to steal information, such as\nusernames and passwords, potentially for use by threat actors either for financial profit or to\ngain remote access to accounts, services, and even endpoints.\n\nBelow, you can see a table with examples of names for each malicious documents received\nby each vertical, along with each email subject (where applicable).\n\n\n-----\n\n## Going After Countries Aggressively Affected by COVID-19\n\nIn terms of the geographical distribution for all malicious reports involving the Coronavirus,\nthings escalated quickly between January and March. In January, reports were coming in\nonly from some countries such as the United States, China, and Germany. By March,\nmalicious reports came in from all around the world, and no European country was spared.\n\n\n-----\n\n-----\n\nIn fact, during March, the largest number of malicious reports was registered from countries\nsuch as Italy, the United States, Turkey, France, the United Kingdom, Germany, Spain,\nCanada, Romania, and Thailand. All these countries that have been seriously afflicted by\nthe COVID-19 outbreak, which is why it’s likely these malware campaigns have been\nfocusing specifically on these regions.\n\nAs if having to deal with the Coronavirus in real life wasn’t enough, threat actors have been\nexploiting panic, misinformation, and confusion in an attempt to maximize their efforts in\nspreading scams and infections or generally profiting off of everyone’s fears.\n\n\n-----\n\n## Here s what you should know\n\nWith countries straining to find ways to contain and even stop the spread of COVID-19\ninfections, the average user/citizen is undoubtedly seeking help and information from any\nonline source on how to stay safe. However, that information may not always come from a\nreputable source.\n\nMalware is a dime a dozen and cybercriminals will stop at nothing to trick users into\ninstalling it. It may already be difficult to cope with the real-life virus, and dealing with cyber\n“viruses” is probably the last thing on anyone’s mind.\n\nHowever, just like in real life, good (security) hygiene means you’re not only keeping\nyourself safe but you’re also helping those around you. So carefully read through emails to\nmake sure they’re legitimate, don’t open attachments unless you’re absolutely sure they’re\nsafe, and try using a security solution that can keep you safe from a wide range of threats,\nso you can focus on what matters: keeping your family safe!\n\n_Note: This article is based on technical information provided courtesy of the Bitdefender_\n_Labs teams._\n\n**TAGS**\n\n[anti-malware research](http://10.10.0.46/blog/labs/tag/antimalware-research/)\n\n**AUTHOR**\n\n## Liviu ARSENE\n\nLiviu Arsene is the proud owner of the secret to the fountain of never-ending energy. That's\nwhat's been helping him work his everything off as a passionate tech news editor for the\npast few years.\n\n[View all posts](http://10.10.0.46/blog/labs/author/larsene/)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-20 - 5 Times More Coronavirus-themed Malware Reports during March.pdf"
    ],
    "report_names": [
        "2020-03-20 - 5 Times More Coronavirus-themed Malware Reports during March.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535795,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653681577,
    "ts_modification_date": 1653681577,
    "files": {
        "pdf": "https://archive.orkl.eu/d2f277bc64facc7d70a0363191b1419b85e3c465.pdf",
        "text": "https://archive.orkl.eu/d2f277bc64facc7d70a0363191b1419b85e3c465.txt",
        "img": "https://archive.orkl.eu/d2f277bc64facc7d70a0363191b1419b85e3c465.jpg"
    }
}