{
    "id": "f17bf2ce-eb86-4390-8221-3933c23e0a5b",
    "created_at": "2023-01-12T15:05:58.434141Z",
    "updated_at": "2025-03-27T02:08:41.304597Z",
    "deleted_at": null,
    "sha1_hash": "11c0683e22d9f31952798cccf0d80b5d42671ef7",
    "title": "2021-08-26 - Widespread credential phishing campaign abuses open redirector links",
    "authors": "",
    "file_creation_date": "2022-05-28T23:14:47Z",
    "file_modification_date": "2022-05-28T23:14:47Z",
    "file_size": 1299964,
    "plain_text": "# Widespread credential phishing campaign abuses open redirector links\n\n**[microsoft.com/security/blog/2021/08/26/widespread-credential-phishing-campaign-abuses-open-redirector-links/](https://www.microsoft.com/security/blog/2021/08/26/widespread-credential-phishing-campaign-abuses-open-redirector-links/)**\n\nAugust 26, 2021\n\nMicrosoft has been actively tracking a widespread credential phishing campaign using open redirector links.\nAttackers combine these links with social engineering baits that impersonate well-known productivity tools and\nservices to lure users into clicking. Doing so leads to a series of redirections—including a CAPTCHA verification\npage that adds a sense of legitimacy and attempts to evade some automated analysis systems—before taking\nthe user to a fake sign-in page. This ultimately leads to credential compromise, which opens the user and their\norganization to other attacks.\n\nThe use of open redirects in email communications is common among organizations for various reasons. For\nexample, sales and marketing campaigns use this feature to lead customers to a desired landing web page and\ntrack click rates and other metrics. However, attackers could abuse open redirects to link to a URL in a trusted\ndomain and embed the eventual final malicious URL as a parameter. Such abuse may prevent users and\nsecurity solutions from quickly recognizing possible malicious intent.\n\nFor instance, users trained to hover on links and inspect for malicious artifacts in emails may still see a domain\nthey trust and thus click it. Likewise, traditional email gateway solutions may inadvertently allow emails from this\ncampaign to pass through because their settings have been trained to recognize the primary URL without\nnecessarily checking the malicious parameters hiding in plain sight.\n\n\n-----\n\n_Figure 1. Attack chain for the open redirect phishing campaign_\n\nThis phishing campaign is also notable for its use of a wide variety of domains for its sender infrastructure—\nanother attempt to evade detection. These include free email domains from numerous country code top-level\ndomains (ccTLDs), compromised legitimate domains, and attacker-owned domain generated algorithm (DGA)\ndomains. As of this writing, we have observed at least 350 unique phishing domains used for this campaign.\nThis not only shows the scale with which this attack is being conducted, but it also demonstrates how much the\nattackers are investing in it, indicating potentially significant payoffs.\n\nToday’s email threats rely on three things to be effective: a convincing social engineering lure, a well-crafted\ndetection evasion technique, and a durable infrastructure to carry out an attack. This phishing campaign\nexemplifies the perfect storm of these elements in its attempt to steal credentials and ultimately infiltrate a\n[network. And given that 91% of all cyberattacks originate with email, Organizations must therefore have a](https://www.microsoft.com/security/blog/2020/03/20/protecting-against-coronavirus-themed-phishing-attacks/)\nsecurity solution that will provide them multilayered defense against these types of attacks.\n\n[Microsoft Defender for Office 365 detects these emails and prevents them from being delivered to user inboxes](https://www.microsoft.com/en-us/security/business/threat-protection/office-365-defender)\nusing multiple layers of dynamic protection technologies, including a built-in sandbox that examines and\ndetonates all the open redirector links in the messages, even in cases where the landing page requires\nCAPTCHA verification. This ensures that even the embedded malicious URLs are detected and blocked.\nMicrosoft Defender for Office 365 is backed by Microsoft experts who enrich the threat intelligence that feeds\ninto our solutions through expert monitoring of email campaigns.\n\n## Attack analysis: Credential phishing via open redirector links\n\nCredential phishing emails represent an extremely prevalent way for threat actors to gain a foothold in a\nnetwork. The use of open redirects from legitimate domains is far from new, and actors continue to abuse its\nability to overcome common precautions.\n\nPhishing continues to grow as a dominant attack vector with the goal of harvesting user credentials. From our\n[2020 Digital Defense Report, we blocked over 13 billion malicious and suspicious mails in the previous year,](https://www.microsoft.com/security/blog/2020/09/29/microsoft-digital-defense-report-2020-cyber-threat-sophistication-rise/)\nwith more than 1 billion of those emails classified as URL-based phishing threats.\n\nIn this campaign, we noticed that the emails seemed to follow a general pattern that displayed all the email\ncontent in a box with a large button that led to credential harvesting pages when clicked. The subject lines for\nthe emails varied depending on the tool they impersonated. In general, we saw that the subject lines contained\nthe recipient’s domain and a timestamp as shown in the examples below:\n\n[Recipient username] 1 New Notification\nReport Status for [Recipient Domain Name] at [Date and Time]\nZoom Meeting for [Recipient Domain Name] at [Date and Time]\nStatus for [Recipient Domain Name] at [Date and Time]\nPassword Notification for [Recipient Domain Name] at [Date and Time]\n\n[Recipient username] eNotification\n\n\n-----\n\n_Figure 2. Sample phishing email masquerading as an Office 365 notification_\n\nOnce recipients hover their cursor over the link or button in the email, they are shown the full URL. However,\nsince the actors set up open redirect links using a legitimate service, users see a legitimate domain name that is\nlikely associated with a company they know and trust. We believe that attackers abuse this open and reputable\nplatform to attempt evading detection while redirecting potential victims to phishing sites.\n\n\n-----\n\n_Figure 3. Hover tip showing an open redirect link with a legitimate domain and phishing link in the URL_\n_parameters_\n\nThe final domains used in the campaigns observed during this period mostly follow a specific domain-generation\nalgorithm (DGA) pattern and use .xyz, .club, .shop, and .online TLDs. The “Re-view invitation” button in Figure 3\npoints to a URL with a trusted domain followed by parameters, with the actor-controlled domain (c-hi[.]xyz)\nhidden in plain sight.\n\n_Figure 4. The actor-controlled domain uses a DGA pattern and a .XYZ top-level domain_\n\nIn August, we detected a fresh spam run from this campaign that used a slightly updated Microsoft-spoofing lure\nand redirect URL but leveraged the same infrastructure and redirection chain.\n\n\n-----\n\n_Figure 5. Sample phishing email from a recent spam run from this phishing campaign_\n\nThese crafted URLs are made possible by open redirection services currently in use by legitimate organizations.\nSuch redirection services typically allow organizations to send out campaign emails with links that redirect to\nsecondary domains from their own domains. For example, a hotel might use open redirects to take email\nrecipients to a third-party booking website, while still using their primary domain in links embedded in their\ncampaign emails.\n\nAttackers abuse this functionality by redirecting to their own malicious infrastructure, while still maintaining the\nlegitimate domain in the full URL. The organizations whose open redirects are being abused are possibly\nunaware that this is even occurring.\n\n## Redirecting to phishing pages\n\nUsers who clicked one of the crafted redirect links are sent to a page in attacker-owned infrastructure. These\npages used Google reCAPTCHA services to possibly evade attempts at dynamically scanning and checking the\ncontents of the page, preventing some analysis systems from advancing to the actual phishing page.\n\n\n-----\n\n_Figure 6. reCAPTCHA service used by phishing page_\n\nUpon completion of the CAPTCHA verification, the user is shown a site that impersonates a legitimate service,\nsuch as Microsoft Office 365, which asks the user for their password. The site is prepopulated with the\nrecipient’s email address to add legitimacy to the request. This technique leverages familiar single sign-on\n(SSO) behavior to trick users into keying in corporate credentials or other credentials associated with the email\naddress.\n\nTo do this, attackers send unique URLs to each recipient with PHP parameters that cause tailored information to\nrender in the phishing page. In some instances, phishing pages are specially crafted to include company logos\nand other branding tied to the recipient’s domain.\n\n_Figure 7. Fake sign-in page prefilled with the recipient email address alongside a fake error message prompting_\n_users to re-enter their passwords_\n\nIf the user enters their password, the page refreshes and displays an error message stating that the page timed\nout or the password was incorrect and that they must enter their password again. This is likely done to get the\nuser to enter their password twice, allowing attackers to ensure they obtain the correct password.\n\n\n-----\n\nOnce the user enters their password a second time, the page directs to a legitimate Sophos website that claims\nthe email message has been released. This adds another layer of false legitimacy to the phishing campaign.\n\n_Figure 8. Legitimate Sophos page displayed after users re-enter their passwords_\n\n## Tracking attacker-controlled domains\n\nSome of the domains used in this campaign include the following:\n\nc-tl[.]xyz\na-cl[.]xyz\nj-on[.]xyz\np-at[.]club\ni-at[.]club\nf-io[.]online\n\nFor the observed campaigns, the sender infrastructure was fairly unique and notable as the actors used a wide\nvariety of sender domains, with most of the domains having at least one of the following characteristics:\n\nFree email domains\nCompromised legitimate domains\nDomains ending in .co.jp\nAttacker-owned DGA domains\n\nMany of the final domains hosting the phishing pages follow a specific DGA pattern:\n\n_[letter]-[letter][letter].xyz_\n\n_[letter]-[letter][letter].club_\n\nThe free email domains span a wide variety of ccTLDs, such as:\n\nde\ncom.mx\ncom.au\nca\n\nThe attacker-owned DGA domains follow a few distinct patterns, including:\n\n_[word or string of characters]-[word][number], incrementing by one, for example: masihtidur-shoes08[.]com_\n\n_[number][word or string of characters]-[number], incrementing by one, for example: 23moesian-17[.]com_\n\n\n-----\n\n_[word][word][number], incrementing by one, for example: notoficationdeliveryamazon10[.]com_\n\n_[word or letters][number]-[number], incrementing by one, for example: dak12shub-3[.]com_\n\nWhile these are the most prevalent patterns observed by Microsoft security researchers, over 350 unique\ndomains have been observed during these campaigns.\n\n## How Microsoft Defender for Office 365 protects against modern email threats\n\nThe abuse of open redirectors represents an ongoing threat that Microsoft experts constantly monitor, along\nwith other threat trends and attacker techniques used in attacks today. Microsoft’s breadth of visibility into\nthreats combined with our deep understanding of how attackers operate will continue to inform the advanced\n[protection delivered by Microsoft Defender for Office 365 against email-based attacks.](https://www.microsoft.com/en-us/security/business/threat-protection/office-365-defender)\n\nFor mitigations against the abuse of open redirector links via known third-party platforms or services, users are\nadvised to follow the recommended best practices of their service providers, such as updating to the latest\nsoftware version, if applicable, to prevent their domains from being abused in future phishing attempts.\n\n[Microsoft Defender for Office 365 protects customers from this threat by leverages its deep visibility into email](https://www.microsoft.com/en-us/security/business/threat-protection/office-365-defender)\nthreats and advanced detection technologies powered by AI and machine learning. We strongly recommend\n[that organizations configure recommended settings in Microsoft Defender for Office 365, such as applying anti-](https://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/recommended-settings-for-eop-and-office365?view=o365-worldwide)\n[phishing, Safe Links, and](https://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/set-up-safe-links-policies?view=o365-worldwide) [Safe Attachments policies. We also recommend installing the Report Message add-in](https://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/set-up-safe-attachments-policies?view=o365-worldwide)\nfor Outlook to enable users to report suspicious messages to their security teams and optionally to Microsoft.\n\n[Attack simulation lets organizations run realistic, yet safe, simulated phishing and password attack campaigns in](https://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/attack-simulator?view=o365-worldwide)\nyour organization. These simulated attacks can help identify and find vulnerable users before a real attack\nmakes a real impact.\n\n[Investigation capabilities in Microsoft Defender 365 allows organizations to respond phishing and other email-](https://www.microsoft.com/en-us/microsoft-365/security/microsoft-365-defender)\nbased attacks. Microsoft 365 Defender correlates signals from emails and other domains to deliver coordinated\ndefense. [Microsoft Defender for Endpoint blocks malicious files and other malware as well as malicious](https://www.microsoft.com/en-us/microsoft-365/security/endpoint-defender)\n[behavior that result from initial access via email. Microsoft Defender SmartScreen integrates with Microsoft](https://docs.microsoft.com/en-us/deployedge/microsoft-edge-security-smartscreen)\nEdge to block malicious websites, including phishing sites, scam sites, and other malicious sites, while Network\nprotection blocks connections to malicious domains and IP addresses.\n\nLearn how you can stop credential phishing and other email threats through comprehensive, industry-leading\nprotection with Microsoft Defender for Office 365.\n\n_Microsoft 365 Defender Threat Intelligence Team_\n\n## Advanced hunting queries\n\nTo locate possible credential phishing activity, run the following advanced hunting queries in Microsoft 365\nDefender.\n\n**Open redirect URLs in t-dot format**\n\nFind URLs in emails with a leading “t”, indicating possible open redirect URLs. Note: the use of a redirector URL\ndoes not necessitate malicious behavior. You must verify whether the emails surfaced via this AHQ are\nlegitimate or malicious.\n```\nEmailUrlInfo\n| where Url matches regex @\"s?\\:\\/\\/(?:www\\.)?t\\.(?:[\\w\\-\\.]+\\/+)+(?:r|redirect)\\/?\\?\"\n\n```\n**Open redirect URLs pointing to attacker infrastructure**\n\n\n-----\n\nFind URLs in emails possibly crafted to redirect to attacker controlled URLs.\n```\nEmailUrlInfo\n//This regex narrows in on emails that contain the known malicious domain pattern in the\nURL from the most recent campaigns\n| where Url matches regex @\"^[a-zA-Z]\\-[a-zA-Z]{2}\\.(xyz|club|shop|online)\"\n\n## Indicators of compromise\n\n```\nFollowing is a list of domains that match the DGA pattern used in sender addresses in this and other malicious\ncampaigns. Note that these have not all been observed in mail flow related to this campaign.\n\nmasihtidur-shoes08[.]com masihtidur-shoes07[.]com masihtidur-shoes04[.]com\n\nmasihtidur-shoes02[.]com masihtidur-shoes01[.]com wixclwardwual-updates9[.]com\n\nwixclwardwual-updates8[.]com wixclwardwual-updates7[.]com wixclwardwual-updates6[.]com\n\nwixclwardwual-updates5[.]com wixclwardwual-updates10[.]com wixclwardwual-updates1[.]com\n\nzxcsaxb-good8[.]com zxcsaxb-good6[.]com zxcsaxb-good5[.]com\n\nzxcsaxb-good4[.]com zxcsaxb-good3[.]com zxcsaxb-good10[.]com\n\ntrashxn-euyr9[.]com trashxn-euyr7[.]com trashxn-euyr6[.]com\n\ntrashxn-euyr5[.]com trashxn-euyr3[.]com trashxn-euyr20[.]com\n\ntrashxn-euyr2[.]com trashxn-euyr19[.]com trashxn-euyr18[.]com\n\ntrashxn-euyr17[.]com trashxn-euyr16[.]com trashxn-euyr15[.]com\n\ntrashxn-euyr14[.]com trashxn-euyr12[.]com trashxn-euyr11[.]com\n\ntrashxn-euyr10[.]com trashxn-euyr1[.]com berangberang-9[.]com\n\nberangberang-7[.]com berangberang-12[.]com berangberang-6[.]com\n\nnotoficationdeliveryamazon8[.]com berangberang-8[.]com berangberang-3[.]com\n\nberangberang-4[.]com berangberang-10[.]com berangberang-11[.]com\n\nberangberang-13[.]com berangberang-5[.]com 77support-update23-4[.]com\n\nposher876ffffff-30[.]com posher876ffffff-5[.]com posher876ffffff-25[.]com\n\nfenranutc0x24ai-11[.]com organix-xtc21[.]com fenranutc0x24ai-13[.]com\n\nfenranutc0x24ai-4[.]com fenranutc0x24ai-17[.]com fenranutc0x24ai-18[.]com\n\nadminsecurity102[.]com adminsecurity101[.]com 23moesian-17[.]com\n\n23moesian-10[.]com 23moesian-11[.]com 23moesian-26[.]com\n\n23moesian-19[.]com 23moesian-2[.]com cokils2ptys-3[.]com\n\ncokils2ptys-1[.]com 23moesian-20[.]com 23moesian-15[.]com\n\n23moesian-18[.]com 23moesian-16[.]com sux71a37-net19[.]com\n\nsux71a37-net1[.]com sux71a37-net25[.]com sux71a37-net14[.]com\n\n\n-----\n\nsux71a37-net18[.]com sux71a37-net15[.]com sux71a37-net12[.]com\n\nsux71a37-net13[.]com sux71a37-net20[.]com sux71a37-net11[.]com\n\nsux71a37-net27[.]com sux71a37-net2[.]com sux71a37-net21[.]com\n\nbimspelitskalix-xuer9[.]com account-info005[.]com irformainsition0971a8-net16[.]com\n\nbas9oiw88remnisn-12[.]com bas9oiw88remnisn-27[.]com bas9oiw88remnisn-26[.]com\n\nbas9oiw88remnisn-11[.]com bas9oiw88remnisn-10[.]com bas9oiw88remnisn-5[.]com\n\nbas9oiw88remnisn-13[.]com bas9oiw88remnisn-1[.]com bas9oiw88remnisn-7[.]com\n\nbas9oiw88remnisn-3[.]com bas9oiw88remnisn-20[.]com bas9oiw88remnisn-8[.]com\n\nbas9oiw88remnisn-23[.]com bas9oiw88remnisn-24[.]com bas9oiw88remnisn-4[.]com\n\nbas9oiw88remnisn-25[.]com romanseyilefreaserty0824r-2[.]com romanseyilefreaserty0824r-1[.]com\n\nsux71a37-net26[.]com sux71a37-net10[.]com sux71a37-net17[.]com\n\nmaills-activitymove02[.]com maills-activitymove04[.]com solution23-servviue-26[.]com\n\nmaills-activitymove01[.]com copris7-yearts-6[.]com copris7-yearts-9[.]com\n\ncopris7-yearts-5[.]com copris7-yearts-8[.]com copris7-yearts-37[.]com\n\nsecurityaccount102[.]com copris7-yearts-4[.]com copris7-yearts-40[.]com\n\ncopris7-yearts-7[.]com copris7-yearts-38[.]com copris7-yearts-39[.]com\n\nromanseyilefreaserty0824r-6[.]com rick845ko-3[.]com rick845ko-2[.]com\n\nrick845ko-10[.]com fasttuamz587-4[.]com winb2as-wwersd76-19[.]com\n\nwinb2as-wwersd76-4[.]com winb2as-wwersd76-6[.]com org77supp-minty662-8[.]com\n\nwinb2as-wwersd76-18[.]com winb2as-wwersd76-1[.]com winb2as-wwersd76-10[.]com\n\norg77supp-minty662-9[.]com winb2as-wwersd76-12[.]com winb2as-wwersd76-20[.]com\n\naccount-info003[.]com account-info012[.]com account-info002[.]com\n\nlaser9078-ter17[.]com account-info011[.]com account-info007[.]com\n\nnotoficationdeliveryamazon1[.]com notoficationdeliveryamazon20[.]com notoficationdeliveryamazon7[.]com\n\nnotoficationdeliveryamazon17[.]com notoficationdeliveryamazon12[.]com contackamazon1[.]com\n\nnotoficationdeliveryamazon6[.]com notoficationdeliveryamazon5[.]com notoficationdeliveryamazon4[.]com\n\nnotoficationdeliveryamazon18[.]com notoficationdeliveryamazon13[.]com notoficationdeliveryamazon3[.]com\n\nnotoficationdeliveryamazon14[.]com gaplerr-xt5[.]com posher876ffffff-29[.]com\n\nkenatipurecehkali-xt3[.]com kenatipurecehkali-xt13[.]com kenatipurecehkali-xt4[.]com\n\nkenatipurecehkali-xt12[.]com kenatipurecehkali-xt5[.]com wtbwts-junet1[.]com\n\nkenatipurecehkali-xt6[.]com hayalanphezor-2sit[.]com hayalanphezor-1sit[.]com\n\nnoticesumartyas-sc24[.]com noticesumartyas-sc13[.]com noticesumartyas-sc2[.]com\n\n\n-----\n\nnoticesumartyas-sc17[.]com noticesumartyas-sc22[.]com noticesumartyas-sc5[.]com\n\nnoticesumartyas-sc4[.]com noticesumartyas-sc21[.]com noticesumartyas-sc25[.]com\n\nappgetbox3[.]com notoficationdeliveryamazon19[.]com notoficationdeliveryamazon10[.]com\n\nappgetbox9[.]com appgetbox8[.]com appgetbox6[.]com\n\nnotoficationdeliveryamazon2[.]com appgetbox7[.]com appgetbox5[.]com\n\nnotoficationdeliveryamazon23[.]com appgetbox10[.]com notoficationdeliveryamazon16[.]com\n\nhvgjgj-shoes08[.]com hvgjgj-shoes13[.]com jgkxjhx-shoes09[.]com\n\nhvgjgj-shoes15[.]com hvgjgj-shoes16[.]com hvgjgj-shoes18[.]com\n\nhvgjgj-shoes20[.]com hvgjgj-shoes12[.]com jgkxjhx-shoes02[.]com\n\nhvgjgj-shoes10[.]com jgkxjhx-shoes03[.]com hvgjgj-shoes11[.]com\n\nhvgjgj-shoes14[.]com jgkxjhx-shoes05[.]com jgkxjhx-shoes04[.]com\n\nhvgjgj-shoes19[.]com jgkxjhx-shoes08[.]com hpk02h21yyts-6[.]com\n\nromanseyilefreaserty0824r-7[.]com gets25-amz[.]net gets30-amz[.]net\n\ngets27-amz[.]net gets28-amz[.]net gets29-amz[.]net\n\ngets32-amz[.]net gets3-amz[.]net gets31-amz[.]net\n\nnoticesumartyas-sc19[.]com noticesumartyas-sc23[.]com noticesumartyas-sc18[.]com\n\nnoticesumartyas-sc15[.]com noticesumartyas-sc20[.]com noticesumartyas-sc16[.]com\n\nnoticesumartyas-sc29[.]com rick845ko-1[.]com bas9oiw88remnisn-9[.]com\n\nrick845ko-5[.]com bas9oiw88remnisn-21[.]com bas9oiw88remnisn-2[.]com\n\nbas9oiw88remnisn-19[.]com rick845ko-6[.]com bas9oiw88remnisn-22[.]com\n\nbas9oiw88remnisn-17[.]com bas9oiw88remnisn-16[.]com adminmabuk103[.]com\n\naccount-info008[.]com suppamz2-piryshj01-3[.]com dak12shub-1[.]com\n\nsecuremanageprodio-02[.]com securemanageprodio-05[.]com securemanageprodio-01[.]com\n\ndak12shub-3[.]com dak12shub-9[.]com dak12shub-8[.]com\n\ndak12shub-6[.]com dak12shub-10[.]com dak12shub-4[.]com\n\nsecuremanageprodio-03[.]com org77supp-minty662-7[.]com winb2as-wwersd76-7[.]com\n\norg77supp-minty662-10[.]com bimspelitskalix-xuer2[.]com gets34-amz[.]net\n\ngets35-amz[.]net service-account-7254[.]com service-account-76357[.]com\n\nservice-account-7247[.]com account-info004[.]com service-account-5315[.]com\n\nbas9oiw88remnisn-14[.]com solution23-servviue-23[.]com organix-xtc18[.]com\n\nromanseyilefreaserty0824r-4[.]com hayalanphezor-7sit[.]com bimspelitskalix-xuer7[.]com\n\nsecuremanageprodio-04[.]com solution23-servviue-15[.]com solution23-servviue-1[.]com\n\n\n-----\n\nsuppamz2-piryshj01-9[.]com suppamz2-piryshj01-6[.]com solution23-servviue-25[.]com\n\nsolution23-servviue-7[.]com solution23-servviue-16[.]com solution23-servviue-11[.]com\n\nsolution23-servviue-27[.]com romanseyilefreaserty0824r-5[.]com cokils2ptys-6[.]com\n\nsolution23-servviue-9[.]com solution23-servviue-19[.]com solution23-servviue-8[.]com\n\nsolution23-servviue-17[.]com solution23-servviue-18[.]com suppamz2-piryshj01-1[.]com\n\nsolution23-servviue-30[.]com solution23-servviue-13[.]com solution23-servviue-12[.]com\n\nsolution23-servviue-10[.]com solution23-servviue-4[.]com solution23-servviue-20[.]com\n\nsolution23-servviue-24[.]com solution23-servviue-5[.]com solution23-servviue-14[.]com\n\nservice-account-7243[.]com service-account-735424[.]com service-account-8457845[.]com\n\nservice-account-374567[.]com service-account-764246[.]com service-account-762441[.]com\n\ngxnhfghnjzh809[.]com xcfhjxfyxnhnjzh10[.]com accountservicealert002[.]com\n\naccountservicealert003[.]com care887-yyrtconsumer23-24[.]com bas9oiw88remnisn-15[.]com\n\ncare887-yyrtconsumer23-23[.]com care887-yyrtconsumer23-27[.]com care887-yyrtconsumer23-25[.]com\n\ncare887-yyrtconsumer23-26[.]com laser9078-ter11[.]com bimspelitskalix-xuer6[.]com\n\nlaser9078-ter10[.]com hayalanphezor-6sit[.]com hayalanphezor-4sit[.]com\n\nhayalanphezor-3sit[.]com romanseyilefreaserty0824r-3[.]com solution23-servviue-6[.]com\n\nressstauww-6279-3[.]com ressstauww-6279-10[.]com sytesss-tas7[.]com\n\nressstauww-6279-7[.]com ressstauww-6279-1[.]com hvgjgj-shoes01[.]com\n\nketiak-muser14[.]com ketiak-muser13[.]com ketiak-muser15[.]com\n\nspammer-comingson01[.]com spammer-comingson02[.]com spammer-comingson04[.]com\n\nspammer-comingson05[.]com spammer-comingson07[.]com posidma-posidjar01[.]com\n\nposidma-posidjar03[.]com posidma-posidjar05[.]com posidma-posidjar06[.]com\n\ntembuslah-bandar01[.]com tembuslah-bandar02[.]com tembuslah-bandar03[.]com\n\ntembuslah-bandar04[.]com tembuslah-bandar05[.]com tembuslah-bandar06[.]com\n\ntembuslah-bandar07[.]com tembuslah-bandar08[.]com tembuslah-bandar09[.]com\n\ntembuslah-bandar10[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-26 - Widespread credential phishing campaign abuses open redirector links.pdf"
    ],
    "report_names": [
        "2021-08-26 - Widespread credential phishing campaign abuses open redirector links.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535958,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653779687,
    "ts_modification_date": 1653779687,
    "files": {
        "pdf": "https://archive.orkl.eu/11c0683e22d9f31952798cccf0d80b5d42671ef7.pdf",
        "text": "https://archive.orkl.eu/11c0683e22d9f31952798cccf0d80b5d42671ef7.txt",
        "img": "https://archive.orkl.eu/11c0683e22d9f31952798cccf0d80b5d42671ef7.jpg"
    }
}