{
    "id": "f1841e81-5c7e-4ff3-91fa-8d1d23c50f62",
    "created_at": "2023-01-12T15:09:02.497162Z",
    "updated_at": "2025-03-27T02:05:21.166523Z",
    "deleted_at": null,
    "sha1_hash": "299dbc52d6a5bebe4585819095d7a76ac42a2197",
    "title": "2018-07-29 - AdKoob information thief targets Facebook ad purchase info",
    "authors": "",
    "file_creation_date": "2022-05-29T01:27:47Z",
    "file_modification_date": "2022-05-29T01:27:47Z",
    "file_size": 684385,
    "plain_text": "# AdKoob information thief targets Facebook ad purchase info\n\n**[news.sophos.com/en-us/2018/07/29/adkoob-information-thief-targets-facebook-ad-purchase-info/](https://news.sophos.com/en-us/2018/07/29/adkoob-information-thief-targets-facebook-ad-purchase-info/)**\n\nFelix Weyne July 29, 2018\n\n**By Felix Weyne**\n\nAt Sophos, we are continuously on the lookout for new threats. One of the systems which\nhelps us in sifting through the daily volume of fresh malware is our sandbox environment,\nwhich gives us the ability to analyze the malware’s dynamic (runtime) behaviour.\n\nRecently, we identified a suspicious executable which showed intriguing behaviour in our\nsandbox. The executable injected code into a legitimate windows binary (svchost.exe), and\nthe injected code triggered one of our memory detections which aims to identify information\n_stealing malware. The injected process ended abruptly and displayed an error message_\nwhich didn’t make any sense relative to the type of code which the process contained: “The\nconfiguration file is missing. Re-installing Easy Backup may fix this problem”.\n\n\n-----\n\nImage one: Decoy messagebox\n\ndisplayed by AdKoob\nThis odd behaviour prompted us to analyze the malware in depth. We took a jump down the\nrabbit hole, leading to the discovery of a previously undocumented threat, which we’re calling\n**AdKoob. It’s a credential stealing malware with a twist: It also exfiltrates data from your**\nFacebook account to an unknown recipient.\n\n### Evading detection and sandbox\n\nIn its effort to avoid being detected, the main AdKoob executable is double-packed: First,\nwith the open source UPX packer, and then with a custom injector. The custom injector uses\na technique called process hollowing to map the malware code in a suspended instance of\nthe Windows Service Host executable. Once mapped, the injector resumes the Service Host\nprocess, at which point the malicious code runs, and the fake error message pops up.\n\nBut when we disassembled AdKoob, we quickly figured out why it throws a fake error\nmessage: AdKoob starts its execution by checking if there is a command line argument\npresent. If there isn’t one, it throws an error, but in one sample I analyzed, it looks for an\nargument of either `'/1c9542b2a8cb' or` `'/mode=debug' .`\n\nImage two: Disassembled start of AdKoob\n\n\n-----\n\nIf whatever process starts the malware passes it the correct argument, AdKoob continues its\nexecution by checking for the presence of `'FC29FA0894FE.ini' in` `%appdata%, which`\nfunctions as a breadcrumb to ensure the malware only gets executed once. If the\nbreadcrumb file exists, the malware terminates immediately.\n\nUsing a built-in command line parameter check is a simple yet crafty anti-sandbox technique,\nsince it is unlikely that an automated sandbox will know in advance which parameter it needs\nto pass to the executable in order to trick it into revealing its true colours.\n\n### Stealing browser credentials\n\nOnce all the evasion checks are satisfied, AdKoob starts its first core task: stealing\nusernames and passwords saved in the browser. To achieve this goal, AdKoob directly\naccesses the file and registry locations where various browsers store the credentials.\n\nAdKoob has to use a few tricks in order to steal data from different browsers. For Chrome\nand older versions of Firefox (prior to version 58), it does a SQL query against the SQLite\ndatabase that these browsers store on disk ( moz_logins for Firefox, and `logins for`\nChrome).\n```\nSELECT encryptedUsername, encryptedPassword, formSubmitURL FROM moz_logins\nSELECT origin_url, username_value, password_value FROM logins\n\n```\nAdKoob accesses the SQLite databases by filename:\n```\nsignons.sqlite (Firefox's SQL credential database)\nGoogle\\Chrome\\User Data\\Default\\Login Data (path to Chrome's database)\n\n```\nRecent versions of Firefox store credentials within a JSON file, which AdKoob is also able to\nquery.\n\nAdditionally AdKoob looks for saved login form credentials of Internet Explorer in the\nfollowing registry location:\n```\nSoftware\\Microsoft\\Internet Explorer\\IntelliForms\\Storage2\n\n```\nAdKoob is able to extract Internet Explorer’s saved ‘Basic Access Authentication’ credentials\n(these are used by certain web applications, sent within specific HTTP headers). It uses the\nGUID string required to generate the cryptographic salt that protects the saved credentials,\nand the prefix needed to distinguish the saved basic access credentials from other\ncredentials in the vault.\n```\nabe2869f-9b47-4cd9-a358-c22904dba7f7 (GUID string used as cryptographic salt)\nMicrosoft_WinInet (Prefix to identify stored Basic access authentication credentials)\n\n### Exfiltrating harvested credentials\n\n```\n\n-----\n\nAfter harvesting the credentials, AdKoob determines the victim s public IP address by making\na HTTP request to either `'useragent.cc' or` `'mybrowserinfo.com' . Besides the`\nvictim’s public IP address, basic information about the machine is also collected.\n\nHarvested browser credentials are encoded and then sent to the attacker over HTTPS, using\ntwo URLs hardcoded in the malware. A separate POST request is made for each browser.\nFor the analyzed sample, the exfiltration URLs (obfuscated here) were:\n```\nhxxps://104[.]200[.]131[.]253:1989/stats1.asp\nhxxps://45[.]32[.]91[.]128:1989/stats1.asp\n\n```\nAn example decoded request looks like:\n```\n3ED4ACD2B09E4389E997B918A9A7ADB4B07A4611BF|Windows NT 6.1<<1.2.3.4|UTC+00:00 GMT\nStandard Time|chrome|Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36\n(KHTML, like Gecko) Chrome/67.0.3396.99\nSafari/537.36{||}aHR0cHM6Ly9hY2NvdW50cy5nb29nbGUuY29tL3NpZ25pbi92Mi9zbC9wd2Q=|dGVzdGNy\n\n```\nThe fields in the decoded request are described below:\n\n**Field** **Data**\n\n\nUnique machine identifier\n(derived from hostname &\nvolume serial number of the\nC-drive)\n\n\n3ED4ACD2B09E4389E997B918A9A7ADB4B07A4611BF\n\n\nOS version Windows NT 6.1\n\nPublic IP (example) 1.2.3.4\n\nVictim’s local timezone UTC+00:00 GMT Standard Time\n\n\nAdKoob’s browser identifier\nstring\n\nUser agent (of the browser\nfrom which the credentials\nwere stolen)\n\nBase64 encoded browser\ncredential(s)\n(website|username|password)\n\n\nchrome\n\nMozilla/5.0 (Windows NT 6.1; Win64; x64)…\n\naHR0cHM6Ly9…|dGVzdGNyZWQ=|U2F2ZU1lIQ==\n\n\nBot identifier yangyangfb\n\n### Facebook profile espionage\n\n\n-----\n\nOnce the saved browser credentials are exfiltrated from the victim s machine, AdKoob starts\nits second core task: establishing a Facebook session and exfiltrating data from the victim’s\nFacebook profile. AdKoob uses two methods to establish a Facebook session.\n\nThe first method relies on using an existing Facebook session stored in the user’s browser\nvia Facebook authentication cookies. AdKoob goes through the victim’s installed browsers,\nand specifically looks for cookies related to the facebook.com domain.\n\nImage Three: AdKoob looking for Facebook cookies stored in Chrome browser\nSimilar to saved credentials, cookies are stored in a SQLite database in Firefox and Chrome.\nWe can easily spot the following SQL queries used by AdKoob to query the cookies:\n```\nSELECT * FROM cookies WHERE cookies.host_key LIKE \"%.facebook.com\";\nSELECT * FROM moz_cookies WHERE moz_cookies.host LIKE \"%.facebook.com\";\n\n```\nBesides Chrome and Firefox, AdKoob also queries the cookies of Internet Explorer and\nMicrosoft Edge for the presence of Facebook cookies.\n\nThe second method involves using the browser credentials AdKoob has already stolen. If\nany of these are for Facebook, AdKoob attempts to log in to Facebook by sending the\nappropriate HTTP requests. If successful, it is able to get hold of additional Facebook\nsession cookies.\n\nOnce successfully authenticated to Facebook, AdKoob proceeds with its espionage payload.\nIt launches a series of requests to a list of Facebook URLs. The malware inspects the\nresponse data from each request using a corresponding set of regular expressions. This\ntechnique enables AdKoob to identify items of interest within the victim’s Facebook profile.\n\nThe first three requests are to the following Facebook URLs:\n```\nhttps://www.facebook.com/\nhttps://www.facebook.com/username/about\nhttps://www.facebook.com/bookmarks/pages\n\n```\nFrom these requests, AdKoob exfiltrates the following data:\n\n\n-----\n\n1.\n\nFacebook Locale (parameter which defines the user’s preferred interface\nlanguage, region)\nFacebook User ID (a string of numbers that doesn’t personally identify a\nFacebook user but does connect to a Facebook user’s profile)\nFacebook Profile username (username chosen by the user, which is used in the\ncustom link to the users’s Facebook profile, e.g. www[.]facebook.com/janedoe3)\nVarious info from the about section of the user’s Facebook profile (including the\nuser’s full name and birthday).\nName(s) of Facebook page(s) the user created\n\n### Interest in advertisement spending\n\nAfter having spied on the victim’s Facebook profile data, AdKoob continues by making a\nseries of interesting requests to an interface which isn’t used by everyday Facebook users,\nrelating to paid advertisement campaigns. Businesses have the possibility to create an\nadvertisement account on Facebook, and use that account to promote a Facebook page or\nwebsite via a specific campaign. Various parameters can be defined by the user, for example\nthe demography of users on which the campaign should focus.\n\nFor each advertisement campaign, the user can define a budget via the Facebook Ads\nmanager interface, where he can also get a clear overview on the results and spending of\nthe advertisement campaign.\n\nImage four: Facebook’s ads manager interface\nAdKoob makes a request to the URL on which this interface is served. It then checks the\nresponse and extracts the ad account ID (a string of numbers which uniquely identify the\nadvertisement account) and the total amount of money which has been spent on\n\n\n-----\n\nadvertisement campaigns.\n\nThe extracted ad account ID is then used to make a query to the Facebook Graph API, a\nprogrammer’s interface which allows a programmer to query information from a Facebook\naccount. The following query is launched by AdKoob:\n```\nact_<adaccountid>/campaigns?date_preset=this_month&fields=\n[\"boosted_action_type\",\"brand_lift_studies\",\"buying_type\",\"effective_status\",\"name\",\"s\n[]&include_headers=false&limit=20&locale=en_US&method=get&pretty=0&sort=\n[\"delivery_info_ascending\",\"spent_descending\",\"stop_time_descending\",\"start_time_desce\n[\"total_count\"]&suppress_http_code=1\n\n```\nThe query and corresponding result can be simulated via the graphical Facebook graph API\nexplorer, a Facebook tool for developers to test their Facebook graph queries, as shown in\nimage five.\n\nImage five: AdKoob’s query emulated in Facebook’s Graph API Explorer\nThe query launched by AdKoob steals various information from advertisement campaigns,\nsuch as its campaign name, amount of money currently spent and the ad campaign’s budget\nlimit.\n\n_This is perhaps the most interesting thing about AdKoob – the payload suggests the_\n_criminals behind the attack are targeting business users. For the simple reason that regular_\n_home users are unlikely to use Facebook advertisement campaigns._\n\nAll the extracted Facebook data gets sent to the same hardcoded URLs as those which were\nused to exfiltrate the browser credentials. In addition to the stolen data from the Facebook\naccount, the Facebook cookies and the Facebook login credentials (if present on the victim’s\nmachine) are also exfiltrated.\n\n\n-----\n\nOnce all exfiltration is complete, AdKoob sends a GET request to a different URL, which\nincludes an identifier based on the user’s Security Identifier (SID):\n```\nhttps://107[.]151[.]152[.]220:5658/down.asp?action=newinstall&u=<identifier>\n\n```\nThis URL is different from the URLs used for data exfiltration, and presumably is used to\ngather statistics about the number of infections.\n\nAs a finale, AdKoob ends its execution by creating the file\n```\n'%appdata%\\FC29FA0894FE.ini', which ensures the malware isn’t run twice. It then self\n```\ndestructs in an attempt to leave no sign that the system was compromised.\n\nSophos detects this threat as Troj/AdKoob-A.\n\n## IOCs\n\nPacked AdKoob sample (SHA256):\ne383582413cc53ec6a630e537eedfeee35d6b5f3495266f2530770f4dd3193a6\n\nUnpacked, analyzed AdKoob sample (SHA256):\n6a6260cb5e1e0ad22af2bc8bb73bc8423df6315a88e39c2264f6def5798b6550\n\nYARA Rule:\n```\nrule adkoob_information_stealer\n{\n  meta:\n    author = \"Felix Weyne, Sophos\"\n  strings:\n    $facebook_cookie_firefox = \"SELECT * FROM moz_cookies WHERE moz_cookies.host\nLIKE \\\"%.facebook.com\\\"\" nocase ascii\n    $facebook_cookie_chrome = \"SELECT * FROM cookies WHERE cookies.host_key LIKE\n\\\"%.facebook.com\\\"\" nocase ascii\n    $facebook_regex_ad_account_id = \"<td [^>]*?datatestid=\\\"all_accounts_table_account_id_cell\\\">([^<>]*?)</td>\" nocase wide\n    $self_destruction = \"/C ping localhost -n 4 > nul & del\" nocase wide\n  condition:\n    all of them\n}\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-07-29 - AdKoob information thief targets Facebook ad purchase info.pdf"
    ],
    "report_names": [
        "2018-07-29 - AdKoob information thief targets Facebook ad purchase info.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536142,
    "ts_updated_at": 1743041121,
    "ts_creation_date": 1653787667,
    "ts_modification_date": 1653787667,
    "files": {
        "pdf": "https://archive.orkl.eu/299dbc52d6a5bebe4585819095d7a76ac42a2197.pdf",
        "text": "https://archive.orkl.eu/299dbc52d6a5bebe4585819095d7a76ac42a2197.txt",
        "img": "https://archive.orkl.eu/299dbc52d6a5bebe4585819095d7a76ac42a2197.jpg"
    }
}