{
    "id": "f1a3c3d6-65df-4a65-a7da-ebf298fe9f87",
    "created_at": "2023-01-12T15:09:06.063914Z",
    "updated_at": "2025-03-27T02:05:30.869107Z",
    "deleted_at": null,
    "sha1_hash": "9eeb86dceb9505d0f8f5a1a9c5dab386018689a6",
    "title": "2021-05-04 - New Panda Stealer Targets Cryptocurrency Wallets",
    "authors": "",
    "file_creation_date": "2022-05-28T03:33:35Z",
    "file_modification_date": "2022-05-28T03:33:35Z",
    "file_size": 671305,
    "plain_text": "# New Panda Stealer Targets Cryptocurrency Wallets\n\n**[trendmicro.com/en_us/research/21/e/new-panda-stealer-targets-cryptocurrency-wallets-.html](https://www.trendmicro.com/en_us/research/21/e/new-panda-stealer-targets-cryptocurrency-wallets-.html)**\n\nMay 4, 2021\n\nFigure 1. The macros script that downloads the Panda Stealer loader\nThe other infection chain involves an attached .XLS file containing an Excel formula that utilizes a PowerShell command\n(Figure 2) to access paste.ee, a Pastebin alternative, that accesses a second encrypted PowerShell command (Figure 3).\n\nFigure 2. Excel formula accessing a paste.ee URL via\n\nPowerShell command\n\nFigure 3. Encoded and decoded PowerShell script from a paste.ee URL\nDecoding these PowerShell scripts revealed that they are used to access paste.ee URLs for easy implementation of fileless\npayloads. The CallByName export function in Visual Basic is used to call the load of a .NET assembly within memory from a\npaste.ee URL. The loaded assembly, obfuscated with an Agile.NET obfuscator, hollows a legitimate MSBuild.exe process\nand replaces it with its payload: the hex-encoded Panda Stealer binary from another paste.ee URL.\n\nOnce installed, Panda Stealer can collect details like private keys and records of past transactions from its victim’s various\ndigital currency wallets, including Dash, Bytecoin, Litecoin, and Ethereum. Not only does it target cryptocurrency wallets, it\ncan steal credentials from other applications such as NordVPN, Telegram, Discord, and Steam. It’s also capable of taking\nscreenshots of the infected computer and exfiltrating data from browsers like cookies, passwords, and cards.\n\nIt drops files under %Temp% folder that stores stolen information under randomized file names, which are then sent to a\ncommand-and-control (C&C) server. Further analysis of its C&C server leads to a login page for \"熊猫Stealer,\" which\ntranslates to “Panda Stealer” (Figure 4), but more domains have been identified with the same login page (Figure 5).\nAnother 14 victims were discovered from the logs of one of these servers.\n\n\n-----\n\nFigure 4. Possible login page for Panda Stealer\n\nFigure 5. Other login pages called \"熊猫Stealer\"\nAnother 264 files similar to Panda Stealer were found on VirusTotal. More than 140 C&C servers (Table 1) and over 10\ndownload sites were used by these samples. Some of the download sites were from Discord, containing files with names\nsuch as \"build.exe,\" which indicates that threat actors may be using Discord to share the Panda Stealer build.\n\nSome of the aforementioned download sites are listed below:\n\nhxxp://23.92.213.108/po/tai1.exe\nhxxp://83.220.175.66/build.exe\nhxxps://bingoroll2.net/chirik.exe\nhxxp://bingoroll2 net/chirik exe\n\n\n-----\n\nhxxp://cryptojora.club/sosi.exe\nhxxp://f0522235.xsph.ru/build.exe\nhxxp://f0522235.xsph.ru/build2.exe\nhxxp://f0522235.xsph.ru/build.exe\nhxxp://micromagican.com/chirik.exe\nhxxp://repairyou.com/henry.exe\nhxxp://traps.ml/build.exe\nhxxp://tydaynsosi.ru/loader/23/1kwo.txt\nhxxp://tydaynsosi.ru/loader/23/1tgk.txt\n\n**C&C servers** **Occurrence per unique file**\n\nhxxp://cocojambo.collector-steal.ga/collect.php 73\n\nhxxp://f0522235.xsph.ru/collect.php 4\n\nhxxp://guarantte.xyz/collect.php 3\n\nhxxp://f0527189.xsph.ru/collect.php 3\n\nhxxp://f0527703.xsph.ru/collect.php 2\n\nhxxp://j1145058.myjino.ru/collect.php 2\n\nhxxp://1wftyu121cwr24v3hswa1234g.tk/collect.php 2\n\nhxxp://f0527262.xsph.ru/collect.php 2\n\nhxxp://steammd0.beget.tech/collect.php 2\n\nTable 1. The top C&C servers used by files that are similar to Panda Stealer\n\n**Attribution**\n\nBased on one of the active C&C servers (Figure 6), we have identified an IP address that we believe was used by the threat\nactor. We believe that this address is assigned to a virtual private server (VPS) rented from Shock Hosting, which the actor\ninfected for testing purposes. The VPS may be paid for using cryptocurrency to avoid being traced and uses the online\nservice Cassandra Crypter (Figure 7). We have reported this to Shock Hosting, and they confirmed that the server assigned\nto this IP address has been suspended.\n\nAnother infected machine was discovered with a history of visiting a Google Drive link, which is also mentioned in a\ndiscussion about AZORult log extractor on an underground forum. The same link and unique cookie were observed on both\nthe log dumps and the forum, therefore the user who posted on the forum must also have access to that log file.\n\n\n-----\n\nFigure 6. Control panel of an active C&C server\n\nFigure 7. Screenshot taken of the threat actor using Cassandra Crypter\n**Similarities with other stealers**\n\n\n-----\n\n[Panda Stealer was found to be a variant of Collector Stealer, which has been sold on some underground forums and a](https://twitter.com/jorgemieres/status/1381982934136205316)\nTelegram channel (Figure 8). Collector Stealer has since been cracked by a Russian threat actor called NCP, also known as\nsu1c1de. Comparing the compiled executables of the cracked Collector Stealer and Panda Stealer shows that the two\nbehave similarly, but have different C&C URLs, build tags, and execution folders (Figure 9). Like Panda Stealer, Collector\nStealer exfiltrates information like cookies, login data, and web data from a compromised computer, storing them in an\nSQLite3 database. It also covers its tracks by deleting its stolen files and activity logs after its execution (Figure 10).\n\nFigure 8. Telegram channel that sells Collector Stealer\n\n\n-----\n\nFigure 9. The compiled executable of the cracked Collector Stealer (left) and the Panda Stealer sample (right)\n\nFigure 10. The activity logs of an earlier Collector Stealer version (left) and Panda Stealer (right)\nBecause the cracked Collector Stealer builder is openly accessible online, cybercriminal groups and script kiddies alike can\nuse it to create their own customized version of the stealer and C&C panel. Threat actors may also augment their malware\ncampaigns with specific features from Collector Stealer. We have also discovered that Panda Stealer has an infection chain\n[that uses the same fileless distribution method as the \"Fair\" variant of Phobos ransomware to carry out memory-based](https://blog.morphisec.com/the-fair-upgrade-variant-of-phobos-ransomware)\nattacks, making it more difficult for security tools to spot.\n\n**Protect your network from spammed threats**\n\nTo protect systems against fileless threats that use spam emails as vectors, enterprises can use the Trend Micro endpoint\n[solutions such as Trend Micro Smart Protection Suites and](https://www.trendmicro.com/en_us/business/products/user-protection/sps.html) [Worry-Free™ Business Security. Both solutions protect users](https://www.trendmicro.com/en_us/small-business/worry-free.html)\nand businesses from threats by detecting malicious files and spammed messages and blocking all related malicious URLs.\n\n**Indicators of compromise**\n\nThere were numerous files, domains, and IP addresses that were involved in this attack. Trend Micro has provided detection\nfor the malicious artifacts found in this investigation. A partial list of the notable items is detailed below:\n\n**SHA256** **Trend Micro Detection Name**\n\n\n-----\n\n6413be289cf38c2462bd8c6b8bad47f8d953f399e1ccba30126a1fb70d13a733 Trojan.X97M.PANDASTEAL.AA\n\n4ff1f8a052addbc5a0388dfa7f32cc493d7947c43dc7096baa070bfc4ae0a14e Trojan.Win32.PHOBOS.B\n\n0a9f466fb5526fd512dd48c3ba9551dbd342bdb314a87d5c6f730d3c80041da6 TrojanSpy.X97M.PANDASTEAL.THDABBA\n\n05d38ac5460418b0aa813fc8c582ee5be42be192de10d188332901157c54287c TrojanSpy.Win32.PANDASTEAL.THDABBA\n\n1efa74e72060865ff07bda90c4f5d0c470dd20198de7144960c88cef248c4457 TrojanSpy.Win32.PANDASTEAL.THDABBA\n\n**URLs**\n\nhxxp://23.92.213.108/po/aXSz3[.]exe\nhxxp://23.92.213.108/po/tai1[.]exe\nhxxp://prtboss.com/collect[.]php\nhxxp://biscosuae[.]com\nhxxp://prtanet[.]com\nhxxps://paste.ee/r/pLpR9\nhxxps://paste.ee/r/Qsowz\nhxxps://paste.ee/r/6toiY\nhxxp://cocojambo.collector-steal.ga/collect.php\nhxxp://f0522235.xsph.ru/collect.php\nhxxp://guarantte.xyz/collect.php\nhxxp://f0527189.xsph.ru/collect.php\nhxxp://f0527703.xsph.ru/collect.php\nhxxp://j1145058.myjino.ru/collect.php\nhxxp://1wftyu121cwr24v3hswa1234g.tk/collect.php\nhxxp://f0527262.xsph.ru/collect.php\n\nMalware\n\nIn early April, we observed a new information stealer called Panda Stealer being delivered via spam emails. Based on Trend\nMicro's telemetry, United States, Australia, Japan, and Germany were among the most affected countries during a recent\nspam wave.\n\nBy: Monte de Jesus, Fyodor Yarochkin, Paul Pajares May 04, 2021 Read time: ( words)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-04 - New Panda Stealer Targets Cryptocurrency Wallets.pdf"
    ],
    "report_names": [
        "2021-05-04 - New Panda Stealer Targets Cryptocurrency Wallets.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536146,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653708815,
    "ts_modification_date": 1653708815,
    "files": {
        "pdf": "https://archive.orkl.eu/9eeb86dceb9505d0f8f5a1a9c5dab386018689a6.pdf",
        "text": "https://archive.orkl.eu/9eeb86dceb9505d0f8f5a1a9c5dab386018689a6.txt",
        "img": "https://archive.orkl.eu/9eeb86dceb9505d0f8f5a1a9c5dab386018689a6.jpg"
    }
}