{
    "id": "f1bfe551-58ae-4c38-a2be-bb4c503d9f9e",
    "created_at": "2023-01-12T15:07:22.714849Z",
    "updated_at": "2025-03-27T02:14:11.709909Z",
    "deleted_at": null,
    "sha1_hash": "4d1ab373df0852e6df55bf468229b4323a60f667",
    "title": "2016-10-05 - FastPOS Updates in Time for the Retail Sale Season",
    "authors": "",
    "file_creation_date": "2014-01-21T09:58:50Z",
    "file_modification_date": "2014-01-21T10:36:40Z",
    "file_size": 2544303,
    "plain_text": "## Cisco 2014  Annual Security Report\n\n\n-----\n\n### Executive Summary\n\n###### The Trust Problem\n\n The exploitation of trust is a common mode of operation for online attackers and other\n\n malicious actors. They take advantage of users’ trust in systems, applications, and the people\n\n and businesses they interact with on a regular basis. And this approach works: There is \n\n ample evidence that adversaries are coming up with new methods for embedding their\n\n malware in networks, remaining undetected for long periods, and stealing data or disrupting\n\n critical systems.\n\n Using methods ranging from the socially engineered theft of passwords and credentials to\n\n stealthy, hide-in-plain-sight infiltrations that execute in minutes, malicious actors continue to\n\n exploit public trust to effect harmful consequences. However, the trust problem goes beyond\n\n criminals exploiting vulnerabilities or preying on users through social engineering: it undermines\n\n confidence in both public and private organizations.\n\n Today’s networks are facing two forms of trust erosion. One is a decline in customer\n\n confidence in the integrity of products. The other is mounting evidence that\n\n malicious actors are defeating trust mechanisms, thus calling into\n\n question the effectiveness of network and application assurance,\n authentication, and authorization architectures. Malicious \n actors continue \n In this report, Cisco offers data on and insights into top\n to innovate ways to \n security concerns, such as shifts in malware, trends in\n exploit public trust to \n vulnerabilities, and the resurgence of distributed denial-of service (DDoS) attacks. The report also looks at campaigns effect harmful\n that target specific organizations, groups, and industries, consequences.\n and the growing sophistication of those who attempt to steal\n\n sensitive information. The report concludes with recommendations\n\n for examining security models holistically and gaining visibility across the\n\n entire attack continuum—before, during, and after an attack.\n\n\n-----\n\n###### Key Discoveries\n\n Below are three key findings from the Cisco 2014 Annual Security Report:\n\n Attacks against infrastructure are targeting significant resources across the Internet.\n\n • \u0007Malicious exploits are gaining access to web hosting servers, nameservers, and data centers. This suggests the forming of überbots that seek high-reputation and resource-rich assets.\n\n • \u0007Buffer errors are a leading threat, at 21 percent of the Common Weakness Enumeration (CWE) threat categories.\n\n • \u0007Malware encounters are shifting toward electronics manufacturing and the agriculture and mining industries at about six times the average encounter rate across industry verticals.\n\n Malicious actors are using trusted applications to exploit gaps in perimeter security.\n\n • Spam continues its downward trend, although the proportion of maliciously intended spam remains constant.\n\n • \u0007Java comprises 91 percent of web exploits; 76 percent of companies using Cisco Web Security services are running Java 6, an end-of-life, unsupported version.\n\n • “Watering hole” attacks are targeting specific industry-related websites to deliver malware.\n\n Investigations of multinational companies show evidence of internal compromise. Suspicious traffic is emanating from their networks and attempting to connect to questionable sites (100 percent of companies are calling malicious malware hosts).\n\n • \u0007Indicators of compromise suggest network penetrations may be undetected over long periods.\n\n • Threat alerts grew 14 percent year over year; new alerts (not updated alerts) are on the rise.\n\n • \u0007Ninety-nine percent of all mobile malware in 2013 targeted Android devices. Android users also have the highest encounter rate (71 percent) with all forms of web-delivered malware.\n\n\n-----\n\n### Report Content\n\n###### The Cisco 2014 Annual Security Report presents security insights across four key areas:\n\n Trust\n\n All organizations should be concerned about finding the right\n\n balance of trust, transparency, and privacy because much is\n\n at stake. In this area, we address three pressures that make\n\n security practitioners’ attempts to help their organizations\n\n achieve this balance even more challenging:\n\n#### • [Greater attack surface area]\n • [Proliferation and sophistication of the attack model]\n • [Complexity of threats and solutions]\n\n###### Threat Intelligence\n\n Using the largest set of detection telemetry available, Cisco\n\n and Sourcefire together have analyzed and assembled\n\n security insights from the past year:\n\n#### • [Attacks against infrastructure are targeting significant ]\n\n###### resources across the Internet.\n\n#### • [Malicious actors are using trusted applications to exploit ]\n\n###### gaps in perimeter security.\n\n#### • [Indicators of compromise suggest that network ]\n\n###### penetrations may be undetected over long periods.\n\n\n-----\n\n###### practices—from brute-force login attempts, large-scale DDoS\n\n activity, and ransomware efforts to the growing reliance on\n\n the cloud, lack of security talent, and other concerns.\n\n Recommendations\n\n Organizations are facing a greater attack surface, the\n\n growing proliferation and sophistication of attack models,\n\n and increasing complexity within the network. Many are\n\n struggling to solidify a security vision supported by an\n\n effective strategy that uses new technologies, simplifies \n\n their architecture and operations, and strengthens their\n\n security teams.\n\n This section covers how a threat-centric security model\n\n enables defenders to address the full attack continuum,\n\n across all attack vectors, and to respond at any time, all \n\n the time, in a continuous fashion—before, during, and after \n\n an attack.\n\n\n-----\n\n###### How Cisco Evaluates the Threat Landscape\n\n Cisco plays a critical role in evaluating threats, given the prevalence of its solutions and \n\n the breadth of its security intelligence:\n\n [16 billion web requests][ are inspected every day through Cisco Cloud Web Security]\n\n#### •\n\n###### [93 billion emails][ are inspected every day by Cisco’s hosted email solution]\n\n#### •\n\n###### [200,000 IP addresses][ are evaluated daily]\n\n#### •\n\n###### [400,000 malware samples][ are evaluated daily]\n\n#### •\n\n###### [33 million endpoint files][ are evaluated every day by FireAMP]\n\n#### •\n\n###### [28 million network connects][ are evaluated every day by FireAMP]\n\n#### •\n\n###### This activity results in the following threats being detected by Cisco:\n\n [4.5 billion emails][ are blocked every day]\n\n#### •\n\n###### [80 million web requests][ are blocked every day]\n\n#### •\n\n###### [6450 endpoint file][ detections occur every day in FireAMP]\n\n#### •\n\n###### [3186 endpoint network detections][ occur every day in FireAMP]\n\n#### •\n\n###### [50,000 network intrusions][ are detected every day]\n\n#### •\n\n\n-----\n\n### Table of Contents\n\n###### Trust...........................................................................................................................8\n\nNew Ways of Doing Business, New Security Gaps........................................................................ 9\nAn Erosion of Trust........................................................................................................... 11\nPrimary Security Challenges for 2014...................................................................................... 12\nTrustworthy, Transparent Systems.......................................................................................... 16\n\n###### Threat Intelligence............................................................................................. 20\n\nThreat Alerts on the Rise.................................................................................................... 21\nSpam Volume Is Down, but Malicious Spam Is Still a Threat............................................................. 24\nWeb Exploits: Java Leads the Pack....................................................................................... 28\nBYOD and Mobility: Device Maturation Benefitting Cybercrime......................................................... 32\nTargeted Attacks: The Challenge of Dislodging Persistent and Pervasive “Visitors”.................................. 36\nMalware Snapshot: Trends Observed in 2013............................................................................ 38\nPrime Targets: Industry Verticals............................................................................................ 41\nFractures in a Fragile Ecosystem.......................................................................................... 43\nMalicious Traffic, Often a Sign of Targeted Attacks, Detected in All Corporate Networks............................ 48\n\n###### Industry................................................................................................................. 52\n\nBrute-Force Login Attempts a Favored Tactic to Compromise Websites.............................................. 53\nDDoS Attacks: What’s Old Is New Again.................................................................................. 55\nDarkSeoul.................................................................................................................... 57\nThe Security Talent Shortage and Solutions Gap........................................................................ 60\nCloud as a New Perimeter.................................................................................................. 61\n\n###### Recommendations............................................................................................ 63\n\nObjectives for 2014: Verifying Trustworthiness and Improving Visibility................................................ 64\n\n###### Appendix.............................................................................................................. 67\n\nSecurity Organizations Need Data Scientists............................................................................. 68\n\n###### About Cisco SIO................................................................................................ 77\n\nCisco SIO.....................................................................................................................78\n\n\n###### About This Document\n\nThis document contains searchable and shareable content.\n\nLook for this icon to open the find feature in Adobe Acrobat.\n\nL k f h i h\n\n##### [ ]\n\n\n###### Recommended Software\n\nAdobe Acrobat Version 7.0 and above\n\n\n-----\n\n# Trust\n\n###### All organizations should be concerned about finding the right balance  of trust, transparency, and privacy because much is at stake.\n\n\n-----\n\n##### [\n\n\n### New Ways of Doing Business, New Security Gaps\n\n###### Weak links in the technology supply chain are one facet of today’s complex cyberthreat and risk landscape.\n\n So, too, is the emergence of the any-to-any infrastructure, where any device in any location\n\n may be coming over any instantiation of the network.[1] There is also a growing abundance of\n\n Internet-enabled devices—smartphones, tablets, and more—trying to connect to applications\n\n that could be running anywhere, including a public software-as-a-service (SaaS) cloud, a\n\n private cloud, or a hybrid cloud.[2] Even basic Internet infrastructure services have become a\n\n target for hackers who want to take advantage of the reputation, bandwidth, and continuous\n\n uptime and availability of web hosting servers, nameservers, and data centers to launch\n\n increasingly larger campaigns. (See “Fractures in a Fragile Ecosystem,” page 43.)\n\n While trends such as cloud computing and mobility are reducing visibility\n\n and increasing security complexity, organizations must still embrace\n\n them because they’re critical to their competitive advantage\n\n and business success. But security gaps are emerging—and\n\n widening—as security teams try to align traditional solutions\n Basic Internet\n with new and rapidly evolving ways of doing business.\n infrastructure has \n Meanwhile, malicious actors are working faster to exploit\n become a target \n the gaps that nonintegrated point solutions simply cannot\n for hackers.\n address. And they are succeeding because they have the\n\n\n###### resources to be more nimble.\n\n\n##### ]\n\n\n###### The cybercrime network is expanding, strengthening, and,\n\n increasingly, operating like any legitimate, sophisticated business\n\n network. Today’s cybercriminal hierarchy is like a pyramid (see Figure 1). At the bottom are\n\n the nontechnical opportunists and “crimeware-as-a-service” users who want to make money,\n\n a statement, or both with their campaigns. In the middle are the resellers and infrastructure\n\n maintainers—the “middlemen.” At the top are the technical innovators—the major players who\n\n law enforcement seeks most, but struggles to find.\n\n\n-----\n\n##### [\n\n\n###### Modern cybercriminals usually have clear business objectives when launching their exploits.\n\n They know what information they’re seeking or what outcomes they want to achieve, and they\n\n know the path they need to take to reach these goals. Adversaries will spend significant time\n\n researching their targets, often through publicly available information on social networks, and\n\n planning their objectives strategically.\n\n Many actors in the so-called “shadow economy” also now send surveillance malware to\n\n collect information about an environment, including what security technology is deployed, so\n\n they can target their attacks. This pre-exploit reconnaissance is how some malware writers\n\n can be sure their malware will work. Once embedded in a network, the advanced malware\n\n they design can communicate with command-and-control servers on the outside and spread\n\n laterally across infrastructure to carry out its mission—whether it’s the theft of vital data or the\n\n\n###### disruption of critical systems.\n\n\n##### ]\n\n\nFigure 1 \u0003\n###### The Cybercriminal Hierarchy\n\n\n-----\n\n### An Erosion of Trust\n\n###### Threats designed to take advantage of users’ trust in systems, applications, and the people and businesses they know are now permanent fixtures in the cyber world.\n\n Dissect almost any scheme and at the core is some abuse of trust: Malware delivered to\n\n users legitimately browsing mainstream websites. Spam emails that appear to be sent by well\n known companies but contain links to malicious sites. Third-party mobile applications laced\n\n with malware and downloaded from popular online marketplaces. Insiders using information\n\n access privileges to steal intellectual property from employers.\n\n There should be an assumption by all users, perhaps, that nothing in the cyber world can\n\n or should be trusted. And security professionals may do their organizations a service by not\n\n trusting any network traffic[3]—or by not having full faith in the security\n\n practices of vendors or the supply chains that provide technology\n\n to the enterprise. Yet organizations in the public and private\n There should \n sectors, individual users, and even nation-states still want\n be an assumption \n assurance that they can trust the foundational technologies\n by all users, that \n they rely on every day.\n nothing in the cyber \n This need for confidence in security has helped to further\n world can or should \n the advancement of the Common Criteria for Information\n be trusted.\n Technology Security Evaluation (Common Criteria), the\n\n language and framework that allows government agencies and\n\n other groups to define the requirements that technology products\n\n must meet to assure they are trustworthy. Today, 26 countries, including the\n\n United States, are participating in the Common Criteria Recognition Arrangement, a \n\n multilateral agreement that provides for mutual recognition of evaluated products by\n\n participating governments.\n\n However, in 2013, trust, in general, suffered a setback. The catalyst: Edward Snowden.\n\n The former U.S. government contractor leaked classified information to The Guardian, a\n\n U.K. newspaper—information he obtained while working on assignment for the U.S. National\n\n Security Agency (NSA).[4]\n\n\n-----\n\n##### [\n\n\n###### Snowden’s disclosures to the media to date include details about the NSA’s electronic\n\n surveillance and data collection program, PRISM,[5] as well as a separate NSA-GCHQ[6] program\n\n known as MUSCULAR, through which fiber-optic networks carrying traffic from the overseas\n\n data centers of major Internet companies were allegedly tapped.[7]\n\n These and other revelations by Snowden about government surveillance practices have\n\n eroded trust on many levels: between nation-states, between governments and the private\n\n sector, between private citizens and their governments, and between private citizens and\n\n organizations in the public and private sector. They also have naturally raised concerns about\n\n the presence and potential risks of both unintentional vulnerabilities and intentional “backdoors”\n\n in technology products—and whether vendors are doing enough to prevent these weaknesses\n\n and protect end users.\n\n### Primary Security Challenges  for 2014\n\n###### As trust erodes—and it becomes harder to define which systems and relationships are trustworthy and which are not—organizations face several key issues that undermine their ability to address security:\n\n 1 | Greater attack surface area\n\n 2 | Proliferation and sophistication of the attack model\n\n\n###### 3 | Complexity of threats and solutions\n\n\n##### ]\n\n\n###### These combined issues create and exacerbate the security gaps that allow malicious actors to\n\n launch exploits faster than organizations can address their security weaknesses.\n\n These threats and risks are examined in more detail on the following pages.\n\n\n-----\n\n###### 1 | Greater Attack Surface Area\n\n Today’s attack surface presents endless possibilities for malicious actors to undermine a large\n\n and fragile security ecosystem. The surface has increased exponentially and is still expanding—\n\n so many endpoints, so many inroads, so much data that’s not under enterprise control.\n\n Data is the prize most adversaries want to reach through their campaigns because it is\n\n essentially currency. If data has any “street value”—whether it’s a major corporation’s intellectual\n\n property or an individual’s healthcare data—it is desirable and, therefore, at risk. If the value of\n\n the target is greater than the risk of compromising it, it will be hacked. Even small organizations\n\n are at risk of being hacked. And most organizations, large and small, have already been\n\n compromised and don’t even know it: 100 percent of business networks analyzed by Cisco\n\n have traffic going to websites that host malware.\n\nFigure 2 \u0003\n###### The Anatomy of a Modern Threat\n\n\n###### Internet & Cloud Apps\n\nPublic Network\n\n\n###### Campus\n\nPerimeter\n\n\n###### Enterprise\n\nData Center\n\n\nInfection entry point occurs Advanced cyberthreat Threat spreads and attempts to\noutside the enterprise bypasses perimeter defense exfiltrate valuable data\n\n\n-----\n\n###### The anatomy of a modern threat, outlined in Figure 2, underscores how the end goal of many\n\n cybercrime campaigns is to reach the data center and exfiltrate valuable\n\n data. In this example, a malicious action occurs on a device outside\n\n the corporate network. It causes an infection, which moves to a\n The end goal \n campus network. That network serves as a launchpad to the\n enterprise network, and then the threat makes its way to the of many cybercrime\n treasure trove: the data center. campaigns is to \n reach the data center \n In light of the expanding attack surface area and the targeting\n and exfiltrate \n of high-value data by hackers, Cisco security experts\n valuable data.\n recommend that enterprises seek to answer two important\n\n questions in 2014: “Where does our critical data reside?” and\n\n “How can we create a secure environment to protect that data,\n\n especially when new business models like cloud computing and mobility\n\n leave us with little control over it?”\n\n 2 | Proliferation and Sophistication of the Attack Model\n\n Today’s threat landscape is nothing like that of just 10 years ago. Simple attacks that caused\n\n containable damage have given way to modern cybercrime operations that are sophisticated,\n\n well-funded, and capable of causing major disruption to organizations.\n\n Companies have become the focus of targeted attacks. These attacks are very difficult to\n\n detect, remain in networks for long periods of time, and amass network resources to launch\n\n attacks elsewhere.\n\n To cover the entire attack continuum, organizations need to address a broad range of attack\n\n vectors with solutions that operate everywhere the threat can manifest itself: on the network,\n\n on endpoints, on mobile devices, and in virtual environments.\n\n “Where does our critical data reside?” and “How can we create a secure environment to protect that data, especially when new business models like cloud computing and mobility leave us with little control over it?”\n Cisco security experts\n\n\n-----\n\n###### 3 | Complexity of Threats and Solutions\n\n Gone are the days when spam blockers and antivirus software could help guard an easily\n\n defined network perimeter from most threats. Today’s networks go beyond traditional\n\n boundaries, and constantly evolve and spawn new attack vectors: mobile devices, web-enabled\n\n and mobile applications, hypervisors, social media, web browsers, home computers, and even\n\n vehicles. Point-in-time solutions can’t respond to the myriad technologies and strategies in\n\n use by malicious actors. This makes monitoring and managing information security even more\n\n difficult for security teams.\n\n Organizational vulnerabilities are increasing because enterprises\n are working through disaggregated point solutions and multiple Point-in-time \n management platforms. The result: a set of disparate\n solutions can’t \n technologies across control points that were never designed\n respond to the myriad\n to work together. This increases the potential for the\n technologies and\n compromise of customer information, intellectual property,\n strategies in \n and other sensitive information, and puts a company’s\n use by malicious \n reputation at risk.\n actors.\n A continuous capability that provides the best opportunity to meet\n\n the challenges of complex threat environments is needed. Relentless\n\n attacks do not occur at a single point in time; they are ongoing. So, too,\n\n should be a company’s defenses.\n\n With the complexity of threats and corresponding solutions at an all-time high, organizations\n\n need to rethink their security strategy. Instead of relying on point solutions, they can minimize\n\n complexity by continuously integrating security into the fabric of the network itself, so the\n\n network can:\n\n#### • [Continuously monitor and analyze files and identify subsequent malicious ]\n\n###### behavior whenever it may begin.\n\n#### • [Help organizations scale enforcement, expanding the surface on which ]\n\n###### networking devices can be placed.\n\n#### • [Accelerate the time to detection because it can see more traffic.]\n • [Give organizations the ability to aggregate unique context awareness that ]\n\n###### is not possible to obtain by relying on security-specific devices alone.\n\n\n-----\n\n###### The shift toward mobility and cloud services is placing a greater security burden on endpoints\n\n and mobile devices that in some cases may never even touch the corporate\n\n network. The fact is that mobile devices introduce security risk\n\n when they are used to access company resources; they easily\n\n connect with third-party cloud services and computers with\n Mobile devices \n security postures that are potentially unknown and outside\n introduce security \n of the enterprise’s control. In addition, mobile malware is\n risk when they \n growing rapidly, which further increases risk. Given the lack\n are used to access \n of even basic visibility, most IT security teams don’t have the\n company \n capability to identify potential threats from these devices.\n resources.\n Advanced approaches such as continuous capability will play\n\n a greater role in addressing advanced malware through big data\n\n analytics that aggregate data and events across the extended network\n\n to provide greater visibility even after a file has moved into the network or between endpoints.\n\n This differs from point-in-time endpoint security that scans files at an initial point in time to\n\n determine a malware disposition. Advanced malware can evade this scan to establish itself\n\n quickly on endpoints and spread throughout networks.\n\n### Trustworthy, Transparent Systems\n\n###### In light of the greater attack surface area, growing proliferation and sophistication of the attack model, and the complexity of threats and solutions, we need to trust the information we consume, along with the systems that deliver it, no matter how we access networked services.\n\n Creating a truly secure network environment becomes even more complex as governments\n\n and businesses invest in mobility, collaboration, cloud computing, and other forms of\n\n virtualization. These capabilities help to improve resiliency, increase efficiency, and reduce\n\n costs, but also can introduce additional risks. The security of the manufacturing processes\n\n\n-----\n\n###### creating IT products is also now at risk, with counterfeit and tampered products becoming\n\n a growing problem. As a result, today’s government and corporate leaders overwhelmingly\n\n identify cybersecurity and associated trust issues as top concerns. The question security\n\n practitioners should ask is: What would we do differently if we knew a compromise \n\n were imminent?\n\n Malicious actors will seek out and exploit any security weakness in the technology supply\n\n chain. Vulnerabilities and intentional backdoors in technology products can ultimately provide\n\n them with access to the “full house.” Backdoors have long been a security issue and should\n\n be a concern for organizations, because they exist solely to help facilitate surreptitious or\n\n criminal activity.\n\n Developing trustworthy systems means building in security from the ground up, from the\n\n beginning to the end of a product’s life cycle. The Cisco Secure Development\n\n Life cycle (CSDL)[8] prescribes a repeatable and measurable\n\n methodology designed to build in product security at the product\n\n concept stage, minimize vulnerabilities during development, and\n Malicious actors \n increase resiliency of products in the face of an attack.\n will seek out and \n Trustworthy systems provide the foundation for a continuous exploit any security\n improvement approach to security that anticipates and weakness in the\n preempts new threats. Such infrastructures not only protect technology \n critical information, but more importantly, help to avoid\n supply chain.\n interruptions of critical services. Trustworthy products supported\n\n by trusted vendors enable their users to minimize the costs and\n\n reputation damage stemming from information misappropriation, service\n\n outages, and information breaches.\n\n Trustworthy systems, however, should not be confused with immunity from an external\n\n attack. IT customers and users have an important role to play in maintaining the effectiveness\n\n of trustworthy systems in fending off attempts to corrupt their operations. This includes\n\n timely installation of security-focused updates and patches, constant vigilance in recognizing\n\n abnormal system behavior, and effective countermeasures against attack.\n\n\n-----\n\n###### Top Concerns for 2014  from Today’s CISOs\n\n As chief information security officers (CISOs) survey today’s threat landscape, they are faced with growing pressure to protect terabytes of data, meet stiff compliance regulations, and evaluate risks of working with third-party vendors—and doing it all with shrinking budgets and lean IT teams. CISOs have more tasks than ever and sophisticated, complex threats to manage. Principal security strategists for Cisco security services, who advise CISOs on security approaches for their organizations, offer this list of the most pressing concerns and challenges for 2014:\n\n Managing Compliance\n\n The most pervasive concern among CISOs may be the need to protect data that resides throughout an increasingly porous network, while expending precious resources on compliance. Compliance alone is not equal to being secure—it is simply a minimum baseline focusing on the needs of a special regulated environment. Security, meanwhile,  is an all-encompassing approach that covers all business activities.\n\n Trusting the Cloud\n\n CISOs must make decisions on how to manage information safely with the finite budgets and time they are allotted. For example, the cloud\n\n_Continues on next page_\n\n\n###### Technologies do not stand still, and neither do attackers.\n\n Ensuring system trustworthiness needs to cover the full\n\n life cycle of a network, from initial design to manufacturing,\n\n system integration, daily operation, maintenance and\n\n updates, and ultimately, to decommissioning of the solution.\n\n The need for trustworthy systems extends beyond an\n\n organization’s own network to include those networks with\n\n which an organization connects. Cisco Security Research\n\n and Operations teams have observed increased use\n\n over the past year of “pivoting.” The pivoting technique in\n\n cybercrime involves the use of a backdoor, vulnerability, or\n\n simple exploitation of trust at some point in the attack chain\n\n as a springboard to launch a more sophisticated campaign\n\n against much bigger targets—such as the network of a major\n\n energy firm or a financial institution’s data center. Some\n\n hackers use the trust that exists between organizations as\n\n the base for a pivot, exploiting one trusted business partner\n\n to target and exploit another unsuspecting trusted business\n\n or governmental partner.\n\n Vigilance is appropriate in the modern threat landscape.\n\n Security must adapt to all the transient states that are part of\n\n the enterprise IT environment by measurably and objectively\n\n validating system trustworthiness, based on independent\n\n confirmable data and processes. The most sustainable\n\n approach is a dynamic defense tailored to an organization’s\n\n unique environment, which includes security controls that are\n\n evolved constantly so they remain relevant.[9]\n\n Trustworthy systems can exist in this environment, and\n\n transparency is essential to building them. “A trustworthy\n\n system must be built on a strong foundation: product\n\n development practices, a trustworthy supply chain, and\n\n an architectural approach consisting of network design,\n\n implementation, and policies,” says John N. Stewart, \n\n\n-----\n\n_Continued from previous page_\n\n###### has become a cost-effective and agile way to manage ever-growing storehouses of data, but it raises more worries for CISOs. Chief executive officers and boards of directors see the cloud as a panacea for eliminating costly hardware. They want the benefits of offloading data to the cloud, and expect the CISO to make it happen—securely and quickly.\n\n Trusting Vendors\n\n As with the cloud, organizations tap into vendors to provide specialized solutions. The cost model for going with third parties makes sense. However, these vendors are high- value targets for criminals, who know that third-party defenses may not be as strong.\n\n Bouncing Back from Security Breaches\n\n All organizations should assume they’ve been hacked, or at least agree that it’s not a question of if they will be targeted for an attack, but when. Recent hacks such as Operation Night Dragon, the RSA breach, and the Shamoon attack against a large oil and gas company in 2012 are on the minds of many CISOs. (See Cisco’s research about the prevalence of malicious activity in corporate networks on page 48.)\n\n\n###### Today’s organizations must consider what impact their\n\n security practices may have on the larger and increasingly\n\n complex and interconnected cybersecurity ecosystem. Not\n\n taking this “big picture” view could result in an organization\n\n earning a bad reputation score, which means no leading\n\n security provider will allow users to access their site. Being\n\n blacklisted is not easy for a business to come back from—and\n\n some may never fully recover.\n\n To learn more about Cisco Trustworthy Systems practices,\n\n please visit www.cisco.com/go/trustworthy.\n\n\n\n##### [\n\n\n###### senior vice president and chief security officer at Cisco. “But\n\n the most important attribute is vendor transparency.”\n\n The trade-off for more transparency is less privacy,\n\n but finding the right balance can be achieved through\n\n cooperation—which leads to greater opportunities to\n\n align threat intelligence and security best practices. All\n\n organizations should be concerned about finding the right\n\n balance of trust, transparency, and privacy because much \n\n is at stake.\n\n In the long term, better cybersecurity can be achieved for\n\n all users, and the full potential of the emerging Internet of\n\n Everything[10] economy can be realized. But meeting these\n\n goals will hinge on effective privacy policies and robust\n\n network defenses that intelligently distribute the burden\n\n of security across the endpoints and the network. In the\n\n short term, and closer to home perhaps, is the need for any\n\n modern business to use the best methods and information\n\n available to help protect its most valuable assets, and\n\n ensure it is not a direct contributor to broader cybersecurity\n\n\n###### challenges.\n\n\n##### ]\n\n\n-----\n\n# Threat Intelligence\n\n###### Using the largest set of detection telemetry with which to work,  Cisco and Sourcefire together have analyzed and assembled  security insights from the past year.\n\n\n-----\n\n### Threat Alerts on the Rise\n\n###### Vulnerabilities and threats reported by Cisco IntelliShield® showed steady growth in 2013: as of October 2013, cumulative annual alert totals increased 14 percent year-over-year from 2012 (Figure 3).\n\n Alerts in October 2013 were at their highest level since IntelliShield began recording them in\n\n May 2000.\n\n Also notable is the significant increase in new alerts as opposed to updated alerts, as tracked\n\n by IntelliShield (Figure 4). Technology vendors and researchers are finding an increasing\n\n number of new vulnerabilities (Figure 5), the discoveries being a result of the greater emphasis\n\n on highly secure development life cycle use, as well as improvements in the security of their\n\n own products. The higher number of new vulnerabilities may also be a sign that vendors are\n\n examining their product code and fixing vulnerabilities before products are released and their\n\n vulnerabilities exploited.\n\nFigure 3\n###### Cumulative Annual Alert Totals, 2010-2013\n\n7000 2013\n\n2012\n\n6000\n\n2011\n\n5000 2010\n\n4000\n\n3000\n\n2000\n\n1000\n\n0\nJan. Feb. Mar. Apr. May Jun. Jul. Aug. Sep. Oct. Nov. Dec.\n\nMonth\n\n\n-----\n\n###### More attention to secure software development can help build trust in vendor solutions. \n\n A secure development life cycle not only mitigates the risk of vulnerabilities and allows vendors\n\n to detect potential defects early in development, but also tells purchasers that they can rely \n\n on these solutions.\n\nFigure 4\n###### New and Updated Alerts, 2013\n\n\n-----\n\nFigure 5\n###### Common Threat Categories Tracked by Cisco IntelliShield\n\nNOTE: These CWE (Common Weakness Enumeration) threat categories, as defined by the National Vulnerability\n[Database (https://nvd.nist.gov/cwe.cfm), tie in to the methods malicious actors use to attack networks.](https://nvd.nist.gov/cwe.cfm)\n\n\n-----\n\n### Spam Volume Is Down, but Malicious Spam Is Still a Threat\n\n###### Spam volume was on a downward trend worldwide in 2013. However, while the overall volume may have decreased, the proportion of maliciously intended spam remained constant.\n\n Spammers use speed as a tool to abuse email users’ trust, delivering massive amounts of\n\n spam when news events or trends lower recipients’ resistance to spam scams.\n\n In the aftermath of the Boston Marathon bombing on April 15, 2013, two large-scale spam\n\n campaigns commenced—one on April 16 and another on April 17—designed to attract email\n\n users hungry for news of the event’s impact. Cisco researchers first\n\n detected the registration of hundreds of bombing-related domain\n\n names just hours after the Boston Marathon attacks occurred.[11]\n Spammers \n Both spam campaigns carried subject lines about supposed\n prey on people’s \n news bulletins relating to the bombings, while the messages\n desire for more\n contained links that claimed to lead to videos of the bomb\n information in the \n explosions or news from reputable media sources. The links\n wake of a \n directed recipients to webpages that included links to real\n major event.\n news stories or videos—but also malicious iframes designed\n\n to infect the visitors’ computers. At its peak, spam related to\n\n the Boston Marathon bombing made up 40 percent of all spam\n\n messages delivered worldwide on April 17, 2013.\n\n Figure 6 shows one of the botnet’s spam campaigns masquerading as a message from\n\n CNN.[12] Figure 7 shows the source HTML for a Boston Marathon bombing spam message. \n\n The final iframe (obfuscated) is for a malicious website.[13]\n\n Because breaking news spam is so immediate, email users are more likely to believe the spam\n\n messages are legitimate. Spammers prey on people’s desire for more information in the wake\n\n of a major event. When spammers give online users what they want, it’s much easier to trick\n\n them into a desired action, such as clicking an infected link. It’s also much easier to prevent\n\n them from suspecting that something is wrong with the message.\n\n\n-----\n\nFigure 6\n###### Boston Marathon Spam\n\nFigure 7\n###### Source HTML for a Boston Marathon Bombing Spam Message\n\n\n-----\n\n###### Spam by the Numbers\n\n Global spam volume is dropping according to data collected by Cisco Threat Research Analysis\n\n\n###### and Communications (TRAC)/SIO (Figure 8), although trends vary by country (Figure 9).\n\nFigure 8\n###### Global Spam Volume, 2013\n\n\nSource: Cisco TRAC/SIO\n\n160\n\n140\n\n120\n\n100\n\n80\n\n60\n\n40\n\n20\n\n0\nJan. Feb.\n\nFigure 9\n###### Volume Trends, 2013\n\n\nSource: Cisco TRAC/SIO\n\n\nItaly\n\nSpain\n\n\n25\n\n20\n\n\nUnited States\n\nKorea,\nRepublic of\n\n\n15\n\n10\n\n\n5\n\n0\nJan. Feb. Mar. Apr. May Jun. Jul. Aug. Sep. Oct.\n\n\n-----\n\nFigure 10\n###### Top Themes for Spam Messages Worldwide\n\n\n-----\n\n### Web Exploits:  Java Leads the Pack\n\n###### Of all the web-based threats that undermine security, vulnerabilities in the Java programming language continue to  be the most frequently exploited target by online criminals, according to Cisco data.\n\n Java exploits far outstrip those detected in Flash or Adobe PDF documents, which are also\n\n popular vectors for criminal activity (Figure 11).\n\n Data from Sourcefire, now part of Cisco, also shows that Java exploits make up the vast\n\n majority (91 percent) of indicators of compromise (IoCs) that are monitored by Sourcefire’s\n\n FireAMP solution for advanced malware analysis and protection (Figure 12). FireAMP \n\n detects live compromises on endpoints, and then records the type of software that \n\n caused each compromise.\n\nFigure 11 \u0003\n###### Malicious Attacks Generated through PDF, Flash, and Java 2013\n\nSource: Cisco Cloud Web Security reports\n\n\n16%\n\n14%\n\n12%\n\n10%\n\n8%\n\n6%\n\n4%\n\n2%\n\n0\nJan.\n\n\nFeb. Mar. Apr. May Jun. Jul. Aug. Sep. Oct. Nov.\n\nMonth\n\n\nPDF\n\nFlash\n\nJava\n\n\n-----\n\n###### For threats such as Java exploits, the most significant issues facing security practitioners are\n\n how malware enters their network environment and where they should focus their efforts to\n\n minimize infection. Individual actions may not appear malicious, but following a chain of events\n\n can shed light on the malware story. Chaining of events is the ability to conduct a retrospective\n\n analysis on data that connects the path taken by malicious actors to bypass perimeter security\n\n and infiltrate the network.\n\n By themselves, IoCs may demonstrate that going to a given website is safe. In turn, the\n\n launch of Java may be a safe action, as may be the launch of an executable file. However, an\n\n organization is at risk if a user visits a website with an iframe injection, which then launches\n\n Java; Java then downloads an executable file, and that file runs malicious actions.\n\nFigure 12 \u0003\n###### Indicators of Compromise, by Type\n\nSource: Sourcefire (FireAMP solution)\n\n\n###### 2%\nMicrosoft Word\n\n###### 3% 1%\nMicrosoft Excel Microsoft PowerPoint\n\n###### 3%\nAdobe Reader\n\n###### 91%\nJava Compromise\n\n\n-----\n\n###### The ubiquity of Java keeps it high on the list of favored tools for criminals, which makes Java\n\n compromises by far the most malicious “chain of events” activity in 2013. As Java’s “About”\n\n webpage explains, 97 percent of enterprise desktops run Java, as do 89 percent of desktop\n\n computers overall in the United States.[14]\n\n Java provides an attack surface that is too big for criminals to ignore. They tend to build\n\n solutions that run exploits in order—for instance, they first attempt to breach a network or \n\n steal data using the easiest or best-known vulnerability before moving on to other methods. \n\n In most cases, Java is the exploit that criminals choose first, since it delivers the best return \n\n on investment.\n\n Mitigating the Java Problem\n\n Although Java-based exploits are commonplace, and vulnerabilities are difficult to eliminate,\n\n there are methods for reducing their impact:\n\n#### • [Where practical, disabling Java in browsers network-wide can prevent these exploits ]\n\n###### from being launched.\n\n#### • [Telemetry tools like Cisco NetFlow, built in to many security solutions, can monitor ]\n\n###### Java-associated traffic, giving security professionals a better understanding of the \n\n sources of threats.\n\n#### • [Comprehensive patch management can close many security holes.]\n • [Endpoint monitoring and analysis tools that continue to track and analyze files after they enter ]\n\n###### the network can retrospectively detect and stop threats that pass through as safe but later\n\n exhibit malicious behavior.\n\n#### • [A prioritized list of potentially compromised devices can be generated by using IoCs to ]\n\n###### correlate malware intelligence (even seemingly benign events) and to identify a zero-day\n\n infection without existing antivirus signatures.\n\n Upgrading to the latest version of Java will also help sidestep vulnerabilities. According to\n\n research from Cisco TRAC/SIO, 90 percent of Cisco customers use a version of the Java 7\n\n Runtime Environment, the most current version of the program. This is good from a security\n\n standpoint, since this version is likely to offer greater protection against vulnerabilities.\n\n\n-----\n\n###### However, Cisco TRAC/SIO research also shows that 76 percent of enterprises using Cisco\n\n solutions are also using the Java 6 Runtime Environment, in addition to Java 7. Java 6 is a\n\n previous version that has reached its end of life and is no longer supported. Enterprises often\n\n use both versions of the Java Runtime Environment because different applications may rely\n\n on different versions to execute Java code. However, with more than three-fourths of the\n\n enterprises surveyed by Cisco using an end-of-life solution with vulnerabilities that may never\n\n be patched publicly, criminals have ample opportunity to exploit weaknesses.\n\n In 2013, Java web malware encounters peaked in April, at 14 percent of all web malware\n\n encountered. These encounters dropped to their lowest point in May and June 2013, at\n\n approximately 6 percent and 5 percent of all web malware encounters, respectively (Figure 13).\n\n (Earlier this year, Oracle announced that it would no longer post Java SE 6 updates to its public\n\n download site, although existing Java SE 6 updates will be available in the Java Archive on the\n\n Oracle Technology Network.)\n\n If security professionals who have limited time to fight web exploits decide to focus most of\n\n their attention on Java, they’ll be putting their resources in the right place.\n\nFigure 13 \u0003\n###### Java Web Malware Encounters, 2013\n\nSource: Cisco TRAC/SIO\n\n14%\n\n12%\n\n10%\n\n\n8%\n\n6%\n\n4%\n\n2%\n\n0\n\n\nJan.\n\n\nFeb. Mar. Apr. May Jun. Jul. Aug. Sep. Oct. Nov.\n\nMonth\n\n\n-----\n\n### BYOD and Mobility:  Device Maturation Benefitting Cybercrime\n\n###### Cybercriminals and their targets share a common challenge: both are trying to figure out how best to use the bring-your-own-device (BYOD) and mobility trends for business advantage.\n\n Two things appear to be helping criminals gain an edge. First is the maturation of mobile\n\n platforms. Cisco security experts note that the more smartphones, tablets, and other devices\n\n perform like traditional desktop and laptop computers, the easier it is to design malware \n\n for them.\n\n Second is the growing using of mobile apps. When users download mobile apps, they’re\n\n essentially putting a lightweight client on the endpoint—and downloading code. Another\n\n challenge: Many users download mobile apps regularly without any\n\n thought of security.\n\n Meanwhile, today’s security teams are grappling with the \n Many users \n “any-to-any problem”: how to secure any user, on any device,\n located anywhere, accessing any application or resource.[15] download mobile \n The BYOD trend only complicates these efforts. It’s difficult apps regularly without \n to manage all of these types of equipment, especially with a any thought \n limited IT budget. In a BYOD environment, the CISO needs to of security.\n be especially certain that the data room is tightly controlled.\n\n Mobility offers new ways for users and data to be compromised.\n\n Cisco researchers have observed actors using wireless channels to\n\n eavesdrop and gain access to data being exchanged through those channels. Mobility also\n\n presents a range of security issues for organizations, including the loss of intellectual property\n\n and other sensitive data if an employee’s device is lost or stolen and not secured.\n\n\n-----\n\n###### Instituting a formal program for managing mobile devices to help ensure that any device is\n\n secure before it can access the network is one solution to improve security for the enterprise,\n\n according to Cisco experts. At the very least, a personal identification number (PIN) lock\n\n should be required for user authentication and the security team should be able to turn off or\n\n wipe clean the device remotely if it is lost or stolen.\n\n Mobile Malware Trends: 2013\n\n The following research on mobile malware trends during 2013 was conducted by Cisco \n\n TRAC/SIO and by Sourcefire, now part of Cisco.\n\n Mobile malware that targets specific devices made up just 1.2\n\n percent of all web malware encounters in 2013. Although\n Mobile malware \n not a significant percentage, it is still worth noting because\n that targets specific\n mobile malware is clearly an emerging—and logical—area of\n devices made up \n exploration for malware developers.\n just 1.2 percent of \n According to Cisco TRAC/SIO researchers, when mobile\n all web malware\n malware is intended to compromise a device, 99 percent of all\n encounters \n encounters target Android devices. Trojans targeting Java Micro\n in 2013.\n Edition (J2ME)-capable devices held the second spot in 2013,\n\n with 0.84 percent of all mobile malware encounters.\n\n Not all mobile malware is designed to target specific devices, however. Many encounters\n\n involve phishing, likejacking, or other social engineering ruses, or forcible redirects to websites\n\n other than expected. An analysis of user agents by Cisco TRAC/SIO reveals that Android\n\n users, at 71 percent, have the highest encounter rates with all forms of web-delivered\n\n malware, followed by Apple iPhone users with 14 percent of all web malware encounters\n\n (Figure 14).\n\n Cisco TRAC/SIO researchers also reported evidence of efforts to monetize Android\n\n compromises during 2013, including launches of adware and small and medium-size\n\n enterprise (SME)-related spyware.\n\n At 43.8 percent, Andr/Qdplugin-A was the most frequently encountered mobile malware,\n\n according to Cisco TRAC/SIO research. Typical encounters were through repackaged copies\n\n of legitimate apps distributed through unofficial marketplaces (Figure 15).\n\n\n-----\n\nFigure 14 \u0003\n###### Web Malware Encounters by Mobile Device\n\nSource: Cisco Cloud Web Security reports\n\n\n100%\n\n80%\n\n60%\n\n40%\n\n20%\n\n0\n\nFigure 15\n###### Top 10 Mobile Malware Encounters, 2013\n\n\nSource: Cisco Cloud Web Security reports\n\n50%\n\n\n40%\n\n30%\n\n\n20%\n\n10%\n\n\n0\n\n\n-----\n\nFigure 16\n###### Top Android Malware Families Observed in 2013\n\nNOTE: SMSSend accounts for 98 percent of all Android malware; the remaining 2 percent is proportionally shown.\nSource: Sourcefire\n\n\n-----\n\n### Targeted Attacks:  The Challenge of Dislodging Persistent and Pervasive \n “Visitors”\n\n###### Odds are high that targeted attacks have already infiltrated  your networks.\n\n And when they do lodge themselves inside a network, they tend to stay around, stealthily\n\n stealing data or using network resources to “pivot” and then attack other entities (for more\n\n on pivoting, see page 18). The damage goes beyond the theft of data or business disruption:\n\n trust between partners and customers can evaporate if these attacks aren’t dislodged from\n\n networks in a timely manner.\n\n Targeted attacks threaten intellectual property, customer data, and sensitive government\n\n information. Their creators use sophisticated tools that circumvent an organization’s security\n\n infrastructure. Criminals go to great lengths to make sure these\n\n breaches go undetected, using methods that result in nearly\n\n imperceptible “indicators of compromise” or IoCs. Their\n\n methodical approach to gain entry into networks and carry out\n Criminals go to \n their mission involves an “attack chain”—the chain of events\n great lengths to make\n that leads up to and through the phases of an attack.\n sure breaches go\n Once these targeted attacks find a place in the network to\n undetected.\n hide, they efficiently carry out their tasks, and usually conduct\n\n them without being noticed.\n\n\n-----\n\nFigure 17\n###### The Attack Chain\n\nTo understand today’s array of threats and effectively defend the network, IT security professionals need to think\nlike attackers. With a deeper understanding of the methodical approach that malicious actors use to execute\ntheir mission, organizations can identify ways to strengthen their defenses. The attack chain, a simplified version\nof the “cyber kill chain,” describes the events that lead to and through the phases of an attack.\n\n\n-----\n\n### Malware Snapshot:  Trends Observed in 2013\n\n###### Cisco security experts perform ongoing research and analysis of malware traffic and other discovered threats, which can provide insights on possible future criminal behavior and aid in the detection of threats.\n\nFigure 18\n###### Top Malware Categories\n\nThis figure displays the top malware categories. Trojans are the most common malware, followed by adware.\nSource: Sourcefire (ClamAV and FireAMP solutions)\n\n###### 64% 20% 8% 4% 4%\n\nFigure 19\n###### Top Windows Malware Families\n\nThis figure shows the top malware families for Windows. The largest, Trojan.Onlinegames, mainly comprises\npassword stealers. It is detected by Sourcefire’s ClamAV antivirus solution. Source: Sourcefire (ClamAV solution)\n\n\n-----\n\nFigure 20\n###### Top 10 Categories of Web Malware Hosts, 2013\n\nThis figure shows the most frequent malware hosts, according to Cisco TRAC/SIO research.\nSource: Cisco Cloud Web Security reports\n\n45%\n\n40%\n\n35%\n\n30%\n\n25%\n\n20%\n\n15%\n\n10%\n\n5%\n\n0\nJan. Feb. Mar. Apr. May Jun. Jul. Aug. Sep. Oct.\n\nMonth\n\nFigure 21\n###### Malware Categories, by Percentage of Total Encounters, 2013\n\nSource: Cisco TRAC/SIO\n\n\n-----\n\n###### Research by Cisco TRAC/SIO during 2013 shows multipurpose trojans were the most\n\n frequently encountered web-delivered malware, at 27 percent of the total encounters.\n\n Malicious scripts, such as exploits and iframes, were the second most frequently encountered\n\n category, at 23 percent. Data-theft trojans, such as password stealers and backdoors, made\n\n up 22 percent of total web malware encounters, with downloader and dropper trojans in fourth\n\n place at 17 percent of total encounters (see Figure 21).\n\n The steady decline in unique malware hosts and IP addresses—a 30 percent decline between\n\n January 2013 and September 2013—suggests that malware is being concentrated in fewer\n\n hosts and fewer IP addresses (Figure 22). (Note: An IP address can serve websites for\n\n multiple domains.) As the number of hosts declines—even as malware remains steady—the\n\n value and reputation of these hosts becomes more important, since good hosts help criminals\n\n accomplish their goals.\n\nFigure 22\n###### Unique Malware Hosts and IP Addresses, 2013\n\nSource: Cisco Cloud Web Security reports\n\n\n-----\n\n###### Watering Holes No Oasis  for Targeted Enterprises\n\n One way malicious actors try to deliver malware to organizations in specific industry verticals is through the use of “watering hole” attacks. Like big game watching their prey, cybercriminals looking to target a particular group (for example, people who work in the aviation industry) will monitor which websites that group frequents, infect one or more of these sites with malware, and then sit back and hope at least one user in the target group visits that site and is compromised.\n\n A watering hole attack is essentially a trust exploit because legitimate websites are employed. It is also a form of spear phishing. However, while spear phishing is directed at select individuals, watering holes are designed to compromise groups of people with common interests. Watering hole attacks are not discerning about their targets: anyone who visits an infected site is at risk.\n\n At the end of April, a watering  hole attack was launched from specific pages hosting nuclear- related content at the U.S. Department of Labor website.[16] Then, beginning in early May 2013, Cisco TRAC/SIO researchers observed another watering hole attack emanating from several other sites centered on the energy and\n\n_Continues on next page_\n\n\n### Prime Targets: Industry Verticals\n\n###### Companies in high-profit verticals, such as the pharmaceutical and chemical industry and electronics manufacturing, have high rates of web malware encounters, according to Cisco TRAC/SIO research.\n\n The rate goes up or down as the value of a particular\n\n vertical’s goods and services rises or declines.\n\n Cisco TRAC/SIO researchers observed remarkable growth\n\n in malware encounters for the agriculture and mining\n\n industry—formerly a relatively low-risk sector. They attribute\n\n the increase in malware encounters for this industry to\n\n cybercriminals seizing on trends such as decreasing precious\n\n metal resources and weather-related disruptions in the \n\n food supply.\n\n Also continuing to rise are malware encounters in the\n\n electronics industry. Cisco security experts report that\n\n malware targeting this vertical typically is designed to help\n\n actors gain access to intellectual property, which they in turn\n\n use for competitive advantage or sell to the highest bidder.\n\n To determine sector-specific malware encounter rates, Cisco\n\n TRAC/SIO researchers compare the median encounter rate\n\n for all organizations that proxy through Cisco Cloud Web\n\n Security to the median encounter rate for all companies in\n\n a specific sector that proxy through the service. An industry\n\n encounter rate above 100 percent reflects a higher-than\n normal risk of web malware encounters, whereas a rate\n\n below 100 percent reflects a lower risk. For example, \n\n\n-----\n\n_Continued from previous page_\n\n###### oil sector. Similarities, including the specific crafting of an exploit used in both attacks, lend credence to the possibility that the two attacks were related. Cisco TRAC/SIO’s research also indicated that many of the sites used the same web designer and hosting provider. This could imply that the initial compromise was due to phished or stolen credentials from that provider.[17]\n\n Protecting users against these attacks involves keeping machines and web browsers fully patched to minimize the number of vulnerabilities that an attacker can exploit. Ensuring web traffic is filtered and checked for malware prior to its delivery to the user’s browser is also essential.\n\n\n###### a company with a 170 percent encounter rate is at a 70\n\n percent increased risk higher than the median. Conversely,\n\n a company with a 70 percent encounter rate is 30 percent\n\n below the median (Figure 23).\n\nFigure 23\n###### Industry Risk and Web Malware  Encounters, 2013\n\nSource: Cisco Cloud Web Security reports\n\n\n-----\n\n### Fractures in a Fragile Ecosystem\n\n###### Cybercriminals are learning that harnessing the power of the Internet’s infrastructure yields far more benefits than simply gaining access to individual computers.\n\n The newest twist in malicious exploits is to gain access to web hosting servers, nameservers,\n\n and data centers—with the goal of taking advantage of the tremendous processing power and\n\n bandwidth they provide. Through this approach, exploits can reach many more unsuspecting\n\n computer users and have a far greater impact on the organizations targeted, whether the goal\n\n is to make a political statement, undermine an adversary, or generate revenue.\n\nFigure 24\n###### High-Efficiency Infection Strategy\n\n\nCompromised\nWebsite\n\nCompromised Compromised\nWebsite Website\n\nCompromised Compromised\nWebsite Website\n\nCompromised Hosting Server\n\n\n-----\n\n##### [\n\n\n###### In essence, this trend in targeting Internet infrastructure means the foundation of the web\n\n itself cannot be trusted. Methods used to ultimately gain root access to hosting servers are\n\n varied and include tactics such as trojans on management workstations that steal server login\n\n credentials, vulnerabilities in third-party management tools used on the servers, and brute\n force login attempts (see page 53). Unknown vulnerabilities in the server software itself may\n\n also provide inroads.\n\n One compromised hosting server can infect thousands of websites and site owners around\n\n the world (Figure 24).\n\n Websites hosted on compromised servers act as both a redirector (the intermediary in\n\n the infection chain) and a malware repository. Instead of many compromised sites loading\n\n malware from only a few malicious domains (a many-to-few relationship), the relationship has\n\n now become many-to-many, hampering takedown efforts.\n\n Domain nameservers are prime targets in this new breed of attack, the exact methods of\n\n which are still under investigation. Indicators are that, in addition to individual websites and\n\n hosting servers, nameservers at certain hosting providers are also being compromised. Cisco\n\n security researchers say this trend toward targeting the Internet’s infrastructure shifts the\n\n threat landscape, because it is giving cybercriminals control over a not-insignificant portion \n\n of the very foundation of the web.\n\n “Cybercrime has become so lucrative and heavily commoditized that it needs a powerful\n\n infrastructure to keep it afloat,” says Gavin Reid, director of threat intelligence for Cisco. \n\n “By compromising hosting servers and data centers, attackers gain not only access to large\n\n\n###### amounts of bandwidth, but also the benefit of continuous uptime for those resources.”\n\n “Cybercrime has become so lucrative and  heavily commoditized that it needs a powerful  infrastructure to keep it afloat.”\n Gavin Reid, director of threat intelligence for Cisco\n\n\n##### ]\n\n\n-----\n\n###### Connecting the Dots: DarkLeech and Linux/CDorked\n\n The DarkLeech attack campaign reported by Cisco in 2013[18] underscores how the\n\n compromise of hosting servers can serve as a springboard to a larger campaign. It is\n\n estimated that the DarkLeech attacks compromised, in a short time period, at least 20,000[19]\n\n legitimate websites around the world that use Apache HTTP server software. Sites were\n\n infected with a Secure Shell daemon (SSHD) backdoor that allowed remote attackers to\n\n upload and configure malicious Apache modules. The compromise enabled attackers to\n\n dynamically inject iframes (HTML elements) in real time on hosted websites, which delivered\n\n exploit code and other malicious content by means of the Blackhole exploit kit.\n\n Because the DarkLeech iframe injections occur only at the moment of a site visit, signs of\n\n the infection may not be readily apparent. In addition, to avoid detection of the compromise,\n\n criminals use a sophisticated array of conditional criteria—for instance, injecting the iframe only\n\nFigure 25\n###### DarkLeech Server Compromises by Country, 2013\n\nSource: Cisco TRAC/SIO\n\n\n###### .5% Other\n\n\n###### 2% Singapore\n\n\n-----\n\n###### if the visitor arrives from a search engine results page, not injecting the iframe if the visitor’s IP\n\n address matches that of the site owner or hosting provider, and injecting the iframe only once\n\n every 24 hours for individual visitors.\n\n The Cisco TRAC/SIO investigation revealed that the DarkLeech compromises spanned the\n\n globe; countries with the largest number of hosting providers naturally experienced the highest\n\n rate of infection.\n\n Cisco SIO/TRAC researchers queried thousands of compromised servers to ascertain the\n\n distribution of affected server software versions.\n\n In April 2013, another malicious backdoor that had infected hundreds of servers running\n\n Apache HTTP server software was detected. Linux/CDorked[20] replaced the HTTPD binary\n\n on cPanel-installed versions of Apache. Similar backdoors targeting Nginx and Lighttpd were\n\nFigure 26\n###### DarkLeech-Compromised Server Responses\n\nSource: Cisco TRAC/SIO\n\n\n-----\n\n###### also discovered. Just as selective as DarkLeech in its attack methods, CDorked also uses\n\n conditional criteria to dynamically inject iframes on websites hosted on the affected server.\n\n Any visitor browsing an affected website then has malicious content delivered from another\n\n malicious website, where a crimeware toolkit attempts to further compromise the user’s PC.[21]\n\n A unique feature of Linux/CDorked is that it cycles through website domains in 24 hours,\n\n on average. Few compromised sites are used for longer. Thus, even if a malware domain is\n\n reported, attackers have already moved on. Also with Linux/CDorked,\n\n hosting providers are changed frequently (about every two weeks),\n\n cycling through the compromised hosts to avoid detection.\n CDorked and \n Compromised nameservers at these same hosting providers\n DarkLeech appear \n enable malicious actors to move from host to host without\n to be part of a \n losing control of domains during the transition. Once on a\n new host, the attackers begin a cycle of new domains, often much greater and \n using typosquatting-style[22] domain names in an attempt to far more complex\n appear legitimate to casual observers. strategy.\n\n Cisco TRAC/SIO analysis of traffic patterns with CDorked\n\n strongly suggests a connection with DarkLeech. The specially\n\n encoded referrer URL employed by CDorked specifically denotes traffic from\n\n DarkLeech. But that isn’t the most interesting twist about the malware: both CDorked and\n\n DarkLeech appear to be part of a much greater and far more complex strategy.\n\n “The sophistication of these compromises suggests cybercriminals have gained significant\n\n control over thousands of websites and multiple hosting servers, including nameservers\n\n employed by those hosts,” says Gavin Reid, director of threat intelligence for Cisco.\n\n “Combined with the recent spate of brute-force login attacks against individual websites, \n\n we appear to be witnessing a changing tide, where the infrastructure of the web is being \n\n used to form what can only be described as a very large—and very powerful—botnet. \n\n This überbot can be used for sending spam, delivering malware, and launching DDoS \n\n attacks on a scale never before seen.”\n\n\n-----\n\n##### [\n\n\n### Malicious Traffic, Often a Sign of Targeted Attacks, Detected in All Corporate Networks\n\n###### According to a Cisco examination of threat intelligence trends, malicious traffic is visible on 100 percent of corporate networks. This means there is evidence that sophisticated criminals or other players have penetrated these networks and may be operating undetected over long periods of time.\n\n All organizations should assume they’ve been hacked, or at least agree that it’s not a question\n\n of if they will be targeted for an attack, but when … and for how long.\n\n In a recent project reviewing Domain Name Service (DNS) lookups originating from inside\n\n corporate networks, Cisco threat intelligence experts found that in every case, organizations\n\n showed evidence that their networks had been misused or compromised (Figure 27). \n\n For example, 100 percent of the business networks analyzed by Cisco had traffic going to\n\n websites that host malware, while 92 percent show traffic to webpages without content, \n\n which typically host malicious activity. Ninety-six percent of the networks reviewed showed\n\n\n###### traffic to hijacked servers.\n\n\n##### ]\n\n\n###### Cisco also detected traffic going to military or government websites within enterprises that\n\n do not normally do business with either, as well as to websites for high-risk geographic\n\n areas, such as countries embargoed from doing business with the United States. Cisco has\n\n observed that such sites may be used because of the generally high reputation enjoyed by\n\n public or government organizations. Traffic to these sites may not be a definitive sign of a\n\n compromise, but for organizations that do not habitually do business with the government or\n\n the military, such traffic could indicate that networks are being compromised so that criminals\n\n can use them to breach government or military websites and networks.\n\n\n-----\n\n###### In spite of their best efforts to keep their networks free of malicious threats, all of the\n\n organizations Cisco examined during 2013 showed evidence of suspicious traffic. The traffic\n\n identified through DNS lookups can provide strong IoCs and are worth further investigation\n\n by organizations that want to halt these hard-to-detect threat actors in their networks. It’s a\n\n method to increase visibility of criminal movement that is typically very difficult to locate.\n\nFigure 27\n###### The Pervasiveness of Malicious Traffic\n\n\nConnections to domains that are known\n###### High-Threat Malware malware threat sites or threat vectors.\n\nSuspicious and excessive traffic going to\n###### Government and Military places not typically contacted by the public.\n\nConnections to known hijacked infrastructure\n###### Hijacked Infrastructure or compromised sites.\n\nConnections to blank sites that may have code\n###### Sites without Content on them to inject malware into systems.\n\n Suspect FTP Unexpected connections to irregular FTP sites.\n\nConnections from within an organization to\n###### Suspect VPN suspicious VPN sites.\n\nConnections to universities in suspicious places, potentially\n###### Education via Threat(s) serving as pivot points for other kinds of malware.\n\nVery high volume of attempts to connect to\n###### Pornography known pornography sites.\n\n\n-----\n\nSpecial Cisco Security Research Feature:\n###### New Twists on Bitsquatting—and New Ways to Halt Attacks\n\n Cybersquatting—the practice of registering domain names that are identical or confusingly similar to a distinctive mark—has long been a tool of online criminals. Recently, “bitsquatting,” the registration of domain names that are one binary digit different from the original domain, has become another way to redirect Internet traffic to sites hosting malware or scams.\n\n Bitsquatting is a form of cybersquatting that targets bit errors in computer memory. A memory error occurs anytime one or more bits being read from memory have changed in state from what was previously written. These errors in memory can occur because of many factors, including cosmic rays (high-energy particles that strike Earth as frequently as 10,000 per square meter per second), a device being used outside its recommended environmental parameters, manufacturing defects, and even low-yield nuclear explosions.\n\n By changing a single bit, a domain such as “twitter.com” can become the bitsquat domain “twitte2.com.” An attacker can simply register a bitsquat domain, wait for a memory error to occur, and then intercept Internet traffic.\n\n Security researchers believe bitsquatting attacks are most likely to occur against frequently resolved domain names, since these domains are most likely to appear in memory when bit errors occur. However, recent Cisco research predicts that domains previously not considered “popular” enough to attack will actually produce useful amounts of bitsquat traffic. This is because the amount of memory per device and the number of devices connected to the Internet are both increasing; according to Cisco estimates, there will be 37 billion “intelligent things” connected to the Internet by 2020.[23]\n\n Bitsquatting Attack Vectors\n\n Cisco TRAC/SIO has identified new bitsquatting attack vectors, including:\n\n • \u0007Subdomain delimiter bitsquatting: According to the accepted syntax for domain name labels, the only valid characters inside a domain name are A-Z, a-z, 0-9, and the hyphen. However, when checking for bitsquat domains, limiting the search to these characters neglects an important character that is also valid inside domain names: the dot. One new bitsquatting technique relies on bit errors that result in a letter “n” (binary 01101110) becoming a dot “.” (binary 00101110) and vice versa.\n\n • \u0007Subdomain delimiters where “n” flips to “.”: In a variation of the above technique, if a second-level domain name contains the letter “n” and there are two or more characters after the letter “n,” then this is a potential bitsquat.  For example, “windowsupdate.com” could become“dowsupdate.com.”\n\n • \u0007URL delimiter bitsquats: A popular context for domain names is within a URL. Inside a typical URL, forward-slash characters such as “/” act as delimiters, separating the scheme from the hostname from the URL path. The forward slash character (binary 00101111) can, by the flip of one bit, become the letter “o” (binary 01101111), and  vice versa.\n\n\n-----\n\n_Continued from previous page_\n\n###### Preventing Bitsquatting Attacks: Create a Bitsquat RPZ\n\n The two mitigation techniques that have commonly been in use to prevent bitsquatting have their place in the security arsenal, but neither method is optimal:\n\n • \u0007Use error-correcting (ECC) memory: The entire base of installed devices would have to upgrade simultaneously worldwide to make this an effective solution.\n\n • \u0007Register the bitsquat domain so that no third party can register it: This is not always possible, as many popular bitsquat domains have already been registered. Depending on the length of the domain name, this also can be costly.\n\n The good news is that these mitigation techniques are not the only ones a security professional can deploy to protect users from accidentally misdirecting Internet traffic. With sufficient adoption, the new mitigations could eliminate the bitsquatting problem almost completely.\n\n For example, response policy zones (RPZs) have been a configuration option since BIND version 9.8.1, and patches exist for earlier versions of BIND. (BIND is widely used Internet DNS software.) RPZs are local zone files that allow the DNS resolver to respond to specific DNS requests by saying the domain name does not exist (NXDOMAIN), redirecting the user to a “walled garden” (a closed platform), or other possibilities.\n\n To mitigate the effects of single bit errors for users of a DNS resolver, the resolver administrator can create an RPZ that protects against bitsquats of frequently resolved or internal-only domain names. For example, the RPZ can be set up so that any requests made to the DNS resolver for bitsquat variants of these domains will get a NXDOMAIN response, silently “correcting” bit errors without any work on the part of the client experiencing the bit error.[24]\n\n\n-----\n\n# Industry\n\n###### Cisco SIO investigators elevate the discussion around industry  trends that extend beyond Cisco’s telemetry.\n\n\n-----\n\n### Brute-Force Login Attempts  a Favored Tactic to Compromise Websites\n\n###### Although brute-force login attempts are by no means a new  tactic for cybercriminals, their use increased threefold in the first half of 2013.\n\n In the course of investigation, researchers with Cisco TRAC/SIO discovered a hub of data used\n\n to feed such actions. It included 8.9 million possible username and password combinations,\n\n including strong passwords—not just the easy-to-crack “password123” variety. Stolen user\n\n credentials help to keep this list, and others like it, well stocked.\n\nFigure 28\n###### How Brute-Force Login Attempts Work\n\n\n-----\n\n##### [\n\n\n###### Key targets for recent brute-force login attempts are widely used content-management\n\n system (CMS) platforms such as WordPress and Joomla. Successful attempts to gain\n\n unauthorized access through a CMS give attackers the ability to upload PHP (hypertext\n\n preprocessor) backdoors and other malicious scripts to compromised websites. In some\n\n cases, the compromise can enable attackers to find a path to a hosting server, which can \n then be commandeered (Figure 28). ]\n\n Considering that there are more than 67 million WordPress sites around the world—and that\n\n publishers are using the platform to create blogs, news sites, company sites, magazines,\n\n social networks, sports sites, and more—it’s not surprising that many\n\n online criminals have their sights set on gaining access through\n\n this CMS.[25] Drupal, a rapidly growing CMS platform, has been\n targeted this year as well; for example, in May, users were Many online \n advised to change their passwords because “unauthorized\n criminals have \n access [to Drupal] was made through third-party software\n their sights set on \n installed on the Drupal.org server infrastructure.”[26]\n gaining access \n But it isn’t just the popularity of these systems that makes through CMS.\n\n them desirable targets. Many of these sites—though active—\n\n have been largely abandoned by their owners. There are likely\n\n millions of abandoned blogs and purchased domains sitting idle, and\n\n many of them are probably now owned by cybercriminals. Cisco security\n\n experts predict the problem will only worsen as more and more people in emerging Internet\n\n markets around the globe establish a blog or a website, only to let it languish later.\n\n The widespread use of plugins, which are designed to extend the functionality of a CMS and\n\n to power videos, animations, and games, is also proving to be a boon for miscreants looking to\n\n gain unauthorized access to platforms like WordPress and Joomla. Many CMS compromises\n\n observed by Cisco researchers in 2013 can be traced back to plugins written in the PHP web\n\n scripting language that were designed poorly and without security in mind.\n\n\n-----\n\nDNS Amplification:\n###### Mitigation Techniques\n\n\n###### Attacks launched through DNS\n\n##### [\n\n###### amplification will remain a concern in 2014, according to Cisco security experts. The Open Resolver Project (openresolverproject.org) reports that as of October 2013, 28 million open resolvers on the Internet pose a “significant threat.” (Consider that the Spamhaus DDoS attack of 300 Gbps used only 30,000 open resolvers.)\n\n##### ]\n\n###### If a resolver is open, that means it is not filtering where it is sending responses. DNS uses the UDP protocol, which is stateless, meaning a request can be made on behalf of another party. That party then receives an amplified amount of traffic. This is why identifying open resolvers—and taking steps to close them—is something the industry  will be dealing with for some time  to come.\n\n Enterprises can reduce the chance of an attack launched by DNS amplification in several ways, including implementing the Internet Engineering Task Force’s Best Current Practice (BCP) 38 to avoid being the source of attacks. This BCP recommends that upstream providers of IP connectivity filter packets entering their networks from downstream customers, and to discard any packets that have\n\n_Continues on next page_\n\n\n### DDoS Attacks: What’s Old Is  New Again\n\n###### Distributed denial of service (DDoS) attacks—which disrupt traffic to and from targeted websites and can paralyze  ISPs (Internet service providers)—have been increasing in both volume  and severity.\n\n Because DDoS attacks had long been considered “old\n\n news” in terms of cybercrime techniques, many enterprises\n\n were confident the security measures they had in place\n\n could provide adequate protection. But that confidence has\n\n been shaken by large-scale DDoS attacks in 2012 and\n\n 2013, including Operation Ababil, which was directed at\n\n several financial institutions and likely politically motivated.[27]\n\n “DDoS attacks should be a top security concern for\n\n organizations in the public and private sector in 2014,” says\n\n John N. Stewart, senior vice president and chief security\n\n officer at Cisco. “Expect future campaigns to be even more\n\n extensive and to last for extended periods. Organizations,\n\n particularly those that operate or have interests in industries\n\n that are already prime targets, such as financial services and\n\n energy, need to ask themselves, ‘Can we be resilient against\n\n a DDoS attack?’”\n\n A new twist: Some DDoS attacks are probably being used\n\n to conceal other nefarious activity, such as wire fraud before,\n\n during, or after a campaign. (See “DarkSeoul,” page 57.)\n\n\n-----\n\n_Continued from previous page_\n\n###### a source address not allocated to that customer.[30] The BCP was co- authored by Cisco, which offers guidelines on deploying uRPF, its implementation.[31]\n\n Another mitigation technique is to configure all authoritative DNS servers to use rate limiting. The authoritative nameserver, which serves an enterprise’s domain, is generally open to all requests. DNS response rate limiting (DNS RRL) is a feature that can be turned on to prevent a DNS server from answering the same question from the same entity too many times—thus protecting the enterprise from being used as an intermediary in DDoS attacks. DNS RRL is enabled on DNS servers and it is one way for a server administrator to limit how effectively a server can be used by attackers in amplification attacks. DNS response rate limiting is a newer feature, and it is not supported by all DNS servers; however, it is supported by ISC BIND, a popular DNS server.\n\n In addition, all recursive DNS servers need to be configured with an access control list (ACL) so they will respond only to queries from hosts on their own network. A poorly managed ACL can be a primary factor in DNS attacks, especially on large servers with large amounts of available bandwidth. This technique also helps\n\n_Continues on next page_\n\n\n###### These attacks can overwhelm bank personnel, prevent\n\n transfer notifications to customers, and prevent customers\n\n from reporting fraud. And by the time an institution recovers\n\n from such an event, it is unable to recoup its financial\n\n losses. One such attack that took place on December 24,\n\n 2012, targeted the website of a regional California financial\n\n institution and “helped to distract bank officials from an online\n\n account takeover against one of its clients, netting thieves\n\n more than $900,000.”[28]\n\n Rapidly deepening expertise in compromising hosting\n\n servers will only make it easier for cybercriminals to launch\n\n DDoS attacks and steal from targeted organizations\n\n (see “Fractures in a Fragile Ecosystem,” page 43). By\n\n commandeering a portion of the Internet’s infrastructure,\n\n malicious actors can take advantage of large amounts\n\n of bandwidth, positioning them to launch any number of\n\n powerful campaigns. It’s already happening: In August 2013,\n\n the Chinese government reported that the largest DDoS\n\n attack it had ever faced shut down the Chinese Internet for\n\n about four hours.[29]\n\n Even spammers are using DDoS attacks to strike back\n\n at organizations they believe are standing in the way of\n\n their revenue generation. In March 2013, the nonprofit\n\n Spamhaus—which tracks spammers and created the\n\n Spamhaus Block List, a directory of suspect IP addresses—\n\n was the target of a DDoS attack that temporarily shut down\n\n its website and slowed Internet traffic worldwide. The\n\n attackers were allegedly affiliated with the Netherlands\n based CyberBunker, a hosting provider with permissive\n\n terms of use, and STOPhaus, which has publicly expressed\n\n its dislike for Spamhaus’s activities. The DDoS attack\n\n came after the widely used Spamhaus service included\n\n CyberBunker on its blacklist. In apparent retaliation,\n\n suspected spammers attempted to take Spamhaus offline \n\n ia a DDoS attack\n\n\n-----\n\n_Continued from previous page_\n\n###### reduce the chances of becoming an intermediary in a DDoS attack.\n\n “Since there is discussion in the security industry around allowing authoritative nameservers to disable service to entities that end up becoming intermediaries in DDoS attacks, enterprises should employ the simple mitigation techniques described above,” says Gavin Reid, director of threat intelligence  for Cisco.\n\n For more on DNS best practices, refer to “DNS Best Practices, Network Protections, and Attack Identification”: http://www.cisco.com/ web/about/security/intelligence/ dns-bcp.html.\n\n\n###### This DDoS incident employed a DNS amplification attack,\n\n which exploits open DNS resolvers that respond even to\n\n queries outside its IP range. By sending an open resolver a\n\n very small, deliberately formed query with a spoofed source\n\n address of the target, attackers can evoke a significantly\n\n larger response to the intended target. After initial attempts\n\n to take Spamhaus offline failed, the attackers employed a\n\n DNS amplification attack targeting Tier 1 and other upstream\n\n providers for Spamhaus.\n\n### DarkSeoul\n\n###### As noted in “DDoS Attacks: What’s Old Is New Again,” cybercriminals’ new focus and fast-growing expertise in compromising hosting servers is only making it easier to launch DDoS attacks and steal from organizations.\n\n Cisco security researchers warn that future DDoS campaigns\n\n are likely to be capable of creating both significant disruption\n\n and damage—including financial loss due to theft.\n\n The DarkSeoul targeted attacks of March 2013 involved\n\n “wiper” malware designed to destroy data in the hard drives\n\n of tens of thousands of PCs and servers. The attacks\n\n targeted financial institutions and media firms in South Korea,\n\n with the payload set to activate at the same time. The wiper\n\n malware appears to be only one facet of the attack, however.\n\n At the same time the malware was triggered, the website\n\n of the Korean network provider LG U+ was defaced and\n\n the networks of other targeted organizations started going\n\n down—capabilities not reproducible in the wiper malware.[32]\n\n\n-----\n\n##### [\n\n\n###### Some believe the attacks were a result of cyberwarfare instituted by North Korea to disrupt\n\n South Korea economically or an act of sabotage by another nation-state. But the possibility\n\n exists that the DarkSeoul attacks were meant to conceal financial gain.[33]\n\n Security researchers are still trying to understand these attacks—and discover who was\n\n responsible for them—but evidence indicates that plans for DarkSeoul may have been put\n\n in motion as far back as 2011. In that year, the U.S. Federal Bureau of Investigation (FBI) first\n\n warned of the emergence of banking trojans designed to conceal the wiring of fraudulent\n\n funds from victims’ accounts.[34] Then, in 2012, the RSA security firm reported on a new breed\n\n of cybercriminals constructing a sophisticated trojan campaign that would launch an attack\n\n on a scheduled day and attempt to “to cash out as many compromised accounts as possible\n\n before its operations are ground to a halt by security systems.”[35] And on Christmas Eve\n\n 2012, online thieves used a DDoS attack as a cover while they stole from a regional California\n\n financial institution.[36]\n\n One malware binary identified in the DarkSeoul attacks that targeted media organizations and\n\n financial institutions is a banking trojan that specifically targeted customers of those same\n\n Korean banks, according to Cisco TRAC/SIO investigators. That fact, along with the timeline\n\n of cybercrime trends leading up to DarkSeoul, indicates the campaign could have been theft\n\n made to look like something else.\n\n Ransomware\n\n Throughout 2013, attackers have increasingly moved away Throughout \n from traditional botnet-driven infections on PCs. Part of this 2013, attackers have\n shift included the increased use of ransomware as the final\n increasingly moved \n malware payload from compromised websites, malicious\n away from traditional\n email, and downloader trojans. Ransomware is a category\n botnet-driven \n of malware that prevents the normal operation of infected\n\n\n###### systems until a prescribed fee is paid.\n\n\n##### ]\n\n\n###### Ransomware provides a difficult to track, yet straightforward, direct\n\n revenue stream for attackers without requiring the use of intermediary\n\n leased services such as those provided by traditional botnets. Attackers mimic legitimate local\n\n economies that have seen a significant increase in sole proprietorship as a result of job losses\n\n\n-----\n\n###### and economic downturns, but the motivation for cybercriminals is the loss of botnet availability\n\n and accessible exploit kits due to takedowns.\n\n In the fall of 2013, a new type of ransomware, dubbed CryptoLocker, began encrypting\n\n victims’ files with a combination of RSA 2048-bit key pairs and AES-256, considered\n\n unfeasible to break. In action, CryptoLocker move files beyond the local machine to include\n\n matching file types on any writeable mapped drive. Upon completion of the encryption\n\n routine, victims are presented with a series of dialog boxes that provide detailed instructions\n\n for payment of the ransom (Figure 29). A timer is also presented instructing the victim to\n\n pay within a specific time (ranging from 30 to 100 hours). The dialog further warns that if the\n\n ransom is not paid in the allotted time, the private key will be deleted from the command\n and-control server, after which the chance to decrypt the files will be lost.\n\n CryptoLocker surged in mid-October, possibly in response to the loss of the Blackhole and\n\n Cool exploit kits following the arrest of the alleged author of those frameworks.\n\nFigure 29\n###### Ransom Instructions from CryptoLocker\n\n\n-----\n\n##### [\n\n\n### The Security Talent Shortage and Solutions Gap\n\n###### The sophistication of the technology and tactics used by online criminals—and their nonstop attempts to breach network security and steal data—have outstripped the ability of IT and security professionals to address threats. Most organizations do not have the people or the systems to monitor their networks consistently and to determine how they are being infiltrated.]\n\n The security talent shortage makes this problem worse: even\n\n when budgets are generous, CISOs struggle to hire people\n\n with up-to-date security skills. It’s estimated that by 2014,\n CISOs struggle \n the industry will still be short more than a million security\n to hire people with \n professionals across the globe. Also in short supply are\n up-to-date \n security professionals with data science skills—understanding\n security skills.\n and analyzing security data can help improve alignment with\n\n business objectives. (See the appendix on page 68, “Security\n\n Organizations Need Data Scientists: Introductory Data Analysis\n\n Tools for Security Practitioners.”)\n\n\n-----\n\n### Cloud as a New Perimeter\n\n###### As CISOs tell Cisco security experts (see page 18), moving  ever-increasing amounts of critical business data to the cloud  is a growing security concern.\n\n The cloud revolution, says Michael Fuhrman, Cisco vice president of engineering, is\n\n comparable to the rise in web-based solutions in the late 1990s.\n\n “This was a radical shift in business use of new technology—and at\n\n that same time, we saw a rise in online attacks from criminals,”\n\n says Fuhrman. “Today, the radical shift comes from the cloud.\n The rise in \n Not only do businesses host many of their critical applications\n cloud computing\n in the cloud, but they are also using the cloud to consume\n is undeniable and\n and analyze critical business information.”\n unstoppable.\n The rise in cloud computing is undeniable and unstoppable.\n\n Cisco has projected that cloud network traffic will grow more\n\n than threefold by 2017.[37]\n\n\n\n##### [\n\n\n###### In 2014 and onward, security professionals can expect to see entire\n\n corporate perimeters move to the cloud. These network edges have been in the process of\n\n becoming far less well-defined in recent years. But with so many applications and so much\n\n data in the cloud, organizations are rapidly losing the ability to see who and what is moving in\n\n\n###### and out of corporate boundaries, and what actions users are taking.\n\n\n##### ]\n\n\n###### This transition to the cloud changes the game because it redefines where data is stored,\n\n moved, and accessed—and creates greater opportunities for attackers.\n\n Adding to fears about ceding the control of data to the cloud is lack of information about how\n\n cloud vendors defend their products against security breaches. Organizations often don’t ask\n\n enough questions about what is contained in their vendors’ service-level agreements, or how\n\n often vendors upgrade their security software or patch vulnerabilities.\n\n\n-----\n\n###### Organizations need reassurance that a cloud provider is using the most sophisticated tools\n\n and strategies available to thwart attacks, or to detect and stop them while in progress. For\n\n information security teams, the decision to move forward often comes down to one question:\n\n “What controls should I look for in a provider to trust it to manage and protect my data?”\n\n On the other side of the fence, cloud providers struggle with identifying and implementing\n\n a manageable set of controls mapped to an increasing number of international regulations,\n\n which are needed to address an increasingly hostile threat environment.\n\n “When we choose vendors for security and critical infrastructure, we often buy based on\n\n technical qualifications and reputation,” says John N. Stewart, senior vice president and chief\n\n security officer at Cisco. “Lately, the vendor’s process and evolving security approach have\n\n also become increasingly important factors.”\n\n Coincidentally, the very things that make the cloud a threat—such as the location outside the\n\n network perimeter and the increasing use of the cloud for business-critical data—can enable\n\n organizations to make more accurate and near-real-time security decision making. With more\n\n traffic going through the cloud, security solutions that also rely on the cloud can quickly and\n\n easily analyze this traffic and gain from this supplemental information. In addition, for smaller\n\n organizations or those with budget constraints, a well-protected and well-managed cloud\n\n service can offer more security safeguards than a business’s own servers and firewalls.\n\n “When we choose vendors for security and critical infrastructure, we often buy based on technical qualifications and reputation. Lately, the vendor’s process and evolving security approach have also become increasingly important factors.”\n John N. Stewart, senior vice president and chief security officer at Cisco\n\n\n-----\n\n# Recommendations\n\n###### More organizations are struggling to solidify a security vision  supported by an effective strategy that uses new technologies, simplifies their architecture and operations, and strengthens  their security teams.\n\n\n-----\n\n### Objectives for 2014:  Verifying Trustworthiness  and Improving Visibility\n\n###### Today, in an environment where the level of trust associated  with a network or device must be dynamically evaluated, organizations are faced with fragmented security models that provide inconsistent enforcement, isolated threat intelligence,  and a proliferation of vendors and products to manage.\n\n The connections among organizations, data, and the advanced attacks launched by malicious\n\n actors are simply too complex for a single appliance to address. And most organizations lack\n\n security personnel with the expertise and experience to help them adapt their security models\n\n to the challenges—and opportunities—presented by cloud computing, mobility, and other new\n\n ways of doing business that are driven by technology advancements.\n\n The past year has seen organizations of all types struggling to understand how to embrace\n\n innovation without creating new security gaps or widening known ones. 2013 also brought\n\n the issue of trust to the forefront. Users of all types are now even more likely to question the\n\n trustworthiness of the technology they rely on every day whether at work or in their personal\n\n lives. It is therefore more important than ever for technology vendors to help assure customers\n\n that security is a priority in their manufacturing processes—and to be prepared to back up\n\n those assurances.\n\n\n\n##### [“We are in a market transition where trust matters, and process and technology must be\n\n###### integral features of product design for a vendor to meet the needs of today’s threats,” says\n\n Cisco chief security officer John N. Stewart. “A company’s promise is insufficient. Firms\n\n need verification through certified products, integrated development processes, innovative\n\n technology, and respected standing in the industry. Organizations also must make it an\n\n ongoing priority to verify the trustworthiness of the technology products they use and the\n\n\n###### vendors that supply them.”\n\n\n##### ]\n\n\n-----\n\n##### [\n\n\n###### Improving the alignment between security operations and business objectives is also an\n\n important measure for strengthening enterprise security. In a climate of limited resources\n\n and anemic budgets, this alignment can help CISOs and other security executives in the\n\n organization to identify key risks and appropriate mitigation approaches. Part of this process\n\n is the acceptance of the fact that not all corporate resources can be completely protected\n\n at all times. “Come to an agreement as to what is most important from a cybersecurity\n\n perspective,” says Gavin Reid, director of threat intelligence for Cisco. “This is a more\n\n productive approach than hoping to find a magic pill that can fix everything.”\n\n To meet today’s security challenges head on, organizations need to examine their security\n\n model holistically and gain visibility across the entire attack continuum:\n\n#### • [Before an attack:][ To defend their network, organizations must be aware of what’s on it: ]\n\n###### devices, operating systems, services, applications, users, and more. Additionally, they must\n\n implement access controls, enforce security policies, and block applications and overall\n\n access to critical assets. However, policies and controls are only a small piece of a bigger\n\n picture. These measures can help to reduce the surface area of attack, but there will always\n\n be gaps that attackers will find and exploit to achieve their objectives.\n\n#### • [During an attack:][ Organizations must address a broad range of attack vectors with solutions ]\n\n###### that operate everywhere that a threat can manifest itself—on the network, on endpoints,\n\n from mobile devices, and in virtual environments. With effective solutions in place, security\n\n professionals will be better positioned to block threats and help to defend the environment.\n\n#### • [After an attack:][ Invariably, many attacks will be successful. This means organizations need ]\n\n###### to have a formal plan in place that will allow them to determine the scope of the damage,\n\n contain the event, remediate, and bring operations back to normal as quickly as possible.\n\n “Attackers and their tools have advanced to evade traditional defenses. The reality is that it’s\n\n no longer a matter of if attackers get in, but when,” says Marty Roesch, chief security architect\n\n for the Security Group at Cisco. “A visibility-driven and threat-focused approach to security is\n\n\n###### needed to protect users across the attack continuum—before, during, and after an attack.”\n\n\n##### ]\n\n\n-----\n\n###### How Services Help Meet Security Challenges\n\n With a greater attack surface, the increasing proliferation and sophistication of attack models, and the growing complexity within the network, more organizations are struggling to solidify a security vision that uses new technologies, simplifies their architecture and operations, and strengthens their team.\n\n Lack of security talent, as discussed on page 60, complicates these issues. In addition, the security industry is innovating faster than organizations can adopt and operationalize these new tools.\n\n Finding the right talent to address the evolving security landscape effectively can be a challenge. Bringing in complementary outside resources can not only help to reduce costs, but also allow the business to free up resources to focus on higher priorities.\n\n Strengthening the Chain Where It Weakens\n\n Preventing threats is of course paramount to maintaining cybersecurity. This is why, with more online criminals shifting their focus toward compromising the Internet’s infrastructure instead of individual computers, Cisco security experts recommend that ISPs and hosting companies take a more active role in helping to protect the integrity  of the Internet.\n\n Identifying difficult-to-detect threats like DarkLeech and Linux/CDorked (see page 45) requires much more “human responsiveness” on the part of hosting providers. Such responsiveness includes fully investigating reports from users and taking them seriously. Providers also need to establish better controls to make sure they can verify the integrity of their server operating system installations. Cisco investigators say that with stealthy malware like CDorked, security teams would have had no way of knowing that the binary had been replaced if a control had not already  been in place to verify the integrity of the installation.\n\n Systems of individual users are susceptible to compromise, of course, but the weakening in the chain often begins long before a threat reaches them. More often now, the attack happens in the middle of the chain, which is why providers need to have better awareness about potential threats that target the Internet’s infrastructure.\n\n\n-----\n\n# Appendix\n\n\n-----\n\n### Security Organizations  Need Data Scientists\n\n###### Introductory Data Analysis Tools for Security Practitioners\n\n Chief security officer (CSO) teams are collecting an unprecedented amount of data, and\n\n the intelligence captured in that data is much too valuable to go unused. Analyzing security\n relevant data provides clues into attackers’ activities and gives actionable insight into how to\n\n thwart attacks.\n\n Data analysis is not new to the security practitioner. There is also an expectation among\n\n security practitioners that records will be generated and labeled. Pen-testers create a record\n\n of investigation after an assessment. Operating system designers implement\n\n auditing subsystems. Application developers design applications that\n\n generate logs.\n Security \n Regardless of what the records are called, one thing is certain: practitioners have \n Security practitioners have a great deal of data—and analyzing\n a great deal of \n that data can lead to important discoveries.\n data—and analyzing \n While data analysis itself is not new, the evolution of the that data can lead \n security landscape has had an impact on the process of data to important \n analysis: discoveries.\n\n#### • [The sheer volume of data generated is staggering.]\n • [The frequency with which ad hoc data analysis is needed is increasing.]\n • [Standardized reports, while helpful, are insufficient.]\n\n\n-----\n\n###### Fortunately, the barrier to entry for security practitioners to do data analysis, even in this \n\n more complex environment, is low—and the data analysis tools ecosystem is rich. Following\n\n is an overview of just some of the freely available tools that practitioners can use to start\n\n analyzing data.\n\n Analyzing Traffic with Wireshark and Scapy\n\n Two tools that excel in doing traffic analysis are Wireshark and Scapy. Wireshark needs no\n\n introduction. Scapy is a Python-based tool that can be used, either as a Python module or\n\n interactively, for crafting or inspecting traffic.\n\n Wireshark’s rich set of command-line tools and protocol dissectors make it indispensable.\n\n For example, with the use of Wireshark’s tcp.stream display filter field, a pcap file containing\n\n multiple TCP streams can be broken into smaller files that each contain all the packets\n\n belonging to a single TCP stream.\n\n Figure A1 shows this command that prints the TCP stream index of the first five TCP packets\n\n in traffic_sample.pcap.\n\nFigure A1\n###### The tshark Command to Extract the tcp.stream Index\n\n\n-----\n\n###### With that knowledge, one can write a script that will split traffic_sample.pcap into individual\n\n pcap files:\n\n\n###### $ cat ~/bin/uniq_stream.sh\n\n #!/bin/bash\n\n function getfile_name() {\n\n orig_name=$1\n\n stream=$2\n\n file_name=”$(echo $orig_name | cut -d’.’ -f1)”\n\n file_name+=”-${stream}.pcap”\n\n echo “${file_name}”\n\n return 0\n\n }\n\n streams=$(tshark -r ${1} -T fields -e tcp.stream | sort -un | tr ‘\\n’ ‘ ‘)\n\n for x in ${streams}\n\n do\n\n file_name=$(getfile_name ${1} ${x})\n\n echo “Creating ${file_name}...”\n\n tshark -r ${1} -w $file_name tcp.stream eq ${x}\n\n done\n\n $\n\n\n###### The script creates a single pcap file for each of the 147 TCP streams in traffic_sample.pcap.\n\n It is now easier to do further analysis on each TCP stream. Note that non-TCP packets from\n\n traffic_sample.pcap will not be in any of the new pcap files:\n\n\n###### $ /bin/uniq_stream.sh traffic_sample.pcap\n\n Creating traffic_sample-1.pcap...\n\n Creating traffic_sample-2.pcap...\n\n …\n\n …\n\n Creating traffic_sample-146.pcap...\n\n Creating traffic_sample-147.pcap...\n\n\n-----\n\n###### Scapy has its own strengths. Since it is developed in Python, all the features of the Python\n\n language and other Python tools can be used. The following snippet demonstrates how Scapy\n\n makes use of operator overloading so that crafting traffic can be done rapidly and intuitively:\n\n\n###### # scapy\n\n >>> dns_query = IP()/UDP()/DNS()\n\n >>> from socket import gethostbyname,gethostname\n\n >>> dns_query[IP].src = gethostbyname(gethostname())\n\n >>> dns_query[IP].dst = “8.8.8.8”\n\n >>> import random\n\n >>> random.seed()\n\n >>> dns_query[UDP].sport = random.randint(0, 2**16)\n\n >>> dns_query[DNS].id = random.randint(0, 2**16)\n\n >>> dns_query[DNS].qdcount = 1\n\n >>> dns_query[DNS].qd = DNSQR(qname=“www.cisco.com”)\n\n >>> scapy.sendrecv.sr1(dns_query)\n\n >>> response = scapy.sendrecv.sr1(dns_query)\n\n Begin emission:\n\n ............Finished to send 1 packets.\n\n .*\n\n Received 14 packets, got 1 answers, remaining 0 packets\n\n >>> response[DNS].ar[DNSRR].rdata\n\n ‘64.102.255.44’\n\n >>>\n\n\n###### This example shows how packets can be constructed and how live traffic can be analyzed.\n\n However, Scapy can be used to analyze pcap files just as easily.\n\n\n-----\n\n###### Analyzing CSV Data\n\n Comma-separated values (CSV) is a popular format for exchanging data. Many tools\n\n (including tshark) allow the user to export data in CSV format. Typically, security practitioners\n\n use spreadsheet programs like Excel to analyze CSV data. It is also often possible to use\n\n command-line tools like grep, cut, sed, awk, uniq, and sort.\n\n Consider using csvkit as an alternative. Csvkit provides several utilities that make it easier to\n\n process CSV data from the command line. Examine the following CSV file and notice how\n\n easy it is to find all lines that have the tty.example.org host in the src column:\n\n\n###### $ head -n 3 tcp_data.csv\n\n src,srcport,dst,dstport\n\n “tty.example.org”,“51816”,”vex.example.org”,”443”\n\n “vex.example.org”,”443”,”tty.example.org”,”51816”\n\n $ csvgrep -n tcp_data.csv\n\n 1: src\n\n 2: srcport\n\n 3: dst\n\n 4: dstport\n\n $ csvgrep -c 1 -r ‘tty\\.example\\.org’ tcp_data.csv | head -n 5\n\n src,srcport,dst,dstport\n\n tty.example.org,51816,vex.example.org,443\n\n tty.example.org,51816,vex.example.org,443\n\n tty.example.org,51427,paz.example.org,5222\n\n tty.example.org,51767,bid.example.org,80\n\n\n-----\n\n###### Csvkit includes a host of utilities. Csvstat is particularly useful as it automatically computes\n\n various statistics. For example, it is easy to compute the frequency of the top five src hosts:\n\n\n###### $ \u0007csvstat -c 1 tcp_data.csv\n\n 1. src\n\n <type ‘unicode’>\n\n Nulls: False\n\n Unique values: 55\n\n 5 most frequent values:\n\n tty.example.org: 2866\n\n lad.example.org: 1242\n\n bin.example.org: 531\n\n trw.example.org: 443\n\n met.example.org: 363\n\n Max length: 15\n\n Row count: 6896\n\n\n###### Matplotlib, Pandas, IPython, and Others\n\n A rich set of Python-based data analysis and visualization tools is available. A great place\n\n to discover these tools is the SciPy site (http://www.scipy.org). Of particular interest are the\n\n Matplotlib, pandas, and IPython packages:\n\n#### • [Matplotlib allows for easy, flexible and visualization.]\n • [Pandas provides tools to manipulate and examine raw data.]\n • [IPython brings features to the Python interpreter that facilitate interactive data analysis. ]\n\n\n-----\n\n###### The following demonstrates how security practitioners can use these three tools to graph the\n\n top src hosts in tcp_data.csv:\n\n\n###### In [3]: df = read_csv(“/Users/shiva/tmp/data_analysis/tcp_data.csv”)\n\n In [4]: df\n\n Out[4]:\n\n <class ‘pandas.core.frame.DataFrame’>\n\n Int64Index: 6896 entries, 0 to 6895\n\n Data columns (total 4 columns):\n\n src 6896 non-null values\n\n srcport 6896 non-null values\n\n dst 6896 non-null values\n\n dstport 6896 non-null values\n\n dtypes: int64(2), object(2)\n\n In [5]: df[‘src’].value_counts()[0:10]\n\n Out[5]:\n\n tty.example.org 2866\n\n lad.example.org 1242\n\n bin.example.org 531\n\n trw.example.org 443\n\n met.example.org 363\n\n gee.example.org 240\n\n gag.example.org 126\n\n and.example.org 107\n\n cup.example.org 95\n\n chi.example.org 93\n\n dtype: int64\n\n In [6]: df[‘src’].value_counts()[0:10].plot(kind=“bar”)\n\n Out[6]: <matplotlib.axes.AxesSubplot at 0x8479c30>\n\n\n-----\n\nFigure A2\n###### Chart Generated Using Plot ()\n\n3000\n\n2500\n\n2000\n\n1500\n\n1000\n\n500\n\n0\n\n###### The beauty of pandas is in how it allows users to explore data. For example, it takes little effort\n\n to find the number of unique srcports that tty.example.org connects from for each unique dst\n\n and dstport combination it communicates with:\n\n\n###### In [229]: tty_df = df[df.src == “tty.example.org”]\n\n In [230]: num_ports = lambda x: len(set(x))\n\n In [231]: pivot_table(tty_df, rows=[‘dst’,‘dstport’], values=‘srcport’, aggfunc=num_ports)\n\n Out[231]:\n\n dst dstport\n\n add.example.org 80 2\n\n ala.example.org 80 3\n\n and.example.org 80 1\n\n auk.example.org 80 2\n\n bid.example.org 80 1\n\n …\n\n\n-----\n\n###### Start Analyzing Data\n\n The examples on the previous pages are barely a drop in the ocean and do not do justice to\n\n the tools referenced. However, they are enough for security practitioners to start performing\n\n meaningful data analysis.\n\n CSOs need to have their security practitioners wear data scientist hats. Diving into available\n\n data will yield insights that are not otherwise possible. Over time, intuition about what parts\n\n of the data to explore will develop. Some organizations may even find they can benefit from\n\n having dedicated data scientists on their teams.\n\n\n-----\n\n# About Cisco SIO\n\n\n-----\n\n### Cisco SIO\n\n###### It has become an increasingly difficult challenge to manage and secure today’s distributed and agile networks.\n\n Online criminals are continuing to exploit users’ trust in consumer applications and devices,\n\n increasing the risk to organizations and employees. Traditional security, which relies on the\n\n layering of products and the use of multiple filters, is not enough to defend against the latest\n\n generation of malware, which spreads quickly, has global targets, and uses multiple vectors \n\n to propagate.\n\n Cisco stays ahead of the latest threats by using real-time threat intelligence from Cisco\n\n Security Intelligence Operations (SIO). Cisco SIO is the world’s largest cloud-based security\n\n ecosystem, using more than 75 terabits of live data feeds from deployed Cisco email, web,\n\n firewall, and intrusion prevention system (IPS) solutions.\n\n Cisco SIO weighs and processes the data, automatically\n categorizing threats and creating rules using more than 200 Traditional \n parameters. Security researchers also collect and supply security is not \n information about security events that have the potential for enough to defend \n widespread impact on networks, applications, and devices.\n against the latest\n Rules are dynamically delivered to deployed Cisco security\n generation of \n devices every three to five minutes.\n malware.\n\n The Cisco SIO team also publishes security best practice\n\n recommendations and tactical guidance for thwarting threats. Cisco\n\n is committed to providing complete security solutions that are integrated,\n\n timely, comprehensive, and effective—enabling holistic security for organizations worldwide.\n\n With Cisco, organizations can save time researching threats and vulnerabilities and focus more\n\n on taking a proactive approach to security.\n\n For early warning intelligence, threat and vulnerability analysis, and proven Cisco mitigation\n\n solutions, please visit www.cisco.com/go/sio.\n\n\n-----\n\n### Endnotes\n\n1 \u0007For more on the any-to-any evolution, see “The Nexus of Devices, Clouds, and Applications” in the Cisco 2013 Annual\n_[Security Report: https://www.cisco.com/web/offer/gist_ty2_asset/Cisco_2013_ASR.pdf.](https://www.cisco.com/web/offer/gist_ty2_asset/Cisco_2013_ASR.pdf)_\n\n2 \u0007Ibid.\n\n3 _No More Chewy Centers: Introducing The Zero Trust Model Of Information Security\u0007_, by John Kindervag, Forrester,\nNov. 12, 2012.\n\n4 [\u0007“Timeline of Edward Snowden’s Revelations,” Al Jazeera America: http://america.aljazeera.com/articles/multimedia/](http://america.aljazeera.com/articles/multimedia/timeline-edward-snowden-revelations.html)\n[timeline-edward-snowden-revelations.html.](http://america.aljazeera.com/articles/multimedia/timeline-edward-snowden-revelations.html)\n\n5 \u0007“NSA collecting phone records of millions of Verizon customers daily,” by Glenn Greenwald, The Guardian, Jun. 5, 2013:\n[http://www.theguardian.com/world/2013/jun/06/nsa-phone-records-verizon-court-order.](http://www.theguardian.com/world/2013/jun/06/nsa-phone-records-verizon-court-order)\n\n6 GCHQ: Government Communications Headquarters, a British intelligence agency.\n\n7 \u0007“NSA infiltrates links to Yahoo, Google data centers worldwide, Snowden documents say,” by Barton Gellman and Ashkan\n[Soltani, Oct. 30, 2013, The Washington Post: http://www.washingtonpost.com/world/national-security/nsa-infiltrates-links-to-](http://www.washingtonpost.com/world/national-security/nsa-infiltrates-links-to-yahoo-google-data-centers-worldwide-snowden-documents-say/2013/10/30/e51d661e-4166-11e3-8b74-d89d714ca4dd_story.html)\n[yahoo-google-data-centers-worldwide-snowden-documents-say/2013/10/30/e51d661e-4166-11e3-8b74-d89d714ca4dd_](http://www.washingtonpost.com/world/national-security/nsa-infiltrates-links-to-yahoo-google-data-centers-worldwide-snowden-documents-say/2013/10/30/e51d661e-4166-11e3-8b74-d89d714ca4dd_story.html)\n[story.html.](http://www.washingtonpost.com/world/national-security/nsa-infiltrates-links-to-yahoo-google-data-centers-worldwide-snowden-documents-say/2013/10/30/e51d661e-4166-11e3-8b74-d89d714ca4dd_story.html)\n\n8 [\u0007For more information, see “Cisco Secure Development Life cycle (CSDL)”: http://www.cisco.com/web/about/security/cspo/](http://www.cisco.com/web/about/security/cspo/csdl/index.html)\n[csdl/index.html.](http://www.cisco.com/web/about/security/cspo/csdl/index.html)\n\n9 \u0007Ibid.\n\n10 \u0007Cisco defines the Internet of Everything as “the next wave of dramatic Internet growth that will come through the confluence\nof people, process, data and things.”\n\n11 \u0007“Massive Spam and Malware Campaign Following the Boston Tragedy,” Cisco Security Blog, Apr. 17, 2013:\n[http://blogs.cisco.com/security/massive-spam-and-malware-campaign-following-the-boston-tragedy/.](http://blogs.cisco.com/security/massive-spam-and-malware-campaign-following-the-boston-tragedy/)\n\n12 \u0007Ibid.\n\n13 \u0007Ibid.\n\n[14 \u0007Java website “About” page: http://www.java.com/en/about/.](http://www.java.com/en/about/)\n\n[15 \u0007To learn more about the “any-to-any evolution,” see the Cisco 2013 Annual Security Report: http://www.cisco.com/web/offer/](http://www.cisco.com/web/offer/gist_ty2_asset/Cisco_2013_ASR.pdf)\n[gist_ty2_asset/Cisco_2013_ASR.pdf.](http://www.cisco.com/web/offer/gist_ty2_asset/Cisco_2013_ASR.pdf)\n\n16 \u0007“Department of Labor Watering Hole Attack Confirmed to be 0-Day with Possible Advanced Reconnaissance Capabilities,”\n[by Craig Williams, Cisco Security Blog, May 4, 2013: http://blogs.cisco.com/security/department-of-labor-watering-hole-](http://blogs.cisco.com/security/department-of-labor-watering-hole-attack-confirmed-to-be-0-day-with-possible-advanced-reconnaissance-capabilities/)\n[attack-confirmed-to-be-0-day-with-possible-advanced-reconnaissance-capabilities/.](http://blogs.cisco.com/security/department-of-labor-watering-hole-attack-confirmed-to-be-0-day-with-possible-advanced-reconnaissance-capabilities/)\n\n17 \u0007“Watering-Hole Attacks Target Energy Sector,” by Emmanuel Tacheau, Cisco Security Blog, Sept. 18, 2013:\n[http://blogs.cisco.com/security/watering-hole-attacks-target-energy-sector/.](http://blogs.cisco.com/security/watering-hole-attacks-target-energy-sector/)\n\n[18 \u0007“Apache DarkLeech Compromises,” by Mary Landesman, Cisco Security Blog, Apr. 2, 2013: http://blogs.cisco.com/security/](http://blogs.cisco.com/security/apache-DarkLeech-compromises/)\n[apache-DarkLeech-compromises/.](http://blogs.cisco.com/security/apache-DarkLeech-compromises/)\n\n19 \u0007“Ongoing malware attack targeting Apache hijacks 20,000 sites,” by Dan Goodin, Ars Technica, Apr. 2, 2013:\n[http://arstechnica.com/security/2013/04/exclusive-ongoing-malware-attack-targeting-apache-hijacks-20000-sites/.](http://arstechnica.com/security/2013/04/exclusive-ongoing-malware-attack-targeting-apache-hijacks-20000-sites/)\n\n[20 \u0007“Linux/CDorked FAQS,” by Mary Landesman, Cisco Security Blog, May 1, 2013: http://blogs.cisco.com/security/](http://blogs.cisco.com/security/linuxcdorked-faqs/)\n[linuxcdorked-faqs/.](http://blogs.cisco.com/security/linuxcdorked-faqs/)\n\n21 \u0007“DarkLeech Apache Attacks Intensify,” by Matthew J. Schwartz, InformationWeek, Apr. 30, 2013:\n[http://www.informationweek.com/security/attacks/DarkLeech-apache-attacks-intensify/240153922.](http://www.informationweek.com/security/attacks/DarkLeech-apache-attacks-intensify/240153922)\n\n22 \u0007Typosquatting is the practice of registering domain names that are one character different from a popular domain name.\n\n23 \u0007“Thanks to IoE, the next decade looks positively ‘nutty,’” by Dave Evans, Cisco Platform Blog, Feb. 12, 2013:\n[http://blogs.cisco.com/news/thanks-to-ioe-the-next-decade-looks-positively-nutty/.](http://blogs.cisco.com/news/thanks-to-ioe-the-next-decade-looks-positively-nutty/)\n\n\n-----\n\n24 \u0007For more information about mitigation strategies for bitsquatting, read the Cisco white paper, Examining the Bitsquatting\n_[Attack Surface, 2013: http://blogs.cisco.com/wp-content/uploads/Schultz-Examining_the_Bitsquatting_Attack_Surface-](http://blogs.cisco.com/wp-content/uploads/Schultz-Examining_the_Bitsquatting_Attack_Surface-whitepaper.pdf)_\n[whitepaper.pdf.](http://blogs.cisco.com/wp-content/uploads/Schultz-Examining_the_Bitsquatting_Attack_Surface-whitepaper.pdf)\n\n25 \u0007“WordPress Sites in the World” and “A Look at Activity Across WordPress.com,” WordPress.com:\n[http://en.wordpress.com/stats/.](http://en.wordpress.com/stats/)\n\n26 \u0007“Important Security Update: Reset Your Drupal.org Password,” Drupal.org, May 29, 2013:\n[https://drupal.org/news/130529SecurityUpdate.](https://drupal.org/news/130529SecurityUpdate)\n\n27 \u0007A detailed report of the patterns and payloads of the Operation Ababil campaign can be found in “Cisco Event Response:\n[Distributed Denial of Service Attacks on Financial Institutions”: http://www.cisco.com/web/about/security/intelligence/](http://www.cisco.com/web/about/security/intelligence/ERP-financial-DDoS.html)\n[ERP-financial-DDoS.html.](http://www.cisco.com/web/about/security/intelligence/ERP-financial-DDoS.html)\n\n28 \u0007“DDoS Attack on Bank Hid $900,000 Cyberheist,” by Brian Krebs, KrebsonSecurity blog, Feb. 19, 2013:\n[http://krebsonsecurity.com/2013/02/ddos-attack-on-bank-hid-900000-cyberheist/.](http://krebsonsecurity.com/2013/02/ddos-attack-on-bank-hid-900000-cyberheist/)\n\n29 \u0007“Chinese Internet Hit by Attack Over Weekend,” by Paul Mozer, China Real Time Report, WSJ.com, Aug. 26, 2013:\n[http://blogs.wsj.com/chinarealtime/2013/08/26/chinese-internet-hit-by-attack-over-weekend/.](http://blogs.wsj.com/chinarealtime/2013/08/26/chinese-internet-hit-by-attack-over-weekend)\n\n[30 \u0007Source: Wikipedia: “Ingress Filtering”: http://en.wikipedia.org/wiki/Ingress_filtering.](http://en.wikipedia.org/wiki/Ingress_filtering)\n\n[31 \u0007“Understanding Unicast Reverse Path Forwarding,” Cisco website: http://www.cisco.com/web/about/security/intelligence/](http://en.wikipedia.org/wiki/Ingress_filtering)\n[unicast-rpf.html.](http://en.wikipedia.org/wiki/Ingress_filtering)\n\n32 \u0007“Your Hard Drive Will Self-Destruct at 2 p.m.: Inside the South Korean Cyberattack,” by Sean Gallagher, Ars Technica, Mar. 20,\n[2013: http://arstechnica.com/security/2013/03/your-hard-drive-will-self-destruct-at-2pm-inside-the-south-korean-](http://arstechnica.com/security/2013/03/your-hard-drive-will-self-destruct-at-2pm-inside-the-south-korean-cyber-attack/)\n[cyber-attack/.](http://arstechnica.com/security/2013/03/your-hard-drive-will-self-destruct-at-2pm-inside-the-south-korean-cyber-attack/)\n\n33 \u0007“Thoughts on DarkSeoul: Data Sharing and Targeted Attackers,” by Seth Hanford, Cisco Security Blog, Mar. 27, 2013:\n[http://blogs.cisco.com/tag/darkseoul/.](http://blogs.cisco.com/tag/darkseoul/)\n\n34 \u0007Ibid.\n\n35 \u0007“Cyber Gang Seeks Botmasters to Wage Massive Wave of Trojan Attacks Against U.S. Banks,” by Mor Ahuvia, RSA, Oct. 4,\n[2012: https://blogs.rsa.com/cyber-gang-seeks-botmasters-to-wage-massive-wave-of-trojan-attacks-against-u-s-banks/.](https://blogs.rsa.com/cyber-gang-seeks-botmasters-to-wage-massive-wave-of-trojan-attacks-against-u-s-banks/)\n\n36 \u0007“DDoS Attack on Bank Hid $900,000 Cyberheist,” by Brian Krebs, KrebsonSecurity blog, Feb. 19, 2013:\n[http://krebsonsecurity.com/2013/02/ddos-attack-on-bank-hid-900000-cyberheist/.](http://krebsonsecurity.com/2013/02/ddos-attack-on-bank-hid-900000-cyberheist/)\n\n[37 \u0007“Cisco projects data center-cloud traffic to triple by 2017,” ZDNet, Oct. 15, 2013: http://www.zdnet.com/cisco-projects-](http://www.zdnet.com/cisco-projects-data-center-cloud-traffic-to-triple-by-2017-7000021985)\n[data-center-cloud-traffic-to-triple-by-2017-7000021985/.](http://www.zdnet.com/cisco-projects-data-center-cloud-traffic-to-triple-by-2017-7000021985)\n\n\n-----\n\nAmericas Headquarters Asia Pacific Headquarters Europe Headquarters\nCisco Systems, Inc. Cisco Systems (USA) Pte. Ltd. Cisco Systems International\nSan Jose, CA Singapore BV Amsterdam,\n\nThe Netherlands\n\nCisco has more than 200 offices worldwide. Addresses, phone numbers, and fax numbers are listed on the\nCisco Website at www.cisco.com/go/offices.\n\nAll contents are Copyright © 2011–2014 Cisco Systems, Inc. All rights reserved. This document is Cisco Public Information. Cisco\nand the Cisco Logo are trademarks of Cisco Systems, Inc. and/or its affiliates in the U.S. and other countries. A listing of Cisco’s\ntrademarks can be found at www.cisco.com/go/trademarks. Third party trademarks mentioned are the property of their respective\nowners. The use of the word partner does not imply a partnership relationship between Cisco and any other company. (012114 v1)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Cisco - Annual Security Report - 2014.pdf"
    ],
    "report_names": [
        "Cisco - Annual Security Report - 2014.pdf"
    ],
    "threat_actors": [
        {
            "id": "ea844ee6-eb12-42c0-8426-11395fe81e6f",
            "created_at": "2022-10-25T15:50:23.300796Z",
            "updated_at": "2025-03-27T02:00:55.434471Z",
            "deleted_at": null,
            "main_name": "Night Dragon",
            "aliases": [
                "Night Dragon"
            ],
            "source_name": "MITRE:Night Dragon",
            "tools": [
                "at",
                "gsecdump",
                "zwShell",
                "PsExec",
                "ASPXSpy",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "09a8f8fe-e907-47b4-8709-a97717dde3cc",
            "created_at": "2022-10-25T16:07:23.90252Z",
            "updated_at": "2025-03-27T02:02:10.020919Z",
            "deleted_at": null,
            "main_name": "Night Dragon",
            "aliases": [],
            "source_name": "ETDA:Night Dragon",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Cain & Abel",
                "gsecdump",
                "zwShell"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "68cc6e37-f16d-4995-a75b-5e8e2a6cbb3d",
            "created_at": "2024-05-01T02:03:07.943593Z",
            "updated_at": "2025-03-27T02:05:17.259709Z",
            "deleted_at": null,
            "main_name": "BRONZE EDISON",
            "aliases": [
                "DarkSeoul",
                "Maverick Panda ",
                "Sykipot ",
                "TG-0623 ",
                "getkys",
                "APT4 "
            ],
            "source_name": "Secureworks:BRONZE EDISON",
            "tools": [
                " Wkysol",
                " ZxPortMap",
                "Gh0st RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "020794ec-7315-47de-818c-2032c362fd15",
            "created_at": "2023-01-06T13:46:38.306576Z",
            "updated_at": "2025-03-27T02:00:02.800515Z",
            "deleted_at": null,
            "main_name": "Night Dragon",
            "aliases": [
                "G0014"
            ],
            "source_name": "MISPGALAXY:Night Dragon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536042,
    "ts_updated_at": 1743041651,
    "ts_creation_date": 1390298330,
    "ts_modification_date": 1390300600,
    "files": {
        "pdf": "https://archive.orkl.eu/4d1ab373df0852e6df55bf468229b4323a60f667.pdf",
        "text": "https://archive.orkl.eu/4d1ab373df0852e6df55bf468229b4323a60f667.txt",
        "img": "https://archive.orkl.eu/4d1ab373df0852e6df55bf468229b4323a60f667.jpg"
    }
}