{
    "id": "f1ddebe9-39e1-4722-87ee-b85900470112",
    "created_at": "2023-01-12T15:00:03.300329Z",
    "updated_at": "2025-03-27T02:06:06.142379Z",
    "deleted_at": null,
    "sha1_hash": "67dffbd52bac7855dce5abd7919511d4c90a42a5",
    "title": "2017-12-19 - Novel Excel Spreadsheet Attack Launches Password Stealing Malware Loki Bot",
    "authors": "",
    "file_creation_date": "2022-05-28T17:01:18Z",
    "file_modification_date": "2022-05-28T17:01:18Z",
    "file_size": 2747479,
    "plain_text": "# Novel Excel Spreadsheet Attack Launches Password Stealing Malware Loki Bot\n\n**lastline.com/blog/password-stealing-malware-loki-bot/**\n\nDecember 19, 2017\n\nPosted by [Lastline ON DEC 19, 2017](https://www.lastline.com/author/jrivenbark/)\nLastline has uncovered a new attack vector launched through Microsoft Excel spreadsheets,\nand just recently expanded into other Office applications. The challenge is not only the novel\ntechnique used but also the difficulty in detecting it in its early stages. Too often companies,\ndue to lack of malware behavior analysis, dismiss alerts as false positives, losing precious\ntime during which the malware is busy stealing credentials. In this post, we’ll describe how\nthe attack works, and what typically happens during the initial days of the attack.\n\n## The Attack and the Payload: Dissected\n\n[Recently Lastline Labs published a blog post titled “When Scriptlets Attack,” about a trending](https://www.lastline.com/labsblog/when-scriptlets-attack-excels-alternative-to-dde-code-execution/)\nnew infection method in Microsoft Excel spreadsheets that we first saw on the 29th of\nNovember. As per the earlier blog post, we scanned the file on Virustotal and only three tools\n\n\n-----\n\ndetected it as malicious.\n\nWith such a low detection rate of this method of attack, many organisations would be at the\nmercy of the scriptlets payload. Indeed with only three detections, many would consider the\noriginal Excel infection vector to be a false positive and do no further investigation or\nremediation of this attack. The payload that is delivered by the Excel scriptlet is Loki, a\nnotorious credential stealer malware tuned to focus on exfiltrating usernames and passwords\n(see Figure A).\n\nFigure A: Dark web ad promoting Loki Bot malware for stealing credentials\n\nThis is a double whammy for most security response teams. Firstly, the low detection rate of\nthe infection vector would lean people towards a False Positive verdict. And secondly, even if\nthey discovered the main payload, Loki, mitigating the behaviour of the threat is often\nincorrectly implemented. This leaves the victimized organisation open to a secondary\nmalware-less attack when the exfiltrated credentials are used by subsequent threat actors to\ngain unauthorised access and then try to move around inside the network.\n\nFast forward nearly two weeks. As of 10 December, 12 days later after the first submission,\nthe malicious Excel scriptlet spreadsheet has attracted 12 positive verdicts on Virustotal out\nof nearly 60 AV tools (see Figure B).\n\n\n-----\n\nFigure B: Twelve days after initial detection, 12 AV tools detected this threat\n\nThe situation, now that AV tools have caught up, is that security teams suddenly receive an\nalert from an AntiVirus scan in the internal environment, and they start the validation\nprocess. In gathering intelligence on the file, they would see that it now has 12 positive\ndetections, and this level takes it over the line from a false positive to a possible malware\ninfection. Starting 12 days after the initial infection, they would try to build evidence of the\nbehaviour of the potential victim’s system and match it against any IoCs stemming from the\noriginal Excel document. The team would have to track back through various logs until they\nfound a connection to a Gabon Top Level Domain [.ga] website, offered from a free web\nhosting service that downloaded an executable file – _output23476823784.exe – to the\nvictim (see Figure C). Provided with this information, they would instigate a further scan for\nthe second stage payload, or hunt for known IoCs of the payload.\n\nFigure C\n\n\n-----\n\nConfirmation of a file hash on the local system would then be reinforced with further\nintelligence validation. The file _output23476823784.exe was unknown to VirusTotal before\nthe 10 December. However, at Day 12 we have roughly 50% of detection engines returning\npositive convictions of .exe malware file that was delivered by the Excel scriptlet.\n\nNow that we have a confirmed infection of the host, remediation action can begin. The vast\nmajority of Anti-Virus labels (see Figure E) for the _output23476823784.exe payload indicate\nthat it is a Trojan.Generic variety of payload. There are various discussed methods of\nremediating a generic Trojan infection including using cleanup tools from AntiVirus vendors,\nor as is often the case, a simple re-image of the system.\n\n\n-----\n\nFigure E: AV tools identified the malware as a generic Trojan\n\nTo summarize, as of the end of Day 12, we found an infected client with a malicious Excel\nspreadsheet that communicated with a domain and installed a generic Trojan, which was\nsubsequently detected and the client system was reimaged. Further studying of logs found\n\n\n-----\n\nthat the generic Trojan made some callbacks to a C&C server, but no lateral movement was\nseen, and a decision was made to close the incident.\n\n## Detection Balance, not Bias\n\nTwo pieces of conventional wisdom have driven the industry into this response process:\n\n**1. Prevention is better than a cure.**\n\nNobody wants to be known as a “traditional security vendor” that cannot keep pace with the\nmassive quantities of unique malware being produced. Instead, the Security industry has\ndevised new detection methods to prevent malware from entering systems based in part on\nAI and ML, to statically determine good or bad elements of a file … This is fine if the goal is\nto try to prevent 100% of attacks from ever entering the organisation. It’s a natural\npreference to simply stop malicious attacks entering the internal network, the problem is,\nwhen you miss one, it becomes very hard to triage and mitigate threats if all you have a\nheuristic alert produced by static analysis at the gateway.\n\n**2. Nobody wants malicious software to run in a production environment.**\n\nIn attempting to address the quantity of detections issue, we, the security industry, have\nsacrificed quality of detections. We need to enrich our static protections with dynamic\nbehavioural analysis to provide better protection for the attacks that breach defences. You\nneed a malware analysis platform to do this.\n\nFigure F shows the actual capabilities or behaviours of the Trojan.generic file\n_output23476823784.exe that was downloaded from the Excel spreadsheet. We can see\nthat this Trojan is heavily weighted to stealing passwords. If our detection and remediation\nprocesses rely on static detections to alert and have no behavioural intelligence, then we are\nincorrectly closing incidents that still pose a significant risk.\n\n\n-----\n\nFigure F: Lastline’s behavioral analysis of the downloaded file\n\nBehavioral Intelligence is the ability to point security operations at clear, concise remediation\ninstructions. The Behavioral Intelligence Quotient (BIQ) is improved by extracting the\npurpose and intent of any potentially malicious encounter. The higher the BIQ in an\norganisation, the faster threat containment occurs using optimal resources with minimum\nimpact.\n\n## Getting to Know the Payload: Loki Bot\n\nThe payload in question is further identified by behavioral intelligence as Loki bot.\n\nBelow (Figure G) is a Dark Market advert for Loki.\n\n\n-----\n\nFigure G: Dark Market Ad\n\nPromotional videos of Loki, (see Figure H) demonstrate its prowess at capturing credentials\nfrom various applications, especially FireFox (47% of the stolen credentials) and Chrome\n(41%), while Windows and email credentials make up only 1-3%.\n\nFigure H: A screenshot from a Loki promotional video\n\nOnce credentials have been stolen from a victim, Loki displays which sites are now\nvulnerable to identity theft (see Figure I). These include social media sites, payment portals,\nbitcoin wallets, and even a Moroccan government login.\n\n\n-----\n\nFigure I: Vulnerable websites as per Loki\n\n## Conclusion\n\n[Our detailed Labs blog post about “When Scriptlets Attack” shows how organisations with a](https://www.lastline.com/labsblog/when-scriptlets-attack-excels-alternative-to-dde-code-execution/)\nlow BIQ suffer from extended compromise dwell time (in this case 12 days), inefficient\nresource usage, unnecessary expenditure of analyst and responder time to correctly triage\nthe threat (approximately 20 man hours), and exposure to a secondary attack vector of fileless attack using unchanged credentials to gain unauthorised access.\n\nIf you have a high BIQ, informed by malware behavioural analytics, the breach is not\ninevitable. Seeing each specific activity engineered into a file makes it immediately obvious\nwhen an encounter is malicious. Better security is not just about prevention. The scriptlet and\nLoki attack demonstrate how Behavioral intelligence with visibility of the real capabilities of\nthe attack makes it possible to detect the attack and implement mitigation efforts on day one\ninstead of waiting until day 12 when it finally is recognized by a critical mass of AV tools and\nuntold credentials have already been stolen.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-12-19 - Novel Excel Spreadsheet Attack Launches Password Stealing Malware Loki Bot.pdf"
    ],
    "report_names": [
        "2017-12-19 - Novel Excel Spreadsheet Attack Launches Password Stealing Malware Loki Bot.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535603,
    "ts_updated_at": 1743041166,
    "ts_creation_date": 1653757278,
    "ts_modification_date": 1653757278,
    "files": {
        "pdf": "https://archive.orkl.eu/67dffbd52bac7855dce5abd7919511d4c90a42a5.pdf",
        "text": "https://archive.orkl.eu/67dffbd52bac7855dce5abd7919511d4c90a42a5.txt",
        "img": "https://archive.orkl.eu/67dffbd52bac7855dce5abd7919511d4c90a42a5.jpg"
    }
}