{
    "id": "f1e889f1-c1a9-40c6-b78b-ba04556e059f",
    "created_at": "2023-01-12T15:07:21.071156Z",
    "updated_at": "2025-03-27T02:06:12.529343Z",
    "deleted_at": null,
    "sha1_hash": "275fc2d8da5d73108cc997ad82eeeae43994ddc8",
    "title": "2021-04-06 - Aurora campaign- Attacking Azerbaijan using multiple RATs",
    "authors": "",
    "file_creation_date": "2022-05-28T03:32:40Z",
    "file_modification_date": "2022-05-28T03:32:40Z",
    "file_size": 1922918,
    "plain_text": "# Aurora campaign: Attacking Azerbaijan using multiple RATs\n\n**[blog.malwarebytes.com/threat-analysis/2021/04/aurora-campaign-attacking-azerbaijan-using-multiple-rats/](https://blog.malwarebytes.com/threat-analysis/2021/04/aurora-campaign-attacking-azerbaijan-using-multiple-rats/)**\n\nThreat Intelligence Team April 6, 2021\n\n_This post was authored by Hossein Jazi_\n\nAs tensions between Azerbaijan and Armenia continue, we are still seeing a number of cyber\n[attacks taking advantage of this situation. On March 5th 2021, we reported an actor that used](https://blog.malwarebytes.com/threat-analysis/2021/03/new-steganography-attack-targets-azerbaijan/)\nsteganography to drop a new .Net Remote Administration Trojan. Since that time, we have\nbeen monitoring this actor and were able to identify new activity where the threat actor\nswitched their RAT from .Net to Python.\n\n## Document Analysis\n\nThe document targets the government of Azerbaijan using a SOCAR letter template as lure.\nSOCAR is the name of Azerbaijan’s Republic Oil and Gas Company. The document’s date is\n25th March 2021 and the letter, related to export of catalyst for analysis, is written to the\nMinistry of Ecology and Natural Resources. The document’s creation time is 28th March 2021\nand is aligned with the date mentioned on the letter. Based on the dates we believe that this\nattack happened between 28th and 30th of March 2021.\n\n\n-----\n\nFi 1 D t l\n\n\n-----\n\n[The embedded macro in this document is almost similar to what we have reported before with](https://blog.malwarebytes.com/threat-analysis/2021/03/new-steganography-attack-targets-azerbaijan/)\nsome small differences. We will talk about the similarities between these two documents in\nthe next section.\n\nThe macro has two main functions “Document_Open” and “Document_Close”. In\n_“Document_Open” after defining the required variables it creates a directory_\n(%APPDATA%\\Roaming\\nettools48\\) for its Python Rat.\n\nFigure 2: Document_Open\nIt then copies itself in a new format to the file path defined before in order to be able to extract\nthe required data from an embedded PNG file (image1.png).\n\nFigure 3: Embedded image\n\nTo extract the embedded data, it calls the “ExtractFromPng” function to identify the chunk that\nhas the embedded data. After finding the chunk, it extracts the files from the PNG file and\nwrites them into “tmp.zip”.\n\n\n-----\n\nFigure 4:\n\nChunk identification\nThe “tmp.zip” is then extracted into “%APPDATA%\\Roaming\\nettools48” directory. It contains\nthe Python 3.6 interpreter, NetTools Python library, Python Rat, the RAT C2 config, as well\n_runner.bat._\n\n\n-----\n\nFigure 5:\n\nApplication directory\nThe Python Rat will be executed when the document is closed. The “Document_Close” first\ndelays execution to bypass security detection mechanisms by creating a junk loop for 100\ntimes and then executes the runner.bat by calling Shell function.\n\nFigure 6:\n\nDocument_Close\nThe runner.bat is also delaying execution for 64 seconds and then it calls Python to execute\nthe Python RAT (vabsheche.py)\n\n\n-----\n\n```\nSET /A num %RANDOM% (80 60 + 1) / 32768 + 60\ntimeout /t %num%\nset DIR=%~dp0\n\"%DIR%\\python\" \"%DIR%\\vabsheche.py\"\n\n## Python RAT Analysis\n\n```\nThe Python RAT used by the attacker is not obfuscated and is pretty simple. It is using the\n_platform library to identify the victim’s OS type._\n\nFigure 7: OS identification\n\nThe C2 domain and port are hardcoded within a file in the RAT directory. The RAT opens this\nfile and extracts the host and port from this file.\n\nFigure\n\n8: Reads C2 config\nIn the next step if the victim is running Windows, it makes itself persistent through creating a\nscheduled task. It first checks if a scheduled task with the name “paurora*” exists or not. If it\ndoes not exist, it reads the content of bg.txt file and creates a bg.vbs file. Then adds the\ncreated VBS file to the list of scheduled tasks.\n\n\n-----\n\nFigure 9: Creates Scheduled task\nThe created VBS file calls the runner.bat to execute the Python RAT.\n\nFigure 10: Scheduled task\nThe main functionality of the RAT is through a loop that starts by creating a secure SSL\nconnection to the server using a certificate file (cert.pem) that was extracted from the PNG file\nand dropped into the RAT directory.\n\nFigure 11: Makes secure connection to server\nAfter building the secure connection to the server it goes to a loop that receives a message\nfrom the server and executes different commands based on the message type.\n\n\n-----\n\nFigure 12: Executes commands\nHere is the list of commands that can be executed by the RAT:\n\nOPEN_NEW_CONNECTION: Sends a message to the server with False as content\nHEART_BEAT: Sends a message to the server that the victim is alive\nUSER_INFO: Collects victim info including OS Name, OS Version and User Name\nSHELL: Executes shell commands received from the server\nPREPARE_UPLOAD: Checks if it can open a file to write the received data from server\ninto it and if that is the case it sends a “Ready” message to the server\nUPLOAD: Receives a buffer from the server and writes them into file\nDOWNLOAD: Archives files and sends them to the server\n\n## Similarity Analysis\n\nIn this sections we provide the similarities between two documents and TTPs used by them.\nThis will help hunters to identify the future campaigns associated with this actor.\n\n### TTPs similarities\n\n\n-----\n\nUsed steganography to embed RATs within the embedded images.\nUsed scheduled tasks for persistence. In both cases It created a VBS file to execute the\nbatch runner.\nUsed a batch file with the same name (runner.bat) to execute the final RAT.\nUsed the same technique to exfiltrate data. (Archive them and send them to the server)\n\n### Documents similarities\n\nBoth have been obfuscated using same obfuscation techniques: Inserting random\ncharacters within the meaningful names to obfuscate the functions and variables\nnames. After deobfuscation, the function graph of these two documents are almost\nsimilar.\n\nFigure 13: Socar.doc\n\nFigure 14: telebler.doc\n\nBoth have used the similar method to obfuscate strings: using “MyFunc23” function that\nreceives an array of numbers and decodes them into a string.\n\n### Other similarities\n\nboth C2 domains have resolved to the same IP address.\nThere are overlaps between the commands used by both .Net and Python RATs.\n\n## Conclusion\n\nDue to tensions between Azerbaijan and Armenia, cyber attacks against these countries have\nbeen increasing in the past year. The Malwarebytes Threat Intelligence Team is constantly\nmonitoring actors that are targeting these countries and was able to identify an actor that has\n\n\n-----\n\ntargeted Azerbaijan using different RATs. This actor has used .Net and Python RATs to infect\nvictims and steal data from them. The actor used spear phishing as initial vector that has used\nsteganography to drop a variant of its RATs.\n\n## IOCs\n\nsocar.doc 42f5f5474431738f91f612d9765b3fc9b85a547274ea64aa034298ad97ad28f4\n\nrunner.bat 82eb05b9d4342f5485d337a24c95f951c5a1eb9960880cc3d61bce1d12d27b72\n\nvabsheche.py e45ffc61a85c2f5c0cbe9376ff215cad324bf14f925bf52ec0d2949f7d235a00\n\nbg.vbs 1be8d33d8fca08c2886fa4e28fa4af8d35828ea5fd6b41dcad6aeb79d0494b67\n\nC2 Domain pook.mywire[.]org\n\nC2 IP 111.90.150.37\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-06 - Aurora campaign- Attacking Azerbaijan using multiple RATs.pdf"
    ],
    "report_names": [
        "2021-04-06 - Aurora campaign- Attacking Azerbaijan using multiple RATs.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536041,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653708760,
    "ts_modification_date": 1653708760,
    "files": {
        "pdf": "https://archive.orkl.eu/275fc2d8da5d73108cc997ad82eeeae43994ddc8.pdf",
        "text": "https://archive.orkl.eu/275fc2d8da5d73108cc997ad82eeeae43994ddc8.txt",
        "img": "https://archive.orkl.eu/275fc2d8da5d73108cc997ad82eeeae43994ddc8.jpg"
    }
}