{
    "id": "f1ed0fb5-c553-419d-b1be-d715f7532f0a",
    "created_at": "2022-10-25T16:48:20.26306Z",
    "updated_at": "2025-03-27T02:16:58.011332Z",
    "deleted_at": null,
    "sha1_hash": "af70e2e4750a95aa3748fc15e3c1fb92f1b47e29",
    "title": "Visa Alert and Update on the Oracle Breach",
    "authors": "Brian Krebs",
    "file_creation_date": "2016-11-15T11:24:40Z",
    "file_modification_date": "2016-11-15T11:24:40Z",
    "file_size": 434161,
    "plain_text": "**13**\n**AUG 16**\n# Visa Alert and Update on the Oracle Breach\n\nCredit card industry giant Visa on Friday issued a security alert warning companies using\npoint-of-sale devices made by Oracle‘s MICROS retail unit to double-check the machines\nfor malicious software or unusual network activity, and to change passwords on the devices.\nVisa also published a list of Internet addresses that may have been involved in the Oracle\nbreach and are thought to be closely tied to an Eastern European organized cybercrime gang.\n\nThe Visa alert is the first substantive document that tries to help explain what malware and\nwhich malefactors might have hit Oracle — and by extension many of Oracle’s customers —\nsince KrebsOnSecurity [broke news of the breach on Aug. 8. That story cited sources close to](http://krebsonsecurity.com/2016/08/data-breach-at-oracles-micros-point-of-sale-division/)\nthe investigation saying hackers had broken into hundreds of servers at Oracle’s retail\ndivision, and had completely compromised Oracle’s [main online support portal for MICROS](https://web.archive.org/web/20160115134519/https:/usc.micros.com/agent/login/login.asp)\ncustomers.\nMICROS is among the top three point-of-sale vendors globally. Oracle’s MICROS division sells\npoint-of-sale systems used at more than 330,000 cash registers worldwide. When Oracle\nbought MICROS in 2014, the company said MICROS’s systems were deployed at some\n200,000+ food and beverage outlets, 100,000+ retail sites, and more than 30,000 hotels.\n\nIn short, tens of millions of credit cards are swiped at MICROS terminals monthly, and a\nbreach involving the theft of credentials that might have granted remote access to even just a\nsmall percentage of those systems is potentially a big and costly problem for all involved.\n\nSo far, however, most MICROS customers are left scratching their heads for answers.\nA [frequently asked questions bulletin (PDF) Oracle also released last Monday held little useful](http://krebsonsecurity.com/wp-content/uploads/2016/08/FAQ.pdf)\ninformation. Oracle issued the same [cryptic response](https://krebsonsecurity.com/wp-content/uploads/2016/08/oraclehosp.png) to everyone who asked for particulars\nabout how far the breach extended. “Oracle has detected and addressed malicious code in\ncertain legacy MICROS systems.”\nOracle also urged MICROS customers to change their passwords, and said “we also\nrecommend that you change the password for any account that was used by a MICROS\nrepresentative to access your on-premises systems.”\n\n\n-----\n\n_One of two documents Oracle sent to MICROS customers and the sum total of information the company has_\n\n_released so far about the breach._\n\nSome technology and fraud experts, including Gartner Analyst Avivah Litan, read that\nstatement highlighted in yellow above as an acknowledgement by Oracle that hackers may\nhave abused credentials gained in the MICROS portal breach to plant malicious code on the\npoint-of-sale devices run by an unknown number of MICROS customers.\n“This [incident] could explain a lot about the source of some of these retail and merchant\npoint-of-sale hacks that nobody has been able to definitively tie to any one point-of-sale\nservices provider,” Litan told me last week. “I’d say there’s a big chance that the hackers in this\ncase found a way to get remote access” to MICROS customers’ on-premises point-of-sale\ndevices.”\n\nClearly, Visa is concerned about this possibility as well.\n\n## INDICATORS OF COMPROMISE\n\nIn my original story about the breach, I wasn’t able to reveal all the data I’d gathered about the\napparent source of the attacks and attackers. A key source in that story asked that I\ntemporarily delay publishing certain details of the investigation, specifically those known as\nindicators of compromise (IOCs). Basically, IOCs are list of suspect Internet addresses,\ndomain names, filenames and other curious digital clues that are thought to connect the victim\nwith its attacker.\n\n\n-----\n\nI’ve been inundated all week with calls and emails from security experts asking for that very\ndata, but sharing it wasn’t my call. That is, until yesterday (8/12/16), when Visa published a\n“merchant communication alert” to some customers. In [that alert](http://krebsonsecurity.com/wp-content/uploads/2016/08/Visa-PFD-MICROS-Alert-12AUG16.pdf) (PDF), Visa published\nIOCs that may be connected with the intrusion. These IOCs could be extremely useful to\nMICROS customers because the presence of Internet traffic to and from these online\ndestinations would strongly suggest the organization’s point-of-sale systems may be similarly\ncompromised.\nSome of the addresses on this list from Visa are known to be associated with the Carbanak\n**Gang, a group of Eastern European hackers that Russian security firm Kaspersky**\n**[Labestimates](https://blog.kaspersky.com/billion-dollar-apt-carbanak/7519/)** has stolen more than $1 billion from banks and retailers. Here’s the IOCs list\nfrom the alert Visa pushed out Friday:\n\n_Visa warned merchants to check their systems for any communications to and from these Internet addresses_\n\n_and domain names associated with a Russian organized cybercrime gang called “Carbanak.”_\n\nThankfully, since at least one of the addresses listed above (192.169.82.86) matched what’s on\nmy source’s list, the source agreed to let me publish the entire thing. [Here it is. I checked my](http://krebsonsecurity.com/wp-content/uploads/2016/08/carboracle.txt)\nsource’s list and found at least five Internet addresses that were seen in both the Oracle attack\nand in [a Sept. 2015 writeup about Carbanak by ESET Security, a Slovakian antivirus and](http://www.welivesecurity.com/2015/09/08/carbanak-gang-is-back-and-packing-new-guns/)\nsecurity company. [NB: If you are unskilled at safely visiting malicious Web sites and/or\nhandling malware, it’s probably best not to visit the addresses in the above-linked list.]\nVisa also mentioned a specific POS-malware threat in its alert called “MalumPOS.”\nAccording to researchers at Trend Micro, MalumPOS is malware designed to target point_of-sale systems in hotels and related industries. In fact, Trend_ _[found](http://blog.trendmicro.com/trendlabs-security-intelligence/trend-micro-discovers-malumpos-targets-hotels-and-other-us-industries/)_ _that MalumPOS is set_\n_up to collect data specifically from point-of-sale systems running on Oracle’s MICROS_\n_platform._\nIt should come as no surprise then that many of Oracle’s biggest customers in the hospitality\nindustry are starting to make noise, accusing Oracle of holding back key information that could\nhelp MICROS-based companies stop and clean up breaches involving malware and stolen\ncustomer credit card data.\n\n\n-----\n\n### “Oracle’s silence has been deafening,” said Michael Blake, chief\n executive officer at HTNG, a trade association for hotels and\n technology.\n\n“Oracle’s silence has been deafening,” said Michael Blake, chief executive officer at [HTNG,](http://www.htng.org/)\na trade association for hotels and technology. “They are still grappling and trying to answer\nquestions on the extent of the breach. Oracle has been invited to the last three [industry] calls\nthis week and they are still going about trying to reach each customer individually and in the\nprocess of doing so they have done nothing but given the lame advice of changing passwords.”\nThe hospitality industry has been particularly hard hit by point-of-sale compromises over the\npast two years. Last month, KrebsOnSecurity broke the news of [a breach at Kimpton](http://krebsonsecurity.com/2016/07/kimpton-hotels-probes-card-breach-claims/)\n[Hotels](http://krebsonsecurity.com/2016/07/kimpton-hotels-probes-card-breach-claims/) (Kimpton appears to run MICROS products, but the company declined to answer\nquestions for this story).\nKimpton joins a long list of hotel brands that have acknowledged card breaches over the last\nyear, including Trump [Hotels (twice),](http://krebsonsecurity.com/2016/04/sources-trump-hotels-breached-again/) [Hilton, Mandarin](http://krebsonsecurity.com/2015/09/banks-card-breach-at-hilton-hotel-properties/) Oriental, and [White](http://krebsonsecurity.com/2014/01/hotel-franchise-firm-white-lodging-investigates-breach/)\n[Lodging(twice),](http://krebsonsecurity.com/2014/01/hotel-franchise-firm-white-lodging-investigates-breach/) [Starwood Hotels and](http://krebsonsecurity.com/2015/11/starwood-hotels-warns-of-credit-card-breach/) [Hyatt. In many of those incidents, thieves had planted](http://krebsonsecurity.com/2016/01/hyatt-card-breach-hit-250-hotels-in-50-nations/)\nmalicious software on the point-of-sale devices at restaurants and bars inside of the hotel\nchains. And, no doubt, many of those cash registers were run on MICROS systems.\nIf Oracle doesn’t exactly know which — if any — of its MICROS customers had malware on\ntheir point-of-sale systems as a result of the breach, it may be because the network intruders\ndidn’t have any reason to interact with Oracle’s customers via the MICROS portal after stealing\nusernames and passwords that would allow them to remotely access customer on-premises\nsystems. In theory, at that point the fraudsters could have bypassed Oracle altogether from\nthen on.\n## BREACHED BY MULTIPLE ACTORS?\n\nAnother possibly interesting development in the Oracle breach story: There are indications\nthat Oracle may have been breached by more than one cybercrime group. Or at least handed\noff from one to the other.\n\nLate this week, Thomas Fox-Brewster at Forbes [published a story](http://www.forbes.com/sites/thomasbrewster/2016/08/11/oracle-micros-hackers-breach-five-point-of-sale-providers/#5f737775eb87) noting that MICROS\nwas just one of at least five point-of-sale companies that were recently hacked by a guy who —\nfrom an exhaustive review of his online chats — appears to have just sat himself down one day\nand decided to hack a bunch of point-of-sale companies.\nForbes quoted my old friend Alex Holden of [Hold Security](http://www.holdsecurity.com/) saying he had evidence that\nhackers had breached at least 10 payment companies, and the story focuses on getting\nconfirmation from the various other providers apparently breached by the same cybercriminal\nactor.\nHolden showed me multiple pages worth of chat logs between two individuals on a cybercrime\nforum [full disclosure: Holden’s company lists me as an adviser, but I accept no compensation\nfor that role, and he ignores most of my advice].\n\nThe discussion between the two hackers begins around July 15, 2016, and goes on for more\nthan a week. In it, the two hackers have been introduced to one another through a mutual,\ntrusted contact. For a while, all they discuss is whether the seller can be trusted to deliver the\nOracle MICROS database and control over the Oracle MICROS customer ticketing portal.\n\nIn the end, the buyer is convinced by what he sees and agrees to pay the bitcoin equivalent of\nroughly USD $13,000 for access to Oracle’s MICROS portal, as well as a handful of other pointof-sale Web sites. The buyer’s bitcoin wallet and the associated transactions can be seen [here.](https://blockchain.info/address/1PmNrYJJAujjehkr84jpQY956ezroi8PS6)\n\n\n-----\n\n_A screen shot shared by one of the hackers involved in compromising Oracle’s MICROS support portal. This_\n\n_screen shot was taken of a similar Web shell the hackers placed on the Web site of another POS provider (this is_\n\n_not the shell that was on Oracle)._\n\nAccording to the chat log, the hacker broke in by exploiting a file-upload function built into\nthe MICROS customer support portal. From there the attackers were able to upload an attack\n[tool known as a “WSO Web Shell.” This is a crude but effective text-based control panel that](https://www.google.com/search?site=&tbm=isch&source=hp&biw=1280&bih=855&q=wso+shell&oq=wso+shell&gs_l=img.3..0j0i24k1l9.1755.3480.0.3808.9.7.0.2.2.0.134.745.2j5.7.0....0...1ac.1.64.img..0.9.752...0i30k1.6BUq9nVnmJs)\nhelps the attacker install additional attack tools to harvest data from the compromised Web\nserver (see screen shot above). The beauty of a Web shell is that the attacker can control the\ninfected site using nothing more than a Web browser, using nothing more than a hidden login\npage and a password that only he knows.\nThe two hackers discussed and both viewed more than [a half-dozen files](http://krebsonsecurity.com/wp-content/uploads/2016/08/OracleMICROSwebshell.txt) that were apparently\nleft behind on the MICROS portal by the WSO shell they uploaded in mid-July (most of the\nmalicious files ended in the file extension “wso.aspx”). The chat logs show the pair of\nmiscreants proceeding to target another 9 online payment providers or point-of-sale vendors.\nSome of those companies were quoted in the Forbes piece having acknowledged a breach\nsimilar to the Web shell attack at Oracle. But none of them have anywhere near the size of\nOracle’s MICROS customer base.\n\n## GOOD HOSPITALITY, OR SWEPT UNDER THE RUG?\n\nOracle maintains in [its FAQ (PDF) about the MICROS attack that “Oracle’s Corporate network](http://krebsonsecurity.com/wp-content/uploads/2016/08/FAQ.pdf)\nand Oracle’s other cloud and service offerings were not impacted.” But a confidential source\nwithin Oracle’s Hospitality Division told KrebsOnSecurity that the breach first started in one\nof Oracle’s major point-of-sale data centers — specifically the company’s large data center in\nManassas, Va.\nAccording to my source, that particular center helps large Oracle hospitality industry clients\nmanage their fleets of MICROS point-of-sale devices.\n\n“Initially, the customer’s network and the internal Oracle network were on the same network,”\nsaid my source, who spoke under condition of anonymity because he did not have permission\n\n\n-----\n\nfrom his employer to speak on the record. “The networking team did a network segmentation\nof these two networks — ironically for security purposes. However, it seems as if what they\nhave done actually allowed access from the Russian Cybercrime group.”\n\nMy source said that in mid-July 2016 Oracle sent out an email alert to employees of its\nhospitality division that they had to re-image their laptops without backing anything up.\n\n“All of the files and software that were on an employee’s computer were deleted, which was\ncrippling to business operations,” my source recalled. “Project management lost all their\nschedules, deployment teams lost all the software that they use to install on customer sites.\nOracle did not tell the employees in this email that they got hacked but just to re-image\neverything with no backups. It seems as if Oracle did a pretty good job sweeping this incident\nunder the rug. Most employees don’t know about the hack and it hasn’t been a huge deal to\nthe customers. However, it is estimated that this cost them billions, so it is a really major\nbreach.”\n\nI sent Oracle a litany of questions based on the above, but a spokesperson for the company\nsaid Oracle would comment on none of it.\n\n= Indicators =\n```\n104.156.240.212\n104.232.35.136\n104.250.153.57\n107.181.246.211\n107.181.250.221\n108.61.57.43\n128.177.144.59\n144.168.45.128\n151.80.8.10\n162.212.105.78\n172.28.202.31\n184.22.81.68\n185.29.9.28 (c)\n185.86.149.115\n185.86.149.60\n186.106.120.113\n190.82.81.132\n194.146.180.58\n195.154.43.52\n198.23.210.156\n207.182.98.21\n208.167.254.234\n209.51.131.190\n216.155.131.74\n216.170.116.120\n220.130.157.99\n23.227.196.99\n23.249.164.109\n31.131.17.128\n45.63.23.135\n\n```\n\n-----\n\n```\n45.63.96.216\n5.45.179.185\n5.45.192.117\n51.254.95.100\n51.254.95.99\n59.55.142.171\n60.228.38.213/login.aspx\n66.232.124.175\n71.63.154.49\n72.233.55.10\n74.125.39.18\n80.83.118.240\n80.83.118.245\n82.163.78.188\n83.183.76.156\n85.186.125.217\n86.55.7.54\n87.236.210.109\n87.236.210.116\n87.98.153.34\n91.207.60.68\n94.140.120.133\n95.215.44.136\n95.215.45.228\n95.215.45.64\n95.215.45.69\n95.215.45.90\n95.215.45.98\n95.215.46.2\n95.215.46.32\n95.215.46.76\n95.85.12.179\n98.129.249.174\nclients14-google.com\nmail.clients12-google.com\nns1.stats1-google.com\nns2.stats1-google.com\nwambiri.net/login.aspx\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/ejrvucttqc6eanln2kkmqtjklg563jxg"
    ],
    "report_names": [
        "BrianKrebs_Carbanak-Oracle-breach(08-13-2016)"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041818,
    "ts_creation_date": 1479209080,
    "ts_modification_date": 1479209080,
    "files": {
        "pdf": "https://archive.orkl.eu/af70e2e4750a95aa3748fc15e3c1fb92f1b47e29.pdf",
        "text": "https://archive.orkl.eu/af70e2e4750a95aa3748fc15e3c1fb92f1b47e29.txt",
        "img": "https://archive.orkl.eu/af70e2e4750a95aa3748fc15e3c1fb92f1b47e29.jpg"
    }
}