{
    "id": "f2009e5f-9699-45ed-ab44-afc8247c87a7",
    "created_at": "2023-05-06T02:09:13.2498Z",
    "updated_at": "2025-03-27T02:14:11.926825Z",
    "deleted_at": null,
    "sha1_hash": "423d4262d79ae4e3077ac353a208240623b2ad55",
    "title": "2022-12-05 - Popularity spikes for information stealer malware on the dark web",
    "authors": "",
    "file_creation_date": "2023-05-05T02:08:32Z",
    "file_modification_date": "2023-05-05T02:08:32Z",
    "file_size": 453867,
    "plain_text": "# Infostealer Malware on the Dark Web\n\n**[accenture.com/us-en/blogs/security/information-stealer-malware-on-dark-web](https://www.accenture.com/us-en/blogs/security/information-stealer-malware-on-dark-web)**\n\nShare\n\nInformation stealer (infostealer) malware—malicious software designed to steal victim\ninformation, including passwords—has become one of the most discussed malware types\non the cybercriminal underground in 2022 according to Accenture’s Cyber Threat\nIntelligence team (ACTI). This is due to infostealers’ ability to harvest cookie data,\nusernames, and passwords, their cheap cost, and their availability as a malware-as-aservice offering, which allows actors with few resources or little technical knowledge to\ndeploy the malware and access others’ networks.\n\nWhile more organizations worldwide are implementing multi-factor authentication (MFA) at\nan increasing rate to protect against the theft of user credentials, this protection is proving\ninsufficient. In 2022, ACTI saw cyber threat actors successfully combine stolen credentials\nand social engineering to carry out high-profile breaches; the success of those breaches\nonly further increased the demand for infostealers on the dark web. In addition, the volume\nof victim data included in logs for sale on underground marketplaces rose between June\nand October of 2022. The popularity spike in infostealers also drove underground actors to\nadvertise on the dark web a variety of new infostealer malware variants.\n\n**MFA fatigue attacks**\n\nIn 2022, the high-profile breaches of several large organizations illustrated the ease at\nwhich threat actors can breach network defenses using stolen employee credentials and\nleveraging MFA fatigue attacks. MFA fatigue attacks involve repeated attempts to log on to\nan MFA-enabled account using stolen credentials, thereby bombarding a potential victim\nwith MFA push requests. In such scenarios, some MFA request recipients accept MFA\nrequests to stop the requests from appearing on connected devices, unknowingly granting\ncriminal access to the now-victims’ systems. In one such attack, threat actors also used a\npopular messaging app to contact victims, purporting to be the victim organization’s IT\ndepartment and social engineering the victim into accepting MFA requests.\n\nThe notorious LAPSUS$ group relied on MFA fatigue attacks for several of its operations in\n[2022. Microsoft investigated LAPSUS$ and concluded the group had obtained credentials](https://www.microsoft.com/en-us/security/blog/2022/03/22/dev-0537-criminal-actor-targeting-organizations-for-data-exfiltration-and-destruction/)\nby:\n\nDeploying the malicious RedLine infostealer to obtain passwords and session tokens.\n\n\n-----\n\nPurchasing credentials and session tokens on criminal underground forums.\nPaying employees at targeted organizations or their suppliers and business partners\nfor access to credentials and MFA approvals.\nSearching public code repositories for exposed credentials.\n\nThis group serves as just one example of real-world criminal use of infostealers in\ncombination with MFA fatigue attacks that have contributed to the surge in popularity for\ninfostealers and the growth of compromised credential marketplaces.\n\n**The rise of compromised credential marketplaces**\n\nACTI monitors several of the most prominent compromised credential marketplaces and\nfound a marked increase in the number of logs for sale from July to October 2022.\n\n**_Russian Market_**\n\nAccess to the Russian Market site allows visitors to search for inventory by malware used,\nvictim operating system, and victim location. This site was among the most popular markets\nin 2022 based on volume of logs available for sale, with victim data sold for an average\nprice of $10 per log. The total number of logs for sale in this market rose by nearly 40%\nfrom approximately 3.3 million to 4.5 million between July and October 2022.\n\n**_Malware_**\n\nIn log advertisements, Russian Market vendors include the malware they used to obtain\ncredentials for sale. So far in 2022, RedLine, Raccoon Stealer, Vidar, Taurus, and AZORult\nare the five infostealers actors have used to obtain the logs on Russian Market (see Figure\n1). Between July and October 2022, RedLine remained the dominant infostealer; however,\nits use decreased from 56% of the total market to 48% in October 2022. Use of the popular\nRaccoon Stealer, on the other hand, increased from 11% to 22% between July and October\n2022, coinciding with the release of Raccoon Stealer v2 on June 30, 2022.\n\n<<< Start >>>\n\n\n-----\n\n**Figure 1: Infostealers cybercriminals used most to obtain the credentials for sale on**\nRussian Market in July and October 2022\n\n<<< End >>>\n\n**_Victimology_**\n\nFrom July to October 2022, the top three countries with the highest number of infostealer\nvictims on Russian Market were India, Indonesia, and Brazil. These countries making up\nthe highest number of infostealer victims is likely due to the vast population of each country\ncombined with a relative low level of cybersecurity awareness in each nation. Between July\nand October 2022, the number of infostealer victims in these counties increased by 33% in\nIndia, 30% in Indonesia, and 40% in Brazil. The remaining seven of the top 10 countries\nwere Pakistan, Vietnam, Egypt, Thailand, Philippines, Turkey, and the U.S.\n\n**What’s next?**\n\n**_Shift toward private sales for quality logs_**\n\nPrivate log sales, which are common on dark web forums, usually involve sellers fostering\nrelationships with trusted buyers who are willing to pay a little more than buyers on open\nmarketplaces. Often, sellers offer the best logs to trusted buyers first and sell the remaining\nlogs on marketplace’s general pages. While ACTI expects marketplaces selling infostealerobtained logs to continue to thrive, the ever-increasing volume of stolen data available on\nthese forums will lead to the highest-quality logs inevitably becoming harder to find as\ntrusted buyers begin to obtain high-value logs through private sales.\n\nTo cater to buyers wanting high-quality logs, the operators of Russian Market added a preorder option on the forum's Stealer Logs section in October 2022. Users with a balance of\nUS$1,000 in their general accounts on the site can provide a list of domains they wish to\n\n\n-----\n\ntarget and will receive notifications of the availability of logs affecting those domains before\nthose logs become available to the rest of the market.\n\n**_Cybercriminals advertise wave of new infostealer-related products on the dark web_**\n\nWith the success of infostealers in 2022, there have been a wave of advertisements for new\nvariants of stealers, enhanced infostealers, and infostealer source code available on the\ncybercriminal underground. The following is a table of notable related advertisements on\ndark web forums from July to October 2022:\n\n**Date** **Forum** **Malware Name** **Price in US Currency**\n\nJul-19-22 Breached Whisper $100\n\nJul-20-22 Sinisterly Gomorrah v5 $150\n\nJul-29-22 LolzGuru Erbium $1,000\n\nJul-31-22 XSS BlackIce $120\n\nAug-15-22 XSS LummaC $1,000\n\nAug-29-22 Exploit Rhadamanthys $999\n\nAug-30-22 Opencard GRIM_NOID $300\n\nSep-02-22 XSS BLUEFOX v2 $350\n\nSep-18-22 Exploit Psigo $321\n\nOct-01-22 Exploit AcridRain $400\n\nOct-08-22 XSS Unnamed $90\n\n**Figure 2: Table of Infostealers Malware Advertisements and Pricing from July to October**\n2022\n\nThe sale of these new strains, combined with the availability of enhanced infostealers and\ninfostealer source code will lead to increased dark web log sale activity both on\nmarketplaces’ “public” spaces and through private sales.\n\n**_New kids on the block_**\n\n**Meta Stealer**\n\nWhile Raccoon, Redline, and Vidar continue to account for the majority of dark web\nmarketplace stock, one new infostealer has forced its way in: Meta Stealer. Underground\nusers first advertised this infostealer on cybercrime forums in March 2022, with\nadvertisements stating that developers heavily based its code on that of Redline but that\n\n\n-----\n\nMeta Stealer had additional features and was less detectible by anti-virus and endpoint\ndetection software. As of November 2022, Meta Stealer costs US$150 per month or\nUS$1,000 for a lifetime license.\n\nSince May 2022, Meta Stealer logs have been appearing on 2easy Market, which has\nadded approximately 13,000 logs as of November 4, 2022. ACTI expects Meta Stealer to\nsee increased popularity as those behind more-established strains lose interest, lose\ncontrol, or find it too tough to continue to bypass anti-virus and endpoint protection\nsoftware.\n\n**Rhadamanthys**\n\nAs Figure 2 references, the Rhadamanthys infostealer appeared on the Exploit forum on\nAugust 29, 2022. The following factors indicate Rhadamanthys is a genuine, powerful\ninfostealer and ads for it are not scams or for sales of a revamped version of previously\nleaked malware code:\n\nVery positive feedback (commenters on the forum thread have praised the quality of\nthe build and its low anti-virus software detection rate)\nThe level of detail on the infostealer the actors operating the forum thread provided\nThe use of a guarantor\nThe samples of the malware the sellers shared with forum members\nThe support of the actors behind the Rhadamanthys forum accounts\n\nACTI assesses Rhadamanthys is a powerful tool for those looking to gain access to\ncorporate networks. The malware can obtain credentials and information from a host of\nplatforms including major browsers, email clients, messaging platforms, and crypto apps\nand wallets. In addition, it targets logs from MFA apps, including Authenticator, Authy, EOS\nAuthenticator, and GAuth Authenticator, as well as Outlook and Slack, and harvests\ncookies. This infostealer can also use a control panel to export cookies (Figure 3) and plug\nthem into a bespoke browser, which helps bypass the need for passwords to access\ntargeted domains. The bespoke browser is Genesium—the browser the operators of the\nunderground marketplace Genesis Market created and have used.\n\n<<< Start >>>\n\n\n-----\n\n**Figure 3: Export Cookie Functionality of Rhadamanthys Stealer**\n\n<<< End >>>\n\nACTI expects to see Rhadamanthys grow in popularity and become a market leader, and\nfor other dark web infostealer vendors to look to emulate this level of success.\n\n**_Law enforcement action unlikely to stem the tide_**\n\nOn October 26, 2022, the U.S. Department of Justice announced the arrest of a major\nplayer behind the Raccoon Stealer operation and the FBI stated it had dismantled Raccoon\nStealer infrastructure. However, on October 30, 2022, the operators of the \"raccoonstealer\"\naccount on the Exploit forum stated the project is still running and servers remain safe, as\nFigure 4 illustrates.\n\n<<< Start >>>\n\n**Figure 4: Update From raccoonstealer Account on Exploit Forum on October 30, 2022**\n\n<<< End >>>\n\n\n-----\n\nRegardless of whether the arrest ultimately affects Raccoon Stealer operations, it might\nmotivate other actors to try to fill the space Raccoon Stealer could leave behind.\n\n**Conclusion and mitigation**\n\nACTI expects the infostealer landscape to continue to evolve and pose a significant risk to\norganizations in 2023. Organizations should examine how they authenticate user access to\ntheir systems and consider moving away from MFA push notifications and toward numbermatching MFA systems and the use of biometrics to dull the effects of infostealers.\nOrganizations should also fully train staff on the dangers of MFA fatigue attacks, social\nengineering attempts, and how to secure online accounts. Monitoring of dark web sources\nto obtain threat intelligence on the latest tactics, techniques, and procedures relating to\ninfostealer malware should also help get ahead of the latest threats in this sphere.\n\n_The Accenture Cyber Threat Intelligence (ACTI) team provides actionable intelligence and_\n_relevant decision support to help organizations detect, analyze and mitigate threats._\n\n**_Accenture Security is a leading provider of end-to-end cybersecurity services, including_**\n_advanced cyber defense, applied cybersecurity solutions and managed security operations._\n_We bring security innovation, coupled with global scale and a worldwide delivery capability_\n_through our network of Advanced Technology and Intelligent Operations centers. Helped by_\n_our team of highly skilled professionals, we enable clients to innovate safely, build cyber_\n_[resilience and grow with confidence. Follow us @AccentureSecure on Twitter,](https://twitter.com/accenturesecure)_ _[LinkedIn or](https://www.linkedin.com/showcase/accenture_security/)_\n_visit us at_ _[accenture.com/security.](http://www.accenture.com/security)_\n\n_Accenture, the Accenture logo, and other trademarks, service marks, and designs are_\n_registered or unregistered trademarks of Accenture and its subsidiaries in the United States_\n_and in foreign countries. All trademarks are properties of their respective owners. All_\n_materials are intended for the original recipient only. The reproduction and distribution of_\n_this material is forbidden without express written permission from Accenture. The opinions,_\n_statements, and assessments in this report are solely those of the individual author(s) and_\n_do not constitute legal advice, nor do they necessarily reflect the views of Accenture, its_\n_subsidiaries, or affiliates. Given the inherent nature of threat intelligence, the content_\n_contained in this article is based on information gathered and understood at the time of its_\n_creation. It is subject to change. Accenture provides the information on an “as-is” basis_\n_without representation or warranty and accepts no liability for any action or failure to act_\n_taken in response to the information contained or referenced in this report._\n\n_Copyright © 2022 Accenture. All rights reserved._\n\n\n-----\n\nPaul Mansfield\n\nCyber Threat Intelligence Analyst\n\nPaul is a lead analyst on Accenture’s iDefense Reconnaissance Team, producing\nactionable intelligence and tracking threat actors.​\n\nFollow me:\n\nThomas “Mannie” Willkan\n\nCyber Threat Intelligence Consultant\n\nThomas ‘Mannie’ Willkan is a Senior Threat Intelligence professional specialising in\nemerging technologies and the Dark Web criminal underground.\n\nFollow me:\n\nHoward Marshall\n\nManaging Director – Accenture Security, Global Cyber Threat Intelligence Lead\n\nAs the global lead for the Cyber Threat Intelligence (CTI) program, Howard directs a team\nof highly skilled cybersecurity specialists.\n\nFollow me:\n\n\n-----\n\nSubscription Center\n\nSubscribe to Security Blog\nSubscribe to Security Blog\n\nSubscribe\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-05 - Popularity spikes for information stealer malware on the dark web.pdf"
    ],
    "report_names": [
        "2022-12-05 - Popularity spikes for information stealer malware on the dark web.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2347282d-6b88-4fbe-b816-16b156c285ac",
            "created_at": "2024-06-19T02:03:08.099397Z",
            "updated_at": "2025-03-27T02:05:17.390442Z",
            "deleted_at": null,
            "main_name": "GOLD RAINFOREST",
            "aliases": [
                "Strawberry Tempest ",
                "Lapsus$"
            ],
            "source_name": "Secureworks:GOLD RAINFOREST",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1683338953,
    "ts_updated_at": 1743041651,
    "ts_creation_date": 1683252512,
    "ts_modification_date": 1683252512,
    "files": {
        "pdf": "https://archive.orkl.eu/423d4262d79ae4e3077ac353a208240623b2ad55.pdf",
        "text": "https://archive.orkl.eu/423d4262d79ae4e3077ac353a208240623b2ad55.txt",
        "img": "https://archive.orkl.eu/423d4262d79ae4e3077ac353a208240623b2ad55.jpg"
    }
}