{
    "id": "f207756c-1b98-47d6-bf0e-774ccdc2f85f",
    "created_at": "2022-10-25T16:48:11.776161Z",
    "updated_at": "2025-03-27T02:16:25.754525Z",
    "deleted_at": null,
    "sha1_hash": "587ded1cca5d59b0ff19a61fa41424eb703f5745",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-01-06T17:01:04Z",
    "file_modification_date": "2021-01-07T06:14:38Z",
    "file_size": 657001,
    "plain_text": "# 6 January 2021\n\nPIN Number\n# 20210106-001\n\nPlease contact the FBI with\nany questions related to this\nPrivate Industry Notification\nat either your local Cyber\n**Task Force or FBI CyWatch.**\n\nLocal Field Offices:\n**www.fbi.gov/contact-us/field-**\n**offices**\n\nE-mail:\n**cywatch@fbi.gov**\n\nPhone:\n**1-855-292-3937**\n\n\nThe following information is being provided by the FBI, with no\nguarantees or warranties, for potential use at the sole discretion of\nrecipients to protect against cyber threats. This data is provided to\nhelp cyber security professionals and system administrators guard\nagainst the persistent malicious actions of cyber actors. This product\nwas coordinated with DHS-CISA.\n\nThis PIN has been released TLP: WHITE: Subject to standard copyright\nrules, TLP: WHITE information may be distributed without restriction.\n\n# Egregor Ransomware Targets Businesses Worldwide, Attempting to Extort Businesses by Publicly Releasing Exfiltrated Data \n\n**Summary**\n\nThe FBI first observed Egregor ransomware in September 2020. To\ndate, the threat actors behind this ransomware variant claim to have\ncompromised over 150 victims worldwide. Once a victim company’s\nnetwork is compromised, Egregor actors exfiltrate data and encrypt\nfiles on the network. The ransomware leaves a ransom note on\nmachines instructing the victim to communicate with the threat actors\nvia an online chat. Egregor actors often utilize the print function on\nvictim machines to print ransom notes. The threat actors then demand\na ransom payment for the return of exfiltrated files and decryption of\nthe network. If the victim refuses to pay, Egregor publishes victim data\nto a public site.\n\n\nThe following information is being provided by the FBI, with no\n\n\n-----\n\n**Threat Overview**\n\nThe FBI assesses Egregor ransomware is operating as a Ransomware as a Service Model. In this model,\nmultiple different individuals play a part in conducting a single intrusion and ransomware event. Because of\nthe large number of actors involved in deploying Egregor, the tactics, techniques, and procedures (TTPs)\nused in its deployment can vary widely, creating significant challenges for defense and mitigation.\nEgregor ransomware utilizes multiple mechanisms to compromise business networks, including targeting\nbusiness network and employee personal accounts that share access with business networks or devices.\nEgregor ransomware may use phishing emails with malicious attachments to gain access to network\naccounts. Egregor can also exploit Remote Desktop Protocol (RDP) or Virtual Private Networks to gain\naccess. Adversaries may also leverage Egregor’s RDP exploitation capability to laterally move inside\nnetworks.\n\nOnce Egregor gains access to the network, Egregor ransomware affiliates use common pen testing and\nexploit tools like Cobalt Strike, Qakbot/Qbot, Advanced IP Scanner, and AdFind to escalate privileges and\nmove laterally across a network, and tools like Rclone (sometimes renamed or hidden as svchost) and 7zip\nto exfiltrate data.\n\nThe FBI does not encourage paying a ransom to criminal actors. Paying a ransom emboldens adversaries to\ntarget additional organizations, encourages other criminal actors to engage in the distribution of\nransomware, and/or may fund illicit activities. Paying the ransom also does not guarantee that a victim’s\nfiles will be recovered. However, the FBI understands that when businesses are faced with an inability to\nfunction, executives will evaluate all options to protect their shareholders, employees, and customers.\nRegardless of whether you or your organization have decided to pay the ransom, the FBI urges you to\nreport ransomware incidents to your local FBI field office. Doing so provides the FBI with the critical\ninformation they need to prevent future attacks by identifying and tracking ransomware attackers and\nholding them accountable under US law.\n\n**Recommended Mitigations**\n\n    - Back-up critical data offline.\n\n    - Ensure copies of critical data are in the cloud or on an external hard drive or storage device.\n\n    - Secure your back-ups and ensure data is not accessible for modification or deletion from\n\nthe system where the data resides.\n\n    - Install and regularly update anti-virus or anti-malware software on all hosts.\n\n    - Only use secure networks and avoid using public Wi-Fi networks.\n\n    - Use two-factor authentication and do not click on unsolicited attachments or links in emails.\n\n\n**Threat Overview**\n\n\n-----\n\n    - Prioritize patching of public-facing remote access products and applications, including\n\nrecent RDP vulnerabilities (CVE-2020-0609, CVE-2020-0610, CVE-2020-16896, CVE-20191489, CVE-2019-1225, CVE-2019-1224, CVE-2019-1108).\n\n    - Review suspicious .bat and .dll files, files with recon data (such as .log files), and exfiltration\n\ntools.\n\n    - Securely configure RDP by restricting access, using multi-factor authentication or strong\n\npasswords.\n\n### Reporting Notice\n\nThe FBI encourages recipients of this document to report information concerning suspicious or criminal\nactivity to their local FBI field office or the FBI’s 24/7 CyberWatch (CyWatch). Field office contacts can\nbe identified at www.fbi.gov/contact-us/field-offices. CyWatch can be contacted by phone at (855)\n[292-3937 or by e-mail at CyWatch@fbi.gov. When available, each report submitted should include the](mailto:CyWatch@ic.fbi.gov)\ndate, time, location, type of activity, number of people, and type of equipment used for the activity,\nthe name of the submitting company or organization, and a designated point of contact. Press inquiries\n[should be directed to the FBI’s National Press Office at npo@fbi.gov or (202) 324-3691.](mailto:npo@ic.fbi.gov)\n\n### Administrative Note\n\nThis PIN has been released TLP: WHITE: Subject to standard copyright rules, TLP: WHITE information\nmay be distributed without restriction. For comments or questions related to the content or\ndissemination of this product, contact CyWatch.\n\n\n# Your Feedback Regarding this Product is Critical\n\n## Please take a few minutes to send us your feedback. Your feedback submission may be anonymous. We read each submission carefully, and your feedback will be extremely valuable to the FBI. Feedback should be specific to\n your experience with our written products to enable the FBI to make quick\n and continuous improvements to these products. Feedback may be\n submitted online here: https://www.ic3.gov/PIFSurvey\n\n\n\n       - Prioritize patching of public-facing remote access products and applications, including\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf"
    ],
    "report_names": [
        "fbi-pin-egregor-ransomware-bc-01062021.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1609952464,
    "ts_modification_date": 1610000078,
    "files": {
        "pdf": "https://archive.orkl.eu/587ded1cca5d59b0ff19a61fa41424eb703f5745.pdf",
        "text": "https://archive.orkl.eu/587ded1cca5d59b0ff19a61fa41424eb703f5745.txt",
        "img": "https://archive.orkl.eu/587ded1cca5d59b0ff19a61fa41424eb703f5745.jpg"
    }
}