{
    "id": "f20fd003-6ce4-41f6-9dbb-7cd3cc676c5e",
    "created_at": "2023-01-12T15:00:02.439522Z",
    "updated_at": "2025-03-27T02:16:26.134088Z",
    "deleted_at": null,
    "sha1_hash": "5a9237893325fea0cc1875b25a6bdae34cffa4b4",
    "title": "2020-07-16 - A Bazar of Tricks- Following Team9’s Development Cycles",
    "authors": "",
    "file_creation_date": "2022-05-28T00:47:00Z",
    "file_modification_date": "2022-05-28T00:47:00Z",
    "file_size": 4983234,
    "plain_text": "# A Bazar of Tricks: Following Team9’s Development Cycles\n\n**[cybereason.com/blog/a-bazar-of-tricks-following-team9s-development-cycles](https://www.cybereason.com/blog/a-bazar-of-tricks-following-team9s-development-cycles)**\n\nWritten By\nCybereason Nocturnus\n\nJuly 16, 2020 | 14 minute read\n\n**Research by: Daniel Frank, Mary Zhao and Assaf Dahan**\n\n## Key Findings\n\n\n-----\n\n**A New Malware Family: The Cybereason Nocturnus team is tracking a new Bazar loader and**\nbackdoor that first emerged in April 2020 and has evolved continuously since. Bazar can be\nused to deploy additional malware, ransomware, and ultimately steal sensitive data from\norganizations.\n**Targeting the US and Europe: Bazar malware infections are specifically targeting**\nprofessional services, healthcare, manufacturing, IT, logistics and travel companies across the\nUS and Europe.\n**With Loader and Backdoor Capabilities: Bazar leverages the Twilio SendGrid email**\nplatform and signed loader files to evade traditional security software in conjunction with a\nfileless backdoor to establish persistence.\n**Under Constant Development: Over the course of this investigation, it is evident that Bazar**\nis under active development. More recently, the active campaigns have disappeared, but later\nreappeared with a new version, which indicates the group is under a development cycle.\n**Evasive, Obfuscated Fileless Malware: This stealthy loader evades detection by abusing the**\ntrust of certificate authorities, much like previous Trickbot loaders. This loader, however, uses\nEmerDNS (.bazar) domains for command and control and is heavily obfuscated. It also uses\nanti-analysis techniques to thwart automated and manual analysis, and loads the encrypted\nbackdoor solely in memory.\n**A Comeback After Two Months: After a two month hiatus, a new variant emerged in mid-**\nJune that improved on its stealth capabilities. This is similar to the modus operandi of other\ncybercriminal organizations in general and Trickbot in particular.\n**Trickbot Ties: The loader exhibits behaviors that tie it to previous Trickbot campaigns.**\nThough several changes exist between the Anchor and Bazar malware, including differences\nin clientID generation, they share the same top-level Bazar domain C2. Unlike Trickbot and\nAnchor, the Bazar loader and backdoor decouple campaign and bot information in bot\ncallbacks. Given these ties and how quickly Bazar is evolving, this may signal the attackers\nnext generation of malware attacks.\n\n## table of contents\n\n Introduction\n\nSince April 2020, the Cybereason Nocturnus team has been investigating the emergence of the\nBazar malware, a loader and backdoor used to collect data about the infected machine and to\ndeploy additional malware. In this analysis, we show how the Bazar malware is sent via phishing\nemails that take advantage of the ongoing coronavirus pandemic, employee payroll reports, and\ncustomer complaints. The Bazar malware appears to have strong ties to Trickbot campaigns\n[resembling those seen in the Trickbot-Anchor collaboration from December 2019. After further](https://www.cybereason.com/blog/dropping-anchor-from-a-trickbot-infection-to-the-discovery-of-the-anchor-malware)\ninvestigation, it is clear that the same infection chain delivers the Bazar loader instead of the usual\nTrickbot downloader.\n\n[The Bazar loader and Bazar backdoor are named after their use of EmerDNS blockchain domains.](https://emercoin.com/en/documentation/blockchain-services/emerdns/emerdns-introduction)\nUsing Bazar domains has been trending recently among cybercriminals because they are able to\nevade takedowns and sinkholing that disrupts botnet communications.\n\n\n-----\n\nThe Bazar loader gives the attacker its initial foothold in the environment, while the Bazar backdoor\nestablishes persistence. Together, the loader and backdoor give threat actors the opportunity to\ndeploy other payloads such as ransomware, and post-exploitation frameworks like CobaltStrike, as\nwell as exfiltrate data and remotely execute commands on infected machines. The Bazar backdoor\ncan lead to disrupted business continuity, data loss, and full compromise, undermining trust in an\norganization.\n\nThere are several different versions of the Bazar backdoor and its loader, which shows that the\nmalware is under active development. This writeup dissects the Bazar loader and backdoor\nfunctionality alongside elements that show its ties to Trickbot collaborations similar to that of\nTrickbot-Anchor from 2019. Our analysis will focus mainly on the Bazar loader as it is especially\nevasive given our findings from its recent re-emergence.\n\nThe Bazar loader infection chain starts from a phishing email link.\n\n## Infection Vector\n\n\n-----\n\n_The Bazar loader infection delivered via malicious link in a phishing email._\n\nWhereas more common Trickbot campaigns use malicious file attachments to launch Microsoft\nOffice macros and download Trickbot, this campaign initially infects hosts with the Bazar loader via\n[phishing emails sent using the Sendgrid email marketing platform. These emails contain links to](https://sendgrid.com/)\ndecoy landing pages for document previews hosted in Google Docs.\n\n_Coronavirus phishing email sent via Sendgrid email marketing with Google Docs links._\n\nVisiting the Google Docs landing page encourages the user to download a file. To convince users to\ndownload the files manually, the page states that document preview is not available.\n\nThe Bazar loader payload retrieval and net.exe commands post-infection.\n\nThe Bazar loader files are dual-extension executable files (such as PreviewReport.DOC.exe) signed\nwith fake certificates such as VB CORPORATE PTY. LTD. This is consistent with the Trickbot group,\nwhich notoriously abuses the trust of certificate authorities by using signed loaders and malware to\nevade security product detection. Signed malware was seen in Trickbot-Anchor infections and will\n[continue to play a role in future campaigns due to the ease of obtaining code-signing certificates](https://medium.com/@chroniclesec/abusing-code-signing-for-profit-ef80a37b50f4)\nand their effectiveness in evading security products.\n\n\n-----\n\nTrickbot and Bazar loader signed files.\n\n## Loader and Backdoor Analyses\n\nThe Cybereason Nocturnus team analyzed both development and operational versions of the Bazar\nloader and backdoor. To differentiate between the two versions for this writeup, we reserved the\nname “Team9” for the development versions and the name “Bazar” for the operational versions.\n\nThe Team9 loader is examined first; then, we analyze the operational Bazar loader. Finally, we\nanalyze an early development version of the malware, which is the Team9 backdoor. We summarize\nchanges between loaders and backdoor versions as they are developed over time in the tables\nbelow.\n\n**Loader variant** **Creation date** **Mutex** **Log files (if any)**\n\nDev Version 1 April 9 n/a ld_debuglog.txt\n\nOperational Loader March 27 - April 20 ld_201127 n/a\n\nNew Operational Loader June 12 - June 18 ld_201127 n/a\n\n\n-----\n\nLoader information\n\n**Backdoor variant** **Creation date** **Mutex** **Log Files (if**\n**any)**\n\nDev Version 1 April 7-9 MSCTF.[botID] bd_debuglog.txt\n\n\nDev Version 2 April 16-22 {589b7a4a-3776-4e82-8e7d435471a6c03c}\nAND\n{517f1c3d-ffc0-4678-a4c06ab759e97501}\n\nDev Version 2.1 April 17-23 {589b7a4a-3776-4e82-8e7d435471a6c03c}\n\n\ndl2.log\n\nbd2.log\n\n\nOperational\nBackdoor\n\nBackdoor information\n\n\nMarch 27 - April\n22\n\n\nmn_185445 n/a\n\n\n## The Early Development Loader (Team9)\n\nExamining a development version of the loader, which contains ‘team9 loader’ strings, it downloads\na XOR-encoded payload from a remote server, then decodes and injects the payload into a target\n[process using process hollowing or](https://attack.mitre.org/techniques/T1093/) [process doppelgänging injection techniques.](https://attack.mitre.org/techniques/T1186/)\n\nTo download the Bazar backdoor, the loader communicates with a remote server that sends the\npayload to the infected machine in encrypted format. On first inspection, the payload does not show\na valid PE header. Reversing the Team9 loader sample shows a XOR key of the infection date, in\nthe format YYYYMMDD (ISO 8601).\n\n\n-----\n\nRetrieving the system time to decrypt the payload.\n\nThe loop responsible for the byte-by-byte decryption is represented in the image below.\n\nDecryption loop for the date and time.\n\nAs shown in later stages of this report, the above is a shared mechanism with the obfuscated and\npacked variant. This loader variant creates a simple autorun key at CurrentVersion\\Run,\nmasqueraded as BackUp Mgr.\n\n\n-----\n\nThe autorun key created by the Team9 loader.\n\nOnce the payload is decoded correctly with a proper PE header, it is validated and then injected into\nmemory. The process can be viewed is in the malware’s logs.\n\nContents of the log file (ld_debug.txt) show Bazar loader infection activity.\n\nDebug strings show the Bazar loader execution and payload retrieval status in a log file\n“ld_debuglog” indicating PE file signature verification and self-deletion capabilities.\n\nThis variant places the debug logs in the hardcoded ‘admin’ user folder.\n\nBazar loader and backdoor debug logs.\n\n## The Operational Bazar Loader\n\nIn the obfuscated and packed version of the loader, an uncommon API call is used to facilitate code\ninjection. As seen in the image below, the loader uses VirtualAllocExNuma to allocate new memory\nand store the returned base address. The beginning of an obfuscated shellcode is copied to this\naddress after being decrypted using an RC4 algorithm.In addition to the shellcode an additional PE\ncan be seen in memory.\n\n\n-----\n\nMemory allocation and call to shellcode decryption.\n\nThe Bazar loader also stores an RSA2 key that is used to open the RC4 key.\n\nRSA2 BLOB as seen in the loader’s memory.\n\nLooking at the code of the ‘decrypt_shellcode_and_mz’ function, we see it is very similar to the one\n[being used in an earlier Trickbot variant and](https://labs.vipre.com/trickbots-tricks/) [TrickBooster.](https://www.deepinstinct.com/2019/07/22/trickbooster-a-deeper-dive-into-the-malware-that-successfully-harvested-over-250m-addresses/)\n\n\n-----\n\nThe shellcode decryption routine.\n\nAfter the RSA2 key is imported from the key [BLOB, the RC4 key is loaded into the RC4 BLOB. It is](https://docs.microsoft.com/en-us/windows/win32/api/wincrypt/ns-wincrypt-publickeystruc)\nreversed, since it defaults to the little-endian format, and is finally appended with a trailing zero byte,\nwhich is an essential part of the key.\n\nThe RC4 BLOB with the loaded key.\n\nWhen the data is decrypted, a relatively short shellcode precedes the MZ bytes.\n\n\n-----\n\nThe decrypted shellcode and PE.\n\nCopied to the previously allocated memory, this code deobfuscates several essential API calls at\nruntime, such as LoadLibraryA, GetProcAddress, VirtualAlloc and VirtualProtect, all of which will be\nused to resolve APIs and allocate memory to run the additional PE.\n\nAPI resolving by the shellcode loader.\n\nThe code loads more APIs to the soon-to-be-executed PE before finally jumping to the PE entry\npoint.\n\n\n-----\n\nResolving APIs for the PE by the shellcode loader.\n\nStepping into the loaded PE,Bazar loader tries to avoid targeting Russian users by checking if the\nRussian language is installed on the infected machine. It calls setlocale, deobfuscating the “Russia”\nstring by adding 0xf4 to each character, and finally resolving and calling StrStrA to check if “Russia”\nis a substring of the current locale. If so, the loader terminates. The Bazar Backdoor repeats this\nstep as well.\n\nChecking for Russian language to determine if it should execute.\n\nIn general, the PE is highly obfuscated. Dedicated methods resolve additional strings and API calls\nat runtime, rendering the PE even more difficult to analyze. Below is an example of the method\nresponsible for resolving the .bazar domains. It loads an obfuscated string, and deobfuscates it\nusing the first character of the domain name as a XOR key for the rest of the string.\n\nDeobfuscating .bazar domains.\n\n\n-----\n\nA mutex name is deobfuscated and then copied before being passed to CreateMutexExA with the\nname “ld_201127”.\n\nMutex creation\n\nOnce the Bazar loader downloads its payload, the Bazar backdoor, it is decrypted using the same\nmethod as the aforementioned Team9 variant.\n\nDecrypting the downloaded payload.\n\nFinally, the loader validates the PE header for successful decryption, then it continues to the next\nstep, which is code injection by process hollowing.\n\n\n-----\n\nSystem time retrieval, decryption, and header check of the downloaded payload.\n\nThe loader tries three different processes: svchost, explorer, and cmd, similar to the functionality in\nthe development version.\n\nAfter the code is successfully injected into one of the above processes, the loader uses several\nmethods to autorun from the victim's machine. This implies that the code has not yet been finalized.\n\n\n-----\n\nBazar loader making sure it will autorun at any cost.\n\nFirst, the loader creates a scheduled task masquerading under the name StartAd - as in Adobe.\nOther samples use a decoy Adobe icon with a double extension .PDF.exe, similar to the MS Word\nvariant being analyzed here.\n\nCreation of the scheduled task using taskschd.dll.\n\nThe author is also set as Adobe for further deception.\n\n\n-----\n\nThe created task as seen in the Task Scheduler.\n\nAfter setting up the scheduled task, the Bazar loader uses RegSetValueExA to write itself to\n_HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon. By doing_\nso, the loader is able to execute on every system logon.\n\nWriting the malware to autorun from userinit.\n\nThe Bazar loader will create another autorun entry by writing an adobe.lnk shortcut in the Windows\nStart menu Startup folder.\n\nWriting the Bazar loader to the startup folder.\n\nFinally, if the autorun overkill process was not enough, the malware grabs the user’s desktop using\nthe SHGetSpecialFolderPathW API call, and makes the shortcuts point to the loader itself. It opens\neach shortcut location, renaming the target by prefixing the application’s name with an underscore,\nultimately renaming itself as the original application, copied to the destination folder.\n\n\n-----\n\nThe legitimate Firefox application is modified so that another copy of the loader can execute.\n\nFor example, the screenshot above shows that _firefox.exe is the original application, while\n_firefox.exe is actually a copy of the Bazar loader. This is confirmed after retrieving the files’ hashes._\n\nHashing both malicious loader copy and legitimate Firefox applications.\n\nAnother small binary file is created in the folder with a .bin extension, containing more encrypted\ndata.\n\n## The New Operational Bazar Loader\n\nA new version of the Bazar loader emerged at the beginning of June 2020. The files submitted to\nVirusTotal share the same fake certificate: “RESURS-RM OOO”. While some functionality remains\nsimilar to the older operational variant (such as the mutex, the downloaded payload decryption\nroutine, the persistence mechanism etc.), there are some new features in this new variant.\n\nOne noticeable feature is the evasive API-Hammering technique, that was also seen recently in a\n[new Trickbot variant. In this case, the usage of 1550 calls to printf is intended to overload sandbox](https://www.joesecurity.org/blog/498839998833561473)\nanalysis with junk data and delay execution, since it logs API calls.\n\n\n-----\n\nBazar loader’s API-Hammering technique.\n\nAnother noticeable difference in the new variant is the change to the initial shellcode decryption\nroutine, though it uses the familiar VirtualAllocExNuma routine.\n\nInitial routine before the shellcode decryption.\n\nThis variant is using what seems to be a custom RC4 algorithm with the following key.\n\n\n-----\n\nThe key used for the shellcode decryption.\n\nOnce the code is decrypted, it is clear that there are actually two payloads inside of it. The first\npayload serves as a loader for the second DLL payload.\n\nThe first PE loads the second one with the export function “StartFunc”.\n\nOffset 0x180004000 holds the second DLL.\n\nThe second DLL.\n\nOnce loaded, the second DLL’s StartFunc starts a loop by calling GetMessageA to retrieve Windows\nmessages and runs the main activity method.\n\n\n-----\n\nStartFunc main activity method.\n\nAnother interesting finding is that Bazar Loader has now implemented a Domain Generation\nAlgorithm using the current date as a seed. At the moment, it seems more of a backup, since in\nmonitored live cases the IPs were contacted directly.\n\nBazar Loader’s DGA implementation.\n\nAll of the generated domains are still under the bazar suffix.\n\n\n-----\n\nGenerated Bazar domains.\n\nOther more minor (but significant for detection) changes include:\n\nConnecting to the C2 using only HTTPS\nUser-Agent name was changed to dbcutwq or user_agent\nA new cookie: group=1\n__lyrt suffix that was used to check the malware’s presence on the machine now changed to_\n__fgqw_\n\n## The Early Development Backdoor (Team9)\n\nThe Cybereason Nocturnus team has identified three versions of this backdoor since early April this\nyear.Their modus operandi does not differ drastically and can be distinguished by their mutexes and\nobfuscation level.\n\nData collected from the infected machine is hashed using the MD5 algorithm set in the\n_CryptCreateHash API call by setting the_ [ALG_ID to 0x8003, and then appended to the mutex name.](https://docs.microsoft.com/en-us/windows/win32/seccrypto/alg-id)\n\n\n-----\n\nGathering and hashing data about the infected machine.\n\nAfter successfully gathering the data, the Bazar backdoor connects to the C2 server. If the\nconnection fails, it continues to retry.\n\nAnother interesting aspect of this version is how it uses a local address to fetch the data from the\nserver. Given that this is an early dev version, the author may be using this method for test\npurposes.\n\nPossible testing environment of the Bazar author.\n\nAfter successfully gathering the data and connecting to the C2 server, the backdoor parses the\ncommand received in the HTTP response. Each char of the command is XORed with the next char\nin the generated MD5 string.\n\n\n-----\n\nXORing the command retrieved from the C2 with the machine identifier hash.\n\nAfter checking and parsing the XORed data, the backdoor then logs and executes the retrieved\ncommand according to the following switch case.\n\nSwitch case for the commands received from the C2 server.\n\n[As seen in the above image, the Bazar backdoor can handle quite a few commands. This next](https://blog.fox-it.com/2020/06/02/in-depth-analysis-of-the-new-team9-malware-family/)\nsection focuses on case 1, which retrieves various pieces of additional information on the infected\nmachine.\n\nAfter receiving the value 1 from the C2 server and parsing the response, the value is mapped to the\nrelevant method for execution.\n\n\n-----\n\nThe methods and mapped values as seen in memory.\n\nThe corresponding method to the value 1 is 0x3fab15b0 in this instance. This method collects\nadditional data from the infected machine, such as its public IP address, computer name, and the\ninstalled Windows version.\n\nGathering additional information about the infected machine.\n\nIt then performs a WMI query to retrieve information about the antivirus engine installed on the\nmachine.\n\nWMI query to get information about the installed antivirus engine.\n\nAlso, the Bazar loader retrieves the installed applications list using the\n_Windows\\CurrentVersion\\Uninstall registry key._\n\nQuerying the installed programs on the machine.\n\nFinally, the loader spawns cmd.exe to perform a series of reconnaissance commands to obtain\ninformation about the network and domain.\n\n\n-----\n\ncmd.exe running net and nltest tools.\n\nBecause the malware is a development version, most of the above data is well-documented in its\nlogs.\n\nTeam9 backdoor logs.\n\nSubsequent network communications use a bot ID hash format reminiscent of the client ID used in\n[Anchor campaigns from 2019, an MD5 hash value.](https://www.cybereason.com/blog/dropping-anchor-from-a-trickbot-infection-to-the-discovery-of-the-anchor-malware)\n\nAs seen in previous Anchor infections, Anchor’s unique identifier generation follows this pattern:\n\n**[Machine_NAME]_[Windows_Version].[Client_ID]**\n\nAfter a machine is infected with Anchor, it uses openNIC resolvers to resolve a Bazar domain such\nas toexample[dot]bazar. It then sends bot callbacks with the following information to the remote\nserver in the format shown below:\n\n**[campaign]/[Machine_NAME]_[Windows_Version].[Client_ID]/[switch]/**\n\nMeanwhile, the generated Bazar bot ID is an MD5 hash composed of the computer name, creation\ndates of system folders, and the system drive serial number.\n\nThe Bazar bot ID is an MD5 hash comprised of host information, including:\n\n**[creation date of %WINDIR% in ASCII]**\n\n**[creation date of %WINDIR%\\system32 in ASCII].**\n\n**[NETBIOS_Name]**\n\n**[%SYSTEMDRIVE% serial number])**\n\nBazar backdoor communications follow a pattern of the botID and numeric command switch.\n\n**[botID]/[switch]**\n\nBackdoor callbacks from the infected host to the Bazar domain use the botID and command switch\n‘2’ when waiting to receive a new task.\n\n\n-----\n\nNetwork communication from infected host to the .bazar domain with a unique botID.\n\nThe Bazar backdoor sends a ‘group’ identifier to the remote server along with the botID and the\nswitch to send data or receive commands. As of May 2020, there were two hardcoded groups.\nThese backdoors are associated with cookie group strings “two” and “five”. Meanwhile, the new\nloader is associated with the cookie group string, “1”.\n\nBazar backdoor “group” identifier sent via HTTP request “cookie” parameter.\n\nWhile the URI string has changed from Trickbot and Anchor variants, the phishing tactics and use of\npost-infection reconnaissance commands remains the same. In the Bazar backdoor, the tag (or\n**gtag) used to identify Trickbot campaigns is removed from C2 URIs. It may have been moved to the**\ncookie HTTP header parameter.\n\nWith Bazar, the infected machine name and Trickbot campaign identifier are no longer sent in the\nsame HTTP requests. Instead, the ‘/api/v{rand}’ URI is sent to retrieve the backdoor from cloud\nhosted servers after the loader executes. Backdoor communications between the C2 server and the\nclient occur to the .bazar domain using the botID assigned to the infected host.\n\nThe decoupling of campaign tag and client machine name from the Bazar C2 server is specific to\nthis backdoor. Because bot communications are often quickly terminated after infections are\ndiscovered, removing the campaign and client machine name from URIs results in reduced\ndowntime, lowering the need to re-infect a machine.\n\n## The Trickbot Connection\n\nAs we previously stated, the Bazar loader and Bazar backdoor show ties to Trickbot and Anchor\nmalware with signed loaders. Similarities between the three include:\n\nusing revoked certificates to sign malware\ndomain reuse (e.g. machunion[.]com and bakedbuns[.]com)\nAlmost identical decryption routines in the Bazar and Trickbot loaders, including the usage of\nthe same WinAPIs, custom RC4 implementation and the usage of the API-Hammering in the\nlatest loader variant, which is found also in Trickbot.\nbackdoor command-and-control using .bazar domains\n\nThe fact that this malware does not infect machines with Russian language support offers a clue to\nits origins and intended targets\n\n\n-----\n\n[The Bazar loaders are signed with revoked certificates. Previous research shows that the Trickbot](https://cybersecurity.att.com/blogs/labs-research/trickbot-bazarloader-in-depth)\ngroup uses revoked certificates to sign files up to six months after certificate revocation, illustrated\nby the use of a certificate issued to subject “VB CORPORATE PTY. LTD.” in January 2020. Anchor\ncampaigns from December also used signed Trickbot loader files with filenames related to preview\ndocuments. The current revoked certificate used in the new loader variant is issued by “RESURSRM OOO”.\n\nIn addition, similar phishing email tactics, Google Drive decoy previews, signed malware, and\ndeceptive file icon use were observed in both of these campaigns. We observed reuse of likely\ncompromised domains to host Bazar loaders that previously served Trickbot loaders. For example,\n[the domain ruths-brownies[dot]com was used in a Trickbot campaign in January and hosted Bazar](https://twitter.com/cyber__sloth/status/1217495240971603968)\n[loaders in April 2020.](https://twitter.com/pancak3lullz/status/1252303608747565057)\n\nThe Bazar malware has a new command-and-control pattern and botID that differs from Trickbot\nand Anchor, yet retains historical indicators of both malware families. Finally, the use of Emercoin\n(.bazar) domains were observed in Trickbot infections delivering Anchor from December 2019.\n\n## Conclusion\n\nIn this writeup, we associate the Bazar loader and Bazar backdoor with the threat actors behind\n[Trickbot and our previous research on Anchor and Trickbot from December 2019. Based on our](https://www.cybereason.com/blog/dropping-anchor-from-a-trickbot-infection-to-the-discovery-of-the-anchor-malware)\ninvestigation, Cybereason estimates that the new malware family is the latest sophisticated tool in\nTrickbot gang's arsenal, that so far has been selectively observed on a handful of high-value\ntargets.\n\nThe Bazar malware is focused on evasion, stealth, and persistence. The malware authors are\nactively testing a few versions of their malware, trying to obfuscate the code as much as possible,\nand hiding the final payload while executing it in the context of another process. To further evade\ndetection, the Bazar loader and backdoor use a different network callback scheme from previously\nseen Trickbot-related malware.\n\nPost-infection, the malware gives threat actors a variety of command and code execution options,\nalong with built-in file upload and self-deletion capabilities. This variety allows attackers to be\ndynamic while exfiltrating data, installing another payload on the targeted machine, or spreading\nfurther on the network. In general, having more options ensures the threat actors can adjust to\nchanges in their goals or victim’s environment.\n\nThe use of blockchain domains distinguishes the Bazar loader and Bazar backdoor as part of a\nfamily of threats that rely on alternate domain name systems such as EmerDNS domains. As we\nreported in Dropping The Anchor in December 2019, these alternate domain name systems have\n[also been used in Trickbot Anchor campaigns. These systems provide bot infrastructure with](https://www.fireeye.com/blog/threat-research/2018/04/cryptocurrencies-cyber-crime-blockchain-infrastructure-use.html)\nprotection from censorship and resilience to takedowns, making them invaluable for threat actors.\n\nThe emergence of the first malware variants in April 2020 was followed by an almost 2-months long\nhiatus, until a new variant was discovered in June 2020. Our research, which covers the evolution of\nthe Bazar malware family, clearly shows that the threat actor took time to re-examine and improve\ntheir code, making the malware stealthier. Bazar’s authors changed some of the most detectable\n\n\n-----\n\ncharacteristics of the previous variant, such as previously hardcoded strings, and modification of the\n[known shellcode decryption routine, similar to what was previously observed in recent Trickbot](https://zero2auto.com/2020/06/22/decrypting-trickbot-crypter/)\nvariants.\n\nAlthough this malware is still in development stages, Cybereason estimates that its latest\nimprovements and resurfacing can indicate the rise of a new formidable threat once fully ready for\nproduction.\n\n## MITRE ATT&CK Techniques\n\n\n**Execution** **Persistence** **Privilege**\n**Escalation**\n\n\n**Defense**\n**Evasion**\n\nDeobfuscate /\n[Decode Files](https://attack.mitre.org/techniques/T1140/)\nor Information\n\n\n**Discovery** **Exfiltration** **Command**\n**and Control**\n\n\nExecution\n[Through](https://attack.mitre.org/techniques/T1106/)\nAPI\n\n\nStartup\nItems\n\nRegistry\nRun Keys /\nStartup\nFolder\n\n\nStartup\nItems\n\nProcess\nInjection\n\n\n[Masquerading](https://attack.mitre.org/techniques/T1036) Application\n[Window](https://attack.mitre.org/techniques/T1010)\nDiscovery\n\n\nAccount\nDiscovery\n\n\nData\nEncrypted\n\n\nCommonly\nUsed Port\n\nRemote File\nCopy\n\nStandard\nApplication\nLayer\nProtocol\n\nStandard\n[Cryptographic](https://attack.mitre.org/techniques/T1032)\nProtocol\n\nStandard\nNon[Application](https://attack.mitre.org/techniques/T1095)\nLayer\nProtocol\n\n\nModify\nRegistry\n\nObfuscated\n[Files or](https://attack.mitre.org/techniques/T1027)\nInformation\n\nProcess\nDoppelgȁnging\n\nProcess\nHollowing\n\nProcess\nInjection\n\n\nFile and\n[Directory](https://attack.mitre.org/techniques/T1083/)\nDiscovery\n\nProcess\nDiscovery\n\nQuery\nRegistry\n\nRemote\n[System](https://attack.mitre.org/techniques/T1018)\nDiscovery\n\nSecurity\n[Software](https://attack.mitre.org/techniques/T1063/)\nDiscovery\n\n\n-----\n\nSystem\n[Information](https://attack.mitre.org/techniques/T1082/)\nDiscovery\n\nSystem\nTime\nDiscovery\n\nSystem\nOwner /\nUser\nDiscovery\n\n## Indicators of Compromise\n\n[Click here to download this campaign's IOCs (PDF)](https://www.cybereason.com/hubfs/A%20Bazar%20of%20Tricks%20Following%20Team9%E2%80%99s%20Development%20Cycles%20IOCs.pdf)\n\nAbout the Author\n\n**Cybereason Nocturnus**\n\nThe Cybereason Nocturnus Team has brought the world’s brightest minds from the military,\ngovernment intelligence, and enterprise security to uncover emerging threats across the globe.\nThey specialize in analyzing new attack methodologies, reverse-engineering malware, and exposing\nunknown system vulnerabilities. The Cybereason Nocturnus Team was the first to release a\nvaccination for the 2017 NotPetya and Bad Rabbit cyberattacks.\n\n[All Posts by Cybereason Nocturnus](https://www.cybereason.com/blog/authors/cybereason-nocturnus)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-16 - A Bazar of Tricks- Following Team9’s Development Cycles.pdf"
    ],
    "report_names": [
        "2020-07-16 - A Bazar of Tricks- Following Team9’s Development Cycles.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535602,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653698820,
    "ts_modification_date": 1653698820,
    "files": {
        "pdf": "https://archive.orkl.eu/5a9237893325fea0cc1875b25a6bdae34cffa4b4.pdf",
        "text": "https://archive.orkl.eu/5a9237893325fea0cc1875b25a6bdae34cffa4b4.txt",
        "img": "https://archive.orkl.eu/5a9237893325fea0cc1875b25a6bdae34cffa4b4.jpg"
    }
}