{
    "id": "f294b302-df77-4cf9-9539-37e9fa48cad0",
    "created_at": "2023-01-12T15:10:30.192112Z",
    "updated_at": "2025-03-27T02:05:29.334778Z",
    "deleted_at": null,
    "sha1_hash": "821546ee2ebf0e806a0867f0910091158e063804",
    "title": "2022-01-10 - TokyoX- DLL side-loading an unknown artifact",
    "authors": "",
    "file_creation_date": "2022-05-28T16:10:03Z",
    "file_modification_date": "2022-05-28T16:10:03Z",
    "file_size": 6587128,
    "plain_text": "# TokyoX: DLL side-loading an unknown artifact\n\n**lab52.io/blog/tokyox-dll-side-loading-an-unknown-artifact/**\n\nDuring Christmas holidays, Lab52 has been analyzing a sample which loads an artifact that\nwe have decided to refer to as “TokyoX” since no similarities have been found as to any\nknown malware, which we usually detect in open sources. However, we cannot confirm so\nfar that it is indeed a new family of malware.\n\nThe first thing we identified was a DLL\n\n(382b3d3bb1be4f14dbc1e82a34946a52795288867ed86c6c43e4f981729be4fc) which had\nthe following timestamps in VirusTotal at the time of the current analysis, and was uploaded\nfrom Russia via web site:\n\nCreation Time 2021-12-09 02:46:43\n\nFirst Submission 2021-12-09 08:48:20\n\nLast Submission 2021-12-09 08:48:20\n\nLast Analysis 2021-12-23 23:38:08\n\nSome antivirus engines tagged the sample as PlugX, but it seems that the attribution might\nbe due to the final payload’s loading mechanism: DLL sideloading with an encrypted payload\nin the same directory. After analyzing the final payload we could not find any similarities with\nother known samples from PlugX other than the loading TTPs.\n\nThis DLL had a related .zip file with the name планирование.zip (translated to as\nplanning.zip). When unzipping, the following files are observed:\n\nThe legitimate file Creative.exe, an encrypted Data file and the version.dll DLL, which\nimplements the loader function for the Data file, and therefore responsible of mapping the\n“TokyoX”.\n\nIf we execute it from a path which is not final or the expected by the malware, it replicates to\nanother path and executes from there, which is something it does have in common with\nsome PlugX dll loaders:\n\n\n-----\n\nOnce executed, we observe how the netsh.exe process tries to establish connections with\nport 443 of the IP address 31.192.107[.]187.\n\nIn this analysis we will focus on different aspects about the process; from double-clicking the\nbinary 123.exe process (which is a copy of Creative.exe but in another path) to the execution\nof “TokyoX” already decrypted in memory.\n\nThe first thing we observe within the process is how the version.dll library prepares the\ndecryption and the final payload’s loading in the remote process:\n\nIn fact, we can see how the content of the Data file is read in the code section of version.dll:\n\nIf we edit the Data file with a hexadecimal editor we will see their values, which will help us to\nidentify it in memory later (beginning with E3 84):\n\n\n-----\n\nAfter reading the file from disk, a child process netsh.exe is created. This just-created child\nprocess is where several new memory segments will be located (a total of 5, including the\nfinal decrypted payload) to decrypt the final “TokyoX” payload. The APIs which were\nobserved for the creation and writing of the remote process are the native APIs\nNtAllocateVirtualmemory and NtwriteVirtualmemory.\n\nFirst, it creates two segments: 100Kb where the encrypted payload is located and which\ncomes from the disc, and another one of 4Kb. In the 4Kb segment we observe how the\nfollowing string is set (which will be the string used for the decrypting process):\n\nThe other memory segment of 100Kb contains the following (encrypted content, as we see\nhow it matches the content from Data file on Disk):\n\n\n-----\n\nAfter the creation of these two segments, a third segment is allocated, where it is loaded the\nabsolute memory addresses from several win32 APIs (VirtualAlloc, LoadLibrary,\nGetProcAddress, the home address of the coded payload, etc.) for its later use by the loader:\n\n\n-----\n\nWe can notice how the segment will have the memory addresses (starting from 123.exe they\nare located in netsh.exe segment through the version.dll code):\n\nThen, another segment of 4Kb is created where it loads the code that will decrypt and load\nthe final payload.\n\nFinally, the “TokyoX” loader runs from the DLL (version.dll) in netsh.exe through the API\nNtcreateThreadEx and we see the start of the last page created in the stack:\n\n\n-----\n\nAfter the execution of NtCreateThreadEx, as indicated, the loader is initiated in netsh.exe in\nthe segment:\n\nOnce the execution is moved to the netsh.exe process, it takes the string located in the initial\n4Kb segment, copies it into the stack and replicates it (0x100, 256 bytes) to match the\nspecific block size of 256bytes. In the following screenshots we can observe how the block\nends with the string “!Up?” when it reaches the value 0x100 in hexadecimal.\n\n\n-----\n\nAfter the block is created with the replicated string, the values from 00 to FF are found and\nused for the decrypting process.\n\n\n-----\n\nAt this point, the loader transforms the 00-FF block with a series of additions combining the\nreplicated string’s block with the 00-FF block, as we can see:\n\n\n-----\n\nThe combination of the blue block (in following image) and the 00-FF block (pointed in red in\nprevious image) results in the following block in memory, marked in red in the image:\n\n\n-----\n\nOn the next step, the loader reads the initial argument, arg0, whose value is 0x900000 and\npoints at the 4Kb block, which stores the absolute addresses to different API from Win32:\n\nAfter this, the decrypting process for the final payload begins. The decrypting process gets\ntwo values from the second block, exchanges and adds them, and the result serves as a\nfinal index to recover the element from the second block with which the xor will be achieved\nthrough the coded block.\n\nThis description of the decryption algorythm has been identified as the RC4 algorythm.\n\n\n-----\n\nAfter the decryption process, we find a PE binary, as seen in the following image. In this\ncase, the payload does not start with the traditional MZ header but the string “tokyo”:\n\n\n-----\n\nThen, we see how it loads the VirtualAlloc absolute address (0x77211856) from the segment\npreviously created:\n\n\n-----\n\nThis creates another memory segment in the process netsh.exe with RWX licenses (that of\n116Kb) which will be used to load the PE:\n\nIn this new segment, it maps the binary using the virtual addresses as the regular Windows\nPE loader would do.\n\nThen, it calls the API LoadLibraryA (it has the address since the DLL saved it in the memory\nsegment) of the strings located in the mapped block:\n\nThen it calls GetProcAddress() to get the addresses of certain functions:\n\n\n-----\n\nNext, the libraries and functions block may be appreciated:\n\n\n-----\n\nAfter the correct mapping and having loaded the necessary libraries for its proper\nfunctioning, it calls EAX to run the decrypted and mapped payload:\n\n\n-----\n\nTo summarize, this article goes through the process followed in memory after executing the\nCreative Cloud application until deploying TokyoX in memory. This DLL sideloading style is\noften linked to APT groups whose attribution is also linked to China, however being a known\ntechnique as it is, we are not able to consider any feasible attribution at the moment.\n\nAs reviewed at the beginning of the article, what we have named as “TokyoX” has not been\nidentified as a known malware so far (at least, with the sources that we have).\n\nAdditionally, at some point of the analysis we identified a tool used by this group for the\ncreation of version.dll, which pretends to be a Windows DLL located in SysWOW/System32.\nThe string “AheadLib” found among the code of the malicious version.dll drew our attention,\nand we quickly found two chinese (casually or not) GitHub repositories with the source code\nof some tool called AheadLib.\n\n\n-----\n\nBasically, this tool will allow you to create a C++ source code file, implementing a DLL with\nthe same exported functions as a given DLL. For the purpose of the current analysis we\ngenerated a source code file using this tool and giving the legitimate version.dll as input.\n\n\n-----\n\nIn the shown screenshot we can see on the left side the pseudocode generated by IDA Pro\nwhile analyzing the malicious version.dll sample. On the right side, we can observe the\nsource code automatically generated by AheadLib using the legitimate version.dll as input.\nEven though the exported functions are not shown in the previous image, we can appreciate\nhow there is a perfect match between both snippets.\n\nRead the second part of the analysis of the final “TokyoX” RAT and its capacities [here.](https://lab52.io/blog/tokyox-dll-side-loading-an-unknown-artifact-part-2/)\n\n## IOCs\n\n382b3d3bb1be4f14dbc1e82a34946a52795288867ed86c6c43e4f981729be4fc\n31.192.107[.]187:443\n\nCustomers with Lab52’s APT intelligence private feed service already have more tools and\nmeans of detection for this campaign.\n\nIn case of having threat hunting service or being client of S2Grupo CERT, this intelligence\nhas already been applied.\n\nIf you need more information about Lab52’s private APT intelligence feed service, you can\n[contact us through the following link](https://lab52.io/contact)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-10 - TokyoX- DLL side-loading an unknown artifact.pdf"
    ],
    "report_names": [
        "2022-01-10 - TokyoX- DLL side-loading an unknown artifact.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536230,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653754203,
    "ts_modification_date": 1653754203,
    "files": {
        "pdf": "https://archive.orkl.eu/821546ee2ebf0e806a0867f0910091158e063804.pdf",
        "text": "https://archive.orkl.eu/821546ee2ebf0e806a0867f0910091158e063804.txt",
        "img": "https://archive.orkl.eu/821546ee2ebf0e806a0867f0910091158e063804.jpg"
    }
}