{
    "id": "f2d8f73f-7ed6-4be3-8c4c-6a95b743239d",
    "created_at": "2025-03-04T02:03:30.814496Z",
    "updated_at": "2025-03-27T02:17:23.495626Z",
    "deleted_at": null,
    "sha1_hash": "99413f03171db34e715c6c04b5644af977996e87",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-04-22T14:04:30Z",
    "file_modification_date": "2024-04-22T14:04:33Z",
    "file_size": 4760534,
    "plain_text": "###### Google Cloud Security\n\n\n###### M-Trends 2024 Special Report\n\n\n-----\n\n###### Table of Contents\n\n Introduction 3\n\n By the Numbers 5\n\n Global Trends 6\n\n Campaigns and Global Events  31\n\n Regional Trends 34\n\n Americas 34\n\n JAPAC 39\n\n EMEA 44\n\n MITRE ATT&CK 49\n\n Articles 60\n\n Chinese Espionage Operations Targeting The Visibility Gap 61\n\n Attacker Operations Involving Zero-Days Vary Depending\n on Motivation 66\n\n Evolution of Phishing Amid Shifting Security Controls 70\n\n How Attackers Leverage AiTM to Overcome MFA 75\n\n Cloud Intrusion Trends 78\n\n Artificial Intelligence in Red (and Purple) Team Operations 81\n\n Conclusion  83\n\n Bibliography 85\n\n\n-----\n\n###### Google Cloud Security Introduction\n M-Trends 2024 Special Report\n\n\n-----\n\n###### One of the big takeaways from our 2023 engagements, and consequently a key theme of M-Trends 2024, is that attackers are focusing more on evasion. They are aiming to avoid detection technologies (such as endpoint detection and response) and maintain persistence on networks for as long as possible, either by targeting edge devices, leveraging “living off the land” and other techniques, or through the use of zero-day vulnerabilities in security and other solutions prevalent throughout enterprises.\n\n Despite attackers’ efforts to evade detection, defenders are continuing to get better at identifying compromises. The global median dwell time—dwell time is the number of days an attacker is on a system from compromise to detection—continued its downward trend in 2023, and is now 10 days (from 16 days in the previous year). It’s a big victory for the good guys, but ransomware is still a key factor in driving down dwell time since it tends to be detected more quickly. Furthermore, Mandiant red teams typically achieve their objectives in 5 to 7 days, so defenders must remain vigilant.\n\n M-Trends 2024 features data and other security metrics that readers have come to expect, highlights zero-day use by espionage\n\n\n###### and financially-motivated attackers, and dives deep into evasive actions conducted particularly by Chinese espionage groups. Other key takeaways in this report include:\n\n • Evolving phishing trends such as attacker\n use of social media, SMS and other communications technologies\n\n • Tactics to bypass multi-factor authentication\n such as adversary-in-the-middle and other techniques\n\n • Cloud intrusion trends such as targeting of\n cloud infrastructure as well as attacker use of cloud resources\n\n • Use of AI in red and purple team\n engagements, with a focus on how new technologies can help produce better outcomes for organizations\n\n Mandiant consultants are always on the frontlines, investigating and analyzing the latest cyber attacks, and understanding how best to defend against them. Consultants proactively assess clients against the latest attacker tactics, techniques and procedures, and help with remediation, transformation\n and education.\n\n Through the release of our annual M-Trends report, we share our learnings with the greater security community, building on our dedication to providing critical knowledge to those tasked with defending organizations. The information in this report has been sanitized to protect the identities of victims and their data.\n\n\n-----\n\n###### By the      M-Trends numbers\n\n\n-----\n\n###### Global\n Trends\n\nThe metrics reported in M-Trends 2024 are based on Mandiant Consulting investigations of targeted attack activity conducted\nbetween January 1, 2023 and December 31, 2023.\n\n\n**Internal detection** is\nwhen an organization\nindependently discovers\nit has been compromised,\nsuch as through an internal\nsecurity appliance alert\nor internal personnel\nnotification of suspicious\nactivity.\n\n**External notification** is\nwhen an outside entity, such\nas law enforcement agencies,\ncybersecurity companies, or\nindustry partners, informs\nan organization it has been\ncompromised. In some cases,\nattackers will perform this\nnotification, such as through\na ransom note.\n\n\n###### Detection by Source\n\nIn 2023, more than half of compromised organizations (54%) first learned of a compromise\nfrom an external source, while 46% first identified evidence of a compromise internally.\nHowever, separating out ransomware-related intrusions reveals that it was much more\ncommon for an organization to learn of a ransomware-related incident from an external\nsource. For ransomware-related intrusions, 70% of organizations were externally notified,\nin most cases, via a ransom demand from the attacker. For intrusions that were not linked\nto ransomware, the ratio of internal versus external discovery was even, 50% to 50%. Of the\ninternally discovered intrusions, 85% did not involve ransomware.\n\n\nThe percentage of externally notified intrusions decreased from 63% in 2022 to 54% in\n2023. Mandiant also responded to more ransomware-related intrusions in 2023 than in\n2022. Ransomware events are most often discovered through external means. Despite\nthis, Mandiant observed a nine point drop in external notifications. This year-over-year\nshift, along with the high proportion of internally discovered compromises in cases other\nthan ransomware, suggests that organizations are experiencing higher rates of success in\ndetecting malicious behavior on their networks.\n\n\n###### Detection by Source, 2011-2023\n\n\n**37%** **33%** **31%** **47%** **53%** **62%** **59%** **47%** **59%** **53%** **37%** **46%**\n\n\n100\n\n90\n\n80\n\n70\n\n60\n\n50\n\n40\n\n30\n\n20\n\n10\n\n\n**6%**\n\n\n0\n2011 2012\n\n\n2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023\n\n\nInternal Detection External Detection\n\n\n-----\n\n**A ransomware-related**\n**intrusion** provides access\nfor or is associated with\nan attacker that has the\nprimary goal of encrypting\ndata, with the intention of\nextracting payment from\nthe target in order to avoid\nfurther harm or to undo the\nmalicious action.\n\n\n###### Ransomware-Related Intrusions\n\nIn 70% of cases, organizations learned of ransomware-related intrusions from external\nsources. Organizations were notified of a ransomware incident by an attacker ransom note\nin three fourths of those intrusions. This is consistent with the extortion business model in\nwhich attackers intentionally and abruptly notify organizations of a ransomware intrusion\nand demand payment. The remaining quarter of external notifications for ransomware\nintrusions came from external partners, such as law enforcement or security companies.\nIn 2022, attacker notifications represented two thirds of external notifications for\nransomware intrusions, compared to one third coming from external partners.\n\n\n###### Ransomware External Notification Source, 2023\n\n 24[%]\nExternal Partner\n\n\n###### 76[%]\nAdversary Notification\n\n\n###### Detection by Source, 2023\n\n80\n\n\nExternal Detection\n\nInternal Detection\n\n\n60\n\n40\n\n\n20\n\n0\n\n\n###### 70[%]\n\n 50[%] 50[%]\n\n 30[%]\n\nRansomware Non-Ransomware\n\n\n-----\n\n**Dwell time** is calculated\nas the number of days an\nattacker is present in a\ncompromised environment\nbefore they are detected.\nThe median represents\na value at the midpoint\nof a dataset sorted by\nmagnitude.\n\n**Change in Median Dwell Time**\n\ndays in 202216 **10days in 2023**\n\n\n###### Dwell Time\n\nGlobal median dwell time continued a downward trend marking another notable shortest\ntime period between initial intrusion and detection for all M-Trends reporting periods. In\n2023, most organizations detected intrusions within 10 days of the initial intrusion. This is\na decline of nearly one week compared to 16 days in 2022.\n\nMandiant defenders observed notable improvements in global median dwell time in 2023\nacross all notification sources. With the shortest periods across the board, global median\ndwell time for external notification sources decreased to 13 days in 2023 from 19 days in\n2022. This likely indicates improved communication between organizations targeted and\nexternal parties making notifications. Another likely explanation for this decrease could be\nthe increase of ransomware-related adversary notifications.\n\nMaintaining the ongoing trend, when defenders detect adversary intrusions internally,\nthey do so faster than the overall median dwell time. The global median dwell time for\nintrusions detected internally was nine days in 2023, down from 13 days in 2022 and from\n18 days in 2021.\n\n\n###### Global Median Dwell Time, 2011-2023\n\n2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022\n\n\n2023\n\n\n###### All 416 243 229 205 146 99 101 78 56 24 21 16 10\n\n\n###### External — — — — 320 107 186 184 141 73 28 19\n\n\n###### 13\n\n\n###### Internal — — — — 56 80 57.5 50.5 30 12 18 13 9\n\n|416|243|229|205|146|99|101|78|56|24|21|16|\n|---|---|---|---|---|---|---|---|---|---|---|---|\n|||||||||||||\n|—|—|—|—|320|107|186|184|141|73|28|19|\n|||||||||||||\n\n\n-----\n\n2018\n\n2019\n\n\n###### Global Dwell Time Distribution\n\nDwell time distribution measures the percentage of Mandiant-investigated intrusions\nwith a specific range of dwell time. In 2023, Mandiant experts continued to see intrusions\ndetected earlier, with 43% of intrusions being detected in one week or less. Nearly two\nthirds of all intrusions in 2023 were detected within 30 days. This likely indicates that\ndetection capabilities continue to improve across organizations, allowing defenders to\nbe notified of threats during the initial infection or reconnaissance phases of the targeted\nattack lifecycle, similar to previous M-Trends reports.\n\nMandiant observed a decrease in intrusions that remain undiscovered for long periods\nof time compared to previous years. In 2023, 6% of investigations identified activity that\nremained undetected for between 1 and 5 years, compared to 11% in 2022 and higher\npercentages prior to 2020. Although organizations are still facing intrusions that go\nundetected for longer periods of time, defenders will likely see the distribution of dwell\ntime move to the left as external parties, such as security vendors and law enforcement,\nincrease their involvement and pace of notifications. However, detection capabilities\nand continuous hunting throughout environments have been effective at unearthing\nlong-standing intrusions. As actionable information is shared, detection capabilities will\ncontinue to improve.\n\nBroadly, the long-term trends of declining median dwell time and increasing rates of\ninternal discovery of compromises indicate that organizations have made meaningful,\nmeasurable improvements in their defensive capabilities.\n\n###### Global Dwell Time Distribution, 2018-2023\n\n 15.0% 16.0% 36.0% 13.0% 18.0% 1.1%\n\n 22.2% 18.5% 29.2% 9.3% 18.5% 2.3%\n\n\n2020 **35.3%** **17.2%** **26.7%** **6.6%** **13.0%** **1.2%**\n\n\n2021\n\n2022\n\n2023\n\n\n###### 37.4% 17.7% 26.2% 10.7% 7.8% 0.3%\n\n 42.0% 16.0% 24.0% 7.0% 11.0% 0.0%\n\n 43.3% 22.7% 22.3% 5.4% 6.0% 0.2%\n\n1 week or less 30 days or less 6 months or less 1 year or less 5 years or less 5 years or more\n\n\n-----\n\n**Change in Global Investigations**\n**Involving Ransomware**\n\n###### % %\n 18in 2022 23in 2023\n\n**Change in Global Dwell Time—**\n**Ransomware**\n\n\nGlobally, organizations detected ransomware or received a ransom demand faster in\n2023–in five days compared to nine days in 2022–regardless of notification source. Nonransomware-related intrusions were detected in 13 days, compared to 17 days in 2022.\n\nIntrusions involving ransomware were detected in six days when the notification came\nfrom an internal source, compared to 12 days in 2022. Defenders were notified of\nransomware-related intrusions from an external party in five days in 2023, two days\nquicker than what was observed in 2022.\n\n\n###### Investigations Involving Ransomware\n\nIn 2023, global investigations involving ransomware increased five percentage points to\n23% of investigations in 2023 compared to 18% in 2022. This brings the percentage of\nransomware-related intrusions back to where it was previously in 2021.\n\n\ndays in 20229 days in 20235\n\n**Change in Global Dwell Time—**\n**Non-Ransomware**\n\n\ndays in 202217 days in 202313\n\n\n###### Global Dwell Time by Investigation Type, 2023\n\n 0\n\n\n10\n\n20\n\n\n30\n\n40\n\n\n7 Days\n\n\n50\n\n60\n\n\n70\n\n80\n\n\n90\n\n100\n\n\nAll Ransomware Non-Ransomware\nInvestigations Investigations Investigations\n\n\n-----\n\nRansomware attacks have continued to be a driving factor in reducing dwell time over the\nyears. However, in 2023, Mandiant experts observed notable improvements in decreased\ndwell time across all notification sources and investigation types.\n\nIntrusions that did not involve ransomware were identified in a shorter period of time in\n2023. Notably, intrusions that occurred in 2023 were identified internally in little over a\nweek, with nine days between initial intrusion and detection, compared to 13 days in 2022.\nOrganizations were notified by an external party of an intrusion one week faster in 2023,\nresulting in a 20-day median dwell time for externally notified, non-ransomware-related\nintrusions, compared to 27 days in 2022.\n\n\n###### Global Median Dwell Time by Detection Source\n\n 6\n\n 5\n\n 9\n\n 20\n\n0 5 10 15 20 25\n\n###### Dwell Time (Days)\n\n|Col1|6 5|9|Col4|20|Col6|\n|---|---|---|---|---|---|\n\n\n###### Internal Detection\n\n External Detection\n\n\n-----\n\n###### Industry Targeting\n\nIn 2023, Mandiant most frequently responded to intrusions at financial services\norganizations, followed by business and professional services, high tech, retail and\nhospitality, and healthcare. All of these sectors have access to a variety of sensitive\ninformation, including proprietary business information, personally identifiable information\n(PII), protected health information (PHI), and financial data. Attackers have also abused\nservice providers and technology organizations to facilitate third-party compromises or\nto obtain access to data or networks belonging to many organizations through a single\ncompromise. Mandiant consistently finds these sectors toward the top of the list for share\nof investigations. Government sector investigations declined from first to tied for fifth with\nhealthcare in 2023, potentially reflecting fewer new investigations related to the war in\nUkraine compared to 2022.\n\n###### Global Industries Targeted, 2023\n\n**Industry** **Percent of Investigations**\n\nFinancial **17.3[%]**\n\nBusiness and Professional Services **13.3[%]**\n\nHigh Tech **12.4[%]**\n\nRetail and Hospitality **8.6[%]**\n\nHealthcare **8.1[%]**\n\nGovernment **8.1[%]**\n\nConstruction and Engineering **7.9[%]**\n\nTransportation and Logistics **6.2[%]**\n\nEducation **5.3[%]**\n\nEntertainment and Media **4.1[%]**\n\nUtilities **2.1[%]**\n\nTelecommunications **1.7[%]**\n\nEnergy **1.3[%]**\n\nOther **1.3[%]**\n\nAerospace and Defense **0.9[%]**\n\nAgricultural and Forestry **0.8[%]**\n\nNonprofits **0.8[%]**\n\n0 5 10 15 20\n\n|4. 2.1% 1.7% 1.3% 1.3% 0.9% 0.8% 0.8%|8.6% 8.1% 8.1% 7.9% 6.2% 5.3% 1%|13.3 12.4%|17.3% %|\n|---|---|---|---|\n\n\n-----\n\n###### Targeted Attacks\n\n Initial Infection Vector\n\nIn 2023, Mandiant experts once again saw exploits used as the most prevalent adversary\ninitial infection vector. In intrusions where the initial intrusion vector was identified, 38%\nof intrusions started with an exploit. This is a six percentage point increase from 2022,\nconsistent with what defenders faced in 2021. For more information, please see “Attacker\nOperations Involving Zero-Days Vary Depending on Motivation”.\n\nPhishing remained the second most common intrusion vector. However it declined in 2023,\nwith 17% of intrusions, compared to 22% in 2022. Phishing remains an effective method to\nestablish an initial foothold and a popular threat vector for adversaries. Full analysis can be\nfound in “Evolution of Phishing Among Shifting Security Controls”.\n\nPrior compromises were the third most significant intrusion vector used by attackers in\n2023. Mandiant investigators noted a three percentage point increase in 2023 compared\nto what was observed in 2022 with 15% of intrusions beginning with access provided by\na prior compromise. This increase is likely related to the ransomware ecosystem and the\ncontinued partnership between ransomware affiliates and various malware operators\nselling initial access.\n\n###### Initial Infection Vector (When Identified)\n\n Exploit Phishing Stolen Credentials\n\n%\n\n###### % 10Brute Force Web\n\n**Compromise**\n\n###### % % %\n\n Prior Compromise\n 17\n %\n 6ServerCompromise Third-PartyCompromise% 5Phishing(Social Media)\n\n% **[2]Other** **1SIM Swap%**\n\n%\n\n###### 2 1%\n 3\n 15\n\n### 38\n\n\n-----\n\nStolen credentials pose a serious security risk to organizations and were the fourth most\nnotable initial intrusion vector in 2023. Attackers often obtain credentials due to password\nreuse or users inadvertently downloading trojanized software on corporate devices.\nInfostealers are frequently delivered through trojanized software. In 2023, 10% of\nintrusions began with evidence of stolen credentials, compared to 14% observed in 2022.\nThe prevalence of both widespread information stealer malware and credential purchasing\ncontinue to challenge defenders.\n\nBrute-force attacks round out the top five initial intrusion vectors observed in 2023,\nrepresenting 6% of intrusions. Proper implementation of multi-factor authentication has\nbeen pivotal to slowing down attackers in their attempts to compromise environments.\n\nAttackers continue to leverage effective tactics to gain access to target environments and\nconduct their operations. While the most popular infection vectors fluctuate, organizations\nmust focus on defense-in-depth strategies. This approach can help mitigate the impact of\nboth common and less frequent initial intrusion methods.\n\nIn 2023, when the initial intrusion vector was identified, an exploit was observed 38% of\nthe time. Mandiant continues to observe both cyber espionage and financially motivated\nattackers leveraging zero-day vulnerabilities to conduct their operations. The most\nprevalent vulnerability Mandiant investigators observed in 2023 was CVE-2023-34362,[1]\nan SQL injection vulnerability in MOVEit Transfer that Mandiant rated as high risk.[2] The\nsecond most prevalent vulnerability was CVE-2022-21587, a critical unauthenticated file\nupload vulnerability in Oracle E-Business Suite. The third most prevalent vulnerability in\n2023 was CVE-2023-2868. CVE-2023-2868 is a critical command injection vulnerability\nin Barracuda Email Security Gateways (physical appliances). These vulnerabilities were\nheavily exploited by attackers, and notably the first and third most targeted vulnerabilities\nwere related to edge devices. For more information on the continued targeting of these\ndevices, please see Chinese Espionage Operations Targeting The Visibility Gap.\n\nHowever, Mandiant experts also observed attackers’ continued use of exploits throughout\nthe attack lifecycle to maintain access, move laterally, and complete their mission.\nMandiant continues to observe a handful of vulnerabilities related to older technologies,\nsuch as Microsoft Access 2003 (CVE-2008-2463),[3] Microsoft Windows Server 2016 (CVE2017-0144),[4] and Telerik (CVE-2019-18935).[5]\n\n###### Most Frequently Seen Vulnerabilities\n\n\n###### Barracuda ESG\nCVE-2023-2868\n\n\n###### MOVEit Transfer\nCVE-2023-34362\n\n\n###### Oracle Web Applications Desktop Integrator\nCVE-2022-21587\n\n\n-----\n\n###### 36[%]\nFinancial Gain\n\n###### 23[%]\nRansomware\n\n###### Financial Gain, 2020-2023\n\n% %\n\n%\n\n###### 38 % 36\n 30 26\n\n**2020** **2021** **2022** **2023**\n\n\n###### Post-Compromise Activity\n\n**Financial Gain**\n\nThe proportion of intrusions Mandiant responded to that served financially motivated\nobjectives increased from more than a quarter of all investigations, 26%, in 2022 to more\nthan a third, 36%, in 2023. Ransomware-related intrusions represented almost two thirds of\nfinancially motivated intrusions and 23% of all 2023 intrusions.\n\nThe remaining financially motivated intrusions included data theft extortion without\nransomware encryption, attackers establishing initial access to facilitate other operations,\nbusiness email compromise (BEC) fraud, and cryptocurrency theft events. Mandiant\nattributed several financially motivated intrusions to likely North Korean[6] state-sponsored\nattackers, including cryptocurrency theft and IT worker wage theft. Mandiant continues to\ntrack North Korean threat groups that conduct financially motivated activity to cover both\noperational costs as well as larger scale activity intended to generate revenue for\nthe state.[7]\n\nThe upward trend in ransomware and other extortion-related investigations in 2023 is\nconsistent with Mandiant and open-source observations of a marked increase in listings\non data leak sites (DLS) and extortion revenue estimates.[8] DLS are websites where the\nillicitly retrieved data of companies that refuse to pay a ransom are published. While\nthis data is skewed toward targets who refused to pay attackers’ ransom demands, it is\nstill useful for understanding broad trends in extortion operations. The FIN11 MOVEit\nexploitation campaign and UNC3944[9] activity described in the Evolution of Phishing\nsection showcase the prevalence of extortion intrusions without ransomware encryption.\n\n###### Count of DLS Listings per Quarter, 2021-2023\n\n1500\n\n1000\n\n500\n\n0\n\n\nNo Direct Financial Gain Observed\n\nDirect Financial Gain\n\n\nQ1 Q2 Q3 Q4\n\n**2021**\n\n\nQ1 Q2 Q3 Q4\n\n**2022**\n\n\nQ1 Q2 Q3 Q4\n\n**2023**\n\n\n-----\n\n###### Data Theft, 2020-2023 Data Theft\n\n\n% %\n\n% %\n\n###### 32 29 40 37\n\n**2020** **2021** **2022** **2023**\n\nNo Observable Data Theft\n\nObservable Data Theft\n\n\nMandiant identified data theft in 37% of 2023 intrusions, which is slightly lower than the\n40% of intrusions reported in 2022. In 11% of intrusions, attackers directly monetized\nstolen data through extortion. In an additional 7%, they used a combination of data theft,\nransomware, and extortion, also known as multifaceted extortion. Mandiant also observed\nattackers steal credentials and other data likely to facilitate reconnaissance of target\nnetworks. Several cases involved large-scale data theft that included intellectual property.\nMandiant also identified instances of targeted or selective data theft by groups such as\nthe Russian cyber espionage group APT29[10] and the suspected Chinese cyber espionage\ncluster UNC4841.[11]\n\n###### 37[%] Data Theft\n\n 11[%] Extortion\n\n 7[%] Multifaceted Extortion\n\n\n-----\n\n**Compromised Architecture**\n\n###### % %\n 6in 2022 6in 2023\n\n\n**Multiple Threat Groups Identified**\n**(per environment)**\n\n###### % %\n 27in 2022 17in 2023\n\n\n**Environment**\n\nIn 2023, Mandiant experts continued to observe attackers use compromised architecture\nto conduct email spam, distribute botnets, and perform some types of cryptomining\nactivity. During the past three years, intrusions related to compromised architecture\nhave been heavily automated following the mass exploitation of vulnerabilities. Publicly\nreleased proof-of-concept (PoC) code for new exploits increases the ease of automating\nattacks, accelerating the attack cycle for adversaries abusing compromised infrastructure.\nPublicly available PoC code for vulnerabilities makes it simple for attackers to automate\ntheir exploits using scanning tools.\n\nIn 2023, Mandiant noted a decrease in the number of investigations that identified\nmultiple threat groups in a single environment. In 17% of investigations, Mandiant experts\nuncovered more than one threat group operating in the target environment. This likely is\nrelated to the volume of targeted zero-days that Mandiant investigated. The 10 percentage\npoint decrease from 2022 (27%) suggests a positive trend, potentially resulting from\ndefenders’ efforts to limit the ability of additional attackers to infiltrate environments.\n\n\n-----\n\n###### 719\n\nNewly Tracked\nThreat Groups\n\n\n###### 316\n\nObserved\nThreat Groups\n\n\n###### Threat Groups\n\nMandiant tracks more than 4,000 threat groups, 719 of which were newly tracked in\n2023. Mandiant investigators encountered 316 different threat groups when responding\nto intrusions in 2023, 220 groups were both newly tracked and observed in Mandiant\ninvestigations in 2023. These counts are largely in line with 2022 observations. For\nexample in 2022, 265 groups were both newly tracked and observed in Mandiant\ninvestigations. In 2023, organizations faced intrusions by two named advanced persistent\nthreat (APT) groups from Russia and Iran; four named financial threat (FIN) groups; and\n310 uncategorized (UNC) groups. While 253 of these UNC groups were newly identified,\nMandiant has tracked the remaining 57 UNC groups for periods ranging from one to 10\nyears. This distribution of threat groups suggests that organizations contend with both\nestablished and new threats on a regular basis.\n\n**Observed threat group**\nis a threat group Mandiant\ninvestigators encountered\nduring incident response\ninvestigations.\n\n\n###### 4000+\n\n**2023 Active** **2023** **Total Tracked** Total Groups ¹ Mandiant tracks Advanced Persistent Threat (APT) groups\n**Geolocations** **Activity** **Efforts**\n0-43. Over the years, APT11 and APT13 were merged into other\ngroups and subsequently deprecated resulting in 42 APT\ngroups actively tracked by Mandiant.\n\n\n-----\n\n**UNC Group** When\nMandiant encounters new\nthreat activity that cannot\nconfidently be linked to an\nexisting group, an UNC group\ndesignation is created to tie\ntogether observable artifacts\nassociated with the activity\ncluster. As new information\nand artifacts are discovered\nthat can be tied back to\nthe same activity cluster,\nMandiant analysts build on\nthe initial understanding\nof the attacker, potentially\nmerging it with other tracked\nthreat clusters and ultimately\ngraduating the UNC to an\nAPT or FIN group.\n\n\nMore than half of the attackers observed in 2023 (52%) were primarily motivated by\nfinancial gain, and 10% principally pursued espionage activities. A very small percentage,\njust 2%, included threat clusters Mandiant judged to be operating for hacktivist\nmotivations, attackers focused on disruption or destruction, and pentesters. For the\nremaining 36% of threat clusters, there was not sufficient evidence to determine a specific\nmotivation with a high degree of confidence. Compared to 2022, Mandiant observed\nmodest declines in the proportion of attackers pursuing objectives of espionage,\ndisruption and destruction, hacktivism, and influence operations. Financially motivated\ngroups made up a larger share of observed attackers in 2023, 52%, compared to 48% in\n2022, a shift at least partially explained by the growth in ransomware- and extortionrelated activity in 2023.\n\n###### Observed Threat Groups by Goal, 2023\n\n\n60\n\n40\n\n\n###### 36[%]\n\n\n###### 52[%]\n\n\n20\n\n0\n\n\n###### 10[%] 2[%]\n\n\nFinancial Gain Unknown Espionage Other\n\n###### Graduation\n\n\nIn 2023, Mandiant graduated one new named threat group, APT43, and merged 189 activity\nclusters into other threat groups based on extensive research into activity overlaps. For\ndetails on how Mandiant defines and references UNC groups and merges, please see,\n“How Mandiant Tracks Uncategorized Threat Actors.”[12]\n\nAPT43 is a prolific cyber operator that supports the interests of the North Korean\nGovernment. The group combines moderately sophisticated technical capabilities with\naggressive social engineering tactics, especially against South Korean and U.S.\ngovernment organizations, academics, and think tanks focused on geopolitical issues\nsurrounding the Korean Peninsula. In addition to its espionage campaigns, we believe\nAPT43 funds itself through cyber crime operations to support its primary mission of\ncollecting strategic intelligence. The group creates numerous spoofed and fraudulent\npersonas for use in social engineering as well as cover identities for purchasing\noperational tooling and infrastructure. APT43 has collaborated with other North Korean\nespionage operators on multiple operations, underscoring the major role APT43 plays in\nNorth Korea’s cyber apparatus. For more details, see the full APT43 report.[13]\n\n\n-----\n\n###### 626\n\nNewly Tracked\nMalware Families\n\n\n###### 227\n\n\n###### Malware\n\nIn 2023, Mandiant began tracking 626 new malware families, 128 of which were seen in\nincident response investigations. This is the highest number of net new malware families\nMandiant has identified in a single year to date. However, this figure is not drastically\nhigher than the 588 malware families that were newly tracked in 2022, which suggests that\nadversaries could be increasing their toolsets at a similar rate.\n\nWhile Mandiant observed an increase in the number of newly tracked malware families in\n2023, the total number of observed families declined from 321 to 277. This decrease may\nreflect the increased use of previously established tools and/or the rising number of\ncompromises that use no malware at all. Of all 277 malware families observed in\nintrusions, 128 were newly tracked in 2023.\n\n\n-----\n\n**A malware category**\ndescribes a malware family’s\nprimary purpose. Each\nmalware family is assigned\nonly one category that\nbest describes its primary\npurpose, regardless of\nfunctionality for more than\none category.\n\n\n###### New Malware Families by Category\n\nThe top five malware categories have remained relatively consistent year over year. Of\nthe 626 newly tracked malware families, the top five categories include backdoors (33%),\ndownloaders (16%), droppers (15%), credential stealers (7%), and ransomware (5%). Newly\ntracked credential stealers return to the top five categories in 2023 after a brief hiatus\nobserved in 2022. Another notable change in rankings is the decrease in newly tracked\nransomware families, from 7% of malware families to 5% of newly tracked families in\n2023. Although Mandiant responded to a similar proportion of ransomware intrusions in\n2023 as in 2021, the decline in net new ransomware families may reflect the prevalence of\nransomware strains that existed prior to 2023, such as LOCKBIT, ALPHV, BASTA,\nand ROYALLOCKER.\n\n###### Newly Tracked Malware Families by Category, 2023\n\n\n###### Backdoor Downloader\n\n\n###### Other Credential\n**Stealer**\n\n\n###### % %%\n %\n 16Dropper\n [15]Ransomware Datamine 7Launcher\n % 15\n %\n % % %\n 5 5 4\n 15\n\n##### 33\n\n\n-----\n\n**An observed malware**\n**family** is a malware family\nidentified during an\ninvestigation by Mandiant\nexperts.\n\n\n###### Observed Malware Families by Category\n\nObserved malware family categories were also relatively consistent with the findings from\nprevious years. Mandiant experts observed 277 malware families during investigations\nconducted in 2023. Backdoors remain the favorite among attackers, making up 34% of\nthe observed malware dataset. This is up one percentage point from 2022. The remaining\nobserved malware family categories show ransomware (11%), droppers (9%), downloaders\n(9%), and tunnelers (6%) rounding out the top five.\n\nMandiant continues to see a rise in attacker use of remote administration tools and other\nutilities to conduct their operations, noted in the continued increase in the “Other” category\nyear over year. Of the 20% of malware families in this category, 8% represent legitimate\nutilities or remote administration tools. While not inherently malicious, attackers often\nleverage these tools in intrusions to evade detection, demonstrating their continued\nresourcefulness. To remain undetected and carry out further operations, attackers use\nliving-off-the-land (LotL) techniques by employing system tools that are already in the\nenvironment or they abuse remote administrator tools that are less likely to be flagged by\ndefault in security technologies like Endpoint Detection and Response tooling.\n\n###### Observed Malware Families by Category, 2023\n\n Backdoor Other Ransomware Dropper\n\n % %\n\n**Downloader Tunneler** **Launcher**\n\n###### 11 9\n % % %\n % 4Datamine\n %6Credential\n**Theft4% 4%**\n\n###### 208\n\n#### 34\n\n\n-----\n\n**Observed Malware Families**\n**2022 to 2023**\n\n**Backdoor**\n\n###### % %\n 33 34\n\n\n###### Backdoor A program whose primary purpose is to allow an attacker to issue interactive commands to the system on which it is installed.\n\n\n###### A utility whose primary purpose is to access, copy, or steal authentication credentials.\n\n\n**Downloader**\n\n###### % %\n 10 8\n\n**Dropper**\n\n\n###### Credential Stealer\n\n\n###### % %\n 9 9\n\n\n**Launcher**\n\n###### % %\n 5 4\n\n\n**Tunneler**\n\n\n###### % %\n 5 6\n\n**Ransomware**\n\n###### % %\n 10 11\n\n\n**Other**\n\n###### % %\n 28 20\n\n\n###### Datamine A utility whose primary purpose is to gather data, typically for theft. Excludes utilities that gather data such as credentials used for the purpose of escalating privileges or information used for system or network reconnaissance.\n\n Downloader A program whose sole purpose is to download (and perhaps launch) a file from a specified address and which does not provide any additional functionality or support any other interactive commands.\n\n Dropper A program whose primary purpose is to extract, install, and potentially launch or execute one or more files.\n\n Launcher A program whose primary purpose is to launch one or more files. Differs from a dropper or an installer in that it does not contain or configure the file, but merely executes or loads it.\n\n Ransomware A program whose primary purpose is to perform some malicious action (such as encrypting data) with the goal of extracting payment from the target in order to avoid or undo the malicious action.\n\n Tunneler A program that proxies or tunnels network traffic.\n\n Other Includes other categories, such as utilities, remote admin technologies, keyloggers, and point of sale.\n\n\n-----\n\n**A publicly available tool**\n**or malware family** is\nreadily obtainable without\nrestriction. This includes tools\nthat are freely available on\nthe internet as well as tools\nthat are sold or purchased,\nas long as they can be\npurchased by any buyer.\n\n**A non-public tool or**\n**malware family** is, to the\nbest of our knowledge, not\npublicly available (either\nfor free or for sale). They\nmay include tools that are\nprivately developed, held or\nused, as well as tools that are\nshared among or sold to a\nrestricted set of customers.\n\n\n###### Malware by Availability\n\nMalware family availability for both newly tracked and observed malware families remains\nmore heavily weighted toward non-public in 2023, similar to previous M-Trends reporting.\nIn both categories, malware families are more often privately developed or have restricted\navailability. Adversaries traditionally use a variety of non-public malware to conduct\ntheir operations. However, the share of publicly available malware families observed in\ninvestigations has increased by one percentage point from 2021 to 2022 and again from\n2022 to 2023 to arrive at 30%. The increased use of publicly available malware likely\nreflects the rise in financially motivated attackers who prioritize speed and efficiency over\nlong-term stealth.\n\n###### Newly Tracked Malware Families by Availability, 2023\n\n\n###### Non-Public\n\n %\n\n Public\n %\n 14\n## 86\n\n###### Observed Malware Families by Availability, 2023\n\n\n###### Non-Public\n\n % Public %\n 30\n#### 70\n\n\n-----\n\n###### BEACON Usage, 2020-2023\n\n20%\n\n10%\n\n0\n\n2020 2021 2022 2023\n\n\n###### Most Frequently Seen Malware\n\nBEACON remains the most frequently observed malware family in Mandiant investigations\nglobally and was identified in 10% of all intrusions. While BEACON remains the favorite\namong attackers, during the past three years Mandiant has seen a decrease in BEACON\nusage. In 2021, 28% of intrusions had at least one BEACON backdoor used. At the time,\nransomware groups were actively compromising organizations across the globe and\nfrequently used BEACON to conduct operations. In 2022, there was a global decrease\nin ransomware-related intrusions, and once again the usage of BEACON reflected that\ndecrease. However, in 2023, Mandiant defenders noted BEACON usage at an all time low,\ndespite an increase in ransomware intrusions.\n\n\n**Most Frequently Seen Malware Families, 2023**\n\n12\n\n\n10\n\n8\n\n\n###### 10[%]\n\n\n6\n\n4\n\n\n###### 5[%] 5[%] 5[%] 4[%]\n\n\n2\n\n0\n\n\n###### 2[%] 2[%] 2[%]\n\n\nBEACON ALPHV LEMURLOOT SYSTEMBC LOCKBIT SEASPY METASPLOIT REGEORG\n\nThis decrease could align with attackers moving to evade endpoint security technology\nwith memory resident malware, utilizing third-party remote administration tools, and\nemploying more LotL techniques, or the abuse of native tools and processes on a system.\nAnother possibility could be that attackers are migrating away from the command and\ncontrol (C2) framework Cobalt Strike and the use of BEACON as their primary backdoor.\nAs robust security community driven detections have created increased mitigations for\nthe Cobalt Strike framework, attackers will increasingly turn to other C2 avenues such as\nSLIVER, Brute Ratel, and Mythic, to support operations.\n\nALPHV and LOCKBIT were the second and fifth most frequently observed malware families,\nrespectively, in 2023. Mandiant encountered ALPHV ransomware in 5% of Mandiant led\ninvestigations in 2023 compared to 2% in 2022.\n\nThe third and sixth most prevalent malware families Mandiant observed were related\nto the first and third most exploited vulnerabilities. LEMURLOOT (5%) and SEASPY (2%)\nare backdoors used by attackers following exploitation of the MOVEit and Barracuda\ntechnologies respectively. The remaining frequently observed malware families have been\nused by multiple attackers, some also in conjunction with ALPHV, LOCKBIT, LEMURLOOT\nand SEASPY.\n\n\n-----\n\n**BEACON** A backdoor written in C/C++ that is part of the Cobalt Strike framework. Supported backdoor\ncommands include shell command execution, file transfer, file execution, and file management.\nBEACON can also capture keystrokes and screenshots as well as act as a proxy server. BEACON\nmay also be tasked with harvesting system credentials, port scanning, and enumerating systems\non a network. BEACON communicates with a C2 server via HTTP or DNS. Mandiant has seen\nBEACON used by a wide range of named threat groups including APT19, APT32, APT40, APT41,\nFIN6, FIN7, FIN9, FIN11, FIN12 and FIN13, as well as more than 800 UNC groups.\n\n**ALPHV** Ransomware written in Rust. The ransomware may contain a plaintext JSON configuration that\nspecifies the ransomware functionality. ALPHV may be able to escalate its privileges and bypass\nUAC, likely contains AES and ChaCha20 (or Salsa) encryption functionality, may use the Restart\nManager as part of its operations, deletes volume shadow copies, may enumerate disk volumes\nand network shares, and may kill processes and services. Mandiant has seen more than 20 UNC\ngroups with financial gain goals use ALPHV.\n\n**LEMURLOOT** LEMURLOOT is a web shell written in C# tailored to interact with the MOVEit Transfer platform. The\nmalware authenticates incoming connections via a hard-coded password and can run commands\nthat will download files from the MOVEit Transfer system, extract its Azure system settings,\nretrieve detailed record information, create and insert a particular user, or delete this same user.\nData returned to the system interacting with LEMURLOOT is Gzip compressed.Based on Mandiant\nobservations, FIN11 is the primary user of LEMURLOOT.\n\n**SYSTEMBC** A tunneler written in C that retrieves proxy-related commands from a C2 server using a custom\nbinary protocol over TCP. A C2 server directs SYSTEMBC to act as a proxy between the C2 server\nand a remote system. SYSTEMBC is also capable of retrieving additional payloads via HTTP. Some\nvariants may use the Tor network for this purpose. Downloaded payloads may be written to disk or\nmapped directly into memory prior to execution. SYSTEMBC is often used to hide network traffic\nassociated with other malware families. Observed families include DANABOT, SMOKELOADER,\nand URSNIF. Mandiant has seen FIN12 and more than 40 UNC groups with financial gain goals use\nSYSTEMBC..\n\n**LOCKBIT** A ransomware written in C that encrypts files stored locally and on network shares. LOCKBIT can\nalso identify additional systems on a network and propagate via SMB. Prior to encrypting files,\nLOCKBIT clears event logs, deletes volume shadow copies, and terminates processes and services\nthat may impact its ability to encrypt files. LOCKBIT has been observed using the file extension\n“.lockbit” for encrypted files. Mandiant has seen more than 30 UNC groups with financial gain\ngoals use LOCKBIT..\n\n**SEASPY** SEASPY is a backdoor that establishes a PCAP filter on port 25 (SMTP) and is activated when a\n“magic packet” is received. SEASPY masquerades as a legitimate Barracuda Network Service and\nchanges its process in memory for further evasion. Mandiant has only seen UNC4841 use SEASPY.\n\n**METASPLOIT** A penetration testing framework whose features include vulnerability testing, network\nenumeration, payload generation and execution, and defense evasion. The framework contains\nexploits for numerous applications and popular operating systems such as Windows, Linux, and\nmacOS. METASPLOIT is commonly used to generate a stager payload, which is responsible for\ndownloading and executing the framework’s METERPRETER backdoor. Mandiant has seen APT32,\nAPT41, APT43, FIN6, FIN7, FIN11, FIN13, and more than 160 UNC groups use Metasploit.\n\n**REGEORG** An open-source utility used to tunnel webshell traffic. Mandiant has seen APT28, APT29, APT41 and\n30 UNC groups use REGEORG.\n\n\n-----\n\nRANSOMWARE AS A SERVICE\n\n###### ALPHV\n\nAFFILIATE\n\nOPERATOR\n\n**UNC2758**\n\nAFFIILIATE\n\n**UNC2465**\n\nRANSOMWARE AS A SERVICE\n\n###### LOCKBIT\n\n\n**Notable Law Enforcement Actions**\n\nIn a December 2023 press release, the United States Federal\nBureau of Investigation (FBI) reported[14] that ALPHV, also known\nas BlackCat, had targeted more than 1,000 organizations. The\nFBI’s press release also outlined the disruption campaign and\nthe development of a decryption tool that allowed the FBI to\noffer help to a number of impacted organizations. Mandiant\ntracks the ALPHV ransomware operator as UNC3507, and\nseveral other clusters of activity as affiliates, most notably\nUNC3944, UNC4696, and UNC4896.\n\nThe fifth most frequently observed malware family across\n2023 Mandiant investigations was LOCKBIT. LOCKBIT\nransomware appeared in 4% of investigations compared to 2%\nin 2022. The LOCKBIT data leak site listed more targets than\nany other extortion group in 2023 by a significant margin. In\nJune 2023, the United States Department of Justice (DOJ)\nannounced criminal charges[15] against a LOCKBIT affiliate, the\nthird individual charged by the DOJ for their role in the global\nLOCKBIT ransomware operation. Since LOCKBIT first appeared\nin early 2020, the DOJ has noted that there have been more than\n1,400 attacks conducted by LOCKBIT ransomware-as-a-service\n(RaaS) affiliates. International law enforcement continued to\npursue LOCKBIT activity, announcing seizure of the LOCKBIT\ndata leak site and back-end infrastructure in “Operation Cronos”\nin February 2024.[16] Mandiant tracks the LOCKBIT ransomware\noperator as UNC2758 and five other notable affiliate groups.\n\nRansomware families like ALPHV and LOCKBIT operate within\ntheir own criminal ecosystems. Following the December 2023\nlaw enforcement disruption of ALPHV, the operators of the\nLOCKBIT ransomware service attempted to take advantage of\nthe situation by appealing to ALPHV affiliates and attempting\nto undercut negotiation processes ALPHV targets had already\nengaged in. Despite these disruptions and arrests by law\nenforcement, ransomware groups remain resilient and adapt\nquickly, mitigating the impact on their operations. While law\nenforcement efforts have yielded decryptors and temporary\nslowdowns, the profitability of ransomware incentivizes\nfinancially motivated adversaries to continue their attacks,\nhighlighting the need for organizations to maintain strong\nsecurity practices.\n\n\n-----\n\n**The operating system**\n**effectiveness** of a malware\nfamily is the operating\nsystem(s) that the malware\ncan be used against.\n\n\n###### Operating System Effectiveness\n\nIn 2023, Mandiant noted a slight increase in newly tracked malware effective on Linux\nsystems at 16%, compared to 12% in 2022. Notably, observed malware effective on Linux\nhas increased to 31% of all malware observed in 2023, compared to 15% in 2022. Similar to\nprevious M-Trends reporting periods, most newly tracked and observed malware families\nstill remain effective on Windows. The apparent decline in the percentage of Windowsrelated malware from 2022 to 2023 likely reflects the greater share of Linux-related\nmalware rather than a true decline in malware effective on Windows.\n\n\n###### Operating System Effectiveness of\n Newly Tracked Malware Families, 2023\n\n100\n\n\n80\n\n60\n\n40\n\n20\n\n0\n\n\n**Windows Linux MacOS** **Unix** **Android** **BSD VMKernel** **iOS**\n\nEffectiveness of Newly Tracked Malware Families\nby Operating System OS Only (Global)\n\nEffectiveness of Newly Tracked Malware Families\nby Operating System (Global)\n\n\n###### 83[%]\n\n 79[%]\n\n\n###### 16[%]\n\n 11[%]\n\n\n###### 4[%]\n 1[%] 1[%]\n 1[%]\n\n\n###### <1[%]\n 0[%]\n\n\n###### 4[%]\n 3[%]\n\n\n###### <1[%]\n <1[%]\n\n\n###### <1[%]\n <1[%]\n\n\n###### Operating System Effectiveness of \n Observed Malware Families, 2023\n\n100\n\n80\n\n###### 79[%]\n\n 67[%]\n\n60\n\n40\n\n###### 31[%]\n\n20 **8[%]**\n\n###### 2[%] 2[%] <1[%] <1[%] 1[%]\n 17[%] 1[%] <1[%]  0[%] 0[%]\n\n0\n\n**Windows Linux MacOS** **Unix** **Android** **BSD VMKernel**\n\nEffectiveness of Observed Malware Families\nby Operating System OS Only\n\nEffectiveness of Observed Malware Families\nby Operating System\n\n\n-----\n\n**MITRE ATT&CK[®]** is a globally\naccessible knowledge\nbase of adversary tactics\nand techniques based on\nreal-world observations.\nThe ATT&CK knowledge\nbase is used as a foundation\nfor the development of\nspecific threat models and\nmethodologies in the private\nsector, government, and the\ncybersecurity product and\nservice community.\n\n###### MITRE ATT&CK Techniques\n Used Most Frequently, 2023\n 74[%]\nObserved in\nMandiant Investigations\n\n\n###### Threat Techniques\n\nSince M-Trends 2020, Mandiant has supported the community by mapping findings\npresented in M-Trends to the MITRE ATT&CK framework. As organizations continue to\nstrengthen their security measures, they can work to prioritize implementing detection\ncapabilities based on techniques and sub-techniques used in intrusions. Mandiant\nprovides metrics around the most frequently observed techniques that adversaries used\nas a resource to organizations as they make decisions on how to further improve their\nsecurity capabilities.\n\nMandiant has mapped an additional 1,200+ Mandiant techniques to the updated MITRE\nATT&CK framework, bringing the total to 3,500+ Mandiant techniques and subsequent\nfindings associated with the ATT&CK framework. In 2023, the MITRE ATT&CK framework\nwas updated to version 14.1, resulting in ATT&CK for Enterprise now containing 201\ntechniques and 427 sub-techniques.\n\n###### MITRE ATT&CK Techniques Used Most Frequently, 2023\n\nMandiant experts observed adversaries use 74% of MITRE ATT&CK techniques and 44%\nof sub-techniques during 2023 intrusions. Nearly three quarters of mapped ATT&CK\ntechniques and almost half of the sub-techniques were actively observed in intrusions\nMandiant investigated in 2023. This breadth of techniques and sub-techniques is at the\nsame magnitude that Mandiant defenders observed in 2022.\n\nThe techniques that attackers used in 2023 are consistent with those observed in 2022,\nwith the top 10 most frequently seen techniques showing little variance over the last\nseveral years. In more than half of investigations, Mandiant investigators noted the use of\na command or scripting interpreter (T1059) by attackers. Notable differences in the 2023\ndataset is the presence of System Owner or User Discovery (T1033) and use of exploits\nagainst a public-facing application (T1190) in the top 10 list of observed techniques. These\ntwo techniques correlate with the rise of ransomware-related intrusions and the increase\nin exploit use, specifically mass exploitation campaigns observed in 2023.\n\nIt is unsurprising that the top five observed sub-techniques are PowerShell (T1059.001),\nWeb Protocols (T1071.001), Remote Desktop Protocol (T1021.001), Service Execution\n(T1569.002), and File Deletion (T1070.004), as this is the fourth consecutive year they\nhave dominated the charts. Attackers likely favor these sub-techniques because they\nutilize readily available tools within a system, making them easy to abuse. Their history\nof successful compromises, combined with the ability to sometimes evade security\nmeasures, makes them a highly effective part of an attacker’s toolkit. This persistent trend\nreveals the standard tactics attackers employ to achieve their objectives. Organizations\nmust prioritize detecting these sub-techniques if they haven’t done so already.\n\n\n-----\n\n###### Top 10 Most Frequently Seen Techniques\n\n\n1 T1059: Command and Scripting Interpreter 52.3%\n\n2 T1027: Obfuscated Files or Information 46.5%\n\n3 T1083: File and Directory Discovery 38.6%\n\n4 T1021: Remote Services 37.3%\n\n5 T1082: System Information Discovery 37.1%\n\n6 T1070: Indicator Removal 35.1%\n\n7 T1071: Application Layer Protocol 34.0%\n\n8 T1033: System Owner/User Discovery 31.7%\n\n9 T1140: Deobfuscate/Decode Files or Information 31.5%\n\n10 T1190: Exploit Public-Facing Application 28.7%\n\n\n###### Top 5 Most Frequently Seen MITRE ATT&CK Sub-Techniques\n\n\n1 T1059.001: PowerShell 32.3%\n\n2 T1071.001: Web Protocols 29.6%\n\n3 T1021.001: Remote Desktop Protocol 28.3%\n\n4 T1569.002: Service Execution 26.8%\n\n5 T1070.004: File Deletion 26.6%\n\nThe observed MITRE ATT&CK techniques mapped to the Mandiant Targeted Attack\nLifecycle can be found in the appendix of this report.\n\n\n-----\n\n###### Campaigns\n  & Global Events\n\n\n**Campaigns** are a set\nof impactful intrusions\nconducted by an attacker\nor multiple attackers in\ncooperation toward a\nsingle objective at multiple\ntargets within a relevant\ntimeframe.[17]\n\n**Global events** are a set\nof impactful intrusions\nconducted by multiple\nunrelated adversaries in\nparallel campaigns involving\na similar theme, target, or\nresource.\n\n\nWhen Mandiant experts observe that multiple organizations are actively being impacted\nby similar threat activity, a campaign or global event is created. A Campaign is a set of\nactivity in which one or more threat groups coordinate to achieve a single objective. Larger\nscale Global Events can encompass multiple threat groups pursuing multiple disparate\nobjectives, but using similar tactics, often exploiting a vulnerability. Campaigns and Global\nEvents (CGE) provide clients with notification of emerging and active threat activity. Over\nthe course of each campaign and global event, Mandiant dynamically updates potential\ntargets with new data as more information is received and analyzed. This intelligence\nincludes indicators of compromise, context surrounding key events, and defensive and\nprevention measures based directly on data collected from Mandiant investigations and\nother Mandiant research.\n\nCampaigns and Global Events provide Mandiant clients with the critical intelligence\nneeded to defend against today’s most dangerous threats. Early identification of active\nexploits means attacks can be halted quickly, minimizing damage. CGEs facilitate rapid\ncollaboration between teams, ensuring a swift response. As Mandiant uncovers new\nthreat data, CGE users receive immediate updates, enabling them to refine defenses and\npinpoint the attack’s full impact. Mandiant tracked and reported 25 campaigns and global\nevents in 2023 related to Mandiant Consulting investigations. These campaigns affected\norganizations across the Americas, EMEA, and JAPAC from 21 industry verticals.\n\n\n-----\n\n###### CVE-2023-34362 Retrospective Timeline\n\n**05-30**\nProgress Software took\ndown cloud services\n\n\n**06-02**\n**CVE-2023-34362 Added to CISA's**\nKnown Exploited Vulnerabilities\nCatalog\n\n**06-06**\nPost on the\n**CL0P^_-LEAKS**\nDLS claimed\nresponsibility\n\n**06-02**\nMandiant Containment &\nHardening Guide Published\n\n\n**06-09**\nPoC exploit for CVE-2023-34362\nfirst publicly available\n\n**06-23**\n**CVE-2023-34362**\nwas required to\nbe remediated\n\n###### July\n\n**Other Threat Groups Scanning Activity**\n\n        - MOVEit Cloud and on-prem versions of MOVEit Transfer\n\n\n**05-15** **05-27** **05-31**\n\nFirst observed Data Exfil Starts Data Exfil Ends\nFIN11 scanning First known\nexploitation of\n**CVE-2023-34362**\noccurred\n\n\nThe FIN11 MOVEit exploitation campaign represents a prominent example of this type\nof event. The CVE-2023-34362 Retrospective Timeline illustrates observations related to\nFIN11’s[18] exploitation of this vulnerability.[19]\n\nMandiant investigators observed FIN11 scanning the internet beginning on May 15,\n2023, using infrastructure that was subsequently used to exploit the MOVEit zero-day\nvulnerability. Based on analysis from Mandiant incident response engagements, the\nearliest evidence of exploitation of CVE-2023-34362 occurred twelve days later, on May\n27, 2023. The evidence also indicates that FIN11 began stealing data from numerous\norganizations via MOVEit technology within 16 hours of the first exploitation of the\nvulnerability. On May 31, 2023, Progress disclosed the vulnerability, patched its cloudbased service, and released a patch for on-premises implementations. It was not until 10\ndays following the first successful exploitation of the vulnerability, on June 6, 2023, that\nFIN11 claimed responsibility for the campaign on the CL0P^_- LEAKS DLS. The first PoC\nwas made publicly available three days later, on June 9, 2023.\n\nNotably, from late 2020 to 2023,[20] FIN11 demonstrated a pattern of exploiting\nvulnerabilities in four different file transfer applications, likely because this type of\ncampaign offers FIN11 several advantages. A working exploit allows FIN11 to compromise\nmany targets at once. Specific targeting of file transfer software provides tactical\nadvantages and supports FIN11’s business model of data theft extortion. FIN11 can obtain\ntarget files directly from the file transfer appliance without additional lateral movement\ninto target environments, which would require time and effort on the part of the attacker\nand create more opportunities for defenders to detect the intrusion.\n\n\n-----\n\n###### 2023 Campaigns and Global Events Related to Mandiant Incident Response Investigations\n\n**Jan ʹ23** **Feb** **Mar** **April** **May** **Jun** **Jul** **Aug** **Sep** **Oct** **Nov** **Dec** **Jan ʹ24** **Feb**\n\nFinancially Motivated Group Gains Access via Drive-By Downloads of FAKEUPDATES\n\nFinancially motivated\nEspionage\n\nFinancially Motivated Group Exploits CVE-2022-21587\n\nMultiple/unknown\n\nUNC2633 Resurfaces to Distribute QAKBOT via OneNote phishing attachments\n\nUNC2500 Resurfaces to Distribute QAKBOT via OneNote phishing attachments\n\nSuspected Chinese Espionage Group Exploits IBM Aspera Faspex to Gain Initial Access\n\nExploitation of CVE-2022-47986 in IBM Aspera Faspex\n\nUNC4736 Conducts Cascading Supply Chain Compromise\n\nUNC3944 Conducts SMS Phishing and Data Theft Extortion\n\nSuspected Russian Group Targets Ukraine with\nSMOKELOADER\n\nFIN11 Exploits a Critical Vulnerability in MOVEit MFT for Data Theft Extortion\n\nFinancially Motivated Group Conducts ALPHV Ransomware and\nData Theft and Extortion\n\n|Jan ʹ23|Feb|Mar|April Financially|May Motivated Gr|Jun oup Gains Ac Financially|Jul cess via Driv Motivated Gr UNC2633 R UNC2500 R Aspera Fas spex cading Suppl|Aug e-By Downlo oup Exploits esurfaces to esurfaces to pex to Gain In y Chain Com|Sep ads of FAKE CVE-2022-21 Distribute Q Distribute Q itial Access promise UNC3944 C|Oct UPDATES 587 AKBOT via O AKBOT via O onducts SMS|Nov neNote phish neNote phish Phishing an|Dec ing attachme ing attachme d Data Theft Suspected SMOKELOA in MOVEit M oup Conduct roup Uses So PERDROP \u0003an Vulnerabilitie CVE-2023-3|Jan ʹ24 Financially Espionage Multiple/unk nts nts Extortion Russian Grou DER FT for Data T s ALPHV Ran cial Media an d DANABOT s in Ivanti Pr 519|Feb motivated nown p Targets Uk heft Extortio somware an d SEO oducts|\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n|||||||||||||||\n|||||||||||||||\n|||||||||||||||\n|Sus Suspec UNC||Suspected Exploitatio|Chinese Espi n of CVE-202|onage Group 2-47986 in IB UNC4736 C|Exploits IBM M Aspera Fa onducts Cas|||||||||\n|||||||||||||||\n||pected DPRK Financiall Explo ted Financial 2500 Resurfa|||||||||||||\n|||||||||||||||\n|||Group Leve Targe y Motivated itation of CV Ex ly Motivated ces to Distri Financia Financially||||||||||||\n||||rages SaaS P ted Supply C Group Distrib E-2023-4966 ploitation of Group Condu bute Phishing lly Motivated Motivated G Suspecte|||||FIN11 Explo|its a Critical Financially Data Theft Financially Poisoning t Exploitatio p Exploits C|Vulnerability Motivated Gr and Extortion Motivated G o Deliver PA n of Multiple itrix Zero-Day||||\n|||||||||||||||\n|||||||||||||||\n|||||rovider in a hain Attack utes DARKG in Citrix Net CVE-2023-4 cts Phishing Unknown Th Emails with Group Uses roup Exploits Exploitati d Chinese Es||||||||||\n|||||||||||||||\n||||||ATE via Micro scaler / ADC 2793 in JetBr / \u0003Adversary- reat Group E Links to Dow DARKGATE A Atlassian \u0003V on of CVE-20 pionage Gro||Suspected|Chinese Grou||||||\n|||||||soft Teams Appliances ains TeamCi in-the-Middl xploits CVE-2 nload Variou ccess to Dep ulnerabilities 23-46805 an up Exploits \u0003C||||||||\n|||||||||||||||\n||||||||ty Products e Campaign 023-20198 s Payloads loy BASTA R for Extortion d \u0003CVE-2024- VE-2023-468|||||||\n|||||||||||||||\n|||||||||||||||\n|||||||||||||||\n|||||||||ansomware Operations 21887 in Ivan 05 and CVE-||||||\n|||||||||||||||\n||||||||||ti Products 2024-21887|||||\n|||||||||||||||\n|||||||||||||||\n\n\nIndustries Affected\n\nManufacturing\n\nLegal & Professional Services\n\n\nFinancial Services\n\nHealthcare\n\nTechnology\n\n\nMedia & Entertainment\n\nChemicals & Materials\nEducation\n\nEnergy & Utilities\n\n\nRetail\n\nInsurance\n\nPharmaceuticals\n\nTelecommunications\n\n\nAutomotive\n\nCivil Society & Non-Profits\n\nConstruction & Engineering\n\nGovernment\n\n\nOil & Gas\n\nTransportation\n\nOther\n\n\n-----\n\n###### Regional\n    Trends\n Americas\n\n\n###### Detection by Source—\n Americas, 2023\n\n\nThe metrics reported in this section are based on Mandiant Consulting investigations\naffecting organizations that are located in North, Central, or South America.\n\n###### Detection by Source\n\n\n###### 43[%]\n\n\n###### 6[%]\n\n\n**Non-**\n**Ransomware,**\n**Internal**\n\n**Ransomware,**\n**Internal**\n\n\n###### 17[%]\n\n 34[%]\n\n\n**Ransomware,**\n**External**\n\n**Non-**\n**Ransomware,**\n**External**\n\n\nIn the Americas in 2023, 51% of organizations first learned of a compromise from an\nexternal source, while 49% identified evidence of a compromise internally. This split\nappears to be consistent with a long-term global trend toward a balance of internal versus\nexternal discovery. This is also consistent with observations in the Americas from 2022,\ncontinuing a trend toward higher rates of external notifications overall compared to\n2017–2021. Growth in ransomware-related intrusions over the last four years has likely\ncontributed to this shift in notification source.\n\nIsolating ransomware-related intrusions from all other compromises exposes a strong\ndivergence in notification sources in ransomware versus non-ransomware-related\nintrusions. Approximately two thirds of ransomware-related intrusions in the Americas\nwere externally notified—most frequently by the attackers themselves in the form of a\nransom note. In contrast, organizations in the region first discovered evidence of a\ncompromise internally in slightly more than half of cases that were not related to\nransomware encryption events.\n\n\n###### Detection by Source—Americas, 2017-2023\n\n100\n\n\n0\n\n20\n\n\n80\n\n60\n\n\n40\n\n60\n\n\n40\n\n20\n\n\n0\n\n\n80\n\n100\n\n\n2017 2018 2019 2020 2021 2022 2023\n\nAmericas Average Trend\n\n\n-----\n\n**Dwell time** is calculated\nas the number of days an\nattacker is present in a\ntarget environment before\nthey are detected. The\nmedian represents a value\nat the midpoint of a dataset\nsorted by magnitude.\n\n**Change in Americas Median**\n**Dwell Time**\n\n\n###### Americas Median Dwell Time\n\nIn 2023, organizations located in the Americas detected intrusions at the same pace as\nin 2022. Median dwell time in the Americas was 10 days. External parties notified these\norganizations of intrusions in 13 days, compared to 12 days in 2022. However, when\nintrusions were detected internally, organizations uncovered malicious activity in eight\ndays in 2023 compared to nine days in the previous year.\n\n\n###### 10days in 2022 10days in 2023\n\n Americas Median Dwell Time, 2016-2023\n\n\n160\n\n140\n\n\n###### 137.5\n\n\nAll\n\n\n120\n\n100\n\n\n80\n\n60\n\n\n40\n\n20\n\n\n0\n\n2016 2017 2018 2019 2020 2021 2022 2023\n\n\n-----\n\n2021\n\n2022\n\n2023\n\n\n###### Dwell Time Distribution\n\nOrganizations in the Americas region continue to improve their detection capabilities.\nOrganizations detected 45% of intrusions in one week or less, a rate that is similar to that\nseen in 2022. In 68.5% of investigations conducted by Mandiant, defenders were made\naware of intrusions in 30 days or less, a four percentage-point increase in investigations\ncompared to 2022.\n\nConsistent with trends seen globally, organizations continue to identify intrusions that had\nremained undetected for longer periods of time. Organizations located in the Americas\nregion saw a small increase in intrusions detected in five years or less and a decrease in\nintrusions that were undetected for more than five years.\n\n###### Americas Dwell Time Distribution, 2021-2023\n\n 38.8% 18.0% 28.2% 11.1% 3.6% 0.4%\n 44.5% 19.4% 26.2% 4.5% 2.6% 2.8%\n\n 45.0% 23.5% 22.3% 4.8% 4.2% 0.3%\n\n1 week or less 30 days or less 6 months or less 1 year or less 5 years or less 5 years or more\n\n\n-----\n\n**Change in Americas Investigations**\n**Involving Ransomware**\n\n###### % %\n 22in 2022 23in 2023\n\n**Change in Americas Median Dwell**\n**Time—Ransomware**\n\ndays in 20225 days in 20236\n\n\n###### Investigations Involving Ransomware\n\nOrganizations located in the Americas detected overall intrusions related to ransomware in\nsix days compared to five days seen in the previous M-Trends reporting period. This could\nbe explained by the slight increase in investigations involving ransomware, or it could be\na slight variation in the ransomware attackers’ ability to conduct operations. In intrusions\nrelated to ransomware, targeted organizations detected malicious activity internally in\nseven days, compared to six days when an external party made organizations aware of\nan intrusion.\n\n\n**Change in Americas Median Dwell**\n**Time—Non-Ransomware**\n\ndays in 202212 days in 202312\n\n###### Americas Median Dwell Time by Detection Source\n\n\nIn intrusions that did not involve ransomware, internal detection remained the fastest\nway for organizations to be notified of an intrusion, with a dwell time of eight days. When\nthey did not detect an intrusion internally, organizations in the Americas were notified of\nintrusions within a median of 19 days by an external party.\n\n###### Americas Dwell Time by Investigation Type, 2023\n\n\n20\n\n30\n\n\n###### 0\n\n10\n\n\n40\n\n50\n\n|Col1|7 6 8|Col3|Col4|19|Col6|\n|---|---|---|---|---|---|\n\n\n0 5 10 15 20 25\n\n\n60\n\n70\n\n\nDwell Time (Days)\n\nInternal Detection\n\nExternal Detection\n\n\n80\n\n\n7 Days\n\n7 Days\n\nMedian Days10 Median Days6 7 Days Median Days12 14\n\n14\n\n14 30\n\n30\n\n30\n\n90\n\n90\n\n150\n\n150 200\n200\n\n90 400\n\n400\n400\n700 700\n\nAll Ransomware Non-Ransomware\nInvestigations Investigations Investigations\n\n\n90\n\n100\n\n\n-----\n\n###### Targeted Attacks\n\nOrganizations in the Americas faced threats similar to those experienced by organizations\n\n\nOrganizations in the Americas faced threats similar to those experienced by organizations\nacross the globe. In 41% of intrusions that had an initial infection vector identified, an\nexploit was the source of attacker activity in the region. Phishing was used as an initial\nvector in 18% of intrusions. Rounding out the top three, attackers leveraged prior\n\n\nvector in 18% of intrusions. Rounding out the top three, attackers leveraged prior\n\n\ncompromised access gained from another threat group or malware in 14% of intrusions.\n\n\ncompromised access gained from another threat group or malware in 14% of intrusions.\n\n\n**Prior Compromise**\n###### 14[%]\n\n\n###### Initial Infection Vector\n\n\nOrganizations in the Americas faced threats similar to those experienced by organizations\nacross the globe. In 41% of intrusions that had an initial infection vector identified, an\nexploit was the source of attacker activity in the region. Phishing was used as an initial\nvector in 18% of intrusions. Rounding out the top three, attackers leveraged prior\ncompromised access gained from another threat group or malware in 14% of intrusions.\n\n###### Threat Groups\n\n Prevalent Threat Group Targeting Americas\n\nThe most frequently observed attacker in the Americas in 2023 was FIN11, a financially\nmotivated threat group. The majority of FIN11 intrusions Mandiant investigated were\nrelated to the widespread campaign exploiting CVE-2023-34362 in the MOVEit Transfer\nsecure managed file transfer (MFT) software.[21 ]Mandiant also investigated intrusions in\nwhich FIN11 exploited CVE-2023-0669 in GoAnywhere MFT. Although FIN11 has deployed\nthe CLOP ransomware in the past, in these campaigns the attacker focused on data theft\nextortion with no ransomware encryption. Counts of listings from the CL0P^_- LEAKS DLS\ncorroborate Mandiant’s investigative findings and demonstrate the scale FIN11 was able to\nachieve through these focused vulnerability exploitation campaigns.\n\n\nexploit was the source of attacker activity in the region. Phishing was used as an initial\n\ncompromised access gained from another threat group or malware in 14% of intrusions.\n\n\n###### Listings Posted to CL0P^_- LEAKS DLS, 2023\n\n200 CVE-2023-34362 disclosed\n\n\n150\n\n100\n\n\n50\n\n0\n\n|Col1|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|CVE-2023-34362 disclosed MOVEit Transfer secure MFT||CVE-2023-34362 disclosed MOVEit Transfer secure MFT|||\n|CVE-2023-0669 disclosed GoAnywhere MFT|||||\n||||||\n||||||\n\n\nJan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec\n\n\n-----\n\n###### JAPAC\n\n\nThe metrics reported in this section are based on Mandiant Consulting investigations\naffecting organizations in Japan and Asia Pacific (JAPAC).\n\n###### Detection by Source—\n JAPAC, 2023 Detection by Source\n\n\n###### 24[%]\n\n\nFor intrusions in the JAPAC region in 2023, organizations were notified of compromises\nfrom external sources in 69% of cases, while 31% of intrusions were discovered internally.\nThis continues a long-term trend in JAPAC of internal detections representing a declining\nproportion of overall notification sources.\n\nIn line with global numbers, organizations located in JAPAC were notified more often\nof intrusions via external notifications. In 2023 in JAPAC, organizations learned of\nransomware-related infections from external sources in three forths of cases.\n\n\n###### 7[%]\n\n 26[%]\n\n\n**Non-**\n**Ransomware,**\n**Internal**\n\n**Ransomware,**\n**Internal**\n\n\n###### Detection by Source—JAPAC, 2017-2023\n\n100\n\n\n40\n\n20\n\n\n0\n\n20\n\n\n80\n\n60\n\n\n40\n\n60\n\n\n###### 43[%]\n\n\n**Ransomware,**\n**External**\n\n**Non-**\n**Ransomware,**\n**External**\n\n\n0\n\n\n80\n\n100\n\n\n2017 2018 2019 2020 2021 2022 2023\n\nJAPAC Internal Average Trend\n\n\n-----\n\n**Change in JAPAC Median**\n**Dwell Time**\n\n###### 33days in 2022 days in 20239\n\n\n###### JAPAC Median Dwell Time\n\nOrganizations in the JAPAC region continued to detect intrusions more quickly year over\nyear. This was true for both notification sources. Median dwell time in JAPAC achieved its\nquickest time of nine days from initial infection to detection, compared to 33 days in 2022.\nOrganizations identified an intrusion internally in six days in JAPAC, compared to 19 days\nseen in 2022. Organizations received external notifications of malicious activity in nine\ndays, just over one week, compared to nearly two months in 2022.\n\n\n###### JAPAC Median Dwell Time, 2016-2023\n\n\n1100\n\n1000\n\n500\n\n450\n\n400\n\n350\n\n300\n\n250\n\n200\n\n150\n\n100\n\n50\n\n0\n\n\n**1088**\n\nAll\n\n**498** External\n\nInternal\n\n###### EMEA\n\n**320.5**\n\n**262**\n\n**204**\n\n**172**\n\n**158**\n\n**131** **137**\n\n**76**\n\n**54** **58**\n**18** **33** **21** **16** **22** **33** **19** **9** **9**\n\n2016 2017 2018 2019 2020 2021 2022 2023\n\n|0|All|\n|---|---|\n||498 External|\n\n\n-----\n\n2021\n\n2022\n\n2023\n\n\n###### Dwell Time Distribution\n\nIn 2023, targeted attacker activity was detected in 48% of intrusions in JAPAC in one\nweek or less. Continuing with observations both globally and year over year in the region,\nthe number of intrusions detected sooner continues to increase, showing the resilience\nof defenders. Over the past three years, Mandiant has seen fewer intrusions remain\nundetected for longer periods of time in the JAPAC region.\n\n###### JAPAC Dwell Time Distribution, 2021-2023\n 36.4% 23.6% 20.0% 3.6% 3.6% 12.7%\n 37.7% 11.7% 21.6% 8.4% 16.7% 5.0%\n\n 48.1% 18.5% 20.4% 7.4% 5.6% 0.0%\n\n1 week or less 30 days or less 6 months or less 1 year or less 5 years or less 5 years or more\n\n\n-----\n\n**Change in JAPAC Investigations**\n**Involving Ransomware**\n\n###### % %\n 32in 2022 33in 2023\n\n**Change in JAPAC Median Dwell**\n**Time—Ransomware**\n\n\n###### Investigations Involving Ransomware\n\nJAPAC saw little movement in the volume of ransomware-related intrusions, with a\nsmall increase to 33% of investigations conducted in the region in 2023. However, dwell\ntime for ransomware-related intrusions declined to three days compared to 19 days in\n2022. This sharp decrease is likely a cause of the quick moving ransomware families\nused in intrusions over the years. Mandiant has observed ransomware-related intrusions\nbalance speed and thoroughness of compromise. Attackers who deploy ransomware want\nto move fast enough to reduce the chance of detection, but also be meticulous enough\nto ensure potential damage that is sufficient to increase the likelihood of maximum\nransom payment.\n\n\ndays in 202219 days in 20233\n\n**Change in JAPAC Dwell Time—**\n**Non-Ransomare**\n\n\nOrganizations detected non-ransomware-related intrusions quicker in 2023 in slightly\nmore than half the time observed in 2022. The median dwell time in the JAPAC region for\nnon-ransomware-related intrusions was 26 days in 2023. Organizations were notified of\nan intrusion in six days by an internal security product or team member. Externally,\nhowever, organizations were notified of an intrusion 37 days after the malicious activity\ninitially began.\n\n###### JAPAC Dwell Time by Investigation Type, 2023\n\n\n###### 60 26days in 2022 days in 2023\n\n JAPAC Median Dwell Time\n by Detection Source\n\n\n20\n\n30\n\n\n0\n\n10\n\n\n7 Days\n\n\n40\n\n50\n\n|2 6|Col2|11|3|7|Col6|Col7|\n|---|---|---|---|---|---|---|\n\n\n0 10 20 30 40 50 60\n\n\n60\n\n70\n\n\nDwell Time (Days)\n\nInternal Detection\n\nExternal Detection\n\n\n80\n\n\n90\n\n100\n\n\nAll Ransomware Non-Ransomware\nInvestigations Investigations Investigations\n\n\n-----\n\n**Phishing**\n###### 18[%]\n\n**Prior Compromise**\n###### 15[%]\n\n\n###### Targeted Attacks\n\n Initial Infection Vector\n\nMandiant investigators identified that organizations in JAPAC were impacted by exploits\nin 39% of investigations when an initial infection vector was identified. In nearly a fifth\n(18%) of investigations, attackers leveraged brute-force techniques to gain initial access\nin the region. Rounding out the top three most seen initial infection vectors in the region\nwas the use of access obtained by a prior compromise. In 15% of intrusions, Mandiant\ninvestigators identified evidence that an attacker leveraged access originally obtained by\nanother attacker through either purchased access or by leveraging unsecured backdoor\naccess. The increase in prior compromise usage is likely representative of the inner\nworkings of the criminal ransomware ecosystem.\n\n###### Threat Groups\n\n Prevalent Threat Group Targeting JAPAC\n\nIn the Japan and Asia Pacific region in 2023, Mandiant investigators most often\nencountered suspected Chinese cyber espionage cluster UNC4841.\n\nBeginning in at least October 2022, UNC4841 exploited a zero-day vulnerability, CVE-20232868, in Barracuda Email Security Gateway (ESG) appliances in a campaign targeting\npublic and private organizations worldwide.[22] In several cases, Mandiant observed\nevidence of UNC4841 searching for and exfiltrating data relevant to Chinese political or\nstrategic interests. In the set of entities that UNC4841 selected for focused data theft,\nMandiant uncovered shell scripts that targeted email domains and users from Ministries\nof Foreign Affairs of ASEAN member nations as well as individuals within foreign trade\noffices and academic research organizations in Taiwan and Hong Kong.\n\nIn this campaign, UNC4841 took a number of steps to disguise its activity. For example,\nit inserted malware in or used the names of legitimate Barracuda modules and phishing\nmessages that were designed to be intercepted by spam filters and avoid further\ninvestigation by security teams. Notably, after the initial vulnerability disclosure and\nremediation efforts, UNC4841 responded aggressively, rapidly altering its malware,\ndeploying additional persistence mechanisms, and moving laterally to maintain access to\ntarget environments. Further analysis on this can be found in Attacker Operations Involving\nZero-Days Vary Depending on Motivation.\n\n\n-----\n\n###### EMEA\n\nThe metrics reported in this section are based on Mandiant Consulting investigations\naffecting organizations in Europe, the Middle East, and Africa (EMEA).\n\n\n###### Detection by Source—\n EMEA, 2023\n\n\n###### 32[%]\n\n\n###### Detection by Source\n\nIn cases Mandiant investigated in 2023 in EMEA, organizations first discovered evidence\nof a compromise internally 46% of the time, while organizations were externally notified\nof compromises in 54% of intrusions. This split matches global numbers for 2023 and\nreverses a long-term trend toward declining rates of internal notifications for the region.\n\n\nOrganizations in EMEA identified ransomware-related intrusions internally slightly more\nfrequently than through external notifications such as a ransom note. The majority of nonransomware-related intrusions were identified by external security partners.\n\n###### Detection by Source—EMEA, 2017-2023\n\n\n###### 13[%] 9[%]\n\n 46[%]\n\n\n**Non-**\n**Ransomware,**\n**Internal**\n\n**Ransomware,**\n**Internal**\n\n**Ransomware,**\n**External**\n\n\n100\n\n80\n\n\n0\n\n20\n\n\n60\n\n\n40\n\n60\n\n\n**Non-**\n**Ransomware,**\n**External**\n\n\n40\n\n20\n\n\n0\n\n\n80\n\n100\n\n\n2017 2018 2019 2020 2021 2022 2023\n\nEMEA Internal Average Trend\n\n\n-----\n\n**Change in EMEA Median Dwell Time**\n\n###### 20 22days in 2022 days in 2023\n\n\n###### EMEA Median Dwell Time\n\nOrganizations in EMEA detected intrusions in 22 days in 2023 compared to 20 days in\n2022. Dwell time for intrusions detected externally decreased to just under two weeks, at\n12 days in 2023 compared to 18 seen in 2022. Organizations detected intrusions internally\nin 23 days in 2023 compared to 33 days in 2022.\n\nOver the years, dwell time has varied across detection sources in EMEA. The general trend\nshows that median dwell time continues to decrease year over year, with median dwell\ntime in 2022 resulting in the shortest time period seen in the region. The small variation\nseen in 2023 could be the result of regional data normalizing, following the notable portion\nof Mandiant’s work in Ukraine in 2022.\n\n\n###### EMEA Median Dwell Time, 2016-2023\n\n\n500\n\n450\n\n400\n\n350\n\n300\n\n250\n\n200\n\n150\n\n100\n\n50\n\n\n###### 474\n\n\nAll\n\nExternal\n\n\n###### 225\n\n\nInternal\n\n###### 48 [60] 29 13 20 18 33 22 12 23\n\n\n###### 301\n\n 61 54 66 23\n\n\n###### 175\n\n\n###### 305\n\n 24.5\n\n\n###### 177\n\n\n###### 106 [128]\n\n\n###### 83\n\n\n0\n\n\n2016 2017 2018 2019 2020 2021 2022\n\n\n2023\n\n\n-----\n\n2021\n\n2022\n\n2023\n\n\n###### Dwell Time Distribution\n\nThis year in EMEA, organizations saw intrusions go undetected for longer periods of time\ncompared to previous years, with 14% of investigations conducted in the region remaining\nundetected for up to five years. However, in 2023, organizations saw less than 1% of\ninvestigations go undetected for more than five years.\n\n###### EMEA Dwell Time Distribution, 2021-2023\n\n 33.0% 14.0% 22.0% 12.0% 14.0% 6.0%\n 41.6% 12.2% 17.7% 10.2% 11.5% 7.0%\n\n 35.9% 20.5% 23.1% 6.4% 14.1% 0.0%\n\n1 week or less 30 days or less 6 months or less 1 year or less 5 years or less 5 years or more\n\n\n-----\n\n**Change in EMEA Investigations**\n**Involving Ransomware**\n\n###### % %\n 7in 2022 22in 2023\n\n\nThe median dwell time for ransomware-related intrusions decreased in the region.\nRansomware intrusions were detected in little more than one week, with eight days\ncompared to 33 days in 2022. Internal detection of ransomware intrusions in EMEA took 3\ndays, compared to 20 days for external notifications.\n\nIntrusions not related to ransomware were detected in 31 days in 2023, compared to 19\ndays in 2022. Non-ransomware-related intrusions remain undetected for longer periods of\ntime if they are detected by an internal source.\n\n###### EMEA Dwell Time by Investigation Type, 2023y g yp\n\n\n###### Investigations Involving Ransomware\n\nOrganizations working with Mandiant in EMEA saw ransomware-related intrusions return\nto a volume previously seen in 2021. Nearly a quarter of the investigations conducted in\nthe region were ransomware-related, 22% in 2023 compared to 7% in 2022.\n\n\n**Change in EMEA Median Dwell**\n**Time—Ransomware**\n\n###### 33days in 2022 days in 20238\n\n\n**Change in EMEA Dwell Time—**\n**Non-Ransomare**\n\ndays in 202219 days in 202331\n\n\n0\n\n10\n\n\n7 Days\n\n\n###### EMEA Median Dwell Time\n by Detection Source\n\n 3\n\n 20\n\n 50\n\n 10\n\n0 10 20 30 40 50 60\n\n\n20\n\n30\n\n\n60\n\n70\n\n\n40\n\n50\n\n|3|10|20|Col4|Col5|50|Col7|\n|---|---|---|---|---|---|---|\n\n\nDwell Time (Days)\n\n\n80\n\n\n90\n\n100\n\n\nAll Ransomware Non-Ransomware\nInvestigations Investigations Investigations\n\n\n-----\n\n###### Targeted Attacks\n\n Initial Infection Vector\n\nIn EMEA, Mandiant investigators noted intrusions began with an exploit in 36% of\nintrusions when an initial infection vector was identified. Organizations in EMEA also faced\nattackers abusing prior access in 21% of intrusions and phishing in 16% of intrusions.\n\n###### Threat Groups\n\n Prevalent Threat Group Targeting EMEA\n\nMandiant investigated a variety of intrusions in EMEA in 2023, including compromises\nattributed to UNC4393. UNC4393 is a financially motivated threat cluster that has\nmonetized access by deploying BASTA ransomware. This cluster does not work alone\nbut rather relies on other attackers to obtain initial access into target environments.\nThroughout most of 2023, Mandiant found that UNC2500 and UNC2633 QAKBOT\ninfections consistently preceded UNC4393 activity in target environments. In August 2023,\nan international law enforcement effort disrupted the QAKBOT botnet,[23] which forced\nUNC2500 to shift to alternative malware payloads to continue operations. Starting in midSeptember 2023, Mandiant observed UNC2500 begin distributing DARKGATE payloads,\nwhich UNC4393 leveraged to ultimately deploy BASTA ransomware.\n\nMandiant regularly observes evidence that multiple attackers were involved in different\nstages of a compromise, and prior compromise was the third most common initial access\nvector for 2023 Mandiant incident responses. The complexity of multi-attacker intrusions\nand the speed with which attacker tactics, techniques, and procedures (TTPs) evolve\nunderscores the importance of implementing defense-in-depth strategies to minimize the\nimpact of an attacker gaining a foothold in an environment.\n\n\n###### Targeted Attacks\n\n Initial Infection Vector\n\nIn EMEA, Mandiant investigators noted intrusions began with an exploit in 36% of\n\n###### EMEA\n\n**Exploit**\n###### 37[%] Threat Groups\n\n**Prior**\n**Compromise**\n###### 21[%] Prevalent Threat Group Targeting EMEA\n\n**Phishing**\n###### 16[%]\n\n\n-----\n\n###### MITRE\n\n Techniques Related to\n ATT&CK\n Mandiant Targeted\n\n**Mandiant’s Targeted Attack Lifecycle is the**\npredictable sequence of events cyber attackers use\n\n###### Attack Lifecycle, 2023\n\nto carry out their attacks.\n\n###### Initial Reconnaissance\n Reconnaissance\n\nT1595: Active Scanning 1.1% T1595.001: Scanning IP Blocks 0.6%\n\nT1595.002: Vulnerability Scanning 0.6%\n\n###### Resource Development\n\nT1608: Stage Capabilities 12.8% T1608.003: Install Digital Certificate 6.6%\n\nT1608.005: Link Target 2.6%\n\nT1608.001: Upload Malware 2.1%\n\nT1608.002: Upload Tool 0.9%\n\nT1608.006: SEO Poisoning 0.9%\n\nT1583: Acquire Infrastructure 5.4% T1583.003: Virtual Private Server 5.4%\n\nT1584: Compromise Infrastructure 3.2%\n\nT1587: Develop Capabilities 2.3% T1587.002: Code Signing Certificates 1.3%\n\nT1587.003: Digital Certificates 0.9%\n\nT1588: Obtain Capabilities 1.5% T1588.004: Digital Certificates 1.1%\n\nT1588.003: Code Signing Certificates 0.4%\n\nT1585: Establish Accounts 0.2% T1585.002: Email Accounts 0.2%\n\n###### Initial Compromise\n Initial Access\n\n\nT1199: Trusted Relationship 0.8%\n\nT1091: Replication Through Removable Media 0.6%\n\nT1200: Hardware Additions 0.2%\n\n\n-----\n\n###### Establish Foothold\n Persistence\n\n\nT1552.004: Private Keys 1.7%\n\nT1552.001: Credentials In Files 1.3%\n\nT1552.003: Bash History 0.9%\n\nT1552.006: Group Policy Preferences 0.8%\n\nT1555.005: Password Managers 0.8%\n\n\nT1056: Input Capture 8.1% T1056.001: Keylogging 7.5%\n\n\nT1056.002: GUI Input Capture 0.6%\n\nT1056 003: Web Portal Capture 0 2%\n\n\n-----\n\n-----\n\n###### Escalate Privileges\n Privilege Escalation\n\n\n-----\n\n###### Internal Reconnaissance\n Discovery\n\n\n-----\n\n-----\n\n###### Lateral Movement Lateral Movement\n\n\n-----\n\n###### Maintain Presence\n Persistence\n\n\n-----\n\nT1037: Boot or Logon Initialization Scripts 0.9% T1037.004: RC Scripts 0.6%\n\nT1006: Direct Volume Access 0.8%\n\nT1553: Subvert Trust Controls 0.8% T1553.002: Code Signing 0.6%\n\nT1553.005: Mark-of-the-Web Bypass 0.2%\n\nT1578: Modify Cloud Compute Infrastructure 0.6% T1578.002: Create Cloud Instance 0.6%\n\nT1578.005: Modify Cloud Compute Configurations 0.2%\n\nT1207: Rogue Domain Controller 0.4%\n\nT1014: Rootkit 0.4%\n\nT1480: Execution Guardrails 0.2%\n\nT1601: Modify System Image 0.2% T1601.001: Patch System Image 0.2%\n\nT1647: Plist File Modification 0.2%\n\nT1127: Trusted Developer Utilities Proxy Execution 0.2% T1127.001: MSBuild 0.2%\n\nT1220: XSL Script Processing 0.2%\n\n\n-----\n\n###### Mission Completion\n Collection\n\n\n-----\n\n###### Impact\n\n\n-----\n\n###### Articles\n\n\n-----\n\n###### Chinese Espionage Operations\n Targeting The Visibility Gap\n\nEndpoint detection and response (EDR) platforms have become commonplace among companies seeking to expand the visibility\ninto endpoint activity necessary to provide a baseline of security monitoring. This increase in visibility has forced attackers to\nevolve in order to maintain operational efficacy. While some attackers have invested in EDR bypass techniques, others have,\ninstead, chosen to focus on areas of the corporate environment where in-depth visibility remains uncommon. While EDR agents\nhave become a standard part of security deployments, many specialized appliances that either segment or host assets critical to\nthe organization often lack similar levels of visibility. These systems have become a new preferred safe haven for attackers as it\nenables them to maintain long-term persistence with lower risk of detection due to the gap in visibility.\n\nCommon examples of devices that rarely support EDR deployment are firewalls, email filtering products, virtualization platforms,\nand virtual private network (VPN) solutions. To further complicate matters, the platforms on which these appliances are built\nmay be proprietary or otherwise locked down, such that forensic analysis efforts are hindered. Exploits for these devices are\nexceedingly valuable to attackers, primarily because they typically require no user interaction to succeed, which helps to minimize\nthe chance of detection. If an attacker possesses an exploit for a zero-day vulnerability on these devices, they are often able to\n\n\n**Zero-day: Vulnerabilities**\ndisclosed before patches are\nmade available.\n\n**N-day: Vulnerabilities first**\nexploited after patches were\nmade available.\n\n\ngain access to a target environment and remain undetected for an extended period of\ntime. Furthermore, the attacker can use the exploit to gain access to additional targets or\nreestablish access to the same target if it is disrupted.\n\nMandiant observed a range of attackers targeting devices that matched this profile in 2023.\nSandworm[24] continued to leverage access via compromised network edge infrastructure to\nenable their wartime operations in Ukraine. The financially motivated group FIN11[25] exploited\na zero-day in MOVEit Transfer software to steal data as part of their data theft extortion\noperations. In the past year alone, Mandiant has investigated several high-profile cases of\nsuspected Chinese espionage operations leveraging zero-day and n-day vulnerabilities to\ntarget systems where visibility has been difficult to instrument.\n\n\n###### Custom Malware for\n Edge Devices\n\nSecurity and networking devices that sit at the logical\nperimeter of a network and host services on the internet are\noften referred to as “edge devices.” Mandiant has observed\na trend in which China-nexus attackers have gained access\nto edge devices via exploitation of vulnerabilities, particularly\nzero-days, and subsequently deployed custom malware\necosystems. These malware ecosystems have typically\nconsisted of several distinct code families that attackers\noperate in unison, and are usually custom developed or tailored\nfor the target edge device and underlying operating system.\nDeveloping malware for these managed appliances is a nontrivial task. Vendors typically do not enable direct access to\nthe operating system or filesystem for appliance device\nowners or users. In order to operationalize attacks within this\nclass of platform, attackers must maintain a resource intensive\nmalware development lifecycle that, by necessity, maintains\nflexibility and a high degree of technical acumen. While this\nprocess requires a substantial investment, it also produces\nclear results when leveraged successfully by attackers.\n\n\n###### Remaining Undetected\n\nIn general, custom malware may go undetected for long\nperiods of time since there is unlikely to be specific detections\nin place for the malware. This is particularly true for edge\ndevices, where network defenders may have little to no means\nfor monitoring and detection of malware activity. Malware\nauthors may also take special care to ensure that the malware\nhinders forensic investigation by circumventing or clearing\nlogging systems in place on the device. Even after the malware\nhas been discovered and exposed by the security community,\nit is often a non-trivial task for a device owner to identify if\nthey have been impacted, since off-the-shelf security products\ntypically will not support edge devices. Furthermore, it is\nsometimes the case that exploitation attempts of zero-day\nvulnerabilities leave little or no reliable evidence behind.\nThis is often exacerbated by the fact that the attack may have\noccurred months or even years prior to detection. Additionally,\nthere are often challenges with traditional forensic techniques\nas these devices are typically kept under tight control by\nmanufacturers, adding to the already complex nature of\ninvestigating these types of compromises.\n\n\n-----\n\n###### Example: BOLDMOVE\n\nBOLDMOVE is a backdoor used by suspected Chinese\nespionage groups that has both Windows and Linux variants\ncontaining a core set of features. Mandiant identified a custom\nvariant of the Linux version of BOLDMOVE, which contained\nan extended set of features to remain undetected on Fortinet\ndevices. This variant of BOLDMOVE disabled the `miglogd` and\n`syslogd` logging daemons on the appliance, and contained\na command to patch memory address space for these\nlogging functions.These customizations of the BOLDMOVE\nbackdoor are suspected to have enabled the attacker to remain\nundetected for a longer period of time than they would have\notherwise been able to through traditional means.\n\n###### Reduced Complexity,\n Increased Reliability\n\nEdge devices such as email security gateway appliances and\nVPNs are typically high-availability devices that run for months\nor years at a time without being rebooted. As such, many of\nthese devices are put through rigorous testing regimes by the\nmanufacturer during development to ensure their stability.\nChina-nexus malware developers take advantage of the\nbuilt-in functionality included in these systems, which benefits\nthem in several ways. In general, leveraging native capabilities\nwill enable attackers to reduce the overall complexity of the\nmalware by instead weaponizing existing features within that\nhave been rigorously tested by the organization. For example,\nfor devices that use proprietary software components such\nas custom file formats or configuration files, attackers may\nbe able to leverage built-in functions to parse or process\nthese files rather than developing their own implementation.\nThis concept is analogous to living-off-the-land, and is\n\n\n###### Example: THINCRUST\n\nDuring an UNC3886 compromise, Mandiant discovered a\nbackdoor deployed to FortiAnalyzer and FortiManager devices\nnamed THINCRUST, which disguised its command and control\n(C2) communications as legitimate API calls to the devices.\nUNC3886, a suspected Chinese espionage group, appended the\nPython-based backdoor code into legitimate web framework\nfiles that were responsible for providing the API interface for\nthe appliance. This gave UNC3886 the ability to harness the\nnative API implementation to access and send commands to\nTHINCRUST by simply interacting with a new endpoint URL, which\nthey had added. By leveraging existing capabilities built into the\nappliance, UNC3886 was able to simplify their malware while\nmaintaining the reliability necessary for continued operations.\n\n###### Tailored Capabilities and\n Smaller Footprint\n\nCustom malware for edge devices may only include the\ncapabilities required to achieve the attacker’s mission\nobjectives. Malware used to exploit vulnerabilities may never be\nused again once the vulnerabilities are discovered and patched,\nas the cost to maintain and repurpose the code often outweighs\nthe benefits. By developing relatively simple malware that serves\nonly to provide the attackers with the desired functionality on\nthe target device, attackers are able to achieve their goals\nwhile minimizing their overall footprint. In the same vein, the\nrequirement for complex obfuscation is likely lessened since\nthe primary objective of the attacker is to remain undetected\nentirely, rather than hinder the analysis of the malware once it\nhas been discovered. By the time the malware is discovered, the\nvulnerability and campaign would have already been exposed,\nand the attacker’s operations typically come to a close.\n\n###### Example: TABLEFLIP\n\nAfter losing access to a FortiManager device during one\nincident due to access control lists change, UNC3886 adapted\nto the situation by deploying a network traffic redirection utility\nnamed TABLEFLIP. TABLEFLIP passively listens on all active\ninterfaces for specialized command packets that contain an\nXOR encoded IP address and port to redirect traffic to using\niptables commands. UNC3886 deployed TABLEFLIP alongside\nthe publicly available REPTILE rootkit to act as a reverse shell,\nand successfully gained access back to the FortiManager\ndevice. The ability to produce purpose-built malware in response\nto changes in an ongoing operation places defenders at a\ndisadvantage when facing capable and agile attackers with\nnation-state backing.\n\n\n**Living off the land: Attacker**\nuse of legitimate, pre-installed\ntools and software within a\ntarget environment, notably to\nevade detection.\n\n\nparticularly effective\non edge devices since\nthese native device\noperations are likely\nnot being monitored\nby network defenders\nand, as such, may\ngo unnoticed.\n\n\n-----\n\n**Activity after internet access restrictions implemented**\n**to FortiManager**\n\n\nAttacker\n\n|1|Col2|\n|---|---|\n\n\nAttacker interacted with\nTABLEFLIP to implement\nIptables traffic redirection\nrules to REPTILE port\n\n|4|Col2|\n|---|---|\n\n\nFirewall\n\n\nAttacker was unable\nto connect directly to\nFortiManager from\ninternet due to newly\nimplemented restrictions\n\nAttacker interacted\nwith THINCRUST on the\nFortiManager via\nCASTLETAP on a\ncompromised FortiGate\n\nAttacker installed TABLEFLIP\ntraffic redirection tool and\nREPTILE backdoor on\nFortiManager to bypass\ninternet access restrictions\n\n\nFortiManager\n\n\n###### Attribution Challenges\n\nCustom malware developed for edge devices may stifle\nattribution for cyber threat intelligence analysts. These\nmalware families, and potentially the entire ecosystem,\ncould be almost entirely unique when compared to existing\nmalware because of the target operating system and tailored\ncapabilities. As such, they may not contain code or other\noverlaps analysts traditionally find between related malware\nfamilies that contribute to the technical attribution analysis.\n\n###### Example: SEASPRAY and WHIRLPOOL\n\nSEASPRAY is a launcher written in Lua that UNC4841 injected\ninto legitimate Barracuda Email Security Gateway (ESG)\nmodules. SEASPRAY registers an event handler for incoming\nemails, and launches an external binary, which Mandiant\ntracks as WHIRLPOOL, when certain markers are present.\nWHIRLPOOL is a simple TLS reverse shell utility that receives\na C2 IP address and port to connect to from SEASPRAY\nat runtime. Because SEASPRAY was a relatively simple\nimplementation that consisted of a few lines of code that\nwere specific to the Barracuda ESG appliances, it did not offer\nmuch value in terms of attribution. Similarly, WHIRLPOOL was\na simple and generic TLS reverse shell that did not contain\nany embedded C2 server information that could be analyzed.\nUsage of such malware on edge devices presented significant\nchallenges for analysts performing attribution analysis.\n\n\n###### In-Depth Knowledge of Edge Devices\n\nMandiant has observed several instances where China-nexus\nattackers demonstrated a high level of in-depth knowledge when\ntargeting edge devices. The degree of knowledge spanned not\nonly the malware used during the attack, but also the zero-day\nvulnerabilities used to gain access to these devices.\n\n###### Example: DEPTHCHARGE\n\nDEPTHCHARGE is a passive backdoor that Mandiant observed\nUNC4841 begin to deploy about one week after Barracuda’s\ninitial public notification of the ESG zero-day campaign.\nThis was followed by more rapid deployment to what\nMandiant assessed were high-value targets, once Barracuda\nannounced plans to replace affected devices. The timing of\nthe accelerated deployment suggests that UNC4841 may have\nanticipated this, and was prepared for remediation efforts\nwith tooling and tactics, techniques and procedures (TTPs)\ndesigned to enable them to continue operations in the face of\nattempts to disrupt their access to target networks.\n\nSeveral aspects of DEPTHCHARGE and its execution chain\ndemonstrated an intimate knowledge of the Barracuda\nESG device and its software components. Most notable\nwas that the attacker had identified a method for malware\npersistence inside the configuration database for the\nappliance, which would result in it being present in exported\nbackup configurations. This meant that device owners looking\nto set up a clean device would unknowingly export backup\nconfigurations containing DEPTHCHARGE persistence, and\nin-turn infect their clean appliances when attempting to\nrestore their configuration.\n\nPerhaps an even more intricate display of UNC4841’s\nknowledge of the inner workings of the appliance was the\nmethod through which DEPTHCHARGE achieved command\nexecution from a trigger inside the MySQL configuration\ndatabase after it had been imported. UNC4841 understood\nthat completely separate components of the ESG’s codebase\naccessed files using the two-argument form of Perl’s open()\nfunction, and that they could craft a special filename that\nwould result in commands being executed on the appliance.\nBy having the MySQL trigger drop a file that induces this\ncommand execution, UNC4841 was able to chain these\ntechniques together to have DEPTHCHARGE dropped and\nexecuted upon import of a backup configuration on a new\nappliance. This effectively enabled UNC4841 to survive\nthrough a complete device replacement in the small number\nof cases where this occurred.\n\n\n-----\n\nESG\nConfiguration\nDatabase\n\n\nOther\ncomponents of\nthe Barracuda\nESG codebase\n\n\n###### Custom Malware for Hypervisors\n\nAs cloud computing has grown in popularity over the years,\nhypervisors have subsequently become commonplace\nwithin modern infrastructures. However, while instrumenting\nendpoint visibility on the guest virtual machines is relatively\neasy, instrumenting visibility on the hypervisor itself can\npresent substantial challenges. As with network edge devices,\nType 1 hypervisors commonly run on operating systems\nversions that are rarely supported by EDR vendors. Not\nsurprisingly, given the low visibility yet excessively high target\nvalue of a hypervisor, Mandiant has observed China-nexus\nattackers targeting hypervisors as well.\n\nHypervisor technologies, such as VMware’s ESXi, use Virtual\nMachine Communication Interface (VMCI) sockets to facilitate\ncommunication between the bare-metal host and the guest\noperating systems. Mandiant has observed attackers leverage\nVMCI sockets for lateral movement and continued persistence\nwithin targeted environments. UNC3886 utilized backdoors\nsuch as VIRTUALPITA, and took advantage of VMCI-based\nchannels to communicate from the ESXi host to the guest\nvirtual machines (VM). Since the traffic over the virtualized\nlayer is localized to the bare metal machine, there are no\nsecurity mechanisms restricting any guest VM or ESXi host\nfrom initiating a connection with the other, essentially\nbypassing any network segmentation. Additionally, traffic\ncannot be monitored outside of the guest VMs and ESXi\n\n\nPeriodically Installs\n\nCreates Persistence\n\nLauncher Script Persistence\n/etc/barracuda/ Executes Script\nsystemctl/ /usr64/share/\nS92badlocks_ gdb/syscalls/\nnotify l686-linux.xml\n\nhosts present in the virtualized environment. While the client/\nserver communication socket has connection-oriented and\nconnectionless variants very similar to TCP and UDP, it is\ninvisible to commonly used networking tools such as tcpdump,\nnetstat, nmap, and Wireshark without custom configurations,\nas it belongs to a different socket address family.\n\nUNC3886 used a novel persistence technique to deploy the\nVIRTUALPITA backdoor using vSphere Installation Bundles\n(“VIBs”). Mandiant had not previously observed this technique\nfor deploying malware or persistence, which suggests\nUNC3886 spent significant resources to understand the\ninner workings of VMware technologies, especially the VMCI\nsockets for circumventing security restrictions. Furthermore,\nVIRTUALPITA was used to pass arbitrary commands to guest\nVMs without being logged on the host. These commands then\nget executed on the guest VM with the vmtoolsd.exe process\nwhere they are then observed in the Windows event logs.\nVIRTUALPITA also sets the HISTFILE to 0, which would remove\nany terminal history on the host system, leaving behind little\nforensics evidence.\n\nESXi Hypervisors vmtoolsd.exe\n\n\nVIRTUALPITA\nand VIRTUALPIE\nsamples listening\nfor inbound\nconnections\n\n\nCommand Execution\n\n\n###### VISUALIZATION LAYER\n\n\nGuest machines\nrunning under\nEXSi Hypervisors\n\n\nFile Transfer\n\n\n-----\n\n###### Recommendations\n\nThe most critical strategy for protecting against such attacks\nis maintaining proper patch management to mitigate the risk\nof exploitation of known vulnerabilities. Applying the most\nrecent patch is the best way to limit any unexpected tampering\nor modification of the appliance. For zero-day vulnerabilities,\nwhere exploitation is unlikely to be detected, a defense-in-depth\napproach provides the best chances of surfacing evidence of\nthe malicious activity further in the attack lifecycle.\n\nIf an organization has identified that they were operating\nvulnerable devices and may have been compromised,\nMandiant recommends performing an investigation and\nhunting activities within their networks. An investigation\nmay include, but is not limited to, the following:\n\n**•** Scanning potentially impacted devices with publicly\n\navailable tools such as IOC scanners to identify evidence\nof compromise.\n\n**•** Sweeping the entire environment for known IOCs.\n\n**•** Reviewing network logs for signs of data theft and lateral\n\nmovement.\n\n**•** Reviewing network logs for abnormal logins or internal\n\ntraffic from edge devices.\n\n**•** Capturing a forensic image of the impacted appliance and\n\nconducting a forensic analysis.\n\n**•** Applying any malware signatures (e.g. YARA rules) to\n\nappliance images to assist forensic investigators.\n\nOrganizations should also consider implementation of security\ncontrols detailed in architecture hardening guidance provided\nby security vendors. Mandiant has previously provided such\ndocumentation for the Barracuda ESG event.[26]\n\n\n###### Outlook\n\nDespite the amount of resourcing required, Chinese espionage\ngroups are almost certainly going to continue investing in the\nacquisition of zero-day exploits and platform-specific tooling.\nMandiant expects that we will continue to see targeting of\nedge devices and platforms that traditionally lack EDR and\nother security solutions due to the challenges associated with\ndiscovery and investigation of compromise. Exploitation of\nthese devices will continue to be an attractive initial access\nvector for Chinese espionage groups to remain undetected and\nmaintain persistence into target environments.\n\nIt is also likely that we will continue to see the deployment\nof custom malware ecosystems by Chinese espionage\ngroups that are tailored for the device and operation at hand.\nThis approach provides several advantages such as the\nincreased ability to remain undetected, reduced complexity\nand increased reliability, and a reduced malware footprint.\nAdditionally, it presents challenges to technical attribution\nbeing performed by threat intelligence analysts.\n\nOrganizations must remain vigilant and ensure that they’re\nnot only monitoring their networks at the operating system\nlayer, but also continue to patch, maintain and, where possible,\nmonitor the appliances that are running the underlying\ninfrastructure of their networks.\n\n\n-----\n\n###### Attacker Operations Involving Zero-Days Vary Depending on Motivation\n\n\nIn the ever-evolving landscape of cybersecurity, zero-day exploits remain a potent weapon\nin the hands of attackers. These vulnerabilities, unknown to software vendors, can provide\nattackers with a stealthy means to gain unauthorized access to systems and sensitive data.\n\n\n**Zero-day: Vulnerabilities**\ndisclosed before patches\nare made available.\n\n\nIn 2023, we tracked a combined total of 97 unique zero-day vulnerabilities exploited in-the-wild,\nsurpassing the volume tracked in 2022 by nearly 56%. People’s Republic of China (PRC) cyber espionage groups were the most\nprolific attackers to exploit zero-days in 2023, and demonstrated a focus on stealth in their zero-day exploitation campaigns. The\nstate-sponsored groups tracked by Mandiant primarily utilize zero-days for intelligence gathering and strategic advantage.\n\n\nAnother consistent component of cyber espionage\nexploitation has been the rise of commercial commercial\nsurveillance vendors selling what are often turnkey or off-theshelf capabilities. In many instances, these vendors offer not\njust the technical expertise to build an exploit chain, but also\nthe subsequent tools necessary to identify and exfiltrate data\nfrom the targeted victim. The growth of these capabilities\nsuggests internal expertise is no longer required to exploit\nzero-day vulnerabilities. This expands the access to zeroday exploits for attackers, even if they lack the technical\nsophistication to conduct zero-day research.\n\nAt the same time, financially motivated attackers have\ncontinued to embrace zero-days, aiming to infiltrate systems\nand steal valuable data for financial gain. During 2023,\nfinancially motivated attackers and espionage groups appear\nto represent roughly the same proportion of total zerodays exploited as they had in the previous two years. FIN11,\na financially motivated group active since at least 2016,\nexploited two zero-days in 2023 in widespread campaigns.\nFIN11’s investment in developing zero-days demonstrates their\ncontinued sophistication. Zero-day vulnerability research is a\ntime and resource intensive process, and FIN11’s exploitation\nof multiple zero-day vulnerabilities indicates the group has\nconsistent access to both. Notably, FIN11 has frequently\ntargeted file transfer applications, which can provide quick\nand efficient access to large amounts of sensitive data\nwithout the need for lateral movement within a victim network.\n\nThe diverse motivations of attackers translate into distinct\napproaches to the utilization of zero-day exploits. Espionage\ngroups prioritizing stealth and long-term access may employ\nzero-days sparingly, and meticulously craft exploits to\nminimize detection. Financially motivated attackers, on the\nother hand, often prioritize speed and efficiency, potentially\nsacrificing stealth for quicker returns and wider exploitation.\n\n\nTwo case studies, derived from frontline Mandiant\nengagements, exemplify the varying behavior of attackers\nwhen driven by distinct objectives. The financially motivated\ncampaign that exploited Progress Software’s MOVEit Transfer\ndemonstrates the adaptability and speed of financially\nmotivated attackers. In contrast, the espionage-driven\ncampaign that targeted the Barracuda Email Security Gateway\n(ESG) highlights the persistence and sophistication of statesponsored groups. These case studies exemplify the varied\ntactics, techniques, and procedures (TTPs) of two groups\nthat have distinctly different objectives, but prosecute those\nobjectives with similar ingenuity and adaptability.\n\n###### Cybercrime Campaign Case Study: MOVEit\n\nIn May 2023, Mandiant observed the exploitation of CVE-202334362,[27] a zero-day vulnerability in Progress’s managed file\ntransfer solution MOVEit Transfer. This vulnerability, affecting\nall MOVEit Transfer versions prior to May 31, 2023, allowed\nattackers to gain unauthorized access to MOVEit Transfer’s\ndatabase, potentially leading to data breaches and financial\nlosses. To exploit CVE-2023-34362, the attacker had to send\na specially crafted request to a vulnerable server, which\ninjected malicious SQL statements into application queries on\nthe vulnerable systems. After gaining access to a vulnerable\napplication’s database, the attacker could perform additional\nactions to gain elevated privileges and execute arbitrary\ncode, including accessing, modifying or deleting data within\nthe database. Mandiant investigated 31 attacks related to\nthis vulnerability, providing valuable insights into the TTPs\nemployed by FIN11, to which we’ve attributed all exploitation.\nMandiant’s analysis revealed a pattern of automated attacks,\nduring which FIN11 appeared to focus on speed and efficiency\nof exploitation. FIN11’s approach to campaigns has evolved\nto become more sophisticated, and pose greater risks to\nt t d i ti\n\n\n-----\n\n###### FIN11’s Attack Campaign\n\nFIN11 emerged as the key player exploiting the MOVEit\nTransfer zero-day. Mandiant’s investigations revealed that\nFIN11 began testing the vulnerability as early as April 2022.\nHowever, public reporting indicates testing might have begun\neven earlier. Testing likely continued until a reliable exploit and\nmeans for data exfiltration was developed.\n\nBeginning in May 2023, FIN11’s attack methodology primarily\ninvolved the deployment of web-based backdoors, data\nenumeration, and data theft. Upon gaining initial access,\nFIN11 deployed a web-based backdoor, which Mandiant\ntracks as LEMURLOOT, on compromised systems. These\nbackdoors masqueraded as legitimate software components,\nand provided functionality for the enumeration and theft of\ndata. FIN11 executed commands through LEMURLOOT to\nenumerate files and folders, retrieve configuration information,\nand create or delete a user with a hard-coded name.\n\n###### Impact and Remediation\n\nNearly 2,600 organizations across various sectors and\nindustries were targeted by FIN11 during this campaign.\nThe scale of the attacks further indicates that FIN11 relied on\nautomated methods, as it would be impractical for them to\nengage in hands-on-keyboard intrusions on such a broad scale.\nBased on data posted on the FIN11 data leak site, FIN11 stole\nterabytes of potentially sensitive data during their campaign.\n\nMandiant did not identify evidence of lateral movement during\nany of the investigations related to FIN11’s use of the MOVEit\nTransfer vulnerability. It is likely that FIN11’s primary objective\nwas the immediate theft of data rather than establishing longterm persistence or compromising additional systems within\nthe target networks. Access to file transfer appliances likely\nprovided FIN11 with sufficient access to sensitive data they\ncould use to extort victims without needing to move laterally in\nthe network.\n\nRemediation efforts surrounding FIN11’s targeting of MOVEit\nTransfer appliances involved applying a sequence of patches\nreleased by Progress Software. Organizations were urged\nto prioritize patching and to implement robust cybersecurity\nmeasures to safeguard against similar attacks.\n\n###### Espionage Campaign Case Study: Barracuda\n\nPRC cyber espionage groups conducted multiple high-profile\nzero-day exploitation campaigns in 2023. One of the most\nnotable, and likely the most widespread, was a campaign\ntargeting Barracuda ESG appliances.[28] UNC4841, a cluster of\n\n\nChinese cyber espionage activity, targeted Barracuda ESGs\nthrough a remote command injection vulnerability (CVE-20232868), which was publicly disclosed in May 2023. However,\nMandiant investigations identified evidence of exploitation\ndating back to at least October 2022. UNC4841 exploited ESG\nappliances by taking advantage of a flaw in the parsing logic for\nprocessing of TAR files. By formatting TAR files in a particular\nway, UNC4841 was able to trigger a remote command injection\nattack that enabled them to execute system commands.\nUNC4841 carefully crafted their attack strategy, employing\nemails cleverly designed to appear as low quality spam, and\nincluding malicious TAR archive attachments. The filenames\nincluded in the TAR archive email attachments contained\nmalicious commands, which were leveraged to establish\na foothold on vulnerable appliances. After gaining access,\nUNC4841 deployed a wide range of second-stage backdoors\nspecifically tailored to Barracuda ESGs to establish long-term\naccess, enabling them to conduct their espionage activities\nundetected for more than eight months.\n\n###### Stealing Sensitive Data with Precision\n\nWith long-term access firmly established, UNC4841 focused\non quietly stealing sensitive data from targeted organizations.\nTheir tactics centered on harvesting email from the ESG’s\ntemporary mail storage component, which enabled them to\nconduct broad email collection on compromised appliances.\nUNC4841 also targeted email collection through shell scripts,\nwhich targeted specific email domains and users deemed to\nbe of strategic importance to China. Additionally, Mandiant\nobserved UNC4841 targeting email being sent to Barracuda\nappliances for collection as they may originate from sources\nof particular intelligence value. The staging file naming\nconventions utilized by UNC4841 throughout the campaign\nwere indicative of a large-scale espionage operation.\nUNC4841 primarily staged data in the /mail/tmp/ directory\nand utilized a consistent file naming convention containing\nthree letters corresponding to the victim organization followed\nby a number.\n\n###### Targeting Trends\n\nUNC4841’s targeting patterns evolved over the campaign,\nwhich lasted longer than eight months. While initially\nfocusing on government organizations, as the campaign\nprogressed, UNC4841 expanded their reach to include\norganizations in the information technology sector, as well\nas a wide range of others. After the public notification of the\nvulnerability, UNC4841 prioritized government agencies and\nhigh-tech organizations for deployment of specific malware\nfamilies. UNC4841 deployed a series of backdoors across\norganizations in the post notification period in order to\nmaintain access and continue operation.\n\n\n-----\n\n###### Mitigating the Threat\n\nOn May 31, 2023, Barracuda strongly advised organizations\nto replace all compromised ESGs immediately regardless\nof patch level. This incident underscores the importance\nof proactive cybersecurity measures, including prompt\nvulnerability patching, regular security audits, and continuous\nmonitoring of networks for attempted lateral movement or\n\n\nsuspicious activity stemming from edge appliances. While\ndefenders cannot anticipate a zero-day, these measures can\nhelp expose other security flaws that could allow an attacker\nto more easily move throughout a network or escalate\nprivileges. Limiting the damage and breadth of an attack from\nundisclosed vulnerabilities helps limit the risks organizations\nface as attackers evolve.\n\n\n###### A Comparative Analysis: Lessons Learned and the Evolving Threat Landscape\n\nThe campaigns targeting MOVEit Transfer and Barracuda ESG vulnerabilities highlight the evolving threat landscape, and the\nstark differences between how financially motivated and espionage-driven attackers operationalize the use of zero-day exploits.\nFIN11 prioritized a fast and efficient approach to its exploitation of MOVEit, targeting a large number of organizations for brief but\nefficient access to sensitive data.\n\n**Feature** **Financially Motivated** **Espionage**\n\nQuantity vs Quality of Victims Vastly more victims (reportedly over 2,600) Relatively few victims (~5% of vulnerable\nappliances)\n\nApproach to Weaponization \u0003of CVE Quick monetization Sustained intelligence gathering\n\n\nImpact Loss of PII, potential exposure of trade\nsecrets, impact on personal privacy and\nbusiness operations\n\nResponse/Containment Requires minimizing data exfiltration and\npreventing ransomware \u0003deployment\n\n\nImplications to national security, targeted\nattacks on government \u0003organizations\n\nRequires thorough understanding of the\ncompromise, attacker tactics, and malware\ndetection\n\n\nMeanwhile, UNC4841 exhibited a more meticulous and\ntargeted approach during its Barracuda ESG exploitation,\nseeking long-term, surreptitious access to sensitive data for\nintelligence purposes.\n\nThe means through which various attackers have historically\nacquired and leveraged zero-day exploits should inform the\ndecision-making and prioritization for organizations that may\nbecome future targets. While there is no reliable way to defend\nagainst zero-day exploits, organizations can mitigate risk\nby working to protect and segregate critical systems, while\nalso ensuring they have the visibility needed for continued\nmonitoring of suspicious activity.\n\nOrganizations traditionally prioritize patching by risk scores,\nwith a higher risk score often getting patched prior to\nthose with lower risk scores. However, evidence of active\nexploitation of a vulnerability should escalate patching\npriority,[29] and affected organizations should launch an\nimmediate investigation into impact.\n\n\nOrganizations that have an existing incident response plan\nand broad environmental monitoring are often better prepared\nto assess the potential impact of a vulnerability on their\nenvironment. Layering network segmentation and logging\nwith advanced endpoint detection and response solutions\nprovides organizations with an efficient means through which\ninvestigations can be started and brought to a swift close.\n\nSimilarly, thoroughly evaluating the security practices and\nnetwork requirements for vendors prior to deploying hardware\nor software into the environment allows defenders to build a\nquality baseline of what should be considered “normal” use.\nVendor vetting also allows for the creation of comprehensive\ndetection mechanisms as the definition of non-standard\nuse is clarified. Any detections for non-standard use within\nthe context of a vendor’s product should be prioritized and\ninvestigated to ensure the legitimacy of the actions on which\nthe detection fired. A blending of policy, threat intelligence,\nand active monitoring can act as an early warning system for\n\nk l i d l bili i\n\n\n-----\n\n###### Conclusion\n\nZero-day exploitation is no longer a niche capability accessible\nto only a handful of attackers, and Mandiant anticipates\nthat the growth we have seen across the last few years will\ncontinue. The rise of zero-day exploitation by ransomware\nand data theft extortion groups, continued state-sponsored\nexploitation, and the growth of turnkey or off-the-shelf\ncapabilities that can be purchased from commercial\ncommercial surveillance vendors will continue to drive the\nidentification of zero-day vulnerabilities and exploits that\ntarget them. By understanding the motivations and TTPs of\nattackers, organizations can build defensive strategies that\nprioritize the types of threats that are most likely to impact\ntheir environments. Strengthening cybersecurity posture,\nadopting robust vulnerability management practices, and\nfostering a culture of security awareness are key steps in\nsafeguarding against zero-days. The MOVEit and Barracuda\ncampaigns offer a stark reminder that cyber threats are not\nmerely a nuisance, but a threat that demands our attention\nand action. Defenders must adopt a proactive approach to\ncybersecurity, recognizing that zero-day vulnerabilities are a\nreality and that preparation reduces their impact.\n\n\n-----\n\n###### Evolution of Phishing Amid Shifting Security Controls\n\nIn 2022, Microsoft moved to block by default the execution of macros in Office documents. This change effectively impeded\nattackers’ ability to leverage this technique for code execution following initial access. Since then, Mandiant has observed\nattackers moving to adopt new methods of initial access involving expanded payload selection, and highly effective social\nengineering tactics. To circumvent security controls, attackers have begun to experiment with a variety of payload types,\nincluding LNK files and weaponized Microsoft Office documents. Attackers also sought to move out of the traditional bounds\nof targeting, and began to engage on platforms beyond email such as social media, SMS messaging, and other common\ncommunications platforms. Mandiant also observed attackers exploit trusted relationships and communications through\ntechniques such as conversation hijacking, and by simply masquerading as internal users. These contemporary phishing\ntechniques challenge traditional security paradigms that have focused on user education, email gateway filtering, and multi-factor\nauthentication (MFA). When targeting users in 2023, attackers leveraged multiple types of phishing payloads and techniques\nthat fell outside of historical norms. Mandiant observed attackers leveraging code obfuscation, remote payload hosting, placing\ndropper scripts within archive files, and bypassing email filtering controls.\n\n\n###### Malware Delivery:\n Old, Borrowed, and\n New Techniques\n\nWhen targeting users in 2023, attackers leveraged multiple\ntypes of phishing payloads and techniques that fell outside of\nhistorical norms. Mandiant observed attackers leveraging code\nobfuscation, remote payload hosting, placing dropper scripts\nwithin archive files, and bypassing email filtering controls.\n\n###### Compressed Archive Files\n\nCompressed archives such as the ZIP and RAR file formats\ncan be used as a container for malicious dropper files, and\nprovide password-based encryption capabilities that can\ncircumvent automated detection. Email security and firewall\ntechnologies can decompress specific archive file formats\nto perform content inspection and policy enforcement during\nfile transfer. However, sandbox analysis of unencrypted\narchives may not occur rapidly enough to prevent the delivery\nof a malicious file to an end user. Similarly, archive files that\nare encrypted using password protection, in effect, bypass\nautomated file scanning. Following Microsoft’s move to\ndisable macros by default in 2022, Mandiant observed multiple\nthreat groups shift towards the inclusion of compressed\narchives as a means to bypass initial detection.\n\nUNC2500 moved away from macro-enabled Office documents\nto other file types, including OneNote and LNK files, contained\nwithin password-protected ZIP archives. These files were\ncommonly delivered as attachments to emails or downloaded\nfrom OneDrive links, Google Drive URLs, and compromised\nwebsites. UNC2500 phishing distribution campaigns have\n\n\nled to the deployment of multiple backdoor types following\ninitial compromise, and have provided access for multiple\nattackers as a precursor to ransomware operations. Beginning\nin September 2023, the LNK files weaponized by UNC2500\ncontained commands that leveraged the built-in cURL utility\nto download and execute a Visual Basic script hosted at a\nmalicious URL leading to the deployment of various backdoors.\n\nAnother threat group, UNC4814, sent spear-phishing emails\nto government and critical infrastructure targets in Ukraine\nbetween April and May 2023. These emails included\nattachments that contained an obfuscated JavaScript\ndownloader. UNC4814 targeted organizations with a lure\nreferencing a convention hosted by the PAX organization\nbased in the Netherlands. Launching the obfuscated\nJavaScript downloader resulted in the execution of a\nPowerShell command, which installed a downloader.\n\n###### Microsoft Office Documents\n\nWhen Microsoft announced their intent to block VBA Macros,\nMandiant observed malware distribution methods shift to\nnew delivery mechanisms within the ecosystem of Microsoft\napplications. Beginning in late January 2023, UNC2633\nleveraged malicious OneNote files to distribute QAKBOT\nmalware. These OneNote files would drop and execute a\nWindows Script File to run additional malicious commands.\nIn February, Mandiant also observed FIN6 use CV-themed\nOneNote lures to distribute a payload consisting of a\ndownloader embedded in LNK files.\n\nDespite Microsoft blocking office macros by default, Mandiant\ncontinued to observe attackers leverage Office documents\nto target users in 2023. Continued use of malicious macros\nmay reflect that some organizations maintain policies that\n\n\n-----\n\nkeep macros enabled due to reliance on macros for legitimate\nbusiness purposes. Since at least February 2023, the Russianexus attacker Turla, tracked by Mandiant as UNC638, has likely\ntargeted Ukrainian military personnel using spear-phishing\nemails containing Excel documents. The spreadsheets\nattached to the emails contained embedded macros to install\na .net backdoor on targeted machines. In April 2023, UNC1151\ntargeted Ukrainian government entities with a RAR archive\ncontaining an Excel spreadsheet with a malicious macro that\ndropped an embedded .net downloader payload.\n\n###### Hyperlinks in Email Body\n and Attachments\n\nMandiant has observed attackers leverage a notable technique\nin their attempts to bypass email security solutions. Instead\nof including a malicious attachment, which may be defeated\nby scanning, attackers have started to include hyperlinks to\nsecond-stage payloads. In some cases the hyperlinks are\nincluded in innocuous attachments, whereas, in others, the\nlinks are included in the message bodies. Email security\nsolutions vary in how far they will follow hyperlinks and the\ndepth of the scanning performed.\n\nBeginning in February 2023, Mandiant observed APT29\nconduct multiple phishing campaigns against diplomatic\nentities using hyperlinks to host second-stage payloads. In\none particular phishing campaign, APT29 attached a PDF\nmasquerading as a wine-tasting event invite, which contained\na malicious embedded URL. In a separate instance targeting\ndiplomatic entities, APT29 embedded the URL directly in the\nemail body. Once a targeted user clicked on a URL within the\nphishing email or PDF, an HTML dropper attachment, which\nMandiant tracks as ROOTSAW, would be downloaded to disk.\nROOTSAW leverages HTML smuggling in order to launch\nJavaScript to decode and further execute embedded malware\nwithin the attachment. Beginning in October 2023, Mandiant\nobserved FIN6 also leveraging this technique through social\nmedia phishing messages containing a resume or job-themed\nPDF. Once a targeted user opened the PDF, the user was\npresented with a fake error message, which included a URL\nto an attacker-controlled domain.\n\n###### Social Engineering: Leveraging Alternative Platforms\n\nAs new technologies are created and deployed to defend\nagainst email-based phishing, attackers have undertaken\na natural process of identifying, trialing, and ultimately\nleveraging new platforms to deliver lures to targets. Attackers\nhave employed a variety of methods to move user interaction\n\n\nand exploitation away from email and perimeter network\nmonitoring, where detections are most heavily focused.\nNotably, they focused on areas where visibility is considerably\nless common, including infiltrating target environment\ncommunication and messaging platforms, connecting over\nsocial media, and phishing mobile devices.\n\n###### Communication and\n Messaging Platforms\n\nMandiant observed multiple attackers attempting to send\nphishing messages to Microsoft Teams users by leveraging\ncompromised internal accounts and external accounts.\nIn April 2023, UNC3944 used compromised internal O365\naccounts to target other internal users over Microsoft Teams.\nThe attackers pretended to be members of the organization’s\nHuman Resources department in order to persuade targeted\nusers to access a spoofed O365 login page hosted on a\ndomain that included the name of the organization. The\nattacker provided guidance to the users on how to access the\nlogin form, and provide their MFA code. Once the attacker was\nauthenticated as the compromised users, they registered new\nMFA methods or updated the user’s phone number used to\nreceive MFA SMS codes.\n\nIn September 2023, UNC5051 used an external O365 tenant\naccount to target users with a Microsoft Teams chat request\nthat contained a malicious URL. Once accessed, the user was\nprompted to download a ZIP archive stored on an attackercontrolled SharePoint site. The ZIP archive contained a\nLNK dropper masquerading as a PDF file that, when executed,\nlaunched a Visual Basic script downloader that used the builtin Windows cURL utility to download and execute a precompiled AutoIT script leading to installation of the\nDARKGATE backdoor. Mandiant has identified multiple threat\nclusters incorporating the DARKGATE backdoor into their\noperations, including those that have provided initial access\nfor ransomware intrusions.\n\n###### Social Media\n\nSocial media platforms provide attackers with additional\ndata collection and phishing opportunities against users of\ntarget organizations. LinkedIn is a particularly popular choice\nfor attackers, which they use to target employees of specific\ncompanies. Due to LinkedIn’s status as a business-oriented\nplatform and the visibility it provides into employee names,\njob titles, and responsibilities, attackers were able to build\nmore plausible lures for phishing campaigns.\n\nIn 2023, Mandiant identified multiple attackers adopting\nfake LinkedIn personas and engaging with users of target\norganizations over private messages. Beginning in May 2023,\nUNC2970 used the LinkedIn platform to conduct spearphishing operations using varied payload types, including\n\n\n-----\n\ncontainer files, to compromise employees of target\norganizations. Post-compromise activity included the\nexecution of backdoors, and the targeted theft of information\nin support of suspected espionage operations. In late June\n2023, UNC4962 targeted users through LinkedIn private\nmessaging using themes related to corporate development\nprojects and job roles. Message recipients were directed to\ndownload a ZIP archive, hosted on cloud storage services,\nthat contained a Visual Basic script payload. That payload\nexecuted a Windows Installer (MSI) package, and resulted in\nthe execution of the DARKGATE backdoor. In October 2023,\nFIN6 also used the LinkedIn platform to send a URL to HR\nrecruiters of a target organization, which prompted them\nto download a PDF file hosted on a fake resume site. FIN6\nrestricted access to the URL using filtering requirements,\nincluding specific User-Agent strings and geofencing. Users\n\n\n**Geofencing: Virtual boundaries**\naround specific geographic\nlocations that attackers will\nuse to only target individuals in\ncertain regions.\n\n\nwho met the criteria\nwere served a ZIP\narchive containing a\nmalicious LNK file,\nwhich, in turn, led to\nthe instantiation of\nboth a downloader\nand a backdoor.\n\n\n###### QR Code Phishing (“Quishing”)\n\nQuick Response codes (QR codes) are a type of barcode\ncontaining encoded data, such as URLs, that can be scanned\nwith mobile devices. Web browser usage on mobile devices is\nnot commonly collected or monitored, which makes it difficult\nto determine when users interact with a phishing website. By\nencoding a malicious URL in a QR code image and embedding it\nwithin a phishing email, attackers can circumvent email security\nscanning that relies on detecting hyperlinks within the email\nmessage body. Users may also find it challenging to confirm\nthe authenticity of a URL or web page when viewing it through\na mobile device browser compared to a desktop browser client.\nIn 2023, attackers included QR codes in phishing emails by\nembedding them within an attached PDF or image file, and\nprompting the email recipient to scan the barcode to retrieve\ninformation such as an invoice or a document.\n\nSince September 2023, Mandiant has observed UNC5103\nleveraging QR codes to direct phishing email recipients to\nwebsites masquerading as the State Taxation Administration\n(STA) of the People’s Republic of China. The attacker attached\na Microsoft Word document to the phishing email that, when\nopened, would display a malicious QR code with instructions\nto begin a tax refund application. Users who visited the\nspoofed STA website from a mobile device were prompted\nto provide personal information, including name, personal\nidentification number, and bank account information.\n\n\nBetween September and October 2023, UNC5092 used\ncompromised third-party email accounts to send phishing\nemails with an image file containing a QR code. The QR\ncode contained an encoded URL that directed the user’s\nmobile device browser to a spoofed Microsoft login page for\ncredential theft. Mandiant subsequently observed UNC5092\nconducting session token theft via adversary-in-the-middle\nattacks to obtain additional authentication information.\nUNC5092 leveraged the obtained cloud access to conduct\na wide variety of activities, including registering external\ndevices to enable MFA, accessing corporate email accounts\nto scrutinize data, creating new email inbox rules, acquiring\nfiles from SharePoint, and sending fraudulent fund transfer\nphishing emails to internal users.\n\n###### SMS Phishing (“Smishing”)\n\nattackers can target users through SMS phishing (smishing),\nwhich is a technique that takes advantage of the internetconnected nature of mobile devices to load web content such\nas spoofed login pages for credential theft. In 2023, Mandiant\nresponded to multiple incidents involving SMS phishing.\n\nIn one October 2023 instance, a attacker, masquerading as\nHelpdesk members of a third-party financial institution, sent\nSMS messages that directed recipients to a spoofed web\npage from their corporate systems. Users who accessed\nthe malicious web page were prompted to install AnyDesk\nremote access software on their corporate systems. Once\nthe attacker gained remote access to targeted systems, they\nnavigated to multiple web pages related to the users’ thirdparty financial institution account with the intent of registering\nnew mobile application access, and stealing money through\nfunds transfers.\n\nMandiant has also observed UNC3944 use SMS phishing\ncampaigns against employees of targeted organizations to\nobtain credentials in order to gain and escalate access to\nthe environments. Starting in mid-2023, Mandiant identified\nUNC3944 leveraging a new phishing kit that delivers phishing\npages designed to appear as if they belong to the targeted\norganization, and using registered domains that include the\ntargeted organization name in combination with “-sso” or\n“servicenow” in the domain. Follow-on access by UNC3944\nhas typically involved targeting of cloud resources to\nestablish a foothold for data theft and monetization, but in\n2023 this attacker shifted tactics to include data extortion\nand ransomware.\n\n###### Detection and Mitigation\n\nWhen user credentials are successfully compromised\nthrough alternative platform phishing such as involving\nSMS or QR codes, the initial discovery of compromise can\noften involve cloud security alerts for risky sign-in events,\n\n\n-----\n\nmailbox rule creation, suspicious MFA device registration,\nor internal and external users reporting suspicious emails\noriginating from a compromised user account within the\norganization. Detection strategies may include generating\nalerts for the aforementioned activity. Platform logs may\nalso record messages or URLs transmitted between users\nthat could be proactively analyzed for suspicious content.\nFor example, the Microsoft 365 audit log can record URLs\n\n\nsent over Microsoft Teams under the MessageURLs field\nwithin the MessageCreatedHasLink Operation. Common\nmitigation approaches to reduce the threat of alternative\nplatform phishing include specifying which Microsoft 365\norganizations are trusted and allowed to chat with internal\nusers over Microsoft Teams, deploying phishing-resistant\nMFA methods, and other recommendations detailed within\nMicrosoft security guides.[30]\n\n\nFile\ndownloads—\nWeb Proxy\n\nFile\ndownloads—\nWeb Proxy\n\nFile\ndownloads—\nWeb Proxy\n\nFile write—\nEndpoint\n\nFile write—\nEndpoint\n\n\nFile\nDownload—\nExecutable\n\nFile\nDownload—\nContainer\ncontains\nExecutable\n\nFile Download\nfrom External\nCloud Storage\n\nCreation of\nsuspicious\nLNK file\n\nCreation of\nWSF files\n\n\nLogsource = Web Proxy\nEventtype = file download\nFiletype = [exe, lnk, vb, …]\n\nLogsource = Web Proxy\n\nEventtype = file download\n\nFiletype = [zip, rar…]\n\nArchive_Contents = [exe, vb,\ncom, bat, js, …]\n\nLogsource = Web Proxy\n\nEventtype = file download\n\nSourcedomain = [*.onedrive.\ncom, drive.google.com,\n*.sharepoint.com, …]\n\nLogsource = endpoint\n\nEventtype = file creation\n\nFiletype = lnk\n\nContents contain (cscript or\nwscript or cmd or powershell or\ncurl or wget or bitsadmin or …)\n\nLogsource = endpoint Eventtype\n= file creation\n\nFiletype = wsf\n\n\nAlert when anomalous, executable file\nextensions are observed being downloaded.\n\nEven when password protected, many\narchives still expose a directory of their\ncontents. Some tools may include archive\ncontents in their log event metadata. Alert\nwhen an archive contains executable files.\n\nIf your organization rarely interacts with\nother organizations through cloud storage,\nalert to use of external org’s cloud storage.\nMark as informational downloads from\napproved domains.\n\nLook for the creation of LNK files that would\nbe used to execute scripting environments\nor launch tools that download contents from\nthe internet. Some endpoint detection and\nresponse tools and Sysmon can provide this\ninsight.\n\nWSF files may be rare in your environment. If\nso, alert to the creation of any such files.\n\n\nT1566.002\n\nT1566.002\n\nT1566.002\n\nT1566.002\n\nT1059\n\n\n-----\n\n**Continued**\n\n**Detection** **Detection**\n\n**Pseudocode**\n\n**Opportunity** **Name**\n\nFile write— Creation Logsource = endpoint\nEndpoint of office\n\nEventtype = file creation\n\nfiles that\nmay include Filetype = [doc, docm, xls, xlsm,\nmacros …]\n\nEmail Email contains Logsource = email\nSecurity office files\n\nEventtype = email\n\nGateway that may\n\ninclude Attachment=true\nmacros\n\nFiletype = [doc, docm, xls, clsm, …]\n\nEndpoint Use of cURL Logsource = endpoint\nExecution on non power\n\nEventtype = process start\n\nuser endpoint\n\nFilename = curl.exe\n\nNOT user = [list of power users…]\n\nEndpoint Use of MSI Logsource = endpoint\nExecution packages\n\nEventtype = process start\n\nFilename = *.msi\n\nTeams Suspicious Logsource = M365\nMessages link sent\n\nEventtype =\n\nbetween\n\nMessageCreatedHasLink\n\nTeams users\n\nMessageURL contains [strings\nsimilar to org’s domain]\n\nNetwork Network Logsource = [dns, webproxy]\nConnection traffic to a domain contains [strings similar\n\nlookalike to org’s domain]\ndomain\n\nMFA Changes Change or Logsource = MFA\naddition to\n\nEventtype = [change phone, add\n\nuser’s MFA\n\nphone]\n\n###### Conclusion\n\nAttackers have advanced the effectiveness of their techniques\nbeyond the scope of what is covered by traditional anti-phishing\nguidance. User awareness concepts such as “only interact\nwith emails from trusted senders” are no longer effective\nagainst attackers’ use of compromised third-party accounts,\nconversation hijacking, internal phishing, and interactive social\nengineering. User devices outside the visibility of organizations\nare also being targeted, which drives the need for implementing\n\n|Detection Opportunity|Detection Name|Pseudocode|Description|MITRE|\n|---|---|---|---|---|\n|File write— Endpoint|Creation of office files that may include macros|Logsource = endpoint Eventtype = file creation Filetype = [doc, docm, xls, xlsm, …]|Most organizations no longer use the antiquated office document format. Alert when these file types are written to disk. Also alert when macro specific document types are written.|T1566.001|\n|Email Security Gateway|Email contains office files that may include macros|Logsource = email Eventtype = email Attachment=true Filetype = [doc, docm, xls, clsm, …]|Most organizations no longer use the antiquated office document format. Macro oriented attachments should be blocked, otherwise alert and investigate.|T1566.001|\n|Endpoint Execution|Use of cURL on non power user endpoint|Logsource = endpoint Eventtype = process start Filename = curl.exe NOT user = [list of power users…]|Alert to highly anomalous use of cURL on Windows endpoints in the organization.|T1204.002|\n|Endpoint Execution|Use of MSI packages|Logsource = endpoint Eventtype = process start Filename = *.msi|Alert to execution of MSI files.|T1204.002|\n|Teams Messages|Suspicious link sent between Teams users|Logsource = M365 Eventtype = MessageCreatedHasLink MessageURL contains [strings similar to org’s domain]|Alert to urls sent over teams that are likely referencing a lookalike domain in order to capture more accounts.|T1534|\n|Network Connection|Network traffic to a lookalike domain|Logsource = [dns, webproxy] domain contains [strings similar to org’s domain]|Alert to dns queries or web traffic to domains with suspicious strings. E.g. ex4mple[.]com instead of example.com.|T1583.001|\n|MFA Changes|Change or addition to user’s MFA|Logsource = MFA Eventtype = [change phone, add phone]|Changes to a user’s phone number in their MFA profile should be rare. Alert and verify with the user.|T1098.005|\n\n\nstricter technical controls for authentication, and the detection\nof suspicious access. Often, an infection chain can involve\nmore than one attacker, with separate groups responsible for\nthe initial phishing access and control of a backdoor, and only a\nbrief overlap in operations. Having a comprehensive detection\nand threat hunting strategy focused on behavioral indicators\nacross all stages of the intrusion lifecycle can lead to faster\nidentification of novel initial access methods. Early detection of\nintrusion activity and rapid system containment are critical to\nlimiting impact from security incidents.\n\n\n-----\n\n###### How Attackers Leverage AiTM to Overcome MFA\n\nMandiant has observed an increase in compromises against cloud-based identities configured with multi-factor authentication\n(MFA). As the adoption of MFA becomes commonplace across organizations, attackers are becoming proficient in methodologies\ncapable of overcoming weaknesses in widely-adopted MFA methods. Most notable is the increasing adoption of web proxy or\nadversary-in-the-middle (AiTM) phishing pages, which are capable of rendering most MFA implementations ineffective by stealing\nsensitive login session tokens.\n\n###### Common MFA Methods\n\nMFA solutions often provide a variety of mechanisms for the management and approval of authentication requests. While\nmechanisms exist that are resistant to AiTM phishing, they often require additional infrastructure and overhead. However, the\nmost commonly employed MFA mechanisms are the ones that are susceptible to attackers leveraging AiTM phishing.\n\n**MFA Type** **Description**\n\nPush notification Phone call or mobile application based prompt that only requires a user to accept a phone app push\nnotification or press a key on their mobile device. Push notifications often lack context about the\nresource being accessed and can enable MFA fatigue attacks, in which users are sent repeated\nrequests until the prompt is approved.\n\n\nOne-time password (OTP) /\nTime-based one-time\npassword (TOTP)\n\nPush notification with number\nmatching verification\n\n\nCode from a SMS or email message, or a time-bound code generated by a mobile application\nor hardware device that is input along with a username and password during or following\nauthentication. SIM swapping and credential harvesting webforms are common methods of stealing\nthese codes, but they are also susceptible to exposure from seed theft or takeover of an account with\naccess to cloud-synced TOTP codes.\n\nA push notification prompt generated on a user's mobile device that can only be accepted upon\ninputting a code generated by the logon portal. This addresses abuse mechanisms associated with\nMFA fatigue as well as TOTP code and seed theft.\n\n\nCertificate-based\nAuthentication requiring X.509 certificate to be installed on devices. Resistant to AiTM phishing attacks.\nauthentication (CBA)\n\nHardware keys Physical devices compatible with the FIDO2 or U2F standard, which use public-key cryptography with\nsupported cloud authentication services. This standard requires the server requesting a key to match\nthe server tied to that key, therefore making it resistant to AiTM phishing attacks.\n\n\n-----\n\n###### Credential Harvesting Evolved: Adversary-in- the-Middle\n\nAttackers often leverage credential harvesting forms, or\nphishing pages, as a means to obtain logon credentials from\ntheir targets. These websites, which are designed to resemble\npopular login portals, can forward to an attacker credentials\nand MFA codes submitted by the targeted user. During an\ninvestigation into a business email compromise, Mandiant\nobserved an attacker operating a credential harvesting\nform that forwarded credentials and time-based MFA codes\nto a private Telegram channel. This instant notification of\nstolen credentials provided the attacker an opportunity to\nsuccessfully log in prior to the MFA code expiring, granting\ninitial access into the targeted account.\n\nAiTM phishing pages go beyond typical credential harvesting\nforms, and use infrastructure designed to overcome commonly\nimplemented MFA methods. Unlike traditional credential\nharvesting forms, AiTM pages behave as a reverse web proxy\nbetween the targeted user and the legitimate logon portal.\nAiTM pages not only intercept credentials and MFA codes, but\nmore critically, the post-authentication session token issued\nby the logon portal. These tokens can be used by an attacker\nto bypass security controls that are only evaluated on the\ninitial sign-in.\n\nCompared to traditional credential harvesting forms, the\nrelative complexity of setting up AiTM phishing infrastructure\nmay have kept its adoption by attackers limited in the past.\nHowever, in 2023, Mandiant observed a marked increase of\nAiTM phishing pages in use by attackers. The acceleration\nof AiTM usage amongst attackers has likely been aided\nby the availability of phishing-as-a-service offerings in the\ncybercriminal underground. Such offerings can provide\nless technically sophisticated attackers access to regularly\nmaintained phishing infrastructure through which they can\nlaunch complex campaigns.\n\n\n###### Detection and Mitigation\n\nWhile AiTM phishing represents an evolution of attacker\ncapabilities in the face of stronger controls such as MFA,\ncompromises through AiTM phishing pages and the ensuing\nuse of stolen session tokens provides defenders with\ndetection opportunities. Since AiTM phishing pages are\ndesigned to intercept and forward a targeted user’s login\ninformation to a cloud authentication service, authentication\nlogs will record the IP address associated with this phishing\ninfrastructure as the user’s source IP address. The attacker’s\nIP address and associated User-Agent string, which may\ndiffer from the initial AiTM logon, will also be recorded when\nauthenticating with a stolen token. Defenders should continue\nto monitor for anomalies, such as geographically infeasible or\nunexpected source IP addresses, and logins originating from\ndata centers.\n\nIn nearly all of Mandiant’s investigations involving compromised\ncloud accounts, attackers were observed enrolling their own\nMFA methods shortly upon gaining initial access. Typically,\nthis was done by interacting with a self-service security portal.\nWhile this activity isn’t exclusive to AiTM attacks and session\ntoken theft, it’s still worth highlighting as an effective detection\nopportunity, especially if paired with other logon anomalies.\nA regular review of new MFA registrations, as well as auditing\naccounts with multiple MFA methods configured, can reveal\nevents worth further investigation.\n\nTo best defend against AiTM attacks, organizations should\npursue a combination of AiTM-resistant MFA methods\nand access policies. Most cloud authentication services\nsupport access policies that can block logons based on\norganization-defined locations, device management status, or\nan assessment of risk based on the account’s historical logon\nproperties. When implementing these access policies, it is\nimportant to understand which can be applied continuously\nthroughout the logon session. Typically, most access policies\nare only applied at the initial token issuance stage, which will\nnot offer protection against the use of previously stolen tokens.\n\n\n-----\n\nOkta - Detect AiTM Phishing using\nFastPass\n\nAzure - Change of\nAuthentication Method\n\nM365 - Detects disabling of Multi\nFactor Authentication\n\n\nT1078 T1556 eventType = \"auth_via_mfa\"\n\nAND result=FAILURE\n\nAND reason=\"FastPass declined phishing attempt\"\n\n\nT1556 LogSource = M365 Audit logs\n\nAND Operation=\"*Disable Strong Authentication.*\"\n\n\nT1098\nT1556\n\n\nLoggedByService=\"Authentication Methods\"\n\nAND Category=\"UserManagement\"\n\nAND OperationName=\"User registered security info\"\n\n\nDevice Registration without MFA T1078.004 Logsource = Azure sign in logs\n\nAND resourceDisplayName = “Device Registration Service”\n\nAND status = “Success”\n\nAND NOT authenticationRequirement = “multifactorAuthentication”\n\n\nAttempt to reset Okta MFA factors\nfor user\n\n###### Conclusion\n\n\nT1098 Logsource = Okta System events\n\nAND action = “user.mfa.factor.reset_all”\n\n\nAs AiTM phishing pages continue to grow in prevalence, many\norganizations today still rely on security controls that do not\noffer token theft protection. Furthermore, mitigating token\ntheft and stolen token usage does not presently fit into a\nsingle, one-size-fits-all solution. Organizations can better\nprotect against AiTM token theft by implementing phishingresistant MFA methods and effective access policies, and\nreduce the risk of stolen token use with policies that are\ncontinuously evaluated during a logon session. If these\ncontrols are paired with effective anomaly-based detection\nmethodologies, organizations can greatly reduce the risk of\nphishing attacks and an attacker’s dwell time.\n\n\n-----\n\n###### Cloud Intrusion Trends\n\nAs enterprise cloud adoption and the use of hybrid cloud/on-premises environments continues to grow, adversaries have followed\nsimilarly in their targeting. Attackers recognize the value of data stored in cloud environments, and the computing resources\navailable that could enable future malicious operations. Mandiant continues to observe attackers of varying motivations pivot to\ncloud environments to target cloud-hosted data, and leverage cloud computing resources in their operations.\n\n\n###### Targeting Identity\n and Access Management and Bypassing MFA Requirements\n\nHistorically, to gain initial access to cloud and hybrid\nenvironments, attackers have relied upon stolen credentials\nand access tokens that did not require multi-factor\nauthentication (MFA). As security awareness and MFA\nadoption has increased in recent years, attackers have\nplaced an increasing emphasis on social engineering. During\ntargeted social engineering campaigns, attackers lure users\ninto providing credentials and using innovative methods to\ncircumvent MFA or exploit weaknesses in its implementation.\n\nMandiant has observed increased usage of adversary-inthe-Middle (AiTM) techniques to bypass MFA requirements\nby capturing session tokens. In an AiTM campaign, the\ntargeted user’s connection to the legitimate cloud service\nis proxied through an attacker controlled server. By doing\nso, the user’s credentials and MFA method are relayed to\nthe legitimate cloud service while the attacker can capture\nthe access token returned to the user. There are a number\nof AiTM kits advertised by attackers that can help automate\nthe construction of convincing landing pages that mimic\nthe legitimate cloud service logon page. In the majority of\nbusiness email compromise (BEC) cases Mandiant responded\nto in 2023, successfully targeted users had MFA configured,\nbut it was circumvented by an AiTM phishing campaign.\n\nAttackers are known to leverage social engineering to target\nusers, and Mandiant continues to observe the effectiveness\nof these campaigns. An espionage-related investigation\nrevealed the use of a heavily tailored spear-phishing email that\nimpersonated an individual in the same industry as the target,\nand used legitimate content relevant to the user to build\ncredibility. The email lured the targeted user to click a link\nand enter their credentials to access protected information.\nOnce in possession of the username and password, the\nattacker triggered a MFA push notification, which the targeted\nuser accepted.\n\n\nAdditionally, Mandiant observed attackers abuse the trusted\nrole of help desk and technical support personnel. In one case,\nphishing messages purporting to be from technical support\nlured users into providing MFA approval for malicious signins\nto a cloud platform. In another case, the financially motivated\nattacker UNC3944 relied heavily on social engineering to\nobtain credentials of users with elevated privileges, leveraging\nSMS phishing and placing phone calls to the targeted\norganization’s help desks to reset a user’s password or\nassociated MFA device.[31]\n\nIn 2023, we observed an increase in the use of targeted SIM\nswapping to gain access to accounts. In cases where this was\neffective, organizations sent time-based one-time password\nMFA codes via SMS messages. In other cases, organizations\nused SMS to verify ownership of an account before sending a\npassword recovery link. Financially motivated attackers have\nbeen observed leveraging SIM swapping to receive both types\nof SMS codes to facilitate an account takeover. A financiallymotivated threat cluster, UNC3786, routinely performed SIM\nswapping to compromise credentials and gain access to\ntargeted organizations’ Okta and/or Microsoft 365 accounts.\nIn one UNC3786 intrusion, while performing a SIM swap, the\nattacker sent spam SMS messages to the targeted user’s\nphone, likely in an attempt to distract the individual from\nnotifications from their phone carrier related to the SIM swap.\nUNC3944 similarly leveraged SIM swapping to gain access to\nuser credentials and SMS MFA codes.[32]\n\nMandiant continues to observe attackers perform\npassword guessing attacks against cloud sign-in portals to\nidentify accounts that do not have MFA configured. Often\norganizations will rely on users to self-enroll an MFA device.\nThis means that if an account does not already have MFA,\nthe first successful password authentication will immediately\nprompt to enroll an MFA device. We have seen espionage\nattackers perform these guessing attacks to find and take\nover dormant accounts without MFA that should have been\ndisabled, or service accounts with no need for MFA.\n\n\n-----\n\n###### Weak Credential Storage\n\nIn other cases, Mandiant observed attackers using credentials\nthat were stored poorly to gain access to cloud environments.\nIn one incident, default configurations on an Internet accessible\nserver led to the discovery and compromise of clear text\nAWS credentials, which allowed the attacker to gain access\nto a target’s AWS environment. In another case, an attacker\nleveraged account credentials believed to have been stolen\nduring a previous incident, enabling the attacker to gain access\nto the targeted organization’s cloud-hosted code repository,\nwhich did not require MFA. Mandiant also responded to\nan incident involving an attacker that accessed a targeted\norganization’s AWS environment using a leaked AWS access\nkey. The investigation revealed that the key likely originated\nfrom a Docker container, hosted on an EC2 instance and owned\nby the organization, that was exposed to the internet. Copies\nof the same key were also found in other public IP addressable\nresources not owned by the targeted organization.\n\n###### Adversary Abuse of\n Cloud Services\n\nAfter obtaining initial access to cloud environments, Mandiant\nobserved adversaries abuse cloud native tools and services\nto maintain access, move laterally, and ultimately accomplish\nmission objectives such as stealing data. By limiting\nthemselves to preinstalled tooling, attackers can decrease\ntheir operational profile, evade detection, and maintain\npresence in cloud environments for longer periods of time.\n\nMandiant has observed attackers using Azure Data Factory\nand AirByte to modify existing pipelines to steal data stored\nin various integrated platforms such as data warehouses,\nstorage blobs, and SQL databases. Specifically, attackers\nhave created pipeline jobs that export data from those data\nsources to an attacker-controlled SFTP server. The use of\ndata factories provided the attackers with a stable and highbandwidth platform to copy large volumes of data.[33]\n\nIn 2023, Mandiant observed a financially-motivated attacker,\nUNC3944, backdoor cloud identity providers (IDP) using\ntechniques that were previously only observed in use by\nespionage groups. In multiple investigations, UNC3944 gained\nadministrative access to Entra ID (formerly Azure AD) to\nconfigure a rogue federated identity provider, which allowed\nthem to execute golden SAML attacks. The attacker could\nthen authenticate to resources protected by Entra ID as any\nuser in the organization without knowledge of their password\nor possession of their MFA device. In one investigation,\nMandiant observed UNC3944 target an organization’s Active\nDirectory Federated Services (ADFS) server, and execute\nMimikatz in an attempt to obtain the token signing certificate\nto conduct a golden SAML attack\n\n\nMandiant also saw attackers target cloud compute instances\nto maintain stealthy persistence in target cloud environments.\nIn multiple incidents the attackers created Azure Virtual\nMachines (VMs) and assigned them public IP addresses.\nThese attacker-created VMs did not have the organization’s\nmandated security and logging software installed on them.\nAs such, the attackers gained unmonitored access to a trusted\nsystem inside of the organization’s virtual network or virtual\nprivate cloud, which they then use to progress their intrusion.[34]\n\nCloud compute instances often have network connectivity\nto organization on-premises networks via virtual private\nnetwork, and can provide an avenue for lateral movement.\nOn multiple occasions UNC3944 moved laterally from Azure\nconsole access into an Azure-hosted VM using the Special\nAdministration Console to connect to VMs via serial console.\nAttackers have employed malicious use of the Serial Console\non Azure VMs to install third-party remote management\nsoftware, which provided them with persistent access to the\nVM. This method of attack is unique in that it avoided many of\nthe traditional detection methods employed within Azure, and\nprovided the attacker with full administrative access to the VM.\n\nMandiant has also observed attackers target cloud\ninfrastructure for the specific purposes of cryptomining based\non their perceived significant processing power. In one incident,\nan attacker gained access to a targeted organization’s Google\nCloud Platform (GCP) project via a leaked service account\nkey. After accessing the project, the attacker deployed more\nthan 1,200 virtual machines with a startup script to execute a\nMonero cryptocurrency miner using the XMR-Stak miner.\n\nAttackers also leveraged open-source offensive security\ntoolsets to survey the environment in some cases. Tools\nsuch as Pacu, an open source AWS exploitation framework,\nand CloudFox, an open source command line tool that can\nenable the discovery of exploitable attack paths into cloud\ninfrastructure, were seen in one case being leveraged to\nperform automated reconnaissance. ScoutSuite, a cloud\nsecurity and auditing tool, was used in another case to\naccess AWS API and Console to conduct operations, which\nincluded the deployment of a cryptocurrency dataminer in\nthe AWS environment.\n\n###### Recommendations\n\nMandiant continues to observe attackers targeting weakly\nimplemented identity management practices and credential\nstorage to obtain legitimate credentials and circumvent\nMFA. As attackers have developed new methods to bypass\nMFA, organizations need to implement changes to their\nauthentication policies to maintain a strong security posture.\nPhishing-resistant MFA methods have gained widespread\nsupport by web browsers, operating systems, and cloud\nservice providers. The two most commonly accepted\n\n\n-----\n\nphishing-resistant MFA methods are certificate-based\nauthentication (CBA) and FIDO2 security keys. Organizations\ncan limit a attacker’s ability to circumvent MFA protections by\nphasing out legacy MFA methods such as SMS, phone calls,\nand TOTP codes in favor of these newer methods.\n\nIn CBA, users are provisioned a certificate identifying them\nand their device as well as a corresponding private key. The\nprivate key is used to prove the user’s identity to the cloud\nservice provider. The user is never prompted for the private\nkey, and in fact they do not know it. Almost all end-user\nsystems in use today contain a Trusted Platform Module\n(TPM), which is a separate chip that stores and manages\ncryptographic keys securely, including the private key used in\nCBA. The key material never leaves the hardware boundary\nof the TPM, so it cannot be stolen by malware on the device.\nWhen CBA is used, the connection is negotiated using mutual\nTLS authentication, which resists most phishing methods\nbecause the secret key is not known to the user, and they\nare never prompted for it. Techniques that use AiTM are also\nthwarted because when the attacker proxies a targeted user’s\nlogin session they must terminate the TLS connection, which\nwill break CBA.\n\nFIDO2 security keys rely on a similar security model as CBA\nto be phishing resistant, with the major distinction being the\nportability of the keys. With a FIDO2 security key, often a USB\ndevice, the key material never leaves the hardware boundary\nof the physical key. Users do not know and are not prompted\nfor the key’s value. Each website configured for FIDO2 has\na unique private key that is tied to a particular application.\nIf a user visits a phishing website, the browser will refuse to\nprompt the user for their security key because the phishing\ndomain does not match any configured keys.\n\nCloud service providers (CSP) provide many tools to\norganizations to help detect and prevent common cryptominer\nschemes. First, all CSPs support authentication methods that\nprovide additional security features beyond access keys and\nAPI secrets. Organizations should audit their cloud accounts\nand establish a program to remove any access keys, especially\n“root” or “superuser” access keys, and move towards modern\nrole-based programmatic access secrets. Additionally,\nbudgeting alerts and limits are a great way to monitor cloud\naccounts for abnormal spending. This is often a high-fidelity\nsignal of a cryptocurrency scheme that has hijacked a cloud\naccount. Finally, consider using a “secure by default” design\nfor any new cloud environments. Secure by default bakes in\nvendor best practices to reduce the attack surface.\n\n\nOrganizations should also consider implementing additional\ncontrols to restrict access to cloud resources to only trusted\ndevices. Each CSP supports this in some form although the\nexact language may differ. This can be done by using mobile\ndevice management (MDM) technologies to maintain device\nstate, and allow authentication only from enrolled devices.\nIf organizations require access to resources using untrusted\ndevices (for example, a hotel computer) they should put in\nplace policies that restrict what can be accessed, and how.\nFor example, users should not be able to access the cloud\nadministration console from an untrusted device. Similarly,\ndownloading documents on untrusted computers should be\nlimited or restricted.\n\n\n-----\n\n###### Artificial Intelligence in Red (and Purple) Team Operations\n\nIn 1955, John McCarthy, a luminary of the fields of both computer science and cognitive science, coined the term “artificial\nintelligence” to be “the science and engineering of making intelligent machines.” This research started as a way to make a machine\nbehave or perform like a human, but, in the modern landscape, the meaning has evolved to encompass machines that can learn\nlike a human. While the artificial intelligence (AI) systems imagined in popular science fiction are still quite far off, AI is currently in\na period of massive growth, investment, and potential. What started as logic machines with massive decision trees has expanded\nto highly complex algorithms based on myriad statistics and large-scale compute power. Recently, the most topical of these\nalgorithms are those that are designed to produce something; these systems are commonly referred to as generative AI (gen AI).\n\nGen AI has captured recent interest and achievements following the release\n\n**Targeted attack lifecycle: The typical** of multiple gen AI tools. Gen AI now creates content on scales previously\nsequence of events taken by attackers unseen, and is assisting with fields that diverge from the purely technical\nwhen conducting targeted operations. foundations of computer science. In cybersecurity, we have seen gen AI\n\nrevolutionize the field of detection engineering, where neural networks and\nmachine learning algorithms now form the heart of a variety of detection and\nresponse toolsets. However, an area where we have yet to see substantial adoption, yet has the potential to yield significant gains,\nis in the field of proactive security and red team assessments.\n\nDuring a red team assessment, Mandiant experts evaluate the capabilities of a customer’s security programs by simulating realworld attack scenarios. Mandiant has observed that attacker usage of AI has largely been limited to the Initial Access stage of the\nTargeted Attack Lifecycle. Specifically, usage has been limited to social engineering and information operations. Mandiant’s Red\nTeam has leveraged gen AI in similar fashion, seeing the greatest growth in adoption when leveraging AI to gain Initial Access to\nclient environments.\n\n\n###### Social Engineering Pretexts\n\nOne of the most prominent examples of gen AI usage within red\nteam assessments is assisting with the process of generating\ncontent and media. Mandiant Red Team assessments will\noften include a social engineering portion, during which\nMandiant is tasked with convincing clients to undertake\nmalicious actions unknowingly. This is commonly done through\ntext- or image-based channels, such as impersonation emails\nor websites. Mandiant consultants have used gen AI tooling\nto create initial drafts of malicious emails, as well as potential\nlanding pages under the guise of communications that are\nmore routine. When successful, these social engineering\nattempts result in Mandiant gaining access to a client network,\nwhich is often the first objective of the assessment.\n\nHowever, success is not the only metric that is helpful when\nperforming social engineering campaigns during red team\nassessments. By offloading the setup workflow to an AI\nsystem, Mandiant is able to gain overall increases in\nthroughput. The faster a social engineering campaign can be\nset up and performed, the more potential campaigns can be\ncompleted. Instead of creating a template from scratch,\nfor which tailoring details can be quite time consuming, gen\nAI can be leveraged to source social engineering pretexts\nmore quickly\n\n\n###### Rapid Tool Development\n\nMuch like how gen AI can be leveraged for the creation\nof social engineering pretexts, gen AI has also proven to\nbe helpful in software development across many areas of\nprogramming. Mandiant has found similar advances provided\nwhen AI is used to assist in the development of custom\ntooling during red team engagements. Gen AI is proving\nto be a capable resource when assisting with well-known\nalgorithms and data structures, can generate code from a\nnatural language-based description, and even integrates\ninto popular developer environments. These capabilities\nand integrations provide significant value when Mandiant\nencounters uncommon or new applications and systems—\na regular occurance during red team assessments.\n\nIn cases where environments do not fit the operational norm,\nMandiant looks to operationalize as much tooling as possible\nto assist with achieving a variety of engagement objectives.\nIn one scenario, Mandiant consultants used gen AI to help\nbuild a set of tools that would assist with the enumeration of\naccessible cloud environments to provide recommendations\nthat improve the security posture of customer environments.\nWithout gen AI, this process would have been much lengthier,\n\n\n-----\n\nforcing consultants to spend hours scouring related\ndocumentation as opposed to operating and delivering value.\nTooling built during engagements often live on well past the\nclose of the engagement, continuing to provide value well\ninto the future when reused. By closing the time necessary for\nthe initial research and creation, the value gained by repeated\nuse increases as the tooling is formalized and adopted in\nfuture engagements.\n\n###### Rapid Knowledge Acquisition\n\nDuring purple team engagements, Mandiant looks to become\nfamiliar with a client’s environment from the perspective\nof both attacker and defender. Logging, data storage, and\ndetection stacks come in a variety of packages from offthe-shelf software to custom built detection stacks made of\n\nbespoke software.\n\n**Red Team: Red teams plan** This often places\nand execute attacks against a consultant in an\norganizations for the purposes environment where\nof identifying weaknesses. they may not be fully\n\nknowledgeable of the\ndefensive toolkit that\nthe customer relies\n\n**Purple Team: Purple teams**\n\non for day-to-day\n\nfoster communication and\n\noperations. As a result,\n\ncollaboration between red\n\nMandiant consultants\n\nteams and defenders to improve\n\nmust familiarize\n\nincident response capabilities.\n\nthemselves not only\nwith the products in\nuse, but their potential responses to the attacks being tested.\n\nRecently, Mandiant has begun to leverage gen AI in a\nconversation capacity to enhance understandings of\nplatforms and subsequently hone in on the security aspects\nof those platforms. Conversations with gen AIs are often\niterative, with broad-stroke initial requests such as asking\nthe AI to describe the common logging methods of a\nspecific piece of software. This provides a launchpad for\nthe conversation to turn to more detailed topics based on\nsubsequent questions, which reference previous answers and\npublic documentation. While this workflow requires vetting\nof answers and follow-on testing, the collaborative nature\nof the process provides a user with a framework and initial\nknowledge base off which they can work. Ultimately this has\nled to an ability to build a more accurate understanding of the\ntechnology stack deployed within a customer’s environment,\na better engagement workflow, and a better product.\n\n\n###### Future adoption of AI for Red Teams\n\nAI and large language model (LLM) development teams seek\nto ingrain a concept of appropriate values within a developed\nlanguage model. This concept, called “AI Alignment”, attempts\nto produce models that work to advance the designer’s\nintended goals within the values defined, while denying\nrequests which fall outside them. AI alignment helps provide\nguardrails, which limit the malicious use of an AI. While\nattackers have leveraged AI to become more efficient, shy\nof developing their own models, they have to operate within\nthe bounds defined by the alignment or attempt to break\nthe alignment. Google even operates their own AI-specific\nRed Team[35] to help find and address potential misuse of AI.\nHowever, Mandiant’s red team assessments present a logical\nconundrum for AI alignment.\n\nMandiant’s red team performs sanctioned malicious actions\nthat customers have requested in order to help improve the\noverall security of their environments. The concept of AI\nAlignment places a ceiling on the level of AI adoption red\nteams can expect when the values encoded in the AI make\nit such that it will not provide answers. Conversely, red team\nengagements produce high-quality data, which helps drive\nbetter security outcomes for customers that can, in turn, be\nused to train AI models.\n\nAn exciting feature of LLMs is their ability to be fine-tuned\nor trained on what is known as domain specific knowledge.\nThe majority of LLMs used by the public are generalist LLMs,\nmeaning that the models are trained on a variety of data\nthat covers a wide swath of different knowledge domains\nvarying in both depth and breadth. Some LLMs are tuned for\nprogramming, whereas others might be targeted towards\nmedical knowledge such as MedLM.[36] For the purposes of\ncybersecurity experts, there is Google’s SecLM,[37] which is\ndesigned to provide actionable visibility into the latest threats.\nTuning LLMs on specific knowledge domains requires vast\namounts of specialized data within the target domain. Red\nteams, as professional organizations, generate and store\na substantial amount of data, which could be used to train\nmodels tuned to help secure customer environments.\n\nResolving these logical and technical challenges will require\na multi-pronged approach. Red teams will need to generate\nstructured data on which models can be trained, and provide\nsubject matter expertise to AI developers. Meanwhile, AI\ndevelopers will have to find novel ways to pursue AI Alignment\nthat leverages the legitimate use of malicious activity, and\nto properly secure access to the models that will be trained\non that data. The combination of red team expertise and\npowerful AI leads could result in a future where red teams are\nconsiderably more effective, and organizations are better able\n\n\n-----\n\n###### Conclusion\n\n\n-----\n\n###### The continued decrease in global median dwell time is a positive trend to see, and a testament to the efforts of defenders to detect threats as quickly as possible. However, attackers are not giving up. In fact, they are focusing more of their efforts on evasion—notably through the increased use of zero-day vulnerabilities, and targeting of edge devices and other technologies outside the traditional lines of visibility. This is bound to be one of the more challenging trends facing defenders in 2024.\n\n One of the ways organizations can test how quickly their security teams can defend against evasion tactics—as well as other threats discussed in M-Trends 2024 such as phishing and MFA bypasses—is by leveraging red team exercises. M-Trends 2024 highlights how Mandiant red and purple teams are using AI—as well as the latest attacker tactics,\n techniques and procedures—to enhance and improve the effectiveness of engagements, providing customers with a clear under- standing about the effectiveness of their security controls. AI is a powerful tool, and\n organizations are increasingly using it in their security toolkit to identify threats faster, eliminate toil, and fill talent gaps. On the offensive end, attacker use of AI remains limited[38] for now, and is most notably being used for social engineering and information operations.\n\n\n###### Preparation is vital, and should be comprehensive and layered. In addition to conducting red team and other exercises to test security teams, other best practices include involving Communications, Legal and other relevant teams in regular tabletop exercises that test incident response plans, and continually reviewing those incident response plans throughout the year.\n\n Sound fundamentals, such as vulnerability and exposure management, least privilege, and hardening also play a role in building strong defenses. Organizations should focus on building a comprehensive security program that spans the entire enterprise, from cloud and on-premises, to IT/OT, and all assets.\n This program should be backed by strong detection and proactive hunting capabilities that are fueled by impactful threat intelligence.\n\n The Mandiant mission is to help keep every organization secure from cyber threats and confident in their readiness. Our annual M-Trends report, featuring data and learnings from our engagements, plays a big part in advancing that mission. We will continue to share our frontline knowledge in M-Trends to improve our collective security awareness, understanding, and capabilities.\n\n\n-----\n\n###### Bibliography\n\n1. [https://community.progress.com/s/article/MOVEit-Transfer-Critical-Vulnerability-31May2023](https://community.progress.com/s/article/MOVEit-Transfer-Critical-Vulnerability-31May2023)\n\n2. [https://cloud.google.com/blog/topics/threat-intelligence/separating-signal-noise-how-mandiant-intelligence-rates-vulnerabilities-](https://cloud.google.com/blog/topics/threat-intelligence/separating-signal-noise-how-mandiant-intelligence-rates-vulnerabilities-intelligence)\n[intelligence](https://cloud.google.com/blog/topics/threat-intelligence/separating-signal-noise-how-mandiant-intelligence-rates-vulnerabilities-intelligence)\n\n3. [https://nvd.nist.gov/vuln/detail/CVE-2008-2463](https://nvd.nist.gov/vuln/detail/CVE-2008-2463)\n\n4. [https://nvd.nist.gov/vuln/detail/CVE-2017-0144](https://nvd.nist.gov/vuln/detail/CVE-2017-0144)\n\n5. [https://nvd.nist.gov/vuln/detail/CVE-2019-18935](https://nvd.nist.gov/vuln/detail/CVE-2019-18935)\n\n6. [https://www.justice.gov/opa/pr/justice-department-announces-court-authorized-action-disrupt-illicit-revenue-generation](https://www.justice.gov/opa/pr/justice-department-announces-court-authorized-action-disrupt-illicit-revenue-generation)\n\n7. [https://cloud.google.com/blog/topics/threat-intelligence/north-korea-cyber-structure-alignment-2023](https://cloud.google.com/blog/topics/threat-intelligence/north-korea-cyber-structure-alignment-2023)\n\n8. [https://www.chainalysis.com/blog/2024-crypto-crime-report-introduction/](https://www.chainalysis.com/blog/2024-crypto-crime-report-introduction/)\n\n9. [https://cloud.google.com/blog/topics/threat-intelligence/unc3944-sms-phishing-sim-swapping-ransomware](https://cloud.google.com/blog/topics/threat-intelligence/unc3944-sms-phishing-sim-swapping-ransomware)\n\n10. [https://cloud.google.com/blog/topics/threat-intelligence/apt29-evolving-diplomatic-phishing](https://cloud.google.com/blog/topics/threat-intelligence/apt29-evolving-diplomatic-phishing)\n\n11. [https://cloud.google.com/blog/topics/threat-intelligence/unc4841-post-barracuda-zero-day-remediation](https://cloud.google.com/blog/topics/threat-intelligence/unc4841-post-barracuda-zero-day-remediation)\n\n12. [https://cloud.google.com/blog/topics/threat-intelligence/how-mandiant-tracks-uncategorized-threat-actors](https://cloud.google.com/blog/topics/threat-intelligence/how-mandiant-tracks-uncategorized-threat-actors)\n\n13. [https://cloud.google.com/blog/topics/threat-intelligence/apt43-north-korea-cybercrime-espionage](https://cloud.google.com/blog/topics/threat-intelligence/apt43-north-korea-cybercrime-espionage)\n\n14. [https://www.justice.gov/opa/pr/justice-department-disrupts-prolific-alphvblackcat-ransomware-variant](https://www.justice.gov/opa/pr/justice-department-disrupts-prolific-alphvblackcat-ransomware-variant)\n\n15. [https://www.justice.gov/usao-nj/pr/russian-national-charged-conspiring-commit-lockbit-ransomware-attacks-against-us-and](https://www.justice.gov/usao-nj/pr/russian-national-charged-conspiring-commit-lockbit-ransomware-attacks-against-us-and)\n\n16. [https://www.europol.europa.eu/media-press/newsroom/news/law-enforcement-disrupt-worlds-biggest-ransomware-operation](https://www.europol.europa.eu/media-press/newsroom/news/law-enforcement-disrupt-worlds-biggest-ransomware-operation)\n\n17. [https://cloud.google.com/blog/products/identity-security/attacker-visibility-threat-campaigns](https://cloud.google.com/blog/products/identity-security/attacker-visibility-threat-campaigns)\n\n18. [https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft](https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft)\n\n19. [https://www.progress.com/security/MOVEit-transfer-and-MOVEit-cloud-vulnerability](https://www.progress.com/security/MOVEit-transfer-and-MOVEit-cloud-vulnerability)\n\n20. [https://cloud.google.com/blog/products/identity-security/cloud-ciso-perspectives-late-june-2023](https://cloud.google.com/blog/products/identity-security/cloud-ciso-perspectives-late-june-2023)\n\n21. [https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft](https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft)\n\n22. [https://cloud.google.com/blog/topics/threat-intelligence/unc4841-post-barracuda-zero-day-remediation](https://cloud.google.com/blog/topics/threat-intelligence/unc4841-post-barracuda-zero-day-remediation)\n\n23. [https://www.fbi.gov/news/stories/fbi-partners-dismantle-qakbot-infrastructure-in-multinational-cyber-takedown](https://www.fbi.gov/news/stories/fbi-partners-dismantle-qakbot-infrastructure-in-multinational-cyber-takedown)\n\n24. [https://cloud.google.com/blog/topics/threat-intelligence/gru-disruptive-playbook](https://cloud.google.com/blog/topics/threat-intelligence/gru-disruptive-playbook)\n\n25. [https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft](https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft)\n\n26. [https://services.google.com/fh/files/misc/barracuda-esg-rpt-en.pdf](https://services.google.com/fh/files/misc/barracuda-esg-rpt-en.pdf)\n\n27. [https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft](https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft)\n\n28. [https://cloud.google.com/blog/topics/threat-intelligence/barracuda-esg-exploited-globally](https://cloud.google.com/blog/topics/threat-intelligence/barracuda-esg-exploited-globally)\n\n29. [https://cloud.google.com/blog/topics/threat-intelligence/putting-model-work-enabling-defenders-vulnerability-intelligence-](https://cloud.google.com/blog/topics/threat-intelligence/putting-model-work-enabling-defenders-vulnerability-intelligence-intelligence-vulnerability-management-part-four)\n\n[intelligence-vulnerability-management-part-four](https://cloud.google.com/blog/topics/threat-intelligence/putting-model-work-enabling-defenders-vulnerability-intelligence-intelligence-vulnerability-management-part-four)\n\n30. [https://www.microsoft.com/en-us/security/blog/2023/08/02/midnight-blizzard-conducts-targeted-social-engineering-over-microsoft-](https://www.microsoft.com/en-us/security/blog/2023/08/02/midnight-blizzard-conducts-targeted-social-)\n\n[teams/](https://www.microsoft.com/en-us/security/blog/2023/08/02/midnight-blizzard-conducts-targeted-social-)\n\n31. [https://cloud.google.com/blog/topics/threat-intelligence/unc3944-sms-phishing-sim-swapping-ransomware](https://cloud.google.com/blog/topics/threat-intelligence/unc3944-sms-phishing-sim-swapping-ransomware)\n\n32. [https://cloud.google.com/blog/topics/threat-intelligence/sim-swapping-abuse-azure-serial](https://cloud.google.com/blog/topics/threat-intelligence/sim-swapping-abuse-azure-serial)\n\n\n-----\n\n33. [https://cloud.google.com/blog/topics/threat-intelligence/unc3944-sms-phishing-sim-swapping-ransomware](https://cloud.google.com/blog/topics/threat-intelligence/unc3944-sms-phishing-sim-swapping-ransomware)\n\n34. [https://cloud.google.com/blog/topics/threat-intelligence/unc3944-sms-phishing-sim-swapping-ransomware](https://cloud.google.com/blog/topics/threat-intelligence/unc3944-sms-phishing-sim-swapping-ransomware)\n\n35. [https://blog.google/technology/safety-security/googles-ai-red-team-the-ethical-hackers-making-ai-safer/](https://blog.google/technology/safety-security/googles-ai-red-team-the-ethical-hackers-making-ai-safer)\n\n36. [https://cloud.google.com/blog/topics/healthcare-life-sciences/introducing-medlm-for-the-healthcare-industry](https://cloud.google.com/blog/topics/healthcare-life-sciences/introducing-medlm-for-the-healthcare-industry)\n\n37. [https://cloud.google.com/blog/products/ai-machine-learning/gemini-for-google-cloud-is-here](https://cloud.google.com/blog/products/ai-machine-learning/gemini-for-google-cloud-is-here)\n\n38. [https://cloud.google.com/blog/topics/threat-intelligence/threat-actors-generative-ai-limited](https://cloud.google.com/blog/topics/threat-intelligence/threat-actors-generative-ai-limited)\n\n\n-----\n\n[For more information, visit cloud.google.com.](http://cloud.google.com)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/misc/m-trends-2024.pdf"
    ],
    "report_names": [
        "m-trends-2024.pdf"
    ],
    "threat_actors": [
        {
            "id": "7a2dd0e8-beea-415c-b90d-4df9da8358ae",
            "created_at": "2024-09-20T02:00:04.575485Z",
            "updated_at": "2025-03-27T02:00:03.414386Z",
            "deleted_at": null,
            "main_name": "UNC2970",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2970",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1f3cf3d1-4764-4158-a216-dd6352e671bb",
            "created_at": "2022-10-25T15:50:23.837615Z",
            "updated_at": "2025-03-27T02:00:55.556414Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "APT19",
                "Codoso",
                "C0d0so0",
                "Codoso Team",
                "Sunshop Group"
            ],
            "source_name": "MITRE:APT19",
            "tools": [
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "575d8adf-f451-4110-b1c0-89fb463e99c0",
            "created_at": "2022-10-25T16:07:23.637493Z",
            "updated_at": "2025-03-27T02:02:09.900204Z",
            "deleted_at": null,
            "main_name": "FIN13",
            "aliases": [],
            "source_name": "ETDA:FIN13",
            "tools": [
                "BLUEAGAVE",
                "BUSTEDPIPE",
                "CLOSEWATCH",
                "GetUserSPNS.vbs",
                "GoBot2",
                "HOTLANE",
                "JSPRAT",
                "MAILSLOT",
                "PowerSploit",
                "ProcDump",
                "SHELLSWEEP",
                "SIXPACK",
                "SPINOFF",
                "SWEARJAR",
                "Tiny SHell",
                "nmap",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a2d3f35f-3b29-4509-bff5-af2638140d39",
            "created_at": "2022-10-25T16:07:23.633982Z",
            "updated_at": "2025-03-27T02:02:09.898653Z",
            "deleted_at": null,
            "main_name": "FIN12",
            "aliases": [],
            "source_name": "ETDA:FIN12",
            "tools": [
                "Agentemis",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "KEGTAP",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6728f306-6259-4e7d-a4ea-59586d90a47d",
            "created_at": "2023-01-06T13:46:39.175292Z",
            "updated_at": "2025-03-27T02:00:03.013291Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "TEMP.Warlock",
                "UNC902"
            ],
            "source_name": "MISPGALAXY:FIN11",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7aa1288a-61ec-4793-b543-9fedc26b9b03",
            "created_at": "2023-11-01T02:01:06.805323Z",
            "updated_at": "2025-03-27T02:00:55.555589Z",
            "deleted_at": null,
            "main_name": "FIN13",
            "aliases": [
                "FIN13",
                "Elephant Beetle"
            ],
            "source_name": "MITRE:FIN13",
            "tools": [
                "Impacket",
                "Mimikatz",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2c3c22a-b3db-4d4a-9a5a-76bfe6171843",
            "created_at": "2023-11-21T02:00:07.315543Z",
            "updated_at": "2025-03-27T02:00:03.237322Z",
            "deleted_at": null,
            "main_name": "UNC4841",
            "aliases": [
                "SLIME57"
            ],
            "source_name": "MISPGALAXY:UNC4841",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c306e698-3b48-46d7-b571-3dfa0c828379",
            "created_at": "2023-05-16T02:02:09.957677Z",
            "updated_at": "2025-03-27T02:00:03.129777Z",
            "deleted_at": null,
            "main_name": "APT43",
            "aliases": [],
            "source_name": "MISPGALAXY:APT43",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1c91699d-77d3-4ad7-9857-9f9196ac1e37",
            "created_at": "2023-11-04T02:00:07.663664Z",
            "updated_at": "2025-03-27T02:00:03.15027Z",
            "deleted_at": null,
            "main_name": "UNC3886",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC3886",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e265bb3a-eb4c-4999-9b1d-c24a0d05a7f0",
            "created_at": "2023-12-21T02:00:06.096716Z",
            "updated_at": "2025-03-27T02:00:03.27337Z",
            "deleted_at": null,
            "main_name": "UNC4736",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC4736",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3b908de-3dd1-4e5d-ba24-5af8217371f0",
            "created_at": "2023-10-03T02:00:08.510742Z",
            "updated_at": "2025-03-27T02:00:03.139677Z",
            "deleted_at": null,
            "main_name": "Scattered Spider",
            "aliases": [
                "Scatter Swine",
                "Storm-0971",
                "UNC3944",
                "Scattered Swine",
                "Octo Tempest",
                "0ktapus",
                "DEV-0971",
                "Starfraud",
                "Muddled Libra",
                "Oktapus"
            ],
            "source_name": "MISPGALAXY:Scattered Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0fc739cf-0b82-48bf-9f7d-398a200b59b5",
            "created_at": "2022-10-25T16:07:23.797925Z",
            "updated_at": "2025-03-27T02:02:09.983353Z",
            "deleted_at": null,
            "main_name": "LockBit Gang",
            "aliases": [
                "Bitwise Spider",
                "Operation Cronos"
            ],
            "source_name": "ETDA:LockBit Gang",
            "tools": [
                "3AM",
                "ABCD Ransomware",
                "CrackMapExec",
                "EmPyre",
                "EmpireProject",
                "LockBit",
                "LockBit Black",
                "Mimikatz",
                "PowerShell Empire",
                "PsExec",
                "Syrphid"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "16f2436b-5f84-44e3-a306-f1f9e92f7bea",
            "created_at": "2023-01-06T13:46:38.745572Z",
            "updated_at": "2025-03-27T02:00:02.907444Z",
            "deleted_at": null,
            "main_name": "APT40",
            "aliases": [
                "ISLANDDREAMS",
                "TEMP.Jumper",
                "BRONZE MOHAWK",
                "GADOLINIUM",
                "KRYPTONITE PANDA",
                "TA423",
                "MUDCARP",
                "Gingham Typhoon",
                "TEMP.Periscope",
                "G0065",
                "ATK29",
                "Red Ladon",
                "ITG09"
            ],
            "source_name": "MISPGALAXY:APT40",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "59be3740-c8c7-47aa-84c8-e80d0cb7ea3a",
            "created_at": "2022-10-25T15:50:23.481057Z",
            "updated_at": "2025-03-27T02:00:55.480695Z",
            "deleted_at": null,
            "main_name": "Leviathan",
            "aliases": [
                "MUDCARP",
                "Kryptonite Panda",
                "Gadolinium",
                "BRONZE MOHAWK",
                "TEMP.Jumper",
                "APT40",
                "TEMP.Periscope",
                "Gingham Typhoon"
            ],
            "source_name": "MITRE:Leviathan",
            "tools": [
                "Windows Credential Editor",
                "BITSAdmin",
                "HOMEFRY",
                "Derusbi",
                "at",
                "BLACKCOFFEE",
                "BADFLICK",
                "gh0st RAT",
                "PowerSploit",
                "MURKYTOP",
                "NanHaiShu",
                "Orz",
                "Cobalt Strike",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f53f4b13-b055-426f-876a-18cf9a0f4fa0",
            "created_at": "2024-05-01T02:03:08.129377Z",
            "updated_at": "2025-03-27T02:05:17.412789Z",
            "deleted_at": null,
            "main_name": "MOONSCAPE",
            "aliases": [
                "UAC-0051 ",
                "UNC1151 ",
                "TA445 "
            ],
            "source_name": "Secureworks:MOONSCAPE",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e424a2db-0f5a-4ee5-96d2-5ab16f1f3824",
            "created_at": "2024-06-19T02:03:08.062614Z",
            "updated_at": "2025-03-27T02:05:17.373121Z",
            "deleted_at": null,
            "main_name": "GOLD HARVEST",
            "aliases": [
                "Scatter Swine ",
                "Scattered Spider ",
                "UNC3944 ",
                "Roasted 0ktapus "
            ],
            "source_name": "Secureworks:GOLD HARVEST",
            "tools": [
                " ConnectWise Control",
                " LogMeIn",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a08d93aa-41e4-4eca-a0fd-002d051a2c2d",
            "created_at": "2024-08-28T02:02:09.711951Z",
            "updated_at": "2025-03-27T02:02:10.193557Z",
            "deleted_at": null,
            "main_name": "UNC3886",
            "aliases": [],
            "source_name": "ETDA:UNC3886",
            "tools": [
                "BOLDMOVE",
                "CASTLETAP",
                "LOOKOVER",
                "MOPSLED",
                "RIFLESPINE",
                "TABLEFLIP",
                "THINCRUST",
                "Tiny SHell",
                "VIRTUALGATE",
                "VIRTUALPIE",
                "VIRTUALPITA",
                "VIRTUALSHINE",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "908cf62e-45cd-492b-bf12-d0902e12fece",
            "created_at": "2024-08-20T02:00:04.543947Z",
            "updated_at": "2025-03-27T02:00:03.40876Z",
            "deleted_at": null,
            "main_name": "UNC4393",
            "aliases": [
                "CURLY SPIDER",
                "STAC5777",
                "Storm-1811"
            ],
            "source_name": "MISPGALAXY:UNC4393",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1db21349-11d6-4e57-805c-fb1e23a8acab",
            "created_at": "2022-10-25T16:07:23.630365Z",
            "updated_at": "2025-03-27T02:02:09.897138Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "DEV-0950",
                "Lace Tempest",
                "Operation Cyclone"
            ],
            "source_name": "ETDA:FIN11",
            "tools": [
                "AZORult",
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "BLUESTEAL",
                "Cl0p",
                "EMASTEAL",
                "FLOWERPIPE",
                "FORKBEARD",
                "FRIENDSPEAK",
                "FlawedAmmyy",
                "GazGolder",
                "Get2",
                "GetandGo",
                "JESTBOT",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MINEDOOR",
                "MIXLABEL",
                "Meterpreter",
                "NAILGUN",
                "POPFLASH",
                "PuffStealer",
                "Rultazo",
                "SALTLICK",
                "SCRAPMINT",
                "SHORTBENCH",
                "SLOWROLL",
                "SPOONBEARD",
                "TiniMet",
                "TinyMet",
                "VIDAR",
                "Vidar Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e9f7f836-b77f-4f95-aa02-9e99d32faf1d",
            "created_at": "2024-12-21T02:00:02.857057Z",
            "updated_at": "2025-03-27T02:00:03.472472Z",
            "deleted_at": null,
            "main_name": "UNC2465",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2465",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f57e32ac-9f90-471d-93ba-7f6d8b05e6c1",
            "created_at": "2023-01-06T13:46:39.29882Z",
            "updated_at": "2025-03-27T02:00:03.044264Z",
            "deleted_at": null,
            "main_name": "FIN13",
            "aliases": [
                "TG2003",
                "Elephant Beetle"
            ],
            "source_name": "MISPGALAXY:FIN13",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d093e8d9-b093-47b8-a988-2a5cbf3ccec9",
            "created_at": "2023-10-14T02:03:13.99057Z",
            "updated_at": "2025-03-27T02:02:09.728121Z",
            "deleted_at": null,
            "main_name": "Scattered Spider",
            "aliases": [
                "0ktapus",
                "LUCR-3",
                "Muddled Libra",
                "Octo Tempest",
                "Scatter Swine",
                "Scattered Spider",
                "Star Fraud",
                "Storm-0875",
                "UNC3944"
            ],
            "source_name": "ETDA:Scattered Spider",
            "tools": [
                "ADRecon",
                "AnyDesk",
                "ConnectWise",
                "DCSync",
                "FiveTran",
                "FleetDeck",
                "Govmomi",
                "Hekatomb",
                "Impacket",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "Lumma Stealer",
                "LummaC2",
                "Mimikatz",
                "Ngrok",
                "PingCastle",
                "ProcDump",
                "PsExec",
                "Pulseway",
                "Pure Storage FlashArray",
                "Pure Storage FlashArray PowerShell SDK",
                "RedLine Stealer",
                "Rsocx",
                "RustDesk",
                "ScreenConnect",
                "SharpHound",
                "Socat",
                "Spidey Bot",
                "Splashtop",
                "Stealc",
                "TacticalRMM",
                "Tailscale",
                "TightVNC",
                "VIDAR",
                "Vidar Stealer",
                "WinRAR",
                "WsTunnel",
                "gosecretsdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "83025f5e-302e-46b0-baf6-650a4d313dfc",
            "created_at": "2024-05-01T02:03:07.971863Z",
            "updated_at": "2025-03-27T02:05:17.278721Z",
            "deleted_at": null,
            "main_name": "BRONZE MOHAWK",
            "aliases": [
                "Flaccid Rose ",
                "GADOLINIUM ",
                "Kryptonite Panda ",
                "Leviathan ",
                "Nanhaishu ",
                "Pickleworm ",
                "Temp.Jumper ",
                "Temp.Periscope ",
                "APT40 "
            ],
            "source_name": "Secureworks:BRONZE MOHAWK",
            "tools": [
                " BlackCoffee",
                " China Chopper",
                " Cobalt Strike",
                " Derusbi",
                " Derusbi Trojan",
                " FUSIONBLAZE",
                " GreenCrash",
                " HOMEFRY",
                " MURKYTOP",
                " Metasploit",
                " Metasploit / Meterpreter",
                " Nanhaishu",
                " Orz",
                " ScanBox",
                " SeDll",
                "AIRBREAK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1741053810,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1713794670,
    "ts_modification_date": 1713794673,
    "files": {
        "pdf": "https://archive.orkl.eu/99413f03171db34e715c6c04b5644af977996e87.pdf",
        "text": "https://archive.orkl.eu/99413f03171db34e715c6c04b5644af977996e87.txt",
        "img": "https://archive.orkl.eu/99413f03171db34e715c6c04b5644af977996e87.jpg"
    }
}