{
    "id": "f313c997-4407-450e-b4ac-41b31badf1e4",
    "created_at": "2023-01-12T15:09:39.950425Z",
    "updated_at": "2025-03-27T02:06:13.934432Z",
    "deleted_at": null,
    "sha1_hash": "2503db952c9b932b07daed6ad5b9dc346b5d5734",
    "title": "2016-10-01 - Source Code for IoT Botnet ‘Mirai’ Released",
    "authors": "",
    "file_creation_date": "2022-05-28T04:09:26Z",
    "file_modification_date": "2022-05-28T04:09:26Z",
    "file_size": 150450,
    "plain_text": "# Source Code for IoT Botnet ‘Mirai’ Released\n\n**[krebsonsecurity.com/2016/10/source-code-for-iot-botnet-mirai-released/](https://krebsonsecurity.com/2016/10/source-code-for-iot-botnet-mirai-released/)**\n\nThe source code that powers the “Internet of Things” (IoT) botnet responsible for launching\nthe [historically large distributed denial-of-service (DDoS) attack against KrebsOnSecurity last](https://krebsonsecurity.com/2016/09/krebsonsecurity-hit-with-record-ddos/)\nmonth has been publicly released, virtually guaranteeing that the Internet will soon be\nflooded with attacks from many new botnets powered by insecure routers, IP cameras, digital\nvideo recorders and other easily hackable devices.\n\nThe leak of the source code was announced Friday on the English-language\n[hacking community Hackforums. The malware, dubbed “Mirai,” spreads to vulnerable](http://krebsonsecurity.com/?s=hackforums&x=0&y=0)\ndevices by continuously scanning the Internet for IoT systems protected by factory default or\nhard-coded usernames and passwords.\n\nThe Hackforums post that includes links to the Mirai source code.\n\nVulnerable devices are then seeded with malicious software that turns them into “bots,”\nforcing them to report to a central control server that can be used as a staging ground for\nlaunching powerful DDoS attacks designed to knock Web sites offline.\n\nThe Hackforums user who released the code, using the nickname “Anna-senpai,” told forum\nmembers the source code was being released in response to increased scrutiny from the\nsecurity industry.\n\n“When I first go in DDoS industry, I wasn’t planning on staying in it long,” Anna-senpai wrote.\n“I made my money, there’s lots of eyes looking at IOT now, so it’s time to [GTFO [link](http://www.urbandictionary.com/define.php?term=GTFO)\nadded]. So today, I have an amazing release for you. With Mirai, I usually pull max 380k bots\nfrom telnet alone. However, after the Kreb [sic] DDoS, ISPs been slowly shutting down and\ncleaning up their act. Today, max pull is about 300k bots, and dropping.”\n\n\n-----\n\nSources tell KrebsOnSecurity that Mirai is one of at least two malware families that are\ncurrently being used to quickly assemble very large IoT-based DDoS armies. The other\ndominant strain of IoT malware, dubbed “Bashlight,” functions similarly to Mirai in that it also\ninfects systems via default usernames and passwords on IoT devices.\n\nAccording to research from security firm Level3 Communications, the Bashlight botnet\ncurrently is responsible for enslaving nearly a million IoT devices and is in direct competition\nwith botnets based on Mirai.\n\n“Both [are] going after the same IoT device exposure and, in a lot of cases, the same\ndevices,” said Dale Drew, Level3’s chief security officer.\n\nInfected systems can be cleaned up by simply rebooting them — thus wiping the malicious\ncode from memory. But experts say there is so much constant scanning going on for\nvulnerable systems that vulnerable IoT devices can be re-infected within minutes of a reboot.\nOnly changing the default password protects them from rapidly being reinfected on reboot.\n\nIn the days since the record 620 Gbps DDoS on KrebsOnSecurity.com, this author has been\nable to confirm that the attack was launched by a Mirai botnet. As I wrote last month,\npreliminary analysis of the attack traffic suggested that perhaps the biggest chunk of the\n[attack came in the form of traffic designed to look like it was generic routing encapsulation](https://www.incapsula.com/blog/what-is-gre-tunnel.html)\n(GRE) data packets, a communication protocol used to establish a direct, point-to-point\nconnection between network nodes. GRE lets two peers share data they wouldn’t be able to\nshare over the public network itself.\n\nOne security expert who asked to remain anonymous said he examined the Mirai source\ncode following its publication online and confirmed that it includes a section responsible for\ncoordinating GRE attacks.\n\nIt’s an open question why anna-senpai released the source code for Mirai, but it’s unlikely to\nhave been an altruistic gesture: Miscreants who develop malicious software often dump their\nsource code publicly when law enforcement investigators and security firms start sniffing\naround a little too close to home. Publishing the code online for all to see and download\nensures that the code’s original authors aren’t the only ones found possessing it if and when\nthe authorities come knocking with search warrants.\n\nMy guess is that (if it’s not already happening) there will soon be many Internet users\ncomplaining to their ISPs about slow Internet speeds as a result of hacked IoT devices on\ntheir network hogging all the bandwidth. On the bright side, if that happens it may help to\nlessen the number of vulnerable systems.\n\nOn the not-so-cheerful side, there are plenty of new, default-insecure IoT devices being\nplugged into the Internet each day. Gartner Inc. [forecasts that 6.4 billion connected things](http://www.gartner.com/newsroom/id/3165317)\nwill be in use worldwide in 2016, up 30 percent from 2015, and will reach 20.8 billion by\n2020 In 2016 5 5 million new things will get connected each day Gartner estimates\n\n\n-----\n\nFor more on what we can and must do about the dawning IoT nightmare, see the second\nhalf of this week’s story, [The Democratization of Censorship. In the meantime,](https://krebsonsecurity.com/2016/09/the-democratization-of-censorship/) [this post from](https://blog.sucuri.net/2016/09/iot-home-router-botnet-leveraged-in-large-ddos-attack.html)\n**Sucuri Inc. points to some of the hardware makers whose default-insecure products are**\npowering this IoT mess.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-10-01 - Source Code for IoT Botnet ‘Mirai’ Released.pdf"
    ],
    "report_names": [
        "2016-10-01 - Source Code for IoT Botnet ‘Mirai’ Released.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536179,
    "ts_updated_at": 1743041173,
    "ts_creation_date": 1653710966,
    "ts_modification_date": 1653710966,
    "files": {
        "pdf": "https://archive.orkl.eu/2503db952c9b932b07daed6ad5b9dc346b5d5734.pdf",
        "text": "https://archive.orkl.eu/2503db952c9b932b07daed6ad5b9dc346b5d5734.txt",
        "img": "https://archive.orkl.eu/2503db952c9b932b07daed6ad5b9dc346b5d5734.jpg"
    }
}