{
    "id": "f319c5f7-7293-4eac-b541-83760433d66a",
    "created_at": "2023-01-12T15:10:49.609281Z",
    "updated_at": "2025-03-27T02:16:26.296006Z",
    "deleted_at": null,
    "sha1_hash": "54955967f43f33758dfebeb297ccf9d52e085dcc",
    "title": "2021-12-16 - Phorpiex botnet is back with a new Twizt- Hijacking Hundreds of crypto transactions",
    "authors": "",
    "file_creation_date": "2022-05-27T22:00:51Z",
    "file_modification_date": "2022-05-27T22:00:51Z",
    "file_size": 1017764,
    "plain_text": "# Phorpiex botnet is back with a new Twizt: Hijacking Hundreds of crypto transactions\n\n**[research.checkpoint.com/2021/phorpiex-botnet-is-back-with-a-new-twizt-hijacking-hundreds-of-crypto-transactions/](https://research.checkpoint.com/2021/phorpiex-botnet-is-back-with-a-new-twizt-hijacking-hundreds-of-crypto-transactions/)**\n\nDecember 16, 2021\n\nDecember 16, 2021\n_Research by: Alexey Bukhteyev_\n\nCheck Point Research (CPR) spotted the resurgence of Phorpiex, an old threat known\nfor its [sextortion spam campaigns, crypto-jacking, cryptocurrency clipping and](https://research.checkpoint.com/2019/in-the-footsteps-of-a-sextortion-campaign/)\nransomware spread\nThe new variant “Twizt” enables the botnet to operate successfully without active C&C\nservers\nPhorpiex crypto-clipper supports more than 30 wallets for different blockchains\nIn one year, Phorpiex bots hijacked 969 transactions and stole 3.64 Bitcoin, 55.87\nEther, and $55,000 in ERC20 tokens accounting for almost half a million in US dollars\n\n## Background\n\nPhorpiex, an old threat known since 2016, was initially known as a botnet that operated\nusing [IRC protocol (also known as Trik). In 2018-2019 Phorpiex switched to modular](https://en.wikipedia.org/wiki/Internet_Relay_Chat)\n[architecture and the IRC bot was replaced with Tldr – a loader controlled through HTTP that](https://research.checkpoint.com/2020/phorpiex-arsenal-part-I/)\n\n\n-----\n\n[became a key part of the Phorpiex botnet infrastructure. In our 2019 Phorpiex Breakdown](https://research.checkpoint.com/2019/phorpiex-breakdown/)\nresearch report, we estimated over 1,000,000 computers were infected with Tldr.\n\n[Phorpiex is mostly known for its massive sextortion spam campaigns, crypto-jacking](https://research.checkpoint.com/2019/in-the-footsteps-of-a-sextortion-campaign/https:/research.checkpoint.com/2019/in-the-footsteps-of-a-sextortion-campaign/)\n(cryptocurrency mining infected machines), spreading ransomware, and cryptocurrency\nclipping. In the summer of 2021, the activity of Phorpiex command and control servers (C&C)\ndropped sharply. The C&C servers were shut down in July, and there was no activity for\n[about two months. On August 27 an announcement was spotted on an underground forum,](https://therecord.media/phorpiex-botnet-shuts-down-source-code-goes-up-for-sale/)\nallegedly from the botnet owners, that stated they were going out of business and sold off the\nsource code.\n\n_Figure 1 – Phorpiex botnet sale announcement_\n\nFrom this announcement, we can hypothesize that the botnet was developed and controlled\nby two individuals. We don’t know if the botnet was actually sold. However, less than two\nweeks later, the C&C servers were back online at another IP address (185.215.113.66) of the\nsame sub-network and later switched to 185.215.113.84:\n\n_Figure 2 – Phorpiex C&C server IP addresses_\n\n\n-----\n\nSimultaneously, the C&C servers started distributing a bot that had never seen before. It was\ncalled “Twizt” and enables the botnet to operate successfully without active C&C servers,\nsince it can operate in peer-to-peer mode. This means that each of the infected computers\ncan act as a server and send commands to other bots in a chain. As a really large number of\ncomputers are connected to the Internet through NAT routers and don’t have an external IP\n[address, the Twizt bot reconfigures home routers that support UPnP and sets up port](https://en.wikipedia.org/wiki/Universal_Plug_and_Play)\nmapping to receive incoming connections. The new bot uses its own binary protocol over\nTCP or UDP with two layers of RC4-encryption. It also verifies data integrity using RSA and\nRC6-256 hash function.\n\nThe emergence of such features suggests that the botnet may become even more stable\nand therefore, more dangerous.\n\n## Malware prevalence and targets\n\nIn our telemetry throughout the year, we saw an almost constant number of Phorpiex victims,\nwhich persisted even during periods of the C&C servers’ inactivity. The numbers began to\nincrease over the last 2 months. In 2021, Phorpiex bots were found in 96 countries. Most\nPhorpiex victims are located in Ethiopia, Nigeria and India:\n\n_Figure 3 – Phorpiex victims in 2021 grouped by country_\n\n## Thousands of victims, hundreds of thousands dollars lost\n\nAside of the new version of the bot, the methods of monetization have not changed. In our\nprevious research, we focused on sextortion campaigns and cryptocurrency mining. At that\ntime, Phorpiex’s revenues from crypto-clipping were not very significant.\n\nSo, what is crypto-clipping? Cryptocurrency clipping (or crypto-clipping) is stealing\ncryptocurrency during a transaction, by substituting the original wallet address saved in the\nclipboard with the attacker’s wallet address When we browse the Internet we use human\n\n-----\n\nreadable domain names that are easy to remember. However, in all popular blockchains\nthere are no analogues for domain names, and the addresses are too long to be typed\nmanually. For example, an address on Ethereum looks like this:\n\n**0x4f4b547309a9Ca52B154E19489cc9A3e3BD60dEf**\n\nTherefore, it’s common to use the clipboard to copy and paste such a long address. When\nthe victim of the crypto-clipper pastes the wallet address, they unknowingly paste the\nattacker’s address instead. With the growing popularity of blockchain technology,\ncryptocurrency clipping carries an increasing risk of large financial losses. Infostealers, and\nremote access Trojans rely on C&C servers to get commands and send stolen data. If a\nmalware implements the crypto-clipping functionality, it can work successfully without any\nC&C servers. Therefore, when the Phorpiex C&C servers go down there is no down time\nbecause hundreds of thousands of bots remain installed and continue to steal victims’\nmoney.\n\nShutting down the botnet’s command and control infrastructure and arresting its authors will\nnot protect those who are already infected with Phorpiex. Due to the nature of the blockchain\nthe stolen money cannot be returned if we do not know the private keys of the wallets used\nby the malware.\n\n## By The Numbers\n\nThe Phorpiex crypto-clipper supports over 30 wallets for different blockchains, including\nBitcoin, Ethereum, Dogecoin, Dash, Monero, and Zilliqa. We focused only on the most\npopular blockchains – Bitcoin and Ethereum.\n\nWe managed to find 60 unique Bitcoin wallets and 37 Ethereum wallets used by the\nPhorpiex crypto-clipper. Many wallets have been active for several years. An outstanding\nexample is the Bitcoin wallet 1DYwJZfyGy5DXaqXpgzuj8shRefxQ7jCEw that first\nappeared in 2018 in Phorpiex bots. The C&C servers for bots that use this wallet are offline.\nHowever, the bots are still active. The wallet received 11 Bitcoins in more than 500\ntransactions:\n\n_Figure 4 – One of Phorpiex Bitcoin wallets_\n\n\n-----\n\nIn a one-year period between November 2020 to November 2021, Phorpiex bots hijacked\n**969 transactions and stole 3.64 Bitcoin, 55.87 Ether, and $55,000 in ERC20 tokens. In**\n2021, the price of Bitcoin and Ethereum increased significantly. The value of the stolen\nassets in current prices is almost half a million US dollars.\n\nHowever, between April 2016 to November 2021, Phorpiex bots hijacked approximately 3000\ntransactions with a total value of approximately 38 Bitcoin, and 133 Ether.\n\n_Figure 5 – Number of Bitcoin and Ethereum transactions hijacked by Phorpiex bots per_\n_month over the time_\n\nThe total value of the stolen money could be even higher because we didn’t include other\nblockchains in our research.\n\nThe average stolen value in hijacked transactions is not very large and decreases when the\ncryptocurrency price rises. The following chart shows how the average amount hijacked\nchanges over time:\n\n\n-----\n\n_Figure 6 – Average hijacked Ethereum transaction_\n\nSeveral times Phorpiex was able to hijack large amounts transactions. The largest amount\nfor an intercepted Ethereum transaction was 26 ETH:\n\n_Figure 7 – The largest hijacked Ethereum transaction._\n\nIn some cases, users tried to send cryptocurrency multiple times but ended up sending it to\nthe cybercriminals’ wallet instead.\n\n## Phorpiex Twizt technical details\n\nTwizt got its name from the mutex used by the first bot that appeared in the wild:\n\n_Figure 8 – New bot uses the mutex name “TWiZT”_\n\nWe do not describe the initialization steps and persistence methods here because they are\n[almost the same as those used in the Tldr bot. We’ll focus on the distinctive features of the](https://research.checkpoint.com/2020/phorpiex-arsenal-part-i/)\nnew bot.\n\n**Locale checks**\n\nSome recent samples of the bot (MD5: ec96bcc50ca8fa91821e820fdfe30915) check for the\nuser’s default locale. The bot does not execute if the user’s default locale abbreviation is\n“UKR” (Ukraine).\n\n_Figure 9 – Twizt bot checks user’s default locale_\n\n\n-----\n\nThis may be a sign that the botnet operators are from the Ukraine, as usually cybercriminals\navoid distributing malware in their country of origin.\n\n### Router reconfiguring using UPnP\n\n[The malware uses SSDP to discover gateway devices in the local network of the targeted](https://en.wikipedia.org/wiki/Simple_Service_Discovery_Protocol)\ncomputer. It sends an “M-SEARCH” request to 239.255.255.250:1900 through UDP\ntransport\n\n_Figure 10 – Twizt bot discovers gateway devices in the local network using SSDP_\n\nIf the targeted computer is connected to the Internet using a router with UPnP enabled, the\nresponse contains its IP address within the local network. For example:\n```\nHTTP/1.1 200 OK\nCACHE-CONTROL: max-age=120\nST: urn:schemas-upnp-org:device:InternetGatewayDevice:1\nUSN: uuid:17271680-1dd2-11b2-b1be-283b822841ed::urn:schemas-upnporg:device:InternetGatewayDevice:1\nEXT:\nSERVER: D-Link/Russia UPnP/1.1 MiniUPnPd/1.8\nLOCATION: http ://192.168.0.1:50680/rootDesc.xml\nOPT: \"http ://schemas.upnp.org/upnp/1/0/\"; ns=01\n01-NLS: 1\nBOOTID.UPNP.ORG: 1\nCONFIGID.UPNP.ORG: 1337\n\n```\nThe malware queries the local router using the supplied URL and parses the XML response.\nIt searches for one of these services:\n\nurn:schemas-upnp-org:service:WANIPConnection:1\nurn:schemas-upnp-org:service:WANPPPConnection:1\n\nand extracts the “controlURL”:\n\n\n-----\n\n```\n<service>\n  <serviceType>urn:schemas-upnp-org:service:WANIPConnection:1</serviceType>\n  <serviceId>urn:upnp-org:serviceId:WANIPConn1</serviceId>\n  <SCPDURL>/igd_wic.xml</SCPDURL>\n  <controlURL>http ://192.168.0.1:50680/upnp/control?WANIPConnection</controlURL>\n  <eventSubURL>http ://192.168.0.1:50680/upnp/event?WANIPConnection</eventSubURL>\n</service>\n\n```\nThe “controlURL” is then used to add UDP and TCP port mapping for the port used by the\nmalware (we observed ports 48755, 40555, 40500):\n\n_Figure 11 – Template of the request sent to configure port mapping_\n\nIt enables the malware to receive incoming connections from other bots even if the infected\ncomputer is behind a NAT router.\n\n### Crypto-clipping\n\nCrypto-clipping is implemented differently than it was in [Tldr. The Twizt bot creates a](https://research.checkpoint.com/2020/phorpiex-arsenal-part-I/)\nmessage-only window (HWND_MESSAGE as the parent windows handle) with a random\nclassname. The clipboard swapping function is registered as a window procedure:\n\n\n-----\n\n_Figure 12 – Creating a message-only window_\n\nThe new malware version supports 35 types of wallets. Because of wide variation it has\nbecome more difficult to identify the corresponding crypto-currencies:\n\n\n-----\n\n_Figure 13 – List of cryptocurrency wallets used by Twizt_\n\nFrom the Phorpiex botnet sale announcement, we learned that the crypto-clipper supports\nthe following blockchains and services:\nLISK, POLKADOT, BITCOIN, WAVES, DASH, DOGECOIN, ETHEREUM, LITECOIN,\nRIPPLE, BITTORRENT, ZCASH, TEZOS, ICON, QTUM, RAVENCOIN, NEM, NEO,\nSMARTCASH, ZILLIQA, ZCASH PRIVATE, YCASH, BITCOIN CASH, COSMOS, MONERO,\nCARDANO, GROESTLCOIN, STELLAR, BITCOIN GOLD, BAND PROTOCOL, PERFECT\nMONEY USD, PERFECT MONEY EURO, PERFECT MONEY BTC.\n\n\n-----\n\n### Communication protocol\n\nThe Twizt bot communicates using its own binary protocol over TCP or UDP. The protocol\nallows it to connect to the C&C server as well as other infected machines and get commands\nfrom them if the main C&C server is unavailable. Early versions of the Twizt bot only had one\nhard-coded IP address for the C&C server.\n\nLater, the Twizt bot binary got an embedded list of IP-addresses for 512 nodes in its\nconfiguration. In addition, it still received the updated list of nodes from another node or from\nthe C&C server.The Twizt bot has the capability to exchange encrypted messages with other\nnodes.\n\n_Figure 14 – Twizt bot raw communication example_\n\nMessages use several layers of encryption for important data. Each encrypted message has\na very simple format:\n\nThe data is encrypted with the hard-coded key “twizt)”, which is the same in all the\nresearched samples. The decrypted message looks like this:\n\n_Figure 15 – Decrypted message from the bot_\n\nRegardless of the message direction, it has the following mandatory fields:\n\n**Murmurhash3 – The hash value is calculated for the entire decrypted message**\n(excluding the hash field itself). If the hash is invalid, the message is not processed by\nthe node.\n**Random number – This is likely added to make every message unique. If this field is**\nomitted, all encrypted messages that carry the same payload would also be the same,\nand could be easily detected as malicious traffic.\n**NodeA SID / NodeB SID – A local or remote node unique session identifier, generated**\nrandomly by the node.\n**Message Type – Determines the kind of payload carried by the message.**\n**Flag – Unknown, can be 0 or 1.**\n**Payload size – Cannot be less than 8.**\n\n\n-----\n\n**Payload – May have different lengths and formats and may vary depending on the**\n**Message Type field. The payload also includes a NodeA SID/NodeB SID field and the**\npayload data. The NodeB SID field may contain a local or remote node unique session\nidentifier. In the first request, this value is 0 (8 bytes). In other requests, it may take\nvalues provided by another node or can be set to this node SID depending on the\n**Message Type.**\n\nThese message types are supported:\n\n**00 00 00 00 – Beaconing message**\n**01 00 00 00 – Update node list**\n**02 00 00 00 – Node list update acknowledge**\n**03 00 00 00 – Download and execute**\n\n### Communication flow\n\nThe following diagram shows the communication flow between two nodes:\n\n_Figure 16 – Example of Twizt bots communication flow_\n\nIn the picture above, “Node A” represents a local node (client); “Node B” represents a\nremote node (server). After performing a full exchange cycle, the malware continues\ncommunication with the beaconing message.\n\n### Beaconing message (Node A -> Node B)\n\nCommunication starts with a beaconing message sent by the client (the node that initiates\nthe connection). This type of message has the following features:\n\n\n-----\n\n**NodeA SID – Set to a pre-generated random number.**\n**Message type – Equal to 0.**\n**Payload size – Is always 8.**\n\nThe payload contains the fields:\n\n**NodeB SID – Is 4 zero bytes.**\n**Payload data – Is 4 zero bytes.**\n\n_Figure 17 – Beaconing message example_\n\n### Update node list (Node B -> Node A)\n\nThe server in reply to the first valid beaconing message usually sends this message. In the\n**Update node list message:**\n\n**NodeA SID – Set to the value previously provided by the client**\n**Message type – Equal to 1**\n\nThe payload contains the fields:\n\n**NodeB SID – The number generated by the server**\n**Payoad data – Contains a list of nodes**\n**RSA trailer – 256-bytes RSA-encrypted trailer. Contains data that is not used by the**\nmalware in this message type.\n\n_Figure 18 – Example of updated node list message_\n\nThe payload data contains a list of 24-byte structures containing the node IP addresses. The\nlist is prepended by the number of nodes (0x10 in the example above) and 4 zero bytes.\nEvery entry in the list has the following format:\n\nThe Rank field shows how many seconds elapsed since the node was online. The nodes are\nsorted in ascending order of rank. The C&C server (or another node) sends the client the list\nof 16 nodes that were recently online.\n\n\n-----\n\nAfter sending this message, the remote host also sends a message with the code 0\n(beaconing message). However, the fields NodeA SID and NodeB SID swap places:\n\n_Figure 19 – Beaconing message sent after the Update node list message_\n\n### Node list update acknowledge (Node A -> Node B)\n\nAfter receiving the node list, the client sends the acknowledge message. Please note that\n**NodeB SID goes first in these messages.**\n\nIn the Node list update acknowledge message:\n\n**Message type – Equal to 2.**\n\n_Figure 20 – Update nodes acknowledge message example_\n\nThe client then sends the Update node list message that includes its list of the top active\nnodes:\n\n**Message type – Equal to 1.**\n\n_Figure 21 – Update node list message sent by the client_\n\nThis enables both the client and the server to exchange their lists of nodes.\n\n### Run command (Node B -> Node A)\n\nIn response to the Update node list message from the client, the server may send a\ncommand to download and run another executable file. NodeB SID goes first in this kind of a\nmessage.\n\n**Message type – Equal to 3.**\n**RSA-encrypted data – 256-bytes buffer that can be decrypted with the RSA public key**\nfrom the malware configuration. This buffer is equal to the RSA trailer from the Update\n**node list message. The buffer contains the RC4-key and the hash value required to**\nverify integrity and decrypt the command body with RC4-ecnrypted URLs.\n\n\n-----\n\n**RC4-encrypted URLs – Encrypted command body that contains one or several RC4-**\n**encrypted URLs to download the files to execute.**\n\n_Figure 22 – Example of run command message_\n\nThe RSA-encrypted data is decrypted using the RSA public key from the malware\nconfiguration. The decrypted data has the following format and contains the 20-byte length\n**RC4-key used to decrypt the command data (the URL for in this case), and the MD6-512**\nhash (64 bytes) of the RC4-encryted data. The rest of the data that follows the MD6 hash is\nnot used.\n\n_Figure 23 – RSA-decrypted content of the Run command message_\n\nThe “Unknown1” and “Unknown2” fields from the RSA-buffer have an unknown purpose\nthat are not used during the command parsing. The “Encrypted data length” field contains\nthe length of the RC4-encrypted data. After decrypting the RSA-buffer, we can also decrypt\nthe URL. The entire decryption flow is listed below:\n\n\n-----\n\n_Figure 24 – Decryption and integrity verification flow for the Run command message_\n\nWe can’t create the RSA-encrypted data, because we don’t have the private key. However, if\nwe extract the RC4-key from the RSA-encrypted data received from the C&C server, we can\nencrypt the fake URL using this key. The bot can successfully decrypt the fake URL, but the\ncommand will not be executed because it verifies the message integrity using the 64-byte\nMD6 hash value that is also stored in the RSA-encrypted data (see Figure 24).\n\nUsing the modified MD6-512 algorithm, Twizt calculates the 64-byte hash value from the\n**RC4-encrypted URLs (indicated by the red box in Figure 24) and compares it with the**\nreference value from the RSA-encrypted data. If the values are not equal, the command is\nnot executed.\n\n_Figure 25 – MD6 hash verification_\n\n\n-----\n\nAn early Twizt version supported only one URL. Newer versions of the Twizt bot support\nmultiple URLs in the following format:\n```\nd|http ://185.215.113[.]84/alfa_|http ://185.215.113[.]84/beta_\n\n```\nThe character “d” in the prefix likely means, “download”. At this moment, only the “download”\ncommand is supported:\n\n_Figure 26 – Parsing the decrypted command body_\n\n### Node list file\n\nAs Twizt is a peer-to-peer bot, it needs to store data about other known nodes and the\ncommands that it receives while distributing it further. When the malware receives an\nupdated list of nodes, it saves this list into a hidden configuration file “nodescfg.dat” located\nin the %userprofile% directory:\n\n_Figure 27 – Nodes configuration file path_\n\nThe node data is stored (not encrypted) in the 8-byte structures:\n\nThe “Last access timestamp” field is the number of seconds since 1980 to the moment\nwhen the node was last online. It’s obtained using the NtQuerySystemTime and\n**RtlTimeToSecondsSince1980:**\n\n_Figure 28 – Setting the last access timestamp for a node that is accessed successfully._\n\nHere is an example of the node list file content:\n\n\n-----\n\n_Figure 29 – Node list file format_\n\nThe file with the list of nodes is loaded when the malware is launched. In this way, the bot\nsaves a list of nodes for use after a reboot.\n\n### Command configuration file\n\nWhen the Twizt bot receives a command from the C&C server or another node, it saves the\ncommand to the file “cmdcfg.dat” located in the %userprofile% directory. The command is\nsaved in the same form as it was received from the server. Therefore, it includes the RSAencrypted header and the RC4-encrypted command data.\n\n_Figure 30 – Command configuration file format_\n\nWhen the malware acts as a server, it sends the data loaded from the command\nconfiguration file unchanged. This allows the bots to exchange the commands received from\nthe C&C server without having the RSA private key to sign the commands.\n\n## Downloader\n\nThere are two cases when Twizt bot can download additional payloads.\n\nThe first option is using a hard-coded base URL and a list of paths. Twizt consequently tries\nto download payloads using the resulting URLs. Twizt typically uses six paths. We observed\nthe following path combinations:\n\n**“a_”, “b_”, “c_”, “d_”, “e_”, “f”**\n\n**“alpha_”, “beta_”, “gamma_”, “delta_”, “epsilon_”, “zeta_”**\n\n**“1”, “2”, “3”, “4”, “5”, “6”**\n\n\n-----\n\nThe malware goes over the paths and checks them one by one appended to the base URL\n(“https://185[.]215.113.84/” and “https://185[.]215.113.84/twizt/” in the analyzed samples).\nThe delay between the checks is 1 second.The download attempts are performed in an\ninfinite loop in a separate thread. Twizt uses a long delay of 90 seconds between the\ndownload cycles:\n\n_Figure 31 – Downloading payloads from URLs stored in the sample_\n\nThe second case, when Twizt can download additional payloads, is when it receives the\ncorresponding command from the C&C server or another node. Before trying to download\nthe payload, the malware checks its size. The payload will not download if its size is less\nthan 5000 bytes.\n\nThe malware expects to receive an encrypted file, which is saved in the “%temp%” folder\nunder the name “%temp%\\{n1}{n2}.exe”, where {n1} and {n2} are random numbers\nbetween 10000 and 40000. Twizt uses the following User-agent header to download files:\n```\nMozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko)\nChrome/93.0.4577.82 Safari/537.36\n\n### Payload decryption\n\n```\nAfter the payload downloads, it is saved in the original encrypted form. The malware maps\nthe file data into the memory using CreateFileMapping/MapViewOfFile. The first 256 bytes\nof the file is the RSA encrypted header. The payload data is decrypted using the 16-bytes\nRC4 key from the header.\n\nLet’s consider the sample with MD5 hash “9fa3010c557db8477aec95587748dc82” contains\nthe following RSA public key:\n```\nN =\n0xa6e5d02b03a9d9613b9e5df849618cbdc20e8f208eb67d60b21977c3768d1b8ffa42314097a455ff94d9\nE = 0x010001\n\n```\nAfter communicating with the C&C server the bot downloaded a file with MD5 hash\n[“43750aaa981077dde08d61fe2b7d1578” from the URL “https://185[.]215.113.84/xgettin“.](https://www.virustotal.com/gui/file/925153aa196572af808ee0b2653aa2302c9ffafb4992732ccc2ed633285b2655)\n\n\n-----\n\nThe file starts with the RSA-encrypted header with a length of 256 bytes:\n\n_Figure 32 – Encrypted content of the file downloaded by Phorpiex_\n\nAfter decrypting the header using the RSA public key, it has a very simple format:\n\nWe can use the RC4 key from the header to decrypt the payload:\n\n\n-----\n\n_Figure 33 – Decryption of the file downloaded by Phorpiex_\n\nWhen the payload is prepared on the C&C server, the murmurhash3 128-bit value of the\nnon-encrypted payload is used as the RC4-key during the payload encryption. Twizt\ncalculates the murmurhash3 value of the decrypted payload and compares it with the RC4key. The malware executes the payload only if the values are the same:\n\n_Figure 34 – Integrity verification of the downloaded file_\n\n\n-----\n\n## Conclusion\n\nUntil recently, Phorpiex was not considered a sophisticated botnet. All of its modules were\nsimple and performed the minimal number of functions. Earlier versions of the Tldr module\ndid not use encryption for the payloads. However, this did not prevent the botnet from\nsuccessfully achieving its goals.\n\nMalware with the functionality of a worm or a virus can continue to spread autonomously for\na long time without any further involvement by its creators. However, in most cases the\ncreators need to use C&C servers to control the bots to be able to profit from the botnet. We\nshould note that for a botnet on the scale of Phorpiex, it is quite difficult to find reliable\nhosting that does not block the C&C server. The creators are further disadvantaged if the IP\naddresses of the C&C servers are added to deny-lists, thereby reducing the efficiency of\ncontrolling the botnet. Changing the IP address of the C&C server can be very difficult.\n\nThe Phorpiex botnet uses techniques that effectively achieve its goals without C&C servers.\nIn our report, we showed that a cryptocurrency clipping technique for a botnet of this scale\ncan generate significant profits (hundreds of thousands US dollars annually), and does not\nrequire any kind of management through C&C servers.\n\nIn the past year, Phorpiex received a significant update that transformed it into a peer-to-peer\nbotnet, allowing it to be managed without having a centralized infrastructure. The C&C\nservers can now change their IP addresses and issue commands, hiding among the botnet\nvictims.\n\n## Tips to stay safe\n\n1. When users copy and paste a crypto wallet address, always double check that the\n\noriginal and pasted addresses match.\n2. Before sending large amounts in crypto, first send a probe “test” transaction with\n\nminimal amount.\n3. Keep operating system updated, do not download software from unverified sources.\n4. Skip the ads. If you are looking for wallets or crypto trading and swapping platforms in\n\nthe crypto space, always look at the first website in your search and not in the ad.\nThese may mislead you as CPR has found scammers using **[Google Ads to steal](https://blog.checkpoint.com/2021/11/04/scammers-used-google-ads-to-steal-500k-worth-of-cryptocurrency/)**\n**crypto wallets.**\n5. Always double-check the URLs!\n\n## Check Point Protections\n\nCheck Point [Infinity is a unified security architecture that delivers real-time threat prevention](https://www.checkpoint.com/infinity-vision/zero-day-protection/)\nof both known and unknown threats, simultaneously protecting the network, cloud, endpoints\nand mobile and IoT devices, and provides protections against this threat.\n\n\n-----\n\n_Threat Emulation protections:_\n\n_Worm.Win.Phorpiex.gl.O_\n_Worm.Win.Phorpiex.ZF_\n\n_Anti-Bot protections:_\n\n_Worm.Win32.Phorpiex.C_\n\n_Worm.Win32.Phorpiex.D_\n\n_Worm.Win32.Phorpiex.H_\n\n## Appendix A: Indicators of Compromise\n\n**SHA256:**\n```\n4151d9af5a104eea9106b18d35102f3b11134d7ba598e1fd57580a932d4596fa\nd5516838dbec985f8e893bb145b364ee3f6060dec3d30967b21309041283dfd1\n4b355796a710bec51e37958a39ca0fb28f462f80b15b3e42162bf47cdf0fca79\nf3fd26579b32378c1115937a1aea5daa2dc4d9f11c7c69c3f6878962e31e6fdc\n7d72f66070b144fdd4d0fcbe39c732d1943b5836c8da1d469da876c27775808e\n143e15adc8d63526b124a401fe1182a44542fb79f22fc17c602151a839c22682\n197286269fe0f8ef718beb337945c88e3b88683ff39c05137b71d7cd662c7ddd\n7356a7c98588b980302a5f2340b56f75a13bdac613f7c22b62eeb4590896e506\n555513aa074aca680c4962f0078f43445a0d382e78046623d53203d8436bad99\n96c57e456b9cd614a632edd4563ac70cb08fc34db2c2398c2c9aaa4ed920445f\n8f49d7e3596aff4c8cd3aa38d0dc6911ae77e54cc3b13210d95c9f38063317a9\n1d69a55baba58f62b1448b92859a39272ba42d171f390749ca8ba9c27e74b010\n313c731da99da31454ec6114d5a8ce03dcf9a24caf02270f9292ab7b9278b316\n8f7bbcb3ac44aa48df92b65b7ef40c341ed80df2710668d5ac6b7207c00b581d\ncf79b1db1c515944e8076170b8d8c2f72747c99e3c686b85422f8d3fd033b254\nb4a5ecd4285c5431b486740ce111211df90486d4ba1fe189e5cbbcd02ec72ed3\n68ca21ebaec1f7a40e25b348e8275c56b7fede56ea30ec2215c535f63d5f04da\n5fae9e2f6fc2e95b5f6be3c8c0d3a76cebf18a2526913d21c67bb98be35f8247\n63455c30d70fc9c2f3150dc8426fd1ea30884b12b4d5a74ba126698c680d7ee3\n8d413fb17a9fb2722c36b288de4cf2564a25d11bd63673191fc9be22bffc227c\n37c35d63111e22bb37ed6b22e5886b5178e3bdac3b50977a5aa029accfa5b195\n3919509ed00956ca7eb30eb7717c24fcfe1da4ca6403ce68d07d5ddab43bc70c\n\n```\n**C&C servers:**\n\n\n-----\n\n```\n185.215.113[.]84\n185.215.113[.]66\n185.215.113[.]93\nthaus[.]ws\ngotsomefile[.]top\ngeauhouefheuutiiiw[.]top\naegieuueueuuruia[.]ru\ntoruuoooshfrohfe[.]su\ngimmefile[.]top\n\n## Appendix B: Cryotcurrency wallets\n\n```\n**Bitcoin address** **Transactions** **Total value (BTC)**\n\n1DYwJZfyGy5DXaqXpgzuj8shRefxQ7jCEw 577 11.77038853\n\n1of6uEzx5qfStF1HrVXaZ1eE3X4ntnbsx 313 5.85069371\n\n1EN3bbs8UdVWA3i3ixtB9jQWvPnP9us4va 158 0.84886532\n\n19mduWVW9QphW5W2caWF84wcGVSmASRYpf 157 2.97800426\n\n3AcMV5pSUcxMmmcMbfSkJXRKbCrF3ysUDJ 84 0.36248146\n\n1E5ZxnNUbbGQarWjMA7tCwp3Btm38GvRkv 82 0.56571843\n\n1FGzLF98d6Uv7P4YH7J4FF4bU599qtZNSk 71 0.78717836\n\n1MaN4Me35n1kM6h7JVPNUQYqYgjasEQLzs 64 0.70780188\n\n1BdhCwNFzNbWoJvxrok6V7z2af7xjJLS58 51 0.45619053\n\n1Bn4JYKoVgQpZ73doWVFSNZBbwKj3cpJNR 48 0.31075967\n\n13cQ2H6oszrEnvw1ZGdsPix9gUayB8tzNa 43 0.31093935\n\n1Gx8oRKKczwdB32yiLzVx5hsjAze6g5HHw 42 0.42138444\n\n17SBPhXtH8AxszbyEPPvFaazef6Cpup7Rg 42 0.62145355\n\n1CUhtfNjsGMZziCVzZ4oVan9NCGriY4NDZ 42 0.2527719\n\n1L6sJ7pmk6EGMUoTmpdbLez9dXACcirRHh 42 0.33589533\n\n19B5G1ftgXRrD6GiTzThL9BiySVdf1HJZy 35 0.73827173\n\n1CpQYTKfiYj8ZoXUmz1DAohjJVsDzGpgbx 33 0.83727682\n\n18qKrmaUXaEgbYEn6yMkGKNcqkYB3mSxNv 31 1.60713638\n\n3JHbgxWSZzvG73eeMZuTvV8LaCwPaSwH5e 30 0.04118681\n\n\n-----\n\n1C2SvtsUu8YZVUBbha4KiBGYRW5dwtrRvd 28 0.20058421\n\n1Kzhh4nqyjB3MAoQ5uH2Bcdz3qXWpnsMzd 26 3.39173817\n\n1LdFFaJiM7R5f9WhUEskVCaVokVtHPHxL5 25 0.11162833\n\n18xjALsLW57DQcXSgvGE8H9iXkXYvPjSWc 20 0.20561805\n\n3NShfYPbqkPmPkXEgJ1SGUYgSjxt1Robhs 19 0.07829182\n\n3PZxHk9t7qRT36R4U1imFAzMrPixLP2S5G 19 0.28756791\n\n1GWTDV99ErrCDN6HUXsStubzZbVuhgftmN 19 0.14624533\n\n18bzpjFfo5JQ41GzzUNRMgcE7WwQwpqFrR 18 0.12136941\n\n19KXPyopGnfZ1dGjLpPPqbo7Jpqki9A9mW 17 0.25350157\n\n13vFjyWgurTopaVmQfgEpiRkHLNc2JMrmL 16 0.08363811\n\n39t2ndtRZKxHPHaprbe6kPaws4vs1nWA94 13 0.011934\n\n18mqohvm3hNusjZ6uBYm1E3bWHgorquaMi 13 0.10253479\n\n38i9rSGLo2KY2HJK249AykR24rVPdz75RS 12 0.04370092\n\n14GJm9M5zaX6Zyojt5yxNZcdoouJ4WPAgT 11 0.11214492\n\n1zWNk4zqRLxMnsjFv6rtsoQrCvcfvMvrM 11 0.13272838\n\n1DhR14ZJtGzfdeemj49Jje6D3ZHEZQh6P3 11 0.246914\n\n3QYPr4imJFmd3c2htT4d3pRuxkSjcXdr95 11 0.04259855\n\n3QYAhRw1WcPMZLYP61n516JeLE2DX9yysW 10 0.07399403\n\n1LaVtKqJatoeAHkHEgp9UF2fJEarEdZPr9 9 0.37694525\n\n15xK9eLYeLNCQVG7uTZkJGZACQGuhk8E3H 8 0.36191407\n\n13M4LtnAhnt6cd78JndfAdoYE4CevjPT4B 8 0.01213431\n\n3EFYP3eiRcnjJAraEYxfVuKsUqcEmTGFot 7 0.06086802\n\n1JPXx7iDdW6oSXA6sf2t2gGm21HyqLe2Bp 7 0.03328335\n\n1BK8sQVskVTrC917QeaZRpUvU7z1tuCHxc 6 0.00428663\n\n16ZWUCzuhvYzpdYJRRKvsBAKmJgcgzpqyg 6 0.0397622\n\n14jk4w1RVV7D2JXEqCwUtMW2UTGoGbJu7N 4 0.01904673\n\n\n-----\n\n35Sb7nDbQFXndgZZu7zYaJbwEffVY8Z4cF 4 0.00328759\n\n1KXZqR1fjAxcv1gvdmPfN2WsWsDwM7r2R2 4 0.244389\n\n12ZcTiGZFWydqY4rDW6FbF1ArsBbdNaPxz 3 0.00673716\n\n1CNp1np9EVESWZ678tX6NPexCy7Cea3q9v 3 0.85662379\n\n19pnchunjYynzeiiu1ddwfzsHrjKcDxRvY 2 0.85007827\n\n1JWWZFUVAWvFNS2D5qwQQo4oSsseoD9kAn 2 0.04953613\n\n3EzR2S3wTiiyokZE9bvY82FZiPA5m45SAC 2 0.00689627\n\n1Cnk3Dc2rdMGpXDjScy9BCza2MRXJygkp8 2 0.00239953\n\n1HewcqbrkXY5iqrDqjb4j4AHiaDeobpE6P 1 0.00030088\n\n1EThtvDy9FXXR4A9FtVyFJBJw7sdheBYqS 1 0.0122992\n\n3NNJW9YnKichMXTVgAhrsD65veUBCfGC9m 1 0.00033241\n\n36LdCfaxb7KpAC7EZ6pzy2eRMsHSZghHpM 1 0.00690512\n\n1MMic1zX21dwUEh7GQuBFhJmQPTbqGYdzM 1 0.00788566\n\n**Total** **2326** **38.40704253**\n\n\n**Ethereum address** **ETH**\n**Transactions**\n\n\n**Total value**\n**(ETH)**\n\n\n0xff8c5843e7abe2708037fc1acdca83b37466a299 50 16.17663323\n\n0xff0d45f3e2ec83de3b2e069300974732ba1c5d30 48 17.69280322\n\n0xab1b250d67d08bf73ac864ea57af8cf762a29649 46 27.87694116\n\n0xb6d8926bf0418de68a7544c717bbb4ea198769cc 38 5.298421864\n\n0x57af5e3e5d6cb0ca6f44d303328b4f68edaa9e39 33 8.74847878\n\n0x2f1a943e9a5c200bc685c0f0e30e8d617b75c9e6 31 8.881011306\n\n0xa557fe5c21325eb8f6c7d5f2004db988c8c8d8b5 16 3.704143229\n\n0xef9e3d8c52044d949c3008d34e32104a187bd46d 14 4.146620911\n\n0xd4f8dfd1cdba76e9ac6b3b31ef3c6c6c3d1ea1d0 10 0.814050284\n\n0xa5228127395263575a4b4f532e4f132b14599d24 8 0.134708954\n\n0x8b7f16faa3f835a0d3e7871a1359e45914d8c344 7 3.22462637\n\n\n-----\n\n0x05f916216cc4ba6ac89b8093d474e2a1e6121c63 7 0.575314034\n\n0x87f84b56fb061f51ca709f2ac3fc6e2d4b3b8f8f 6 4.22714208\n\n0x74e4195d16e8887ebe6d6abde1aa38bc91e69976 6 0.104948174\n\n0x373b9854c9e4511b920372f5495640cdc25d6832 5 0.28459803\n\n0x75861ac703aabf12e51b374543f51320eeccb91d 5 0.50729028\n\n0xa9b717e03cf8f2d792bff807588e50dcea9d0b1c 4 0.475362\n\n0x43e44151ad4d625d367376a6fd3ea44c82718777 4 7.32426232\n\n0xc4e6e206ddc7f83a78582fc4e5536a8ed395c5e1 4 0.194103764\n\n0x02c48a8716f4ed9784544fc7100abfb9febd1761 4 0.564922754\n\n0xac9a31bb9e9a3887ffc9513a93dd6da7ec648345 3 0.0574927\n\n0x887d27da0a963bdfbc503357f2dc9837eb2c9444 3 5.168551905\n\n0x869c893e84618da936274badf3d9e800d0572955 3 5.93558275\n\n0xea375afbda5e11af6f93932ef2dcde2cf38768dd 3 0.16124587\n\n0x4562b3eea33b3eb4ed2e08719a05421e06e452f4 2 5.096436059\n\n0xcfe425756103a113807985f4b9aa3cecf637e99a 2 0.243502265\n\n0xb2bfcee11601b6af7357a7a636b7af3240024568 1 4.652749775\n\n0x334bd517cf36ad075b0807903624139ce99e3921 1 1.0043\n\n**Total** **364** **133.2762441**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-16 - Phorpiex botnet is back with a new Twizt- Hijacking Hundreds of crypto transactions.pdf"
    ],
    "report_names": [
        "2021-12-16 - Phorpiex botnet is back with a new Twizt- Hijacking Hundreds of crypto transactions.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536249,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653688851,
    "ts_modification_date": 1653688851,
    "files": {
        "pdf": "https://archive.orkl.eu/54955967f43f33758dfebeb297ccf9d52e085dcc.pdf",
        "text": "https://archive.orkl.eu/54955967f43f33758dfebeb297ccf9d52e085dcc.txt",
        "img": "https://archive.orkl.eu/54955967f43f33758dfebeb297ccf9d52e085dcc.jpg"
    }
}