{
    "id": "f33a2fdf-ebb4-450a-9d31-0e4cd3ae5f34",
    "created_at": "2023-01-12T15:04:31.212277Z",
    "updated_at": "2025-03-27T02:13:11.723384Z",
    "deleted_at": null,
    "sha1_hash": "6ca30183b744bba5cb6726439ebee0a9a22fc7df",
    "title": "2019-08-01 - LookBack Malware Targets the United States Utilities Sector with Phishing Attacks Impersonating Engineering Licensing Boards",
    "authors": "",
    "file_creation_date": "2022-05-28T17:51:43Z",
    "file_modification_date": "2022-05-28T17:51:43Z",
    "file_size": 1716777,
    "plain_text": "# LookBack Malware Targets the United States Utilities Sector with Phishing Attacks Impersonating Engineering Licensing Boards\n\n**[proofpoint.com/us/threat-insight/post/lookback-malware-targets-united-states-utilities-sector-phishing-attacks](https://www.proofpoint.com/us/threat-insight/post/lookback-malware-targets-united-states-utilities-sector-phishing-attacks)**\n\nAugust 1, 2019\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nLookBack Malware Targets the United States Utilities Sector with Phishing Attacks Impersonating Engineering Licensing\nBoards\n\n\n-----\n\nAugust 01, 2019 Michael Raggi and Dennis Schwarz with the Proofpoint Threat Insight Team\n\n**Overview**\n\n[Between July 19 and July 25, 2019, several spear phishing emails were identified targeting three US companies in the](https://www.proofpoint.com/us/threat-reference/spear-phishing)\nutilities sector. The [phishing emails appeared to impersonate a US-based engineering licensing board with emails](https://www.proofpoint.com/us/threat-reference/phishing)\noriginating from what appears to be an actor-controlled domain, nceess[.]com. Nceess[.]com is believed to be an\nimpersonation of a domain owned by the US National Council of Examiners for Engineering and Surveying. The emails\ncontain a malicious Microsoft Word attachment that uses macros to install and run malware that Proofpoint researchers\nhave dubbed “LookBack.” This malware consists of a remote access Trojan (RAT) module and a proxy mechanism used\nfor command and control (C&C) communication. We believe this may be the work of a state-sponsored APT actor based\non overlaps with historical campaigns and macros utilized. The utilization of this distinct delivery methodology coupled\nwith unique LookBack malware highlights the continuing threats posed by sophisticated adversaries to utilities systems\nand critical infrastructure providers.\n\n**Delivery**\nEmails delivered on July 19 and July 25 purported to be a failed examination result from the NCEES (National Council of\nExaminers for Engineering and Surveying) and fraudulently utilized the NCEES logo. The email sender address and\nreply-to fields contained the impersonation domain nceess[.]com. Like the phishing domain, the email bodies\nimpersonated member ID numbers and the signature block of a fictitious employee at NCEES. The Microsoft Word\ndocument attachment included in the email also invoked the failed examination pretense with the file name “Result\nNotice.doc.”\n\n\n-----\n\n_Figure 1: NCEES-themed phishing email_\n\nAll emails originated from the IP address 79.141.168[.]137, which appears to be an actor-controlled IP utilized to host the\nphishing domain nceess[.]com. An examination of passive DNS and domain registration history for this domain identified\nadditional domains that appeared to be actor registered, which also impersonated engineering and electric licensing\nbodies in the US. Among these domains, only nceess[.]com was observed in active phishing campaigns targeting utility\ncompanies.\n\n**Exploitation**\n\nThe phishing messages were found to contain a Microsoft Word document attachment that uses VBA macros to\ninstall LookBack malware. When the attachment is executed, the malicious VBA macro within the Microsoft Word\nattachment drops three Privacy Enhanced Mail (PEM) files to the host: tempgup.txt, tempgup2.txt, and tempsodom.txt.\nAdditionally, the file Temptcm.tmp, which is a version of certutil.exe, is dropped to decode the PEM files\nusing Temptcm.tmp. The macro next creates a copy of the decoded PEM files restoring their proper file extensions with\nthe Windows essentuti.exe. tempgup.txt becomes GUP.exe, which impersonates the name of an open-source binary\nused by Notepad++; tempgup2.txt becomes libcurl.dll, a malicious loader DLL file; and tempsodom.txt\nbecomes sodom.txt, which contains command and control configuration data utilized by the malware. Finally, the macro\nlaunches GUP.exe and the libcurl.dll loader separately, resulting in the execution of LookBack malware.\n\n**LookBack Malware**\n\nLookBack malware is a remote access Trojan written in C++ that relies on a proxy communication tool to relay data from\nthe infected host to a command and control IP. Its capabilities include an enumeration of services; viewing of process,\nsystem, and file data; deleting files; executing commands; taking screenshots; moving and clicking the mouse; rebooting\nthe machine and deleting itself from an infected host. The malware consists of the following components:\n\nA command and control proxy tool (referred to as GUP)\n\nA malware loader comprised of a legitimate libcurl.dll file with one export function modified to execute shellcode.\n\nA communications module (referred to as SodomNormal) which creates a C&C channel with the GUP proxy tool.\n\n\n-----\n\nA remote access Trojan component (referred to as SodomMain), which is delivered following decoding the initial\nbeacon response received via the GUP proxy tool and the SodomNormal local host proxy module.\n\n_GUP Proxy Tool_\n\nThe GUP command and control proxy tool may impersonate the name of a piece of legitimate opensource software\navailable at wingup[.]org, which is used by Notepad++. In historic campaigns by APT adversaries, legitimate GUP.exe\nversions were utilized that were digitally signed by Notepad++. In this campaign, files appeared to impersonate the\nGUP.exe file name rather than being a legitimate signed binary. The function of this tool is to set up a TCP listener on a\nlocalhost, receive encoded data via requests from the SodomNormal localhost module, and to forward this data to the\ncommand and control IP via HTTP. The GUP Proxy Tool has a hardcoded configuration which is included as both strings\nand integers. The following configuration data was identified from the analyzed sample.\n\nGUP[.] exe|368ae77c829c29db2c3e719ce423104db86165422391403ad0483944aa287c20\n\nListener address: 127.0.0.1\n\nListener port: 9090\n\nC&C host: 103.253.41[.]45\n\nC&C URL format: http://%s/status[.]gif?r=%d\n\nObserved URL: http://103.253.41[.]45/status.gif?r=1564065990\n\n_Libcurl.dll Malware Loader_\n\nThis dynamic link library appears to be a legitimate version of libcurl.dll except for a single exported function, which is\nreferred to as ordinal #52 and curl_share_init in the analyzed sample. This function has been modified by threat actors to\nextract a resource contained within libcurl.dll, decrypt malicious data included in that resource, and load the resulting DLL\nto execute a malicious function. When this function is executed, the SodomNormal communications module begins\nrunning within Libcurl.dll. In addition to loading the communications module, the initial macro described above configures\na persistence mechanism for this malware loader by setting up a Registry Run key. The non-concatenated command\nincluded in the macro that establishes persistence for Libcurl.dll and the hash for this sample are included below.\n\ncmd /c reg add HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run /v CurlUpdate /f /d rundll32.exe\nC:\\Users\\Public\\libcurl.dll,#52\n\nLibcurl.dll| cf57eb331b09cb2bc8992ea253d301161f1fa38583cba0733ea6dc2da2bdf740\n\n_SodomNormal Communications Module_\n\nThe SodomNormal Communications module runs within the libcurl.dll loader as a loaded DLL. Its primary function is to\ncommunicate data gathered by the SodomMain remote access Trojan module with the GUP Proxy Tool. It attempts to\nacquire an existing configuration from the file sodom.ini. However, it appears the configuration is dropped in the file\nsodom.txt instead. If that configuration is not available, it utilizes a hardcoded configuration in the binary. An example of\nthis hardcoded configuration has been included below. The tool uses a custom binary protocol over sockets for its\ncommand and control communication with the GUP Proxy Tool and all transferred data is encrypted using a modified\nversion of RC4 encryption. It has limited functionality which includes an initial beacon, an initial beacon response that\nincludes encoded data containing the SodomMain RAT, and a command poll which passes header and decrypted data in\nan exported function enabling the SodomMain RAT to run. The hash for this sample is included below.\n\nSodomNormal[.]bin|360057ef2c4c14e263bbe2fc2df9ed4790bd8ed66256c827f1af349da31d47be\n\n\n-----\n\n_Figure 2: SodomNormal Communications Module hardcoded local host configuration._\n\n_SodomMain Remote Access Trojan Module_\n\nThe SodomMain module is LookBack malware’s remote access Trojan module that can send and receive numerous\ncommands indicative of its function as a RAT. The malware is delivered within the encoded data that is received by\nthe SodomNormal module as part of its initial beacon response. It then runs within the SodomNormal module and uses\nits “send_data” function for C&C communications. The data is ultimately relayed to the GUP Proxy Tool and the C&C IP.\n\nNoteworthy malware commands include:\n\nGet process listing\n\nKill process\n\nExecutes cmd[.] exe command\n\nGets drive type\n\nFind files\n\nRead files\n\nDelete files\n\nWrite to files\n\nExecute files\n\nEnumerate services\n\nStarts services\n\nDelete services\n\nTakes a screenshot of desktop\n\nMove/Click Mouse and take a screenshot\n\nExit\n\nRemoves self (libcurl[.] dll)\n\nShutdown\n\nReboot\n\nThe hash for this sample is included below.\n\nSodomMain[.] dll| f8fae5b912ca61068a2be64e51273e90a10ebf7ffbd7feaf9a29475387f99a6d\n\n**Notes on Attribution**\n\n\n-----\n\nAnalysts identified similarities between the macros utilized in this campaign and historic APT campaigns targeting\nJapanese corporations in 2018 [1]. Moreover, LookBack utilizes an encoded proxy mechanism for C&C communication\nthat resembles a historic TTP utilized in those campaigns. However, analysts note that the LookBack malware has not\npreviously been associated with a known APT actor and that no additional infrastructure or code overlaps were identified\nto suggest an attribution to a specific adversary.\n\nIn the attachments identified as part of the July 2019 campaigns, threat actors appeared to utilize many concatenation\ncommands within the macro to obfuscate the VBA function. It is possible these concatenations were an attempt to evade\nstatic signature detection for the macro strings while maintaining the integrity of the installation mechanism, which had\nbeen historically been used to target different sectors and geographies. The below comparison indicates the shared\nmacro content which appears to have been rewritten.\n\n_Figure 3: Macro utilized in July 2018 campaigns targeting Japanese corporations_\n\n_Figure 4: Macro utilized in July 2019 campaigns targeting US utilities sector_\n\n**Conclusion**\n\nThe detection of a new malware family delivered using phishing tactics once used by known APT adversaries highlights a\ncontinuing global risk from nation-state actors. While definitive attribution in this instance requires further study of\ninfrastructure, toolsets, and methodologies, the risk that these campaigns pose to utilities providers is clear. The profile of\nthis campaign is indicative of specific risk to US-based entities in the utilities sector. Phishing emails leveraged the\nknowledge of the licensing bodies utilized within the utilities sector for social engineering purposes that communicated\nurgency and relevance to their targets. Persistent targeting of any entity that provides critical infrastructure should be\nconsidered an acute risk with a potential impact beyond the immediate targets. Since so many other individuals and\nsectors rely on these services to remain operational safeguarding them is paramount. Analysts continue to monitor key\nentities in the utilities sector to identify and prevent these and similar attacks in the hopes of preventing any intended\nimpact to critical infrastructure.\n\n**References**\n\n[[1]https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html](https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html)\n\n**Indicators of Compromise (IOCs)**\n\n\nIOC IOC\nType\n\n\nDescription\n\n\n-----\n\na2d41af0b4f8f0fd950fd4ac164cb2c836fd3c679688b4db75e85ffabfc20d94 SHA256 Microsoft Word\nAttachment - result\nnotice.doc\n\n3a03509d1036f4ccf4bd4cb28717287791bf5e90f94b6edd4bffe40a66a4b237 SHA256 Microsoft Word\nAttachment - result\nnotice.doc\n\nf8fae5b912ca61068a2be64e51273e90a10ebf7ffbd7feaf9a29475387f99a6d SHA256 LookBack RAT Module SodomMain.dll\n\n360057ef2c4c14e263bbe2fc2df9ed4790bd8ed66256c827f1af349da31d47be SHA256 LookBack Communications\nModule SodomNormal.bin\n\ncf57eb331b09cb2bc8992ea253d301161f1fa38583cba0733ea6dc2da2bdf740 SHA256 LookBack Malware Loader\n– Libcurl.dll\n\n368ae77c829c29db2c3e719ce423104db86165422391403ad0483944aa287c20 SHA256 LookBack Malware GUP\nProxy Tool – GUP.exe\n\n103.253.41[.]45 IP Command and Control IP\n\n79.141.168[.]137 IP xOriginating IP\n\nnceess[.]com Domain Phishing Domain\n\n**ET and ETPRO Suricata/SNORT Signatures**\n\n2837783 ETPRO TROJAN Win32/LookBack CnC Activity\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-08-01 - LookBack Malware Targets the United States Utilities Sector with Phishing Attacks Impersonating Engineering Licensing Boards.pdf"
    ],
    "report_names": [
        "2019-08-01 - LookBack Malware Targets the United States Utilities Sector with Phishing Attacks Impersonating Engineering Licensing Boards.pdf"
    ],
    "threat_actors": [
        {
            "id": "faa4a29b-254a-45bd-b412-9a1cbddbd5e3",
            "created_at": "2022-10-25T16:07:23.80111Z",
            "updated_at": "2025-03-27T02:02:09.985067Z",
            "deleted_at": null,
            "main_name": "LookBack",
            "aliases": [
                "FlowingFrog",
                "LookBack",
                "LookingFrog",
                "TA410",
                "Witchetty"
            ],
            "source_name": "ETDA:LookBack",
            "tools": [
                "FlowCloud",
                "GUP Proxy Tool",
                "SodomMain",
                "SodomMain RAT",
                "SodomNormal"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535871,
    "ts_updated_at": 1743041591,
    "ts_creation_date": 1653760303,
    "ts_modification_date": 1653760303,
    "files": {
        "pdf": "https://archive.orkl.eu/6ca30183b744bba5cb6726439ebee0a9a22fc7df.pdf",
        "text": "https://archive.orkl.eu/6ca30183b744bba5cb6726439ebee0a9a22fc7df.txt",
        "img": "https://archive.orkl.eu/6ca30183b744bba5cb6726439ebee0a9a22fc7df.jpg"
    }
}