{
    "id": "f36f84eb-3eec-4d74-92da-74fe73f5bf2d",
    "created_at": "2023-01-12T15:08:59.774543Z",
    "updated_at": "2025-03-27T02:09:30.432089Z",
    "deleted_at": null,
    "sha1_hash": "61ab4bf934dff8c807a2b9ec04f90d58b80231fc",
    "title": "2019-05-08 - Get Smart with Enhanced Memory Dumping in VMRay Analyzer 3.0",
    "authors": "",
    "file_creation_date": "2022-05-28T16:12:28Z",
    "file_modification_date": "2022-05-28T16:12:28Z",
    "file_size": 586044,
    "plain_text": "# Explained: Smart Memory Dumping\n\n**vmray.com/cyber-security-blog/smart-memory-dumping/**\n\n[In a recent major update of our flagship platform, VMRay Analyzer 3.0, we made dramatic](https://www.vmray.com/cyber-security-blog/vmray-analyzer-3-0-raising-the-bar-automated-malware-analysis-detection/)\nimprovements in the system’s memory dumping capabilities. In an automated approach we\ncall smart memory dumping, VMRay Analyzer now triggers more frequent and more relevant\nmemory dumps to capture a comprehensive view of malware characteristics and behavior. In\nturn, this increases the speed and accuracy of malware analysis and detection.\n\nFor incident responders, smart memory dumping makes their jobs easier by automating\nmany tasks that previously required manual intervention. In addition, more frequent and\nrelevant dumps enhance digital forensics by capturing a more complete record of artifacts\ncreated by threats and attacks.\n\n## What Gets Packed, Must be Unpacked\n\nMalware authors routinely combine multiple techniques to evade detection and analysis by\nlayered defenses: anti-virus, static analysis, and dynamic analysis tools. A popular approach\nis to compress, encrypt and/or obfuscate malicious files, making it harder and more timeconsuming to identify and classify the malware—and address the threat it poses.\n\nTo do their dirty work, however, malware files need to be restored to their original state in\nmemory so they can execute as intended. And that creates an opportunity to detect\npotentially malicious behavior in the safe environment of the sandbox.\n\n\n-----\n\nAs successive layers of protection are removed—the packer layer, the compression layer,\nthe obfuscation layer—the characteristics and behavior of malware are revealed. For\ninstance, memory has to be allocated to store decrypted or deobfuscated data and code. In\n[response to such changes, the VMRay Platform triggers a succession of memory dumps,](http://www.vmray.com/malware-detection-analysis-platform/)\ncreating snapshots of telltale information about a potential threat or attack. (See Figure 1.)\n\nSome examples of changes that trigger memory dumps:\n\nPrivate memory regions/buffers are marked as executable\nCode has executed in the memory region\nThe memory region was written into\n\n_Figure 1: VMRay triggers a series of dumps for a memory region at important phases of_\n_memory usage_\n\n[In the screen capture above, taken from a VMRay Analyzer report on Remcos, a series of](https://www.vmray.com/analyses/9542c4da58ef/report/behavior_grouped.html)\ndumps is created in response to code being executed in the memory region that starts at\n0x400000.\n\n[(Remcos is a remote access tool widely used for malicious purposes.) Here’s what this high-](https://blog.malwarebytes.com/detections/trojan-remcos/)\nlevel view shows:\n\n[Because VMRay Analyzer automatically applies YARA rules to memory dumps, all the](https://www.vmray.com/cyber-security-blog/built-in-yara-rules/)\nresulting YARA matches are displayed.\nThe dump listed on Line 1 appears to be benign as no YARA matches were found.\n\n\n-----\n\nLikewise, there are no YARA matches for the dump listed on Line 3. However, the\ncontent of memory has changed, and that triggers a subsequent dump that we’ll\nexamine shortly in Figure 2.\nLine 4 shows that, after monitoring and dumping the region, YARA matching detected\npotentially malicious indicators in that particular dump. Later in the post, we’ll show the\nmemory dump−after it has been loaded into IDA for easier analysis−and we’ll explore it\nin a bit more detail. (See Figure 3.)\n\n### Why Timing and Frequency Matter\n\nWith memory dumping, frequency and timing matter. Dump too often and you’ll create more\ninformation than you need. Dump infrequently or at the wrong times and you’ll miss\ninformation that could enhance analysis and detection, such as identifying malicious URLs or\nregistry keys the malware is designed to access.\n\nSmart memory dumping addresses these challenges. In a process analogous to burst mode\non a camera, triggers built into VMRay dynamically initiates a memory dump any time\nsomething changes (see Figure 2).\n\n_Figure 2: VMRay Analyzer memory dump loaded in IDA_\n\nThis screenshot of a VMRay Analyzer memory dump loaded in IDA shows details from one\nof the first memory dumps we saw initiated in Figure 1 when the code starting at Entry Point\n0x00418340 executed.\n\nThe first several lines, highlighted in green, show areas of memory that are empty,\nindicating they’re free of threats.\n\n\n-----\n\nHowever, the next line, in red, shows a set of instructions, starting with the pusha\ninstruction in the previously mentioned memory location 0x418340. VMRay captures\nthe whole sequence of instructions that follow, also shown in red.\n\nThough not illustrated here, the importance of timely memory dumps is easily understood in\nthe context of malware that “cleans up” by re-encrypting parts of itself that have been\ntemporarily decrypted so they can execute. The decrypted data may only be visible for an\ninfinitesimal period of time, but VMRay takes a snapshot that captures it before it disappears\nagain.\n\n### Better Malware Classification & Streamlined Manual Analysis\n\nImproved memory dumping creates a more complete and detailed picture of malware activity,\nfor example by revealing suspect code and strings associated with known signatures and\nmalware families.\n\nContinuing with the example we’ve been discussing, Figure 3 now shows that the\nbenign-looking region in Figure 2 has changed, revealing strings and other indicators of\nthe malware.\nYou would typically see this on malware that unpacks and decrypts parts of itself in\nmemory. Our memory dumping feature was able to capture this transition.\nHighlighted in yellow, VMRay identifies the file as a likely Remcos sample. Remcos is a\nremote access tool (RAT) widely used for malicious purposes\n\nIn turn, that bolsters the automated pattern-matching power of YARA rules, resulting in faster,\nmore accurate malware classification and better detection rates.\n\n_Figure 3: VMRay memory dumps, as shown here in the IDA interface, reveal concealed_\n_malware behavior to analysts_\n\n\n-----\n\nWith VMRay, security teams can utilize their own custom YARA rules along with VMRayprovided rules. And they can more easily write new rules, for example, to automate the\nextraction of new C2 servers and malware samples.\n\nVersion 3.0’s enhanced memory dumping also streamlines manual analysis. Decompressed\nor decrypted code that has been captured via a memory dump can be directly examined in a\ndisassembler, such as [IDA or](https://www.vmray.com/cyber-security-blog/ida-plugin-vmray-analyzer/) [GHIDRA. Translating machine language into higher-level](https://www.nsa.gov/resources/everyone/ghidra/)\nlanguages makes human analysis easier and eliminates the tedious process of debugging\npacked files.\n\n_Get-hands on with VMRay Analyzer’s enhanced memory dumping capabilities. Start your_\n_trial today!_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-05-08 - Get Smart with Enhanced Memory Dumping in VMRay Analyzer 3.0.pdf"
    ],
    "report_names": [
        "2019-05-08 - Get Smart with Enhanced Memory Dumping in VMRay Analyzer 3.0.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536139,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653754348,
    "ts_modification_date": 1653754348,
    "files": {
        "pdf": "https://archive.orkl.eu/61ab4bf934dff8c807a2b9ec04f90d58b80231fc.pdf",
        "text": "https://archive.orkl.eu/61ab4bf934dff8c807a2b9ec04f90d58b80231fc.txt",
        "img": "https://archive.orkl.eu/61ab4bf934dff8c807a2b9ec04f90d58b80231fc.jpg"
    }
}