{
    "id": "f3bfdd64-8d18-4631-8e09-bf978d6b3db1",
    "created_at": "2023-01-12T15:09:15.078944Z",
    "updated_at": "2025-03-27T02:06:01.402205Z",
    "deleted_at": null,
    "sha1_hash": "d350ec1c906b5ba79b935a029be7fd398724f808",
    "title": "2022-04-05 - eSentire Threat Intelligence Malware Analysis- DoubleZero",
    "authors": "",
    "file_creation_date": "2022-05-29T00:53:37Z",
    "file_modification_date": "2022-05-29T00:53:37Z",
    "file_size": 1759471,
    "plain_text": "# eSentire Threat Intelligence Malware Analysis: DoubleZero\n\n**[esentire.com/blog/esentire-threat-intelligence-malware-analysis-doublezero](https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-doublezero)**\n\nDoubleZero is a newly emerging destructive malware targeting Ukrainian enterprises. The\ninitial access vector is unknown, but eSentire Threat Intelligence assesses with medium\nconfidence that the threat actor(s) was able to gain access to the infected machine(s) and\nescalate, or use, the existing administrative privileges to manually execute the malware.\n\nAs the Russia-Ukraine crisis continues, we assess that destructive malware will continue to be\nactively deployed to disrupt the operations of Ukrainian infrastructure.\n\n**Key Takeaways:**\n\nDoubleZero is the fifth wiper malware targeting Ukrainian organizations (previously we\nhave observed WhisperGate, HermeticWiper, IsaacWiper and CaddyWiper samples).\nThe malware destroys the components responsible for Windows boot process and\noverwrites the files will null bytes.\nThe compilation timestamp was changed by the threat actor(s) to confuse the\nresearchers and make it harder to evaluate how long ago the malware sample was\nwritten.\nTo achieve the full-scale disruption, the threat actor(s) would need to escalate their\nprivileges or bypass the user account control (UAC) to fully compromise the system.\neSentire Threat Intelligence team has observed that the malware fails to run on Windows\nServers.\n\n\n-----\n\n## Case Study\n\nOn March 22, 2022, the Computer Emergency Response Team of Ukraine (CERT-UA)\nreleased an advisory warning about the destructive DoubleZero malware found on March 17,\n2022. The malicious activity is tracked under UAC-0088 and aimed to disrupt the operations of\nUkrainian organizations.\n\n## DoubleZero Analysis\n\nThe ZIP archives are named “Вирус... крайне опасно!!!.zip” which means “Virus…extremely\n_dangerous!!!.zip” and csrss.zip. The archives contain two files:_\n\ncpcrs.exe\ncsrss.exe\n\nThe 32-bit executables are compiled with .NET and both executables have the same impash,\nor import hash, 2916dda3c80b39a540b60c072a91a915 (the hash that is calculated based on\nthe library/APIs used and their order within the executable file). It means that both files have\nthe same functionality.\n\nThe compilation timestamp dates to May 28, 2071, which is not valid.\n\n### Obfuscation\n\nThe .NET malware sample appears to be highly obfuscated (Exhibit 1).\n\n_Exhibit 1: Initial obfuscated .NET sample_\n\nAfter the first round of de-obfuscation, we discovered that DoubleZero implements AES (block\nsize 128-bit) encryption in EBC mode with PKCS padding, control flow and switch statements\nfor additional code obfuscation as shown in Exhibit 2.\n\n\n-----\n\n_Exhibit 2: Obfuscation algorithm_\n\n### Enumeration\n\nThe sample enumerates the HKEY_CURRENT_USER, HKEY_USERS,\n_HKEY_LOCAL_MACHINE registry keys including HKEY_LOCAL_MACHINE\\BCD00000000_\n(the key contains the boot configuration data that is required to boot up the Windows system)\nand subkeys using GetSubKeyNames, Registry.LocalMachine and Registry.CurrentUser\nproperties to remove them later.\n\nThe malware also enumerates on the paths listed in Exhibit 3 using Regex to match as few\ncharacters as possible with (.*?), also known as lazy mode, and “.*” to match any character\nexcept for line terminators.\n\n**The paths queried:**\n\n_\\\\Users\\\\\\\\.*?\\\\\\\\Local Settings.*_\n_\\\\Users\\\\\\\\.*?\\\\\\\\AppData\\\\\\\\Local\\\\\\\\Application Data.*_\n_\\\\Users\\\\\\\\.*?\\\\\\\\Start Menu.*_\n_\\\\Users\\\\\\\\.*?\\\\\\\\Application Data.*_\n_\\\\ProgramData\\\\\\\\Microsoft.*_\n_\\\\Users\\\\\\\\.*?\\\\\\\\AppData\\\\\\\\Local\\\\\\\\Microsoft.*_\n_\\\\Users\\\\\\\\.*?\\\\\\\\AppData\\\\\\\\Roaming\\\\\\\\Microsoft.*_\n\n\n-----\n\n_Exhibit 3: Enumerating the folders using regex_\n\nThe following folders get concatenated together forming a path (Exhibit 4):\n\n_ProgramFiles(x86)\\Documents and Settings_\n_ProgramFiles(x86)\\ProgramData\\Application Data_\n_ProgramFiles(x86)\\Users\\All Users_\n_ProgramFiles(x86)\\Users\\Default User_\n\n_Exhibit 4: Folder concatenation_\n\nIt is notable that the sample also enumerates through drivers (Exhibit 4) and\n_C:\\Windows\\NTDS path. The NTDS file contains a database that stores Active Directory data,_\nincluding information groups, group membership and user objects. It also includes the\npassword hashes for all users in the domain. eSentire Threat Intelligence team observed that\nthe malware does not run on the Windows Server.\n\n\n-----\n\nThe malware gets the root drive of the infected device and Operating System information using\n_Environment.SystemDirectory and Environment.OSVersion properties (Exhibit 5)._\n\n_Exhibit 5: Enumerating system directory and OS version_\n\nDoubleZero attempts to get all logical drives on the infected computers (Exhibits 6-7).\n\n_Exhibit 6: GetLogicalDrives gets a bitmask representing the currently available disk drives_\n\n_Exhibit 7: Checks if the drive name is valid_\n\n\n-----\n\nThree DLLs (Dynamic Link Library) will be used in this sample (Exhibit 8):\n\nntdll.dll\nkernel32.dll\nuser32.dll\n\n_Exhibit 8: DLLs used in DoubleZero_\n\nIn Exhibit 9, the variables highlighted in orange are some of the API calls available for use by\nDoubleZero:\n\n**NtOpenFile: this function opens an existing file, directory, device or volume then returns**\na handle for the file object.\n**NtFsControlFile: sends a control code to the specified file system or driver to perform**\nspecific action.\n**RtlNtStatusToDosError: returns the system error code.**\n**RtlAdjustPrivilege: disables or enables a privilege from the calling thread or process.**\n**[CloseHandle: closes handles to objects mention in Microsoft MSDN.](https://docs.microsoft.com/en-us/windows/win32/api/handleapi/nf-handleapi-closehandle)**\n**GetFileSizeEx: gets the size of a file.**\n**GetLastError: receives the calling thread's last-error code value.**\n**ExitWindowsEx: logs interactive user off, shuts down the system, or shuts down and**\nrestarts the system.\n\n\n-----\n\n_Exhibit 9: API calls via the appropriate DLLs_\n\nIn addition to the API calls, the malware attempts to set the appropriate access control or full\naccess rights to the following files to fill them with zeroes (Exhibit 10):\n\nBOOTMGR (boot manager) including BCD (Boot Configuration Data) file, which are\nresponsible for Windows startup process.\nBOOTSECT.BAK, which is a backup of the BOOTSECT.DOS. that is created by default\nby old Windows operating systems when any boot modifications take place.\npagefile.sys, which supports system crash dumps and used to manage virtual memory.\nswapfile.sys, which is used in conjunction with pagefile.sys to free up the memory in\nRAM.\n\n_Exhibit 10: Modifying access control rights_\n\n### Data Destruction\n\n\n-----\n\nThe NtFsControlFile is responsible for zeroing the data out with the IOCTL code\n_FSCTL_SET_ZERO_DATA (0x980c8) if it was able to open the file with NtOpenFile API_\n(Exhibit 11). The number of bytes to be zeroed out are equal to the size of the file.\n\n_Exhibit 11: API responsible for wiping the data_\n\nAfter the sample finishes executing, the system will automatically restart, and the user will get a\nprompt that the BCD file is missing or corrupted (Exhibit 12). The executables need to be run\nas an Administrator for it to gain the full access to the system files and registry keys to proceed\nwith deletion/wiping process. If the executables are opened as a user without UAC privilege\nelevation – the malware only wipes the files under C:\\Users and the system shuts down after.\n\n_Exhibit 12: Missing \\Boot\\BCD file (error)_\n\n## What eSentire is doing about it\n\nOur Threat Response Unit (TRU) combines threat intelligence gleaned from research, security\nincidents, and the external threat landscape to create actionable outcomes for our customers.\nWe are taking a holistic response approach to combat modern destructive malware by\n\n\n-----\n\ndeploying countermeasures, such as:\n\nDetections to identify and prevent Double Zero Wiper are in place across eSentire MDR\nfor Endpoint and Log products\nThreat hunts have been performed for indicators associated with DoubleZero malware\n\n## Recommendations from eSentire’s Threat Response Unit (TRU)\n\nWe recommend implementing the following controls to help secure your organization against\nthe DoubleZero malware:\n\nConfirm that all devices are protected with Endpoint Detection and Response (EDR)\nsolutions\nImplement a Cyber Security Awareness Training Program that educates the employees\nabout the threat landscape\nEnsure the role-based access control (RBAC) that restricts system access to authorized\nusers is in place\nImplement a Vulnerability Management Program that helps identify and prioritize high\nseverity vulnerabilities.\nPatch any external-facing applications and devices as well as enforce strong password\npolicies\n\nWhile the Tactics, Techniques, and Procedures (TTPs) used by adversaries grow in\nsophistication, they lead to a limited set of choke points at which critical business decisions\nmust be made. Intercepting the various attack paths utilized by the modern threat actor\nrequires actively monitoring the threat landscape, developing, and deploying endpoint\ndetection, and the ability to investigate logs & network data during active intrusions.\n\neSentire’s Threat Response Unit (TRU) is a world-class team of threat researchers who\ndevelop new detections enriched by original threat intelligence and leverage new machine\nlearning models that correlate multi-signal data and automate rapid response to advanced\nthreats.\n\nIf you’re not currently engaged with an MDR provider, eSentire MDR can help you reclaim the\nadvantage and put your business ahead of disruption.\n\nLearn what it means to have an elite team of Threat Hunters and Researchers that works for\nyou. [Connect with an eSentire Security Specialist.](https://www.esentire.com/get-started)\n\n## Appendix\n\n### Sources\n\n Indicators of Compromise\n\n\n-----\n\n|Name|File Hash (SHA-256)|\n|---|---|\n|Вирус... крайне опасно!!!.zip|d897f07ae6f42de8f35e2b05f5ef5733d7ec599d5e786d3225e66ca605a48f53|\n|csrss.zip|8dd8b9bd94de1e72f0c400c5f32dcefc114cc0a5bf14b74ba6edc19fd4aeb2a5|\n|cpcrs.exe (DoubleZero)|3b2e708eaa4744c76a633391cf2c983f4a098b46436525619e5ea44e105355fe|\n|csrss.exe (DoubleZero)|30b3cbe8817ed75d8221059e4be35d5624bd6b5dc921d4991a7adc4c3eb5de4a|\n\n\n### Yara Rules\n```\nimport \"pe\"\nimport \"math\"\nrule DoubleZero {\n  meta:\n    author = \"eSentire TI\"\n    date = \"03/24/2022\"\n    version = \"1.0\"\n  strings:\n    $file = \"Microsoft.NET\" wide fullword nocase // .NET binary\n    $api1 = \"NtFsControlFile\" // send a control code to the file system \n    $api2 = \"CreateDecryptor\" // create the AES decryptor\n    $api3 = \"set_UseShellExecute\" // use OS shell to start the process\n    $api4 = \"FsctlSetZeroData\" // zero out the data \n    $access_api1 = \"RtlAdjustPrivilege\" // modify the privileges\n    $access_api2 = \"AddAccessRule\" // add a rule to the list of rules within a\nFileSystemSecurity object\n  condition:\n    for any i in (0..pe.number_of_sections - 1): (\n      math.entropy(pe.sections[i].raw_data_offset, pe.sections[i].raw_data_size)\n>=4  \n                      and pe.sections[i].name == \".text\" ) and\n    all of ($api*) and all of ($access_api*) and $file and\n    (uint16(0) == 0x5A4D or uint32(0) == 0x4464c457f)\n    and filesize < 500KB  \n}\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-05 - eSentire Threat Intelligence Malware Analysis- DoubleZero.pdf"
    ],
    "report_names": [
        "2022-04-05 - eSentire Threat Intelligence Malware Analysis- DoubleZero.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536155,
    "ts_updated_at": 1743041161,
    "ts_creation_date": 1653785617,
    "ts_modification_date": 1653785617,
    "files": {
        "pdf": "https://archive.orkl.eu/d350ec1c906b5ba79b935a029be7fd398724f808.pdf",
        "text": "https://archive.orkl.eu/d350ec1c906b5ba79b935a029be7fd398724f808.txt",
        "img": "https://archive.orkl.eu/d350ec1c906b5ba79b935a029be7fd398724f808.jpg"
    }
}