{
    "id": "f43692ae-eedc-468c-ba11-3798b95f7bea",
    "created_at": "2023-01-12T15:06:44.385516Z",
    "updated_at": "2025-03-27T02:05:32.010548Z",
    "deleted_at": null,
    "sha1_hash": "27778b8f44efb446be92e11dfd725593469cea01",
    "title": "2010-11-15 - Tracing the Crimeware Origins by Reversing Injected Code",
    "authors": "",
    "file_creation_date": "2022-05-27T21:47:01Z",
    "file_modification_date": "2022-05-27T21:47:01Z",
    "file_size": 269975,
    "plain_text": "# Tracing the Crimeware Origins by Reversing Injected Code\n\n**[resources.infosecinstitute.com/zeroaccess-malware-part-4-tracing-the-crimeware-origins-by-reversing-injected-code/](http://resources.infosecinstitute.com/zeroaccess-malware-part-4-tracing-the-crimeware-origins-by-reversing-injected-code/)**\n\nReverse engineering\nNovember 15, 2010 by Giuseppe Bonfa\n\n[Part 1: Introduction and De-Obfuscating and Reversing the User-Mode Agent Dropper](http://resources.infosecinstitute.com/step-by-step-tutorial-on-reverse-engineering-malware-the-zeroaccessmaxsmiscer-crimeware-rootkit/)\n\n[Part 2: Reverse Engineering the Kernel-Mode Device Driver Stealth Rootkit](http://resources.infosecinstitute.com/zeroaccess-malware-part-2-the-kernel-mode-device-driver-stealth-rootkit/)\n\n[Part 3: Reverse Engineering the Kernel-Mode Device Driver Process Injection Rootkit](https://resources.infosecinstitute.com/zeroaccess-malware-part-3-the-device-driver-process-injection-rootkit/)\n\n**Part 4:Tracing the Crimeware Origins by Reversing the Injected Code**\n\nIn this final part we will trace the origins of the ZeroAccess rootkit. We will discover that the\npurpose of this rootkit is to set up a stealthy, undetectable and un-removable platform to\ndeliver malicious software to victim computers. We will also see that ZeroAccess is being\ncurrently used to deliver FakeAntivirus crimeware applications that trick users into paying\n$70 to remove the antivirus. It could be used to delivery any malicious application, such as\none that steals bank and credit card information in the future. Further analysis and network\nforensics supports that ZeroAccess is being hosted and originates from the Ecatel Network,\nwhich is controlled by the cybercrime syndicate RBN (Russian Business Network).\n\nLet’s take a look at the max++ DLL. It is injected into other processes address space by the\nkernel mode driver reversed in Part 3. Here are the hashes for this DLL:\n\nFileSize: 36.00 KB (36864 bytes)\n\nMD5: 4CE2F6BA808954FA7B1257D4C754D5B0\n\nSHA-1: E74EA961ADCA942623AE721283D33F6907A7C86D\n\nNo VersionInfo Available.\n\nResource: “TYPELIB”.\n\nmax++.00.x86.dll does not have an ET ( Export Table ) entire code is contained into\nDllEntryPoint() function.\n\nThis malicious DLL is injected via APC and ZwAllocateVirtualMemory by the second installed\ndriver. Recall that this driver finds newly loaded processes via\nPsSetLoadImageNotifyRoutine.\n\n\n-----\n\nThis DLL can be debugged by using OllyDbg 1.10 LoadDLL utility. As this component is the\njust a small feature of ZeroAccess, we won’t go into as much detail on it as we did with the\ntwo drivers and the user-mode agent.\n\nThe above ZwTestAlert function tests whether the current thread has been alerted (and\nclears the alerted flag). It also enables the delivery of queued user APCs.\nNextDisableThreadLibraryCalls disables the DLL_THREAD_ATTACH and\nDLL_THREAD_DETACH notifications for the DLL. By disabling the notifications, the DLL\ninitialization code is not paged in because a thread is created or deleted, thus reducing the\nsize of the application’s working code set. This use of DisableThreadLibraryCalls increases\ninvisibility for the injected DLL.\n\nThe call EAX is placed inside a do-while that updates the value pointed by EAX in iteration.\nThis involves in calling a different routine each time. Let’s look at the next code block:\n\n\n-----\n\nWe see the API call completed. A thread is created, and we can inspect it by reaching the\nStartAddress argument. This new thread will invoke a couple of calls that will talk to a\nCommand and Control (C&C) server. The C&C server will issue requests to websites that\ncontain code to install further malicious code to be executed on the victim’s machine.\n\nFrom string analysis we can obtain some valuable information:\n\nAll these entries as you can see are placed into the hidden NTFS volume that was analyzed\npreviously. There are also other interesting strings like:\n\n\n-----\n\nregistrymachineSoftwareMicrosoftInternet ExplorerMain{F9197A7E-CE10-458e-85F85B0CE6DF2BBE}\n\nThe CLSID encoding is of great help during malware forensics. It can be used to determine\nunivocally malware type and version. A quick search show us that this CLSID belongs to\nTrojan-Ransom.Win32.Digitala.b which is a downloader Aagent.\n\nThe above code blocks are executed if fdwReason is satisfied. Otherwise execution flows to\nanother block of code that essentially acts as a cleanup routine.\n\nThis injected DLL serves the purpose of generating web redirections to malicious websites\nthat contain FakeAntivirus software. Fake antivirus software (a.k.a misleading applications or\nrogue antivirus) is big business nowadays with Symantec reporting 43 million installation\nattempts from over 250 distinct programs between July 1, 2009, to June 30, 2010. With fake\nAV software costing the victim anywhere from $30 to $100, this is a lucrative earner for\ncriminals.\n\nThe malicious URLs are:\n\nhttp://intensedive.com/install/setup.php?m=d310b08f1d6d&i=1&id=000069000\nhttp://intensedive.com/install/setup.php?m=d310b08f1d6d\nhttp://intensedive.com/updates/cleaner.dll?m=d310b08f1d6d\n\n[The IP address behind these domains is 94.102.63.99. From www.robtex.com we can see](http://www.robtex.com/)\nthe following graph\n\nAS29073 belongs to Ecatel Network which is a well known crimeware friendly ISP.\n\n[http://hphosts.blogspot.com/2009/11/crimeware-friendly-isps-ecatel-as29073.html](http://hphosts.blogspot.com/2009/11/crimeware-friendly-isps-ecatel-as29073.html)\n\nEcatel is infamous for the massive hosting of malware and spambots, the most widely used\nIPs are:\n\n94.102.60.151\n94.102.60.152\n94.102.60.153\n94.102.60.182\n94.102.60.43\n94.102.60.77\n\nDetailed information on Ecatel activities can be seen here:\nhttp://www sudosecure net/archives/333\n\n\n-----\n\nOften Ecatel was involved into fakeAV campaigns, and ZeroAccess drives to fake software\ndownload. From sudosecure.net we see a relation with the well-know cybercrime ring, RBN (\nRussian Business Network ).\n\nPosted: November 15, 2010\n\nAuthor\n\n**Giuseppe Bonfa**\n\n**VIEW PROFILE**\nGiuseppe is a security researcher for InfoSec Institute and a seasoned InfoSec professional\nin reverse-engineering and development with 10 years of experience under the Windows\nplatforms. He is currently deeply focused on Malware Reversing (Hostile Code and Extreme\nPackers) especially Rootkit Technology and Windows Internals. He has previously worked as\nMalware Analyst for Comodo Security Solutions as a member of the most known Reverse\nEngineering Teams and is currently a consultant for private customers in the field of Device\nDriver Development, Malware Analysis and Development of Custom Tools for Digital\nForensics. He collaborates with Malware Intelligence and Threat Investigation organizations\nand has even discovered vulnerabilities in PGP and Avast Antivirus Device Drivers. As a\ntechnical author, Giuseppe has over 10 years of experience and hundreds of published\npieces of research.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2010/2010-11-15 - Tracing the Crimeware Origins by Reversing Injected Code.pdf"
    ],
    "report_names": [
        "2010-11-15 - Tracing the Crimeware Origins by Reversing Injected Code.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536004,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653688021,
    "ts_modification_date": 1653688021,
    "files": {
        "pdf": "https://archive.orkl.eu/27778b8f44efb446be92e11dfd725593469cea01.pdf",
        "text": "https://archive.orkl.eu/27778b8f44efb446be92e11dfd725593469cea01.txt",
        "img": "https://archive.orkl.eu/27778b8f44efb446be92e11dfd725593469cea01.jpg"
    }
}