{
    "id": "f4371ebc-0798-4870-b84b-fa7e59e71988",
    "created_at": "2022-10-25T16:48:12.768199Z",
    "updated_at": "2025-03-27T02:14:02.493988Z",
    "deleted_at": null,
    "sha1_hash": "7f98a609e1dcd3f69a822d3636c28f7a9e2dd105",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-10-21T09:51:12Z",
    "file_modification_date": "2019-10-21T09:51:12Z",
    "file_size": 401520,
    "plain_text": "## Winnti Group’s skip‑2.0: A Microsoft SQL Server backdoor\n\n**[welivesecurity.com/2019/10/21/winnti-group-skip2-0-microsoft-sql-server-backdoor](https://www.welivesecurity.com/2019/10/21/winnti-group-skip2-0-microsoft-sql-server-backdoor/)**\n\nOctober 21, 2019\n\nNotorious cyberespionage group debases MSSQL\n\n[Mathieu Tartare 21 Oct 2019 - 11:30AM](https://www.welivesecurity.com/author/mtartare/)\nFor a while, ESET researchers have been tracking the activities of the Winnti Group,\nactive since at least 2012 and responsible for high-profile supply-chain attacks\n[against the video game and software industry. Recently, we discovered a previously](https://www.welivesecurity.com/2019/03/11/gaming-industry-scope-attackers-asia/)\nundocumented backdoor targeting Microsoft SQL (MSSQL) that allows attackers to maintain a\nvery discreet foothold inside compromised organizations. This backdoor bears multiple similarities\nto the PortReuse backdoor, another tool used by the Winnti Group that was first documented by\nESET in October 2019, such as the use of the same custom packer and VMProtected launcher,\nwhich is why we attribute this backdoor to the Winnti Group.\n\nEarlier this year, we received a sample of this new backdoor called skip-2.0 by its authors and\npart of the Winnti Group’s arsenal. This backdoor targets MSSQL Server 11 and 12, allowing the\nattacker to connect stealthily to any MSSQL account by using a magic password – while\nautomatically hiding these connections from the logs. Such a backdoor could allow an attacker to\nstealthily copy, modify or delete database content. This could be used, for example, to manipulate\nin-game currencies for financial gain. In-game currency database manipulations by Winnti\n[operators have already been reported. To the best of our knowledge, skip-2.0 is the first MSSQL](https://image.ahnlab.com/global/upload/download/documents/1401223631603288.pdf)\nServer backdoor to be documented publicly. Note that even though MSSQL Server 11 and 12 are\nnot the most recent versions (released in 2012 and 2014, respectively), they are the most\n[commonly used ones according to Censys’s data.](https://censys.io/)\n\n[We recently published a white paper updating our understanding of the arsenal of the Winnti](https://www.welivesecurity.com/wp-content/uploads/2019/10/ESET_Winnti.pdf)\nGroup, and that exposed a previously undocumented backdoor of theirs called PortReuse. It uses\nan identical packer to that used with the payload embedded in compromised video games\n[uncovered by ESET in March 2019. The VMProtected launcher that drops the PortReuse](https://www.welivesecurity.com/2019/03/11/gaming-industry-scope-attackers-asia/)\nbackdoor was also found being used to launch recent ShadowPad versions. In that context, we\nwere able to find a new tool called skip.2-0 by its developer. It uses the same VMProtected\nlauncher as well as Winnti Group’s custom packer and exhibits multiple similarities with other\nsamples from the Winnti Group’s toolset. This leads us to ascribe skip-2.0 to that toolset also.\n\nThis article will focus on the technical details and functionality of this MSSQL Server backdoor, as\nwell as on exposing the technical similarities of skip.2-0 with the Winnti Group’s known arsenal –\nin particular, with the PortReuse backdoor and ShadowPad. A note on the reasons why we chose\n[the “Winnti Group” naming can be found on our white paper.](https://www.welivesecurity.com/2019/10/14/connecting-dots-exposing-arsenal-methods-winnti/)\n\n# VMProtected launcher\n\n\n-----\n\nWe found skip-2.0 while looking for VMProtected launchers, for which the payload is usually\neither PortReuse or ShadowPad.\n\n### Embedded payload\n\nAs with the encrypted PortReuse and ShadowPad payloads, skip-2.0 is embedded in the\nVMProtected launcher’s overlay, as shown in Figure 1:\n\n\n_Figure 1. VMProtected launcher’s headers. The payload is embedded in the PE overlay._\n\n\n### Encryption\n\nThe payload encryption is identical to that used in the other VMProtected launchers. It is RC5encrypted with a key derived from the VolumeID and the string f@Ukd!rCto R$., as described in\n[our previous white paper on the Winnti Group arsenal.](https://www.welivesecurity.com/wp-content/uploads/2019/10/ESET_Winnti.pdf)\n\n### Persistence\n\nAs in the case of PortReuse and ShadowPad, the launcher probably persists by exploiting a DLL\nhijacking vulnerability by being installed at C:\\Windows\\System32\\TSVIPSrv.DLL. This results in\nthe DLL being loaded by the standard Windows SessionEnv service at system startup.\n\n# Winnti Group’s custom packer\n\nOnce decrypted the embedded payload is actually Winnti Group’s custom packer. This packer is\n[the same shellcode that was documented in our previous article and white paper. It is used to](https://www.welivesecurity.com/2019/03/11/gaming-industry-scope-attackers-asia/)\npack the PortReuse backdoor as well as the payload embedded in the compromised video\ngames.\n\n### Packer configuration\n\nAs described in our previous article, the packer configuration contains the decryption key of the\npacked binary as well as its original filename, its size and the execution type (EXE or DLL). The\npayload’s packer configuration is shown in Table 1.\n\n\n**Parent SHA 1** **Payload SHA 1** **RC4 key** **Filename**\n\n\n**Launch**\n**type**\n\n\n-----\n\n**Parent SHA-1** **Payload SHA-1** **RC4 key** **Filename**\n\n\n9aafe81d07b3e5b‐\nb282608f0a2a4656eb485b7c9\n\n\na2571946ab181657e‐\nb825cde07188e8bcd689575\n\n\n163716559 InnerLoader.dll\n\n\n**Launch**\n**type**\n\n2\n\n\n_Table 1. Payload’s packer configuration_\nOne can see from the packer configuration that the payload is called Inner-Loader. Inner-Loader\nis the name of an injector that is the part of the Winnti Group’s arsenal used to inject the\n_PortReuse backdoor into processes listening on a particular port, as described in our previous_\npublication. Beyond that identical name, by analyzing this payload it appears that it is another\nvariant of the Inner-Loader injector.\n\n## Inner-Loader injector\n\nThis variant of Inner-Loader, instead of looking for a process listening on a particular port, as in\nthe case when injecting the PortReuse backdoor, looks for a process called sqlserv.exe, which is\nthe conventional process name of MSSQL Server. If found, Inner-Loader then injects a payload\ninto this process. This payload is also packed with the custom packer – the packer configuration\nof that payload is shown in Table 2.\n\n\n**Parent SHA-1** **Payload SHA-1** **RC4 key**\n\n\n**File‐**\n**name**\n\n\na2571946ab181657e‐\nb825cde07188e8bcd689575\n\n\n60b9428d00be5ce562f‐\nf3d888441220290a6dac7\n\n\n923567961 skip2.0.dll\n\n\n**Launch**\n**type**\n\n2\n\n\n_Table 2. Packer configuration of the payload embedded in Inner-Loader_\nThe original filename of this injected payload is skip-2.0.dll.\n\n# skip-2.0\n\nAfter having been injected and launched by Inner-Loader, skip-2.0 first checks whether it is\nexecuting within an sqlserv.exe process and if so, retrieves a handle to sqllang.dll, which is\nloaded by sqlserv.exe. It then proceeds to find and hook multiple functions from that DLL. Figure\n2 depicts the skip-2.0 chain of compromise.\n\n\n-----\n\n_Figure 2. skip-2.0 unpacking and injection_\n\n### Hooking sqllang.dll\n\nThe hooking procedure used by skip-2.0 is very similar to the one used by NetAgent, the\n_PortReuse module responsible for installing the networking hook. This hooking library is based on_\n[the distorm open source disassembler that is used by multiple open source hooking frameworks.](https://github.com/gdabah/distorm)\nIn particular, a disassembling library is needed to correctly compute the size of the instructions to\nbe hooked. One can see in Figure 3 that the hooking procedure used by NetAgent and skip-2.0\nare almost identical.\n\n\n-----\n\n_Figure 3. Hex-Rays output comparison between the NetAgent (left) and skip-2.0 (right) hooking procedures_\n\n\nThere is one notable difference, which is the fact that the hooking function from skip-2.0 takes the\naddress of the hook to be installed as argument, while for NetAgent, the address of the hook to\ninstall is hardcoded. This is due to the fact that skip-2.0 has to hook multiple functions in\nsqllang.dll to operate properly, while NetAgent only targets a single function.\n\nTo locate each sqllang.dll functions to be hooked, skip-2.0 first retrieves the size of the DLL once\nloaded in memory (i.e. its virtual size) by parsing its PE headers. Then an array of bytes to be\nmatched within sqllang.dll is initialized as shown in Figure 4. Once the address of the first\noccurrence matching the byte array is found, the hook is installed using the procedure shown in\nFigure 3.\n\n\n_Figure 4. Hex-Rays output of the procedure initializing the byte array to match in sqllang.dll_\n\n\nThe success of the hook installation is then logged in cleartext in a log file located at the\nhardcoded path C:\\Windows\\Temp\\TS_2CE1.tmp and shown in Figure 5.\n\n\n-----\n\n_Figure 5. Log generated during hooks installation_\n\n\nShould the targeted function not be found, the hook installer searches for a fallback function, with\na different set of byte patterns.\n\nMatching a sequence of bytes to locate the address of the targeted function instead of using a\nstatic offset, plus as using a fallback sequence of bytes, allows skip-2.0 to be more resilient to\nMSSQL updates and to potentially target multiple sqllang.dll updates.\n\n### One password to rule them all\n\nThe functions targeted by skip-2.0 are related to authentication and event logging. The targeted\nfunctions include:\n\nCPwdPolicyManager::ValidatePwdForLogin\nCSECAuthenticate::AuthenticateLoginIdentity\nReportLoginSuccess\nIssueLoginSuccessReport\nFExecuteLogonTriggers\nXeSqlPkg::sql_statement_completed::Publish\nXeSqlPkg::sql_batch_completed::Publish\nSecAuditPkg::audit_event::Publish\nXeSqlPkg::login::Publish\nXeSqlPkg::ual_instrument_called::Publish\n\nThe most interesting function is the first one (CPwdPolicyManager::ValidatePwdForLogin), which\nis responsible for validating the password provided for a given user. This function’s hook checks\nwhether the password provided by the user matches the magic password, in that case, the\noriginal function will not be called and the hook will return 0, allowing the connection even though\nthe correct password was not provided. A global flag is then set that will be checked by the other\nhooked functions responsible for event logging. The corresponding decompiled procedure is\nshown in Figure 5. In the case where this global flag is set, the hooked logging functions will\nsilently return without calling their corresponding, original functions, so the action will not be\nlogged. In the case where a different password is provided, the original function is called.\n\n\n-----\n\n_Figure 6. Hex Rays output of the procedure responsible for matching the password provided_\n\n_at login with the hardcoded string_\n\n\nA similar backdooring technique, based on hardcoded passwords, was used with SSH backdoors\npreviously discovered by ESET. The difference here is that skip-2.0 is installed in-memory, while\nin the case of the SSH backdoors the sshd executable was modified prior to execution.\n\nAdditionally, CSECAuthenticate::AuthenticateLoginIdentity will be called from within its hook code\nbut the hook will always return 0. The ReportLoginSucess and IssueLoginSuccessReport hooks\nwill not call the original functions if the magic password was used to log in. The same behavior is\napplied to FEExecuteLogonTriggers. Other logging functions such as\nXeSqlPkg::sql_statement_completed::Publish or XeSqlPkg::sql_batch_completed::Publish will\nalso be disabled in the case where the user logged in with the magic password. Multiple audit\nevents are disabled as well, including SecAuditPkg::audit_event::Publish,\nXeSqlPkg::login::Publish and XeSqlPkg::ual_instrument_called::Publish.\n\nThis series of hooks allows the attacker not only to gain persistence in the victim’s MSSQL Server\nthrough the use of a special password, but also to remain undetected thanks to the multiple log\nand event publishing mechanisms that are disabled when that password is used.\n\nWe tested skip-2.0 against multiple MSSQL Server versions and found that we were able to login\nsuccessfully using the special password with MSSQL Server 11 and 12. To check whether a\nparticular sqllang.dll version is targeted by skip-2.0 (i.e., that matches the byte patterns), we\n[created a YARA rule, which can be found in our GitHub repository.](https://github.com/eset/malware-ioc/tree/master/winnti_group)\n\n# Connection with the Winnti Group\n\nWe observed multiple similarities between skip-2.0 and other tools from the Winnti Group’s\narsenal. Its VMProtected launcher, custom packer, Inner-Loader injector and hooking framework\nare part of the already known toolset of the Winnti Group. This leads us to think that skip-2.0 is\nalso part of that toolset.\n\n# Conclusion\n\nThe skip-2.0 backdoor is an interesting addition to the Winnti Group’s arsenal, sharing a great\ndeal of similarities with the group’s already known toolset, and allowing the attacker to achieve\npersistence on an MSSQL Server. Considering that administrative privileges are required for\ninstalling the hooks, skip-2.0 must be used on already compromised MSSQL Servers to achieve\npersistence and stealthiness.\n\nWe will continue to monitor new activities of the Winnti Group and will publish relevant information\n[on our blog. For any inquiries, contact us at threatintel@eset.com.](mailto:threatintel@eset.com)\n\n# Indicators of Compromise (IoCs)\n\n\n-----\n\n**ESET**\n**detec‐**\n**tion**\n\n**Component** **SHA-1** **name**\n\n\nVMP Loader 18E4FEB988CB95D71D81E1964AA6280E22361B9F\n4AF89296A15C1EA9068A279E05CC4A41B967C956\n\n\nWin64/Pa\ncked.VM‐\nProtec‐\nt.HX\n\n\nInner-Loader injector A2571946AB181657EB825CDE07188E8BCD689575 Win64/In‐\njector.BS\n\nskip-2.0 60B9428D00BE5CE562FF3D888441220290A6DAC7 Win32/Ag\nent.SOK\n\n\nKnown targeted sqllang.dll files (nonexhaustive list)\n\n\n4396D3C904CD340984D474065959E8DD11915444\nBE352631E6A6A9D0B7BBA9B82D910‐\nFA5AB40C64E\nD4ADBC3F77ADE63B836FC4D9E5915A3479F09B‐\nD4\n0BBD3321F93F3DCD‐\nD2A332D1F0326142B3F4961A\nFAE6B48F1D6ED‐\nDEC79E62844C444FE3955411EE3\nA25B25FFA17E63C6884E28E96B487F58DF4502E7\nDE76419331381C390A758E634BF2E165A42D4807\nED08E9B4BA6C4B5A1F26D671AD212AA2F‐\nB0874A2\n1E1B0D91B37BAEBF77F85D1B7C640B8C‐\nC02FE11A\n59FB000D36612950FEBC36004F1317F7D000AA0B\n661DA36BDD115A1E649F3AAE11AD6F7D6FF2D‐\nB63\n\n\nN/A\n\n\n### MITRE ATT&CK techniques\n\n**Tactic** **ID** **Name** **Description**\n\n\nExecution [T1035](https://attack.mitre.org/techniques/T1035/) Service\nExecution\n\n\nPersis‐\ntence\n\nDefense\nEvasion\n\n\n[T1038](https://attack.mitre.org/techniques/T1038/) DLL Search Or‐\nder Hijacking\n\n\n[T1054](https://attack.mitre.org/techniques/T1054/) Indicator\nBlocking\n\n[T1045](https://attack.mitre.org/techniques/T1045/) Software\nPacking\n\n\n_skip-2.0 is started with the SessionEnv service_\n\n_skip-2.0 probably uses a DLL hijacking technique against the Ses‐_\nsionEnv service\n\n\n[T1179](https://attack.mitre.org/techniques/T1179/) Hooking _skip-2.0 hooks multiple functions in sqllang.dll service to bypass_\nauthentication and maintain stealth\n\n\nDiscovery [T1057](https://attack.mitre.org/techniques/T1057/) Process\nDiscovery\n\n\n_skip-2.0 blocks event logging_\n\n_skip.2-0 and Inner-Loader are packed using Winnti's custom pack‐_\ner. Further, the launcher is VMProtected.\n\n_Inner-Loader lists running processes in order to find the process_\nrunning MSSQL Server\n\n\nImpact [T1485](https://attack.mitre.org/techniques/T1485/) Data Destruction _skip-2.0 allows unauthorized access to MSSQL databases, allow‐_\ning data destruction or tampering\n\n\n[T1494](https://attack.mitre.org/techniques/T1494/) Runtime Data\nManipulation\n\n\n_skip-2.0 manipulates event logging at runtime_\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\n[T1492](https://attack.mitre.org/techniques/T1492/) Stored Data\nManipulation\n\n\n_skip-2.0 allows unauthorized access to MSSQL databases, allow‐_\ning manipulation of stored data\n\n\n[Mathieu Tartare 21 Oct 2019 - 11:30AM](https://www.welivesecurity.com/author/mtartare/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.10.21.Winnti_skip_2.0/Winnti%20Group%E2%80%99s%20skip%E2%80%912.0_%20A%C2%A0Microsoft%20SQL%20Server%20backdoor.pdf"
    ],
    "report_names": [
        "Winnti Group’s skip‑2.0_ A Microsoft SQL Server backdoor"
    ],
    "threat_actors": [
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041642,
    "ts_creation_date": 1571651472,
    "ts_modification_date": 1571651472,
    "files": {
        "pdf": "https://archive.orkl.eu/7f98a609e1dcd3f69a822d3636c28f7a9e2dd105.pdf",
        "text": "https://archive.orkl.eu/7f98a609e1dcd3f69a822d3636c28f7a9e2dd105.txt",
        "img": "https://archive.orkl.eu/7f98a609e1dcd3f69a822d3636c28f7a9e2dd105.jpg"
    }
}