{
    "id": "f43b5eff-89b9-4ae8-b641-8e4b85725f5d",
    "created_at": "2023-01-12T14:59:37.902313Z",
    "updated_at": "2025-03-27T02:05:32.533041Z",
    "deleted_at": null,
    "sha1_hash": "3de99e121c5f2f3be83bcbe88834e10c27358437",
    "title": "2019-09-18 - The WannaCry hangover",
    "authors": "",
    "file_creation_date": "2022-05-28T15:25:16Z",
    "file_modification_date": "2022-05-28T15:25:16Z",
    "file_size": 1201617,
    "plain_text": "# The WannaCry hangover\n\n**[news.sophos.com/en-us/2019/09/18/the-wannacry-hangover/](https://news.sophos.com/en-us/2019/09/18/the-wannacry-hangover/)**\n\nPeter Mackenzie September 18, 2019\n\nThis morning, [SophosLabs is releasing a deep dive into the aftermath of a malware that, two](https://www.sophos.com/en-us/medialibrary/PDFs/technical-papers/WannaCry-Aftershock.pdf)\nyears ago, looked like an unstoppable scourge. On the morning of May 12, 2017,\norganizations and individuals around the world were attacked by malware now known as\nWannaCry.\n\nWannaCry’s rapid spread, enabled by its implementation of a Windows vulnerability stolen\nfrom an intelligence agency, was suddenly halted when security researchers registered an\ninternet domain name embedded in the code – a routine research procedure that,\ninadvertently, tripped a “kill switch” subroutine in the malware, causing it to stop infecting\ncomputers. A small number of variants released in the following days, using new kill switch\ndomains, were shut down using the same method.\n\nPrior to the malware’s first appearance, Microsoft released an update to close off the\nvulnerability to exploitation, which would have prevented the infection from spreading. The\ndelay in installing that April, 2017 update directly contributed to WannaCry’s ability to copy\n\n\n-----\n\nitself from computer to computer.\n\nBy the time the kill switch domain had any effect, the malware had already wrought a lot of\ndestruction. But the kill switch, surprisingly, didn’t mean an end to WannaCry, even though\n(as far as we know) WannaCry was updated and rereleased only twice a few days after the\nfirst infection. In fact, WannaCry detections appear to be at an all-time high, surpassing the\nnumber of detections of older worm malware such as Conficker. The malware continues to\ninfect computers worldwide.\n\nThese 11 WannaCry variants were responsible for the bulk of the more than 4.3 million\nWannaCry attacks we observed in August, 2019\n\n## WannaCry never went away, it just got more broken\n\nSo why isn’t the world still up in arms about WannaCry? It turns out, someone (or possibly\nseveral someones) tinkered with WannaCry at some point after the initial attack, and those\nmodified versions are what’s triggering nearly all the detections we now see. Where there\nwas once just a single, unique WannaCry binary, there are now more than 12,000 variants in\ncirculation. In just the month of August, 2019, Sophos detected, and blocked, more than 4.3\nmillion attempts by infected computers to spread some version of WannaCry to a protected\nendpoint.\n\n\n-----\n\nThe one upside: Virtually all the WannaCry variants we ve discovered are catastrophically\nbroken, incapable of encrypting the computers of its victims. But these variants are still quite\ncapable of spreading broken copies of themselves to Windows computers that haven’t been\npatched to fix the bug that allowed WannaCry to spread so quickly in the first place.\n\nThe original kill switch domains have remained active since May, 2017, when security\nresearchers registered the domains, effectively ending the WannaCry attack. To analyze why\nWannaCry still seems to be spreading, despite the fact that the kill switch is still active, we\nlooked at about a fifth of the variants that we detected between September and December,\n2018.\n\nIn that three month period a year ago, we detected 5.1 million failed attempts by WannaCryinfected computers to infect a customer’s protected machine or machines. Out of that sample\nset, we made some interesting discoveries:\n\nAll of the 2,725 variants of WannaCry we analyzed contained some form of a bypass\nfor the kill switch code that stymied the original WannaCry.\nTen unique, modified versions of WannaCry malware accounted for 3.4 million (66.7%)\nof the detections, with the top three accounting for 2.6 million (50.1%).\n476 of the unique files (3.8%) accounted for an overwhelming 98.8% of the detections.\n12,005 of the unique files identified (96.1%) were seen fewer than 100 times each.\nThe original, true WannaCry binary, with an uncorrupted payload capable of encrypting\na victim’s computer, was seen only 40 times – a number so low that it could easily be\nattributed to security researchers or analysts conducting tests, rather than a real attack.\nSophos’ original WannaCry behavioral definition, CXmal-Wanna-A, offers effective\ndefense against any attempted infections.\n\n\n-----\n\nIn a heatmap based on August, 2019 detections of unsuccessful attempted WannaCry\ninfections against Sophos customers, the United States remained the top targeted country,\nwith more than 22% of infection attempts targeting computers there. Targeted countries such\nas India (8.8%), Pakistan (8.4%), Peru (7.3%), and Indonesia (6.7%) speak to the global\nnature of the WannaCry threat.\nThe most consequential modification to these latter-day WannaCry variants is the kill switch\nbypass. We detected four different methods, some more kludgy than others, that had been\nused to get around the protection the kill switch subroutine provides.\n\n## Deferring patches isn’t optional, anymore\n\nWannaCry’s spread was, and still is, aided by the fact that large organizations tend to defer\ninstalling Windows update patches, out of an abundance of caution, because some updates\nhave, historically, caused incompatibilities with third party software. This debate over whether\nto update right away or to defer the updates until testing can be completed continues even to\nthis day, with some tech columnists persisting in advising users not to install patches right\naway as a method of mitigating the consequences of an occasional patch that doesn’t work\nas intended.\n\nWhile there are limited circumstances in which some specific groups of users will not want a\ncomputer to download and install operating system updates, nearly all people and\norganizations do not fall into this category. Unfortunately, people who spread information\nabout how to defer or avoid updates rarely discuss the more nuanced reasons why someone\nmight want (or not want) to disable this feature. There are tradeoffs and serious\n\n\n-----\n\nconsequences to not installing updates. But some IT administrators or individuals reticence\nto install updates appears to be deep-seated and widespread, despite the risk such inaction\nposes.\n\nThe continuous rise in WannaCry detections does raise warning flags: it means there are still\nmachines whose owners have not installed an operating system update in more than two\nyears, and those machines are vulnerable not only to WannaCry, but to much more\ndangerous types of attack that have emerged in the past two years.\n\nAnd this leads to an inescapable point: The fact remains that, if the original kill switch\ndomains were to suddenly become unregistered, the potent, harmful versions of WannaCry\ncould suddenly become virulent again, distributed by and to a plethora of vulnerable,\nunpatched machines.\n\n### Acknowledgments\n\nThe author would like to acknowledge the efforts of many in the security community who\nhelped build an early understanding of the effect and impact of WannaCry, including Marcus\nHutchins, Jamie Hankins, and Matt Suiche, and SophosLabs researchers Fraser Howard\nand Anton Kalinin for their assistance with the research and technical guidance for this\n[report. We will publish IoCs from this report on our Github.](https://github.com/sophoslabs/IoCs)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-09-18 - The WannaCry hangover.pdf"
    ],
    "report_names": [
        "2019-09-18 - The WannaCry hangover.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535577,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653751516,
    "ts_modification_date": 1653751516,
    "files": {
        "pdf": "https://archive.orkl.eu/3de99e121c5f2f3be83bcbe88834e10c27358437.pdf",
        "text": "https://archive.orkl.eu/3de99e121c5f2f3be83bcbe88834e10c27358437.txt",
        "img": "https://archive.orkl.eu/3de99e121c5f2f3be83bcbe88834e10c27358437.jpg"
    }
}