{
    "id": "f45cf234-a458-4d98-832f-4c93a2759765",
    "created_at": "2023-01-12T15:09:12.475012Z",
    "updated_at": "2025-03-27T02:12:36.928776Z",
    "deleted_at": null,
    "sha1_hash": "d7c802c69fc706c702bf094b685ed93cdf9d2ada",
    "title": "2016-08-29 - German Speakers Targeted by SPAM Leading to Ozone RAT",
    "authors": "",
    "file_creation_date": "2022-05-28T03:38:23Z",
    "file_modification_date": "2022-05-28T03:38:23Z",
    "file_size": 565525,
    "plain_text": "# German Speakers Targeted by SPAM Leading to Ozone RAT\n\n**[fortinet.com/blog/threat-research/german-speakers-targeted-by-spam-leading-to-ozone-rat.html](https://www.fortinet.com/blog/threat-research/german-speakers-targeted-by-spam-leading-to-ozone-rat.html)**\n\nAugust 29, 2016\n\nThreat Research\n\nBy [Floser Bacurio Jr. and](https://www.fortinet.com/blog/search?author=Floser+Bacurio+Jr.) [Joie Salvio | August 29, 2016](https://www.fortinet.com/blog/search?author=Joie+Salvio)\nRemote Administration Tools (RAT) have been around for a long time. They provide users\nand administrators with the convenience of being able to take full control of their systems\nwithout needing to be physically in front of a device. In this age of global operations, that’s a\nhuge deal. From troubleshooting machines across countries to observing employees across\nrooms, RAT solutions have become widely used tools for remote maintenance and\nmonitoring.\n\nUnfortunately, malware authors often utilize these same capabilities to compromise systems.\nFull remote access capabilities is a dream tool for the black hat community, and are highly\nsought after.\n\nAs a case in point, we recently discovered a SPAM campaign targeting German-speaking\nusers that involves a relatively new commercialized RAT called Ozone.\n\n## German-Speaking Social Engineering\n\nIn this report we will take a look at this new SPAM campaign that appears to be\ntargeting German-speaking users. The email subject claims to be billing information for\n“Cable” service, and the attachment contains a Microsoft Word document.\n\n\n-----\n\n_Fig.1 Spam Email with German message_\n\nMicrosoft Word documents with malicious downloader Macros are quite common. In this\ncase, however, the attacker is using a rather old, but possibly still very effective scheme.\nAttached to the document is a javascript with a small thumbnail of what the recipient is\nintended to assume is their cable bill. It comes with the classic instruction to double-click on\nthe image to see it fully. As expected, doing so executes a malicious javascript, and initiates\nthe next step in the infection chain.\n\n_Fig.2 Document File with the disguised javascript_\n\nThe malicious JavaScript begins to install a fake SSL Certificate, and sets proxies on IE,\nChrome, and Mozilla browsers to a remote Proxy Auto Config (PAC) file. The address to the\nPAC file is a TOR URL (a tool that allows people to communicate anonymously on the\nInternet) that is randomly selected from its hard-coded configuration. It allows the system to\n\n\n-----\n\naccess the attacker s TOR site without installing TOR proxy software, by using .to\n(Tor2Web) and “.link” (Onion Link) URL extensions. These services act as relays between\nthe TOR network and the Web.\n\n_Fig.3 TOR URL config_\n\nThis is a very common setup for man-in-the-middle (MITM) attacks. By setting the browser\nproxies, the attacker can lead users to phishing pages like banks, payment sites, credit card\ncompanies, etc. It would not be a surprise to learn that those pages are registered using the\ninstalled fake SSL Certificate to assure users that the sites being accessed are legitimate\nand secure.\n\n_Fig.4 Installed Fake SSL Certificate Information_\n\n\n-----\n\n_Fig. 5 Fake Certificate Installed in IE_\n\nAs if not satisfied with installing a man-in-the-middle attack, the script then downloads a RAT\nserver.\n\n## The Ozone RAT Server and Core Module\n\nUpon searching for similar samples of the downloaded executable, some versions were\nfound to include debug information pointing to Ozone RAT. The similarities between these\nsamples and the code in our lab suggested that the executable is the Ozone RAT’s server\ncomponent, and was built using the tool. This assumption was further confirmed in our tests\non the RAT that we discuss later in this article.\n\nIt turns out that this is the “loader-only” version of the server. The core module (DLL),\ncontaining all the RAT capabilities, needs to be received from the client first. In this case,\nafter informing the client of the server’s existence, it then waits for the client to manually\ninitiate the sending of the module.\n\n\n-----\n\n_Fig. 6 Server must wait for the core DLL from client_\n\nOnce the encrypted core module is sent, it is dropped as “data.dbf” to the same path as the\nserver. This is later read and decrypted in memory for loading. This same file can also be\nfound in the Ozone package.\n\n\n-----\n\n_Fig. 7 Encrypted and decrypted core module_\n\nIt then uses a technique called Reflective DLL Injection, whereby it loads the decrypted\nmodule directly from memory using the Delphi API BTMemoryModule. This is commonly\nused for loading libraries directly from the binary’s resource. However, in this case, since the\nmodule is not from the binary’s actual resource, it’s possibly just an attempt to hide the\nmodule from process inspections since modules loaded this way will not be included in a\nprocess’ list of loaded libraries. It’s also possible that it’s just an adaptation of its other\nversion. This is briefly discussed later while discussing the module’s RAT capabilities.\n\n\n-----\n\n## Ozone RAT\n\nThe Ozone RAT website has been active for a year, offering 2 package options – Standard\n($20) and Platinum ($50). The latter offers a lifetime license and bonus features for Crypto\nMining and MSWord Exploit builder.\n\n_Fig.8 Ozone Website_\n\nIt was not difficult to find a “modified” version of the application for testing. We got ahold of\nOzone 0.55. Although based on the demo video from the website, version 0.60 is already\navailable.\n\nThe Ozone interface has all the characteristics of a typical RAT client - main interface, server\nbuilder, and a control center.\n\nThe main interface shows the status of the running servers and the active ports being used\nfor communication.\n\n_Fig.9 Main interface shows active connections_\n\nBuilding a server component is very simple. One does not need to be an expert to build one\nand distribute it. As mentioned earlier, the server has two versions - the “FAT” and the\n“loader-only” version. The former is bigger (duh!) because the core module is already\n\n\n-----\n\nincluded in the server binary as a resource. In this version, it makes more sense to use the\nReflective DLL Injection version to avoid additional dropped files. In the case of the latter, as\nmentioned previously, this can be a process inspection evasion or simply an adaptation of\nthe “FAT” version. It also has the option to pack the binary with a simple UPX.\n\n_Fig.10 Builder for the customizable server binary_\n\n\n-----\n\nAll RAT operations that can be executed by the server are in the Control Center interface.\nThis includes everything from simple file operations to fully controlling the system using a\nremote desktop. Its arsenal is common to RAT applications, except for the hVNC (or hidden\nVNC) module. Basically, hidden VNC takes advantage of Windows’ multiple desktop\ncapability to open a new hidden desktop session for the attacker to control. Since\napplications running from other desktops are invisible to others, an attacker can control the\nsystem and run applications without the user knowing - a very tricky feature to implement.\n\n_Fig.11 Control Center for the RAT operations_\n\nAs an attempt to prevent malicious usage, the website includes a list of Terms of Services\n(TOS), attempting to scare violators with a “license ban”. Included in the list are the terms,\n_“You are not allowed to use it in malicious ways” and “You are not allowed to send out a bin_\n_to another person’s PC's without their permission.” However, for a tool intended only for_\n\n\n-----\n\nlegitimate purposes, but at the same time including an exploit builder and hidden VNC as\nfeatures, there’s seems to be a little contradiction between its stated function and its actual\nfunctionality.\n\n## Conclusion\n\nAn important lesson here is that malware actors still use simple, but very effective socialengineering techniques to get those extra clicks from unaware and untrained users. Also, in\nthis particular case, in addition to an MITM setup, a RAT malware is installed in the system.\nThis multiple setup shows how much an attacker desires to take control of a system.\n\nWith RAT applications like Ozone, one does not need to be an expert to create and distribute\nmalware. Anyone can buy Ozone from their websites, or simply download “modified”\nversions, like what we used in our tests for this article. Some are publicly available, and can\nbe attractive to curious minds. Just a few words of caution, though. This can be a cunning\nordeal. These “modified” versions may be the malware themselves. With a lack of\nunderstanding how malware schemes work, even before starting your first attack, you may\ninadvertently become one of the first victims.\n\nFig.12 Keylog from the server installed by the modified Ozone RAT client\n\n## IOC’s\n\n70ece9b44f54fa5ac525908da412bf707ce7fae08a8f2b8134f34133df43e982 W32/OzoneRAT.A!tr\n\n71f1073d0b8aabaf0a2481e9b7c1cd0ca906fee719b45f7d4722d01884c75a17 JS/Nemucod.C060!tr.dldr\n\n-= FortiGuard Lion Team =\n## Related Posts\n\nCopyright © 2022 Fortinet, Inc. All Rights Reserved\n\n\n-----\n\n[Terms of ServicesPrivacy Policy](https://www.fortinet.com/corporate/about-us/legal.html)\n| Cookie Settings\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-08-29 - German Speakers Targeted by SPAM Leading to Ozone RAT.pdf"
    ],
    "report_names": [
        "2016-08-29 - German Speakers Targeted by SPAM Leading to Ozone RAT.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "33f527a5-a5da-496a-a48c-7807cc858c3e",
            "created_at": "2022-10-25T15:50:23.803657Z",
            "updated_at": "2025-03-27T02:00:55.550132Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "PLATINUM"
            ],
            "source_name": "MITRE:PLATINUM",
            "tools": [
                "JPIN",
                "Dipsind",
                "adbupd"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7d8ef10e-1d7b-49a0-ab6e-f1dae465a1a4",
            "created_at": "2023-01-06T13:46:38.595679Z",
            "updated_at": "2025-03-27T02:00:02.869216Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "TwoForOne",
                "G0068",
                "ATK33"
            ],
            "source_name": "MISPGALAXY:PLATINUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e61c46f7-88a1-421a-9fed-0cfe2eeb820a",
            "created_at": "2022-10-25T16:07:24.061767Z",
            "updated_at": "2025-03-27T02:02:10.094583Z",
            "deleted_at": null,
            "main_name": "Platinum",
            "aliases": [
                "ATK 33",
                "Operation EasternRoppels",
                "TwoForOne"
            ],
            "source_name": "ETDA:Platinum",
            "tools": [
                "AMTsol",
                "Adupib",
                "Adupihan",
                "Dipsind",
                "DvDupdate.dll",
                "JPIN",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "RedPepper",
                "RedSalt",
                "Titanium",
                "adbupd",
                "psinstrc.ps1"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536152,
    "ts_updated_at": 1743041556,
    "ts_creation_date": 1653709103,
    "ts_modification_date": 1653709103,
    "files": {
        "pdf": "https://archive.orkl.eu/d7c802c69fc706c702bf094b685ed93cdf9d2ada.pdf",
        "text": "https://archive.orkl.eu/d7c802c69fc706c702bf094b685ed93cdf9d2ada.txt",
        "img": "https://archive.orkl.eu/d7c802c69fc706c702bf094b685ed93cdf9d2ada.jpg"
    }
}