{
    "id": "f493efde-b8da-411a-9dc8-e4ce159213e1",
    "created_at": "2022-10-25T16:48:13.046772Z",
    "updated_at": "2025-03-27T02:16:58.192099Z",
    "deleted_at": null,
    "sha1_hash": "75e144bb2f67929f91e7565ad9a75464d2fba7f7",
    "title": "Goldfin Alert | Accenture",
    "authors": "",
    "file_creation_date": "2018-08-02T10:40:15Z",
    "file_modification_date": "2018-08-02T14:05:42Z",
    "file_size": 1335150,
    "plain_text": "# CYBER ADVISORY\n\n\n## GOLDFIN:\n### A Persistent Campaign Targeting CIS Countries with SOCKSBOT\n\n##### July 26, 2018\n\n\n-----\n\n#### SUMMARY\n\n\nA number of security vendors reported a series of cyber-attacks involving the use of a\nmalware family called SOCKSBOT and claimed to be associated with CANDLEFISH (a.k.a.\nPatchwork, Dropping Elephant). However, as disclosed in this report, research by\niDefense analysts shows that SOCKSBOT was in fact used by a threat group in an 18month-long campaign dubbed Goldfin, spoofing financial institutions in the\nCommonwealth of Independent States (CIS) countries since as early as February 2017 to\nas recently as May 2018. Based on the tactics, techniques and procedures (TTPs)\nobserved in this campaign, iDefense assesses with moderate confidence that the\nreported campaign is unlikely to be associated with CANDLEFISH.\n\nIn addition, iDefense analysts have identified infrastructure overlap and the shared use of\na PowerShell obfuscation technique with FIN7. Although these observations are not\nenough to attribute the Goldfin campaign to FIN7, iDefense assesses these to be\ninteresting and noteworthy observations that further highlights the complex\nrelationships that exist behind-the-scene in organized cyber crime.\n\n\n#### HOW TO USE THIS REPORT\n\n\n##### INTENDED AUDIENCE\n\niDefense is providing information about the reported campaigns to the general iDefense\ncustomer base, with this report being intended for security operations center (SOC)\nanalysts and engineers. Management and executive leadership may also want to use this\ninformation.\n\n##### HOW TO USE THIS INTELLIGENCE\n\niDefense is providing this information so that customers are aware of the modus\noperandi of a highly active threat group that is targeting financial institutions for financial\ngain. SOC analysts and engineers can use this IA's detailed information pertaining to the\nworkings of a malware family and indicators of compromise (IoCs) to contain or mitigate\nthe discussed threat through monitoring or blocking. SOC analysts can use the\ninformation provided in the Analysis and Mitigation sections of this IA for hunting\nactivities for systems that may have already been compromised. Analysts and security\nengineers can use the IoCs by adding them to hunting lists on endpoint detection and\nresponse (EDR) solutions as well as network- and host-based blacklists to detect and\ndeny malware implantation and command-and-control (C2) communication.\n\nIntelligence analysts may want to use the information provided in this IA to better inform\ntheir own analyses. The provided information can also help inform ongoing intelligence\n\n\n-----\n\nanalyses and forensic investigations, particularly for compromise discovery, damage\nassessment, and attribution.\n\nManagement and executive leadership may use this information to assess the risks\nassociated with the threat described herein to make operational and policy decisions\naccordingly.\n\n##### HOW THIS INTELLIGENCE HELPS ADDRESS EXISTING OR POTENTIAL THREATS\n\nKnowledge of the group's tactics, techniques, and procedures (TTPs) should help to\nbetter inform detection and response to attacks by this threat group.\n\n\n#### CAMPAIGN ANALYSIS\n\n\niDefense analysts came across two spear-phishing campaigns in October 2017 involving\nthe use of a malware family publicly known as SOCKSBOT. One campaign spoofs the\nHalyk Bank (Exhibit 1) and another spoofs the PrivatBank (Exhibit 2):\n\n_Exhibit 1: Spear-Phishing Email Spoofing Halyk Bank_\n\n\n-----\n\n_Exhibit 2: Content of a Spear-Phishing E-mail Spoofing PrivatBank Shared on the Public_\n_Forum doneckforum.com_\n\nAs Exhibits 1 and 2 show, both emails contain an identical message, even down to the\nlocation of the embedded hyperlinks. The only differences are the embedded URLs and\nthe signature of the email in order to reflect the financial institution the attackers were\nspoofing. This information suggests some sort of phishing kit was likely used to generate\nthe phishing emails.\n\nAn approximate translation of the e-mail spoofing Halyk Bank is as follows:\n```\n    Subject: Notification of opening an account (Halyk Bank of Kazakhs\n    tan)\n    Dear customer, an account with the People's Bank of Kazakhstan has\n    been opened in your name, you can find detailed information in the\n    attached file.\n    If you did not receive an envelope with a login and password, then\n    you need to register to access the Personal Area. In case of loss\n    of login / password, you can register a new one in the section \"Pa\n    ssword recovery\".\n    If in the process of work you have any questions or problems, plea\n    se contact the Customer Service Department at the contacts listed\n    below. Our specialists are always ready to help you.\n\n```\nThe embedded malicious hyperlinks used in the respective attacks are as follows:\n```\n    hxxp://halyk-bank[.]com/dog.zip \n    hxxp://privatbank-ua[.]com/dog.zip\n\n```\nSubsequent technical analysis of the infection chain involved led iDefense to uncover an\n18-month long campaign of spoofing banks in CIS countries, with the most recent\ncampaign observed on May 28, 2018 spoofing the Idea Bank CJSC:\n\n\n-----\n\n_Exhibit 3: Spear-Phishing Email Spoofing Idea Bank CJSC_\n\nThe forum member reports that two spear-phishing emails were received: one claiming\nto be a notification about opening an account and the other claiming to be a notification\nof a loan being taken out. The content of the latter email is approximately translated\nbelow:\n```\n    Dear client, in your name, a loan was issued to Idea Bank, for mor\n    e details, see the attached file in which the full name and phone\n    number of your personal loan expert is indicated, the amount and c\n    onditions for repaying the loan.\n    An envelope with a credit agreement was sent to your address. In c\n    ase you did not receive the envelope, you should contact your pers\n    onal expert.\n    In case of loss of the contract, you can restore it at the nearest\n    branch of the bank or request a duplicate through your personal ex\n    pert.\n    For any questions you are interested in, you can contact your pers\n    onal expert or the Customer Service Department at the contacts lis\n    ted below. Our specialists are always ready to help you.\n    Yours faithfully,\n    Idea Bank CJSC\n    Phone for calls from abroad: +375 (17) 306-33-14\n\n```\nIn the attacks observed, all involved a phishing email with two embedded URLs directing\nthe user to download a file named `dog.zip. Based on the content of the e-mails and the`\ndomain names, the following banks were spoofed in this campaign:\n\n  - Halyk Bank (Kazakhstan)\n\n  - PrivatBank (Ukraine)\n\n  - Idea Bank (Belarus)\n\n\n-----\n\n  - Tejara Bank (Iran)\n\nIt is also noteworthy that in both phishing kits, there are always two hyperlinks linking to\nthe same malicious file: one in the body of the message and one at the end of the e-mail\nin a link called `Договор (which translates to` `Contract).`\n\nThe next section details the infection chain that follows the initial download.\n\n#### INFECTION CHAIN ANALYSIS\n\nThe general infection chain observed in this campaign is as shown in Exhibit 4:\n\n_Exhibit 4: The Infection Chain Used in the SOCKSBOT Campaign_\n\n##### STAGE 1 - JAVASCRIPT DROPPER\n\n\nBoth links delivered a ZIP archive file named `dog.zip:`\n\n\n\n- `hxxp://halyk-bank[.]com/dog.zip - 211fbf34749df5e717e8b11fecb3f648`\n\n\n\n- `hxxp://privatbank-ua[.]com/dog.zip - b3fb88a5aa791aea141bf3b4cf045355`\n\n\nBoth contain a JavaScript file named `dog.js` with the MD5\n\nsignatures `9a273653364dfb143ff196d826d2bac4` and `21a09cf81f3584a741c7167f622d6c50`\n\n, respectively.\n\nThe JavaScript file contains heavily obfuscated code as Exhibit 5 shows. The malicious\ncode is in fact hidden as comments and is dynamically deobfuscated once the script has\nbeen executed.\n\n\n-----\n\nOnce deobfuscated (see Exhibit 6), it is clear that the code is designed to do two things:\n\n\n1. To look for a running anti-virus processes, such as `avp.exe` (Kaspersky Antivirus).\n\n\nNote that some variants of the malware also search\nfor `ekrn.exe` (ESET), `cis.exe` (Comodo) and `avgnt.exe` (Avira).\n\n\n2. To drop and execute a PowerShell script named `setup.ps1. This script is`\n\n\ngenerated based on Base64 encoded data stored in variables\nnamed dllData and `code.`\n\n\n3. Delete `setup.ps1`\n\n\n-----\n\n##### STAGE 2 - POWERSHELL DROPPER WITH EMPIRE\n\nThe PowerShell script `setup.ps1` used in each attack has the respective MD5\n\nsignatures 521c81c62836a233a6e771bc3491300f and `00c38b787eac602ffaed0b9372f2c443`\n\n.\n\nThe script is designed for the following (see Exhibit 7):\n\n\n1. Create a PowerShell script\n\n\nnamed `checkupdate.ps1` in C:\\Users\\Public\\Downloads\\ (This path is hardcoded\n\n\nin the malware). The content of this script is stored in a variable named `data` and is\nBased64 encoded\n2. Create a cmdlet that would:\n\n\na. move the script `checkupdate.ps1` to the home directory for the current\n\n\nPowerShell install\n\n\nb. establish persistence by creating a Windows service named `Check for`\n\n```\nupdates, set to \"delay-auto\" start and execute checkupdate.ps1\n\n```\n\n3. Use a modified version of the function `Invoke-EventVwrBypass from the Empire`\n\n\nPost-exploitation framework to bypass UAC and execute the above cmdlet\n\n\n-----\n\n##### STAGE 3 - POWERSHELL REFLECTIVE LOADER\n\nSimilarly, `checkupdate.ps1` used in each attack has the respective MD5\n\nsignatures 54e7f3a1a1a8857e35a45f4eb2a3317d\nand `29573b1fa60bce8e04dd2a4d554a7447.`\n\nUnsurprisingly, this script also contains obfuscated code. The malicious payload is\ncompressed, Base64 encoded, and embedded within the script, which is similar to a\n[technique used in PowerSploit.](https://github.com/PowerShellMafia/PowerSploit/blob/master/ScriptModification/Out-CompressedDll.ps1)\n\n\n_Exhibit 8: Obfuscated Code in_ `checkupdate.ps1`\n\n\nThe code is in fact a PowerShell reflective loader script with a dynamic-link library (DLL)\nbinary embedded as Base64-encoded data (Exhibit 9).\n\n\n-----\n\n##### STAGE 4 - SOCKSBOT\n\nThe specific SOCKSBOT sample analyzed in this report has the following properties:\n\n  - **Filename: socksbot.dll**\n\n  - **MD5: 90f35fd205556a04d13216c33cb0dbe3**\n\n  - **File Size: 17.0 KB (17408 bytes)**\n\n  - **Compiled Time Stamp: 2017-10-27 17:46:05**\n\n\n-----\n\nAs mentioned in the last section, the SOCKSBOT implant is typically delivered as a\nBase64-encoded string reflectively loaded (via the\n`?ReflectiveLoader@@YGKPAX@Z` exported function) in a newly\n\nstarted `svchost.exe` process. As such, the implant exists only in memory and never\ntouches the disk.\n\nThe implant will first verify if any of the mutexes in the following format are present in\norder to not run twice:\n```\nGlobal\\%snps \nGlobal\\%sstp\n\n```\nExhibit 10 shows an example of a created mutex.\n\n_Exhibit 10: Mutex Creation_ `a321c0d8979a05bdnps`\n\nThe SOCKSBOT implant has the following capabilities:\n\n  - Enumerate processes (process list)\n\n  - Take screenshots\n\n  - Download, upload, write, and execute files\n\n  - Create and inject into new processes\n\n  - Communicate to C2 via sockets\n\nThis implant will communicate with the designated C2 server by first creating a buffer\nand will, on first execution, communicate to the C2 server that it has successfully\ninfected a target by using a.php URI that is pseudo-randomly generated. SOCKSBOT\n\nuses the `ObtainUserAgentString` API to determine the default user-agent of the machine.\n\nAn example of a request to the C2 `46.166.163[.]243` is shown in Exhibit 11.\n\n_Exhibit 11: Traffic to the C2 Server_\n\nThe C2 server or the operator of the SOCKSBOT implant can then respond with a specific\nHTTP status code to perform a set of actions. Exhibit 12 shows this option in the implant.\n\n\n-----\n\nThe following status codes are supported:\n\n\n\n- `200: create and start new socket`\n\n\n\n- `202: enumerate processes and take screenshot`\n\n\n\n- `203: perform a set of actions (download, upload, execute)`\n\n\nExhibit 13 shows an example of possible actions:\n\n_Exhibit 13: HTTP Status Code_ `203` _Return Options_\n\nThe actions that the operator can perform are as follows:\n\n  - Write and execute files\n\n\n-----\n\n  - Execute PowerShell scripts\n\n  - Execute a PowerShell script and exit\n\nSOCKSBOT can thus write other PowerShell scripts to the `%TEMP%` folder and execute\nthese hidden from the user. This is achieved with the following command:\n```\n    %s\\System32\\WindowsPowerShell\\v1.0\\powershell.exe -ExecutionPolicy Bypas\n    s -NoLogo -NonInteractive -NoProfile -WindowStyle Hidden -File \"%s\"\n\n```\nThis allows the attacker to upload other obfuscated PowerShell scripts on the machine\nand, as such, makes SOCKSBOT a powerful and persistent backdoor.\n\nAltogether, the SOCKSBOT samples observed and analyzed in this report are as follows:\n```\n    90f35fd205556a04d13216c33cb0dbe3 \n    2a4d16ddad27c6eb60e197b6b07c2df0 \n    14f71d5cb8f15f0a9943b5d709a85b73 \n    92dfd0534b080234f9536371be63e37a \n    039d9e47e4474bee24785f8ec5307695 \n    55a57741f49d6c887992353bc47846bc\n\n```\nOnly three different C2 servers have been observed:\n```\n    5.8.88[.]64 \n    46.166.163[.]243 \n    5.135.73[.]113\n\n```\n\n#### INFECTION CHAIN VARIATIONS\n\n\nWhile the described infection chain above is the most common infection chain observed,\niDefense analysts have also observed a number of different variations in related\ncampaigns:\n\n1. SOCKSBOT Dropper\n2. dog.js Obfuscation\n3. Random PowerShell Script Names\n4. Reflective loading PowerShell Script Obfuscation\n\n##### VARIATION 1: SOCKSBOT DROPPER\n\nAside from the PowerShell reflective loader, iDefense analysts have also identified a\ndropper executable binary with the following properties that was used to reflectively\nload SOCKSBOT into a chosen process (usually `svchost.exe):`\n\n  - **Filename: <random>**\n\n  - **MD5: 14f71d5cb8f15f0a9943b5d709a85b73**\n\n  - **File Size: 23.6 KB (24200 bytes)**\n\n\n\n- **Compiled Time Stamp: 2017-02-01 13:40:14**\n\n\n-----\n\n- **Signer: Magnum Travel Club** (Serial: `1F 8A 3E 60 EE C1 E3 AA 63 B3 9B DD 26`\n\n```\nE1 10 FB)\n\n```\n\nNote that the binary was signed with a code-signing certificate purportedly from an\norganization called `Magnum Travel Club.`\n\nThis dropper will create a copy of itself in `C:\\Programdata\\Logs` as a hidden system file\nand will then delete the original file. Another copy will be created\nin `%appdata%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup` with the same\nproperties to ensure persistence.\n\nFinally, the dropper will start a new `svchost.exe` process in a suspended state and\n\nconsequently reflectively load (and inject) the SOCKSBOT implant into the process.\n\nAn additional Windows service may be created for persistence as well, which is done by\nfirst enumerating existing legitimate services and creating a new service spoofing one of\nthe services with an almost identical name.\n\nIn this case, a new service named `Xindows Error Reporting Service` was created (see\n\nExhibit 14).\n\n_Exhibit 14: Service Creation_\n\nWhile this dropper does indeed load the SOCKSBOT implant, all other iterations or\ncampaigns have used scripts, in particular JavaScript and PowerShell, to reflectively load\nthe SOCKSBOT payload.\n\n##### VARIATION 2: DOG.JS OBFUSCATION\n\nWhile most dog.js samples observed were obfuscated as reported in the infection chain\nsection, there are also versions that were not obfuscated at all or were obfuscated using\na different obfuscation technique such as different character encoding (Exhibit 15):\n\n\n-----\n\n_Exhibit 15: A Different Obfuscation Technique Used in dog.js_\n\nOnce executed, this sample (MD5: `b01cf8f375bc0aff2cfe3dc1b4c1823c) will deobfuscate`\n\nand generate a new file called `~~1.tmp` in %appdata%\\Futures. The script is deleted after\nexecution.\n\n##### VARIATION 3: RANDOM POWERSHELL SCRIPT NAMES\n\nCertain variants of dog.js also have a new function to randomly generate file names for\nthe second- and third-stage PowerShell scripts:\n```\n    function makerndps1() {\n      var text = \"\";\n      var possible = \"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz\n    0123456789\";\n      for (var i = 0;\n      i < 5;\n      i++) text += possible.charAt(Math.floor(Math.random() * possible.l\n    ength));\n      return text + '.ps1';\n    }\n\n##### 4. REFLECTIVE LOADING POWERSHELL SCRIPT OBFUSCATION\n\n```\nAside from changes to the dog.js obfuscation, iDefense analysts have also found a\ndifferent obfuscation technique used to obscure the code in the reflective loading script\n(see Exhibit 16):\n\n\n-----\n\nBased on the preference to spoof financial institutions in CIS countries, the network\ninfrastructure used and the observed targeting, iDefense assesses with moderate\nconfidence that the reported campaign is unlikely to be associated with CANDLEFISH.\n\nFurthermore, iDefense analysts have identified a number of interesting and noteworthy\noverlaps with FIN7:\n\n  - Identical WHOIS information used in domains associated with the Goldfin\ncampaign and FIN7, as well as network hosting overlap\n\n  - Shared use of a PowerShell obfuscation technique\n\n\n-----\n\n##### OVERLAP 1: IDENTICAL WHOIS INFORMATION AND NETWORK HOSTING OVERLAP\n\n\nResearch shows that the domains `privat-bankau[.]com, halyk-bank[.]com, and` `tejara-`\n\n\n`bank[.]com` all have the organization name `Goldfin LLC, a near-identical registrant`\n\n\naddress (see below), and a @rambler.ru e-mail address used as the registrant e-mail\naddress.\n```\n    Registrant Organization: Goldfin LLC\n    Registrant Street: ul Arbat 5  \n    Registrant City: Moscow\n    Registrant State/Province: Moscow\n    Registrant Postal Code: 115343\n    Registrant Country: RU\n\n```\nThis pattern overlaps with two other domains `despanabrandfood[.]com` and `silverdiners[.]com` (see Exhibit 18) - that iDefense current\nassesses with low confidence are likely associated with FIN7 due to the following:\n\n\n1. Spoofing restaurant chains Despaña Brand Foods (legitimate\n\n\ndomain `despanabrandfoods.com) and Silver Diner (legitimate`\ndomain silverdiners.com), a known technique associated with FIN7. The website\n```\ndespanabrandfood[.]com remains indexed by Google (see Exhibit 19)\n\n```\n\n2. Previously resolved to the IP address `192.99.14[.]211, which was reported by`\n\n\nTrustwave and tr1dx as associated with FIN7 towards late 2016 and early 2017. In\naddition, like many domains associated with FIN7 as well as the Carbanak group,\nmany of the domains used in the Goldfin campaign were also parked at\n```\n31.41.41[.]41 which is associated with CIS Hosting. However, iDefense analysts\n\n```\nare aware both hosts are likely to be shared/parking hosts hence the association\nwith FIN7 based on this overlap is of low confidence.\n\n\n-----\n\nExhibit 20 illustrates the overlapping infrastructure between the Goldfin campaign and\ninfrastructure associated with FIN7:\n\n\n-----\n\n##### OVERLAP 2: SHARED USE OF A POWERSHELL OBFUSCATION TECHNIQUE\n\nAs mentioned in the infection chain analysis, the code embedded within the third-stage\nPowerShell script `checkupdate.ps1` is obfuscated using a technique similar to that of\nPowerSploit. However, the technique used appears to be a niche variant as the\nembedded payload is further split into chunks and dynamically added to an array variable\nnamed `$OArr.`\n\nInterestingly, iDefense analysts have previously observed this obfuscation used in a\nPowerShell component (MD5: 87327b4045b9d004697aec7e7a4b9ba8) that was dropped by\na HALFBAKED sample (MD5: 31fcf8a4ec7a4c693eda9336321cf401) back in August 2017.\nHALFBAKED is a malware family associated with FIN7.\n\n_Exhibit 21: Similar PowerShell Obfuscation Technique Used between the Goldfin_\n_Campaign and FIN7_\n\nWhile the above overlapping features are not strong enough to be used to conclude that\nthe Goldfin campaign is associated with FIN7, iDefense analysts believe they are\nsignificant and noteworthy and may well add to new evidence that may come to light in\nthe future as research continues. They also highlight the complex hidden relationships\nthat exist behind-the-scenes in organized cyber crime.\n\n\n#### MITIGATION\n\n\nTo effectively defend against the threats described in this report, iDefense recommends\nblocking the following access URIs and IP address:\n```\n    blopsadmvdrl[.]com \n    bipovnerlvd[.]com \n    kiprovolswe[.]com \n    kiprovol[.]com \n    voievnenibrinw[.]com \n    bnrnboerxce[.]com \n    tejara-bank[.]com \n    privat-bankau[.]com \n\n```\n\n-----\n\n```\n    halyk-bank[.]com \n    wedogreatpurchases[.]com \n    privatbank-ua[.]com \n    moneyma-r[.]com \n    fisrteditionps[.]com \n    essentialetimes[.]com \n    dewifal[.]com \n    micro-earth[.]com \n    5.8.88[.]64 \n    46.166.163[.]243 \n    5.135.73[.]113\n\n```\nIt will also be useful for incident response and threat-hunting purposes to verify the\nexistence of any of the following artefacts:\n\n  - A randomly named file\nin `C:\\Programdata\\Logs` or %appdata%\\Microsoft\\Windows\\Start\n```\n    Menu\\Programs\\Startup\n\n```\n  - Randomly named PowerShell or JavaScript files in `%temp%`\n\n\n\n- A file named `dog.zip` and `dog.js`\n\n\n\n  - A file named `~~1.tmp in` `%appdata%\\Futures`\n\n  - A service name with significant spelling errors\n\n  - A service named `Check for updates`\n\n  - A PowerShell script named `checkupdate.ps1` in default PowerShell installation\ndirectory\n\n  - A svchost.exe process that does not have wininit.exe as parent process\n\nIt will also be useful to verify the existence of any of the following hashes on the host:\n```\n    de394e9d294d2c325298eb54826ba116 \n    09d43765c2259a8df868a5fa6206ae2b \n    9a273653364dfb143ff196d826d2bac4 \n    6da6025fc7956f644b0b161781071cec \n    211fbf34749df5e717e8b11fecb3f648 \n    dae11ed0013d58000f10919b8cba8023 \n    949b7e0f9d309e8a7ab32fa4664a7906 \n    bdaa27c6284ff95c01178db7a96121a4 \n    50598c4dc7c299d0cbd92c128a56944e \n    21a09cf81f3584a741c7167f622d6c50 \n    b3fb88a5aa791aea141bf3b4cf045355 \n    54e7f3a1a1a8857e35a45f4eb2a3317d \n    29573b1fa60bce8e04dd2a4d554a7447 \n    7b528c9d8150e4a4ab27b90a4e333763 \n    7f1aa2b2d539aa7d3dbb067417457309 \n    b10c3d00a7ceff0b7050f450968c8f69 \n    29573b1fa60bce8e04dd2a4d554a7447 \n    c38b06f871d2268972fa01725b59d7ed\n\n```\n\n-----\n\n#### CONTACT US\n\n\nJoshua Ray\njoshua.a.ray@accenture.com\n\nHoward Marshall\nhoward.marshall@accenture.com\n\nRobert Coderre\nrobert.c.coderre@accenture.com\n\nJayson Jean\njayson.jean@accenture.com\n\nEmily Cody\nemily.a.cody@accenture.com\n\n\n-----\n\n##### ABOUT ACCENTURE\n\nAccenture is a leading global professional services company, providing a broad range of services\nand solutions in strategy, consulting, digital, technology and operations. Combining unmatched\nexperience and specialized skills across more than 40 industries and all business functions—\nunderpinned by the world’s largest delivery network—Accenture works at the intersection of\nbusiness and technology to help clients improve their performance and create sustainable value\nfor their stakeholders. With approximately 425,000 people serving clients in more than 120\ncountries, Accenture drives innovation to improve the way the world works and lives. Visit us at\n**[www.accenture.com](http://www.accenture.com/)**\n\n##### ABOUT ACCENTURE SECURITY\n\nAccenture Security helps organizations build resilience from the inside out, so they can\nconfidently focus on innovation and growth. Leveraging its global network of cybersecurity labs,\ndeep industry understanding across client value chains and services that span the security\nlifecycle, Accenture protects organization’s valuable assets, end-to-end. With services that\ninclude strategy and risk management, cyber defense, digital identity, application security and\nmanaged security, Accenture enables businesses around the world to defend against known\nsophisticated threats, and the unknown. Follow us @AccentureSecure on Twitter or visit the\nAccenture Security blog.\n\n**LEGAL NOTICE & DISCLAIMER: © 2018 Accenture. All rights reserved. Accenture, the Accenture logo, iDefense and other**\ntrademarks, service marks, and designs are registered or unregistered trademarks of Accenture and its subsidiaries in the United\nStates and in foreign countries. All trademarks are properties of their respective owners. All materials are intended for the original\nrecipient only. The reproduction and distribution of this material is forbidden without express written permission from iDefense.\nThe opinions, statements, and assessments in this report are solely those of the individual author(s) and do not constitute legal\nadvice, nor do they necessarily reflect the views of Accenture, its subsidiaries, or affiliates.\n\nGiven the inherent nature of threat intelligence, the content contained in this alert is based on information gathered and\nunderstood at the time of its creation. It is subject to change.\n\nACCENTURE PROVIDES THE INFORMATION ON AN “AS-IS” BASIS WITHOUT REPRESENTATION OR WARRANTY AND ACCEPTS NO\nLIABILITY FOR ANY ACTION OR FAILURE TO ACT TAKEN IN RESPONSE TO THE INFORMATION CONTAINED OR REFERENCED IN\nTHIS ALERT.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.08.02.Goldfin_Security_Alert/Accenture-Goldfin-Security-Alert-1.pdf"
    ],
    "report_names": [
        "Accenture-Goldfin-Security-Alert-1"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7ea1e0de-53b9-4059-802f-485884180701",
            "created_at": "2022-10-25T16:07:24.04846Z",
            "updated_at": "2025-03-27T02:02:10.090459Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "APT-C-09",
                "ATK 11",
                "Capricorn Organisation",
                "Chinastrats",
                "Dropping Elephant",
                "Maha Grass",
                "Quilted Tiger",
                "TG-4410",
                "Thirsty Gemini",
                "Zinc Emerson"
            ],
            "source_name": "ETDA:Patchwork",
            "tools": [
                "AndroRAT",
                "Artra Downloader",
                "ArtraDownloader",
                "AutoIt backdoor",
                "BADNEWS",
                "BIRDDOG",
                "Bahamut",
                "Bozok",
                "Bozok RAT",
                "Brute Ratel",
                "Brute Ratel C4",
                "CinaRAT",
                "Crypta",
                "ForeIT",
                "JakyllHyde",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "NDiskMonitor",
                "Nadrac",
                "PGoShell",
                "PowerSploit",
                "PubFantacy",
                "Quasar RAT",
                "QuasarRAT",
                "Ragnatela",
                "Ragnatela RAT",
                "SocksBot",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL",
                "Yggdrasil"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2b29dd16-a06f-4830-81a1-365443bc54b8",
            "created_at": "2023-01-06T13:46:38.460047Z",
            "updated_at": "2025-03-27T02:00:02.839173Z",
            "deleted_at": null,
            "main_name": "QUILTED TIGER",
            "aliases": [
                "ATK11",
                "G0040",
                "Orange Athos",
                "Chinastrats",
                "Sarit",
                "Dropping Elephant",
                "APT-C-09",
                "Thirsty Gemini",
                "ZINC EMERSON"
            ],
            "source_name": "MISPGALAXY:QUILTED TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041818,
    "ts_creation_date": 1533206415,
    "ts_modification_date": 1533218742,
    "files": {
        "pdf": "https://archive.orkl.eu/75e144bb2f67929f91e7565ad9a75464d2fba7f7.pdf",
        "text": "https://archive.orkl.eu/75e144bb2f67929f91e7565ad9a75464d2fba7f7.txt",
        "img": "https://archive.orkl.eu/75e144bb2f67929f91e7565ad9a75464d2fba7f7.jpg"
    }
}