{
    "id": "f4f19ef7-84b2-4efc-8e87-49020aa045d7",
    "created_at": "2023-01-12T15:08:06.434093Z",
    "updated_at": "2025-03-27T02:05:25.632494Z",
    "deleted_at": null,
    "sha1_hash": "eaa54eb25d7af409ae67f3fc726c302678c82cb5",
    "title": "2021-07-14 - LOCKDATA Auction – Another leak marketplace showing the recent shift of ransomware operators",
    "authors": "",
    "file_creation_date": "2022-05-28T19:55:31Z",
    "file_modification_date": "2022-05-28T19:55:31Z",
    "file_size": 703166,
    "plain_text": "# LOCKDATA Auction – Another leak marketplace showing the recent shift of ransomware operators\n\n**[telekom.com/en/blog/group/article/lockdata-auction-631300](https://www.telekom.com/en/blog/group/article/lockdata-auction-631300)**\n\nBlog.Telekom\n\n07‑14‑2021\n[Nils Stünkel](https://www.telekom.com/en/blog/631290-631290)\n\n5 Comments\n\nShare Share\nTwo clicks for more data privacy: click here to activate the button and send your\nrecommendation. Data will be transfered as soon as the activation occurs.\n\nPrint\n[Read out](https://app-eu.readspeaker.com/cgi-bin/rsent?customerid=4779&lang=en&readid=readspeakercontent&url=https://www.telekom.com/en/blog/group/article/lockdata-auction-631300)\n\nBy now policy makers all over the world identify ransomware as a significant threat to our\ndigital society. In the aftermath of the [Colonial Pipeline Attack in May 2021 that caused](https://en.wikipedia.org/wiki/Colonial_Pipeline_Cyberattack)\nwidespread gasoline shortages in several US states, ransomware was more discussed than\never. President Biden recently requested Russian President Putin to crack down on\nransomware operations and the U.S. Department of Justice is elevating investigations of\nransomware attacks to a similar priority as terrorism. This caused panic in the ransomware\nunderground with some underground forums banning advertisements for ransomware\noperations.\n\n\n-----\n\nLOCKDATA Auction shows the recent shift of ransomware operators. (Bild von Gerd Altmann\nauf Pixabay)\n\nThe ransomware underground is constantly innovating and finding new ways to operate. One\n[of these recent innovations is the rise of stolen data marketplaces. Instead of using the](https://www.bleepingcomputer.com/news/security/data-leak-marketplaces-aim-to-take-over-the-extortion-economy/)\ndouble extortion approach, i.e. encrypting the infrastructure and threatening to release stolen\ndata, former ransomware gangs shift to data-theft extortion operations only. One reason for\nthis might be to evade the measures that authorities are now putting in place due to events\nlike the Colonial Pipeline Attack. Two examples for such marketplaces are Marketo and File\nLeaks.\n\nIn this blog post, [Thomas Barabosch and I will talk about another leak site that Deutsche](https://www.telekom.com/en/blog/592636-592636)\nTelekom Security recently encountered: LOCKDATA Auction. We will describe what\nLOCKDATA Auction is and give insights into a CryLock ransomware case where the CryLock\naffiliate worked with this portal. And, of course we provide analysis resources for CryLock\n[ransomware including YARA rules at our Github repository.](https://github.com/telekom-security/malware_analysis/tree/main/crylock)\n\nThe Incident Response Team at Deutsche Telekom Security GmbH can quickly investigate\nand help you remediate ongoing ransomware intrusions. For more information, please\ncontact: [DFIR@telekom.de.](http://10.10.0.46/mailto:DFIR@telekom.de)\n\n## What is LOCKDATA Auction?\n\nLOCKDATA Auction is a Darknet portal that Deutsche Telekom Security is aware of since\nMay 2021. Figure 1 depicts the main page of LOCKDATA Auction. It appears to offer various\nauctions of stolen data from victims worldwide. The country of origin of the victims is always\nannotated, e.g. Saudi Arabia or USA. Auctions appear to be open for more than one month\nin some cases.\n\nFigure 1: LOCKDATA Auction victim listing.\n\nThe registration for auctions is described as invite-only (see Figure 2). Underground\nmarketplace operators frequently use reputation based or referral systems to better protect\ntheir identities from investigators and shield their communication methods from outsiders.\n\nFigure 2: Registration for auctions is invite-only.\n\nBut, to our surprise, when we looked through the page code to learn how invites worked\nunder the hood, we discovered that the “Sign up” and “Sign in” functions were completely\nnon-functional.\n\nUsually, when a user tries to log into a webpage, the user’s browser will have to check in with\nthe server and verify that their credentials are correct. This page doesn’t do that at all - it will\nalways just display a message like “Error: Login or password entered incorrectly” or “Error:\nWrong invite code!” immediately when “Sign in” or “Sign up” is clicked.\n\n\n-----\n\nFigure 3: The code responsible for the Sign up and Sign in forms.\n\nSo, what does this mean? Most likely, since the portal is fairly new, functionality might still be\nin development. Another hypothesis is that the site merely serves as a menacing mockup of\nan online auction site, to coerce victims into paying the ransom. During our investigation, we\nhave observed a ransomware operator change victim information on the auction site on the\nfly, which proves they have direct access to LOCKDATA Auction.\n\nAuctions have a start price (ranging from $50 000 to $500 000), a minimum deposit (ranging\nfrom $0 to $50 000 dollars), and a blitz price (up to $1 500 000). The website shows the top\nbet for active auctions as well. In some cases, the top bet is less than the starting price.\nThere is a link to preview data, which however was broken in most cases (as of time of\nwriting). The descriptions of the victims and data sets is comprehensive. Data set sizes\nrange from 50 GB to 2 TB. Figure 3 shows an example of an active auction.\n\nFigure 4: An active auction on LOCKDATA Auction.\n\nSuccessfully concluded auctions are still listed on the website. Their download link is\n“locked” but there is still a button to contact the seller. Figure 4 depicts an example of a\nfinished auction. In this case, supposedly $40 000 were paid for 2 terabytes of personal data\nof a North American public entity.\n\nFigure 5: A completed auction on LOCKDATA Auction.\n\n## Who offers leaks on LOCKDATA Auction?\n\nDeutsche Telekom Security was involved in a LOCKDATA Auction case. In this occasion, the\nthreat actor utilized the CryLock ransomware to encrypt the victim’s environment.\n\n[CryLock is a ransomware from the Russian cybercrime underground. It follows a](https://malpedia.caad.fkie.fraunhofer.de/details/win.cryakl)\nRansomware-as-a-Service (RaaS) model, where “partners” (or “affiliates”) acquire the\nransomware to deploy it in victim environments. The first reference to this ransomware was\nin 2014. Back then, it was publicly known as Crykal. A take-down of its infrastructure took\n[place in 2018, resulting in a decryptor being published. In 2020, Crykal was rebranded under](https://twitter.com/LawrenceAbrams/status/1254471019047399424?s=20)\nthe name CryLock.\n\nCryLock is written in Delphi, so obfuscations are nearly non-existent. There is a check\nwhether or not the victim is located in a CIS (Commonwealth of Independent States) country,\nwhich is a common check for malware families from Russia and other CIS states. The\n[ransomware encrypts files using a combination of RSA and a custom symmetric algorithm.](https://hackmag.com/security/ransomware-russian-style/)\nAfter encryption, it drops a file called “how_to_decrypt.hta” as seen in Figure 5. The key\ntakeaway is that the victim must contact the ransomware affiliate using the provided email\naddress and a unique victim ID. This is the general course of action that CryLock affiliates\nfollow.\n\n\n-----\n\nFigure 6: how_to_decrypt.hta shows information to the victim.\n\nHowever, in this particular case the modus operandi was slightly different. We observed how\n[the threat actor utilized a Batch file to also add a legal notice to show on startup of the](https://www.howtogeek.com/howto/15771/display-a-text-message-during-bootup-of-windows-7/)\nencrypted systems. This legal notice stated the following:\n\n“Your system has been tested for security by the CryLOCK Ramsoware team and has failed.\nWe specialize in file encryption and are also involved in industrial (also economic or\ncorporate) espionage. We don't care about your files and what you do, nothing personal - it's\njust business. We recommend contacting us, as your confidential files have been stolen and\nwill be sold to interested people if you do not pay for their removal or decryption of the files.\nOne of the email for communication: [REDACTED]@[REDACTED].com Do not use\ncorporate email for communication, in most cases your letters will not reach us. Our auction\nof information and confidential files, hosted in Tor [REDACTED].onion or\nhttp://[REDACTED].”\n\nIn their notice, the threat actor refers to the “CryLOCK Ramsoware [sic] team”. In addition to\nthe aforementioned email address for communication purposes, they also provide the link to\nLOCKDATA Auction.\n\n## “Search Keys” Utility\n\n[The notice also contained an additional (shortened) Internet link. This link resolved to a cloud](https://www.telekom.com/en/glossary#glossar381510)\nhosting provider (see Figure 7), where the “Search_keys_CryLOCK_3.0.exe” tool could be\ndownloaded.\n\nThe page also contained a wallpaper of a part of the legal notice quoted above. Again, the\nsame typo can be seen here. At this point, we are not sure whether this is an unintended\ntypo or a stylization of the word “ransomware”. There were several communication channels\nmentioned: two email addresses and the TOR link to LOCKDATA Auction. One email\naddress refers to CryLock and one to the auctioneer who was responsible for the auction on\nLOCKDATA Auction.\n\nFigure 7: CryLock tool hosted at cloud hosting provider.\n\nThe tool “Search_keys_CryLOCK_3.0.exe” (see Figure 7) itself is rather interesting. This\nDelphi 7 utility can scan local disks as well as network storage for files that CryLock\nencrypted. It supposedly will also identify which generation of encryption mode was used on\nthe files. Furthermore, it can kill CryLock related processes (e.g. mshta.exe, which shows the\nransom note).\n\nFigure 8: CryLock Delphi Tool Search_keys_CryLOCK_3.0.exe.\n\n\n-----\n\n## Access Brokering\n\nNowadays, ransomware is teamwork. Administrator access to systems is gained and sold by\n[specialized hackers, sometimes for as low as $10. When an access path changes hands, we](https://www.telekom.com/en/glossary#glossar381602)\ntypically observe a change in the way the attack is carried out.\n\nIn this case, we discovered that the initial compromise of the victim’s environment had been\nsupported by a very distinct set of attacker infrastructure, tools, and mannerisms. The exact\nsame behavior was observed in an entirely different case that occurred around the same\ntime, but where another RaaS was used. This indicates that the actor using those tools may\nbreach different victims and then either trade the access to one or more other group(s) or\ndeploy different last stage payloads themselves.\n\n## Conclusion\n\nLOCKDATA Auction is a new player in the field of darknet marketplaces. At this time, the site\nlacks basic functionality one would expect from an online auction site but is likely to grow\nover time.\n\nAt this point, it is not 100% clear whether LOCKDATA Auction is exclusive to CryLock\naffiliates or open to other ransomware operations as well, even though the similarity in\nbranding between CryLock and LOCKDATA is striking. The attackers state with typos that\nthe CryLock ransomware team attacked a victim’s environment, which may suggest a group\nof people working together more closely than in a typical RaaS affiliate model. On the other\nside, the link to LOCKDATA Auction was not directly provided in the ransom note. It was\nshown to the victim only through a pre-login “legal notice” in Windows. Also, separate email\naddresses are listed for communication: one CryLock-related and one for the auctioneer at\nLOCKDATA Auction.\n\nThe ransomware landscape is innovating at a fast pace. Reactions of nation-states due to\nrecent events like the Colonial Pipeline Attack in May 2021 are just increasing the velocity.\nOne recent trend are stolen data (or leak) marketplaces like LOCKDATA Auction. These\nmarketplaces offer threat actors a way to publish and monetize stolen data as leverage for\ntheir data-theft extortions.\n\n### Appendix A: IOCs\n\n**IOC** **Description**\n\ne89135d80017e9da16b187ebe0a9de64 Search_keys_CryLOCK_3.0.exe\n\n58a65f8e2075fd8ea32cd2a0384de10c Sample “how_to_decrypt.hta”\n\n\n-----\n\n3139ca1821331314c95816b92fe24c29 Sample CryLock 2.3.0.0\n\n[On topicBleepingComputer: Data leak marketplaces aim to take over the extortion economy](https://www.bleepingcomputer.com/news/security/data-leak-marketplaces-aim-to-take-over-the-extortion-economy/)\n\n[Reuters: Exclusive: U.S. to give ransomware hacks similar priority as terrorism](https://www.reuters.com/technology/exclusive-us-give-ransomware-hacks-similar-priority-terrorism-official-says-2021-06-03/)\n\n© Gerd Altmann auf Pixabay\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-14 - LOCKDATA Auction – Another leak marketplace showing the recent shift of ransomware operators.pdf"
    ],
    "report_names": [
        "2021-07-14 - LOCKDATA Auction – Another leak marketplace showing the recent shift of ransomware operators.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536086,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653767731,
    "ts_modification_date": 1653767731,
    "files": {
        "pdf": "https://archive.orkl.eu/eaa54eb25d7af409ae67f3fc726c302678c82cb5.pdf",
        "text": "https://archive.orkl.eu/eaa54eb25d7af409ae67f3fc726c302678c82cb5.txt",
        "img": "https://archive.orkl.eu/eaa54eb25d7af409ae67f3fc726c302678c82cb5.jpg"
    }
}