{
    "id": "f5695123-36b7-42c8-91b8-feaef0159d53",
    "created_at": "2023-01-12T15:04:06.276178Z",
    "updated_at": "2025-03-27T02:11:48.881302Z",
    "deleted_at": null,
    "sha1_hash": "4083c5202fa4e174c5609981f259d72e155d6d64",
    "title": "2022-08-24 - Looking for the ‘Sliver’ lining- Hunting for emerging command-and-control frameworks",
    "authors": "",
    "file_creation_date": "2022-09-01T10:26:43Z",
    "file_modification_date": "2022-09-01T10:26:43Z",
    "file_size": 1035744,
    "plain_text": "# Looking for the ‘Sliver’ lining: Hunting for emerging command-and-control frameworks\n\n**microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-**\nframeworks\n\nAugust 24, 2022\n\nMicrosoft has observed the Sliver command-and-control (C2) framework now being adopted\n[and integrated in intrusion campaigns by nation-state threat actors, cybercrime groups](https://www.ncsc.gov.uk/files/Advisory%20Further%20TTPs%20associated%20with%20SVR%20cyber%20actors.pdf)\n[directly supporting ransomware and extortion, and other threat actors to evade detection.](https://aka.ms/ransomware-as-a-service)\nWe’ve seen these actors use Sliver with—or as a replacement for—Cobalt Strike. Given\nCobalt Strike’s popularity as an attack tool, defenses against it have also improved over time.\nSliver thus presents an attractive alternative for actors looking for a lesser-known toolset with\na low barrier for entry.\n\nFirst made public in late 2019 and advertised to security professionals, Sliver is an opensource framework that’s available on GitHub and includes many common C2 framework\nfeatures such as support for multiple simultaneous operators, multiple listener types, userdeveloped extensions, and payload generation. Since December 2020, we’ve observed\nthreat actors adopting Sliver into their arsenal.\n\n\n-----\n\nAmong its adopters is the prolific ransomware-as-service (RaaS) affiliate [DEV-0237. More](https://aka.ms/ransomware-as-a-service#DEV-0237)\nrecently, we’ve seen cybercrime actors historically tied to human-operated ransomware now\ndeliver Sliver and various post-compromise tools using Bumblebee malware (also known as\nCOLDTRAIN) as an initial access loader. Customers can learn more about Bumblebee in our\n[Threat Analytics report available in the Microsoft 365 Defender portal.](https://www.microsoft.com/security/business/siem-and-xdr/microsoft-365-defender)\n\n[In this blog, we share how the researchers behind Microsoft Defender Experts for Hunting](https://www.microsoft.com/security/business/services/microsoft-defender-experts-hunting)\nanalyzed Sliver and used both lab-simulated attacks and real-world threat activity to create\nhunting queries to surface Sliver and other C2 frameworks.\n\n## Threat hunting: Part art(ifact), all science\n\nFor security researchers, there’s a distinction between hunting and detection. For novel\nthreats, researchers try to strike a balance between high-fidelity detection rules identifying a\nspecific, known malware family, threat actor, or class of behavior and low-fidelity hunting\nrules, which generate more false positives but also more generically capture a technique and\nits derivatives.\n\nThe following sections illustrate the art and science of how these lower-fidelity rules help\nthreat hunters measure and contextualize suspicious observations to find novel or stealthy\nthreats.\n\n### Sleuthing Sliver\n\nThreat actors use C2 frameworks to manage their access to compromised hosts and\nnetworks during an intrusion. A C2 framework usually includes a server that accepts\nconnections from implants on a compromised system, and a client application that allows the\nC2 operators to interact with the implants and launch malicious commands.\n\nMany threat actors integrate public, open-source C2 framework options into their arsenal\nbecause these have a low barrier to entry and offer several advantages for attackers like low\ncost, ease of modification, and difficult attribution. As previously mentioned, Sliver is one\nsuch open-source framework. Although Sliver is somewhat new, the TTPs it implements are\ncommon across many frameworks.\n\nBelow are examples of how Defender Experts hunt for these TTPs to identify Sliver and\nother emerging C2 frameworks in customer environments.\n\n**Infrastructure**\n\nSliver, like many C2 frameworks, supports various network protocols such as DNS,\nHTTP/TLS, MTLS, and TCP. It can also accept implant or operator connections and host files\nto impersonate a benign web server.\n\n\n-----\n\nThe first step in testing any C2 framework is starting listeners and scanning them to identify\nanomalies. Some common artifacts are unique HTTP header combinations and JARM\nhashes, the latter of which are active fingerprinting techniques for TLS servers. RiskIQ has\n[shared such a methodology for Sliver and](https://ti.defender.microsoft.com/articles/b1406335) [Bumblebee detection.](https://ti.defender.microsoft.com/articles/0b211905)\n\n**Payloads**\n\nSince Sliver is written in the Go programming language (GoLang), its implants are crossplatform compatible. By default, operators can generate implants in several formats,\nincluding:\n\nShellcode\nExecutable\nShared library/DLL\nService\n\n[Sliver also supports stagers—smaller payloads with few built-in features that are primarily](https://github.com/BishopFox/sliver/wiki/Stagers)\nintended to retrieve and launch a full implant. Stagers are used by many C2 frameworks to\nminimize the malicious code that’s included in an initial payload (for example, in a phishing\nemail). This can make file-based detection more challenging.\n\nHowever, operators don’t need to use Sliver’s default DLL or executable payloads. Motivated\nthreat actors can generate a Sliver shellcode and embed it in custom loaders like Bumblebee\nthat then runs the Sliver implant on a compromised system. Detection engineers can create\nloader-specific detections or, if the shellcode isn’t obfuscated, rules for the shellcode payload\nthat is embedded in the loader.\n\n**Config extraction**\n\nWhen responding to a suspected intrusion, security analysts may find themselves with a\nmalware payload with little context. Quickly extracting key configuration details from the\nmalware like C2 address, network configurations, and other implant details is a crucial step\nin hunting for affected devices in the network.\n\nMany implants, including Sliver, heavily obfuscate or encrypt useful information to prolong\nanalysis and detection attempts. Sliver, like other implants based on GoLang, uses the public\n[gobfuscate library for this purpose. Several researchers have created tools to assist with “de-](https://github.com/unixpickle/gobfuscate)\ngobfuscating” strings in payloads, but it is still a fairly manual process[1].\n\nIn such cases, we can extract configurations we are interested in more easily when they’re\nloaded into memory. Sliver must de-obfuscate and decrypt its configurations to use them, so\nwe can scan memory for these values and extract them programmatically to get results like\nconfiguration data, as illustrated in Figure 1 below:\n\n\n-----\n\nFigure 1. Sample configuration extraction from a Sliver test implant\nThere are similar public de-obfuscation tools for Cobalt Strike, such as\n[Apr4h/CobaltStrikeScan and](https://github.com/Apr4h/CobaltStrikeScan) [CCob/BeaconEye.](https://github.com/CCob/BeaconEye)\n\nSome malware will attempt to obfuscate or encrypt configurations in memory as well. Cobalt\nStrike’s [“sleep_mask” is a good example of this. However, it’s important to note that even in](https://www.cobaltstrike.com/blog/sleep-mask-update-in-cobalt-strike-4-5/)\nthese cases, the malware must decrypt the configurations when it wants to check in with the\nC2 server for new instructions. Thus, extracting configurations from memory requires\nintentional timing.\n\n**Code execution**\n\nSliver includes a variety of built-in techniques and post-exploitation functionality. One of the\nmost common underlying techniques used by C2 operators and frameworks is process\ninjection, which is a method of running arbitrary code within the address space of a separate\nlive process.\n\nAttackers use process injection for defense evasion, access, or privilege elevation,\ndistancing risky code execution, and many other reasons. As Microsoft researchers\n[explained: “[P]rocess injection gives attackers the ability to run malicious code that](https://www.microsoft.com/security/blog/2017/07/12/detecting-stealthier-cross-process-injection-techniques-with-windows-defender-atp-process-hollowing-and-atom-bombing/)\nmasquerades as legitimate programs. With code injection, attackers don’t have to use\ncustom processes that can quickly be detected. Instead, they insert malicious code into\ncommon trusted processes (e.g., explorer.exe, regsvr32.exe, svchost.exe, etc.), giving their\noperations an increased level of stealth and persistence.” Figure 2 below illustrates how\nprocess injection typically works:\n\n\n-----\n\nFigure 2.\n\nHow process injection works\nJust like any other C2 framework, Sliver utilizes process injection as a core part of many\ndefault commands or capabilities, such as:\n\n\n-----\n\nmigrate (command) – migrate into a remote process\nspawndll (command) – load and run a reflective DLL in a remote process\nsideload (command) – load and run a shared object (shared library/DLL) in a remote\nprocess\nmsf-inject (command) – inject a Metasploit Framework payload into a process\nexecute-assembly (command) – load and run a .NET assembly in a child process\ngetsystem (command) – spawn a new Sliver session as the NT AUTHORITY\\SYSTEM\nuser\nextensions/aliases – Beacon Object Files (BOFs), .NET apps, and other third-party\ntooling\n\nSliver also uses common process injection implementations. For example, as of this writing,\nthe built-in Sliver migrate command migrates to a remote process using a classic\ncombination of VirtualAllocEx, WriteProcessMemory, VirtualProtectEx, and finally\n_CreateRemoteThread Windows API calls. Other commands such as Sideload, SpawnDll,_\nand Execute-Assembly also rely on this combination. This sequence of injection-related API\n[calls is well documented, and Microsoft Defender for Endpoint generates alerts like A](https://www.microsoft.com/security/business/endpoint-security/microsoft-defender-endpoint)\n_process was injected with potentially malicious code based on the combination of such API_\ncalls:\n\nFigure 3. Example of Microsoft Defender for Endpoint alerts for injection-related API calls\nAside from process injection, Sliver provides additional familiar techniques such as lateral\nmovement via a PsExec command. Defender for Endpoint generates multiple alerts on such\ndefault techniques:\n\n\n-----\n\nFigure 4. Example of Microsoft Defender for Endpoint alerts for default service installation\ncreated by PsExec command\n\n### Surfacing Sliver threat activity\n\nBased on our analysis of the Sliver framework, Defender Experts designed advanced\nhunting queries to surface Sliver-related threat activity. These hunting queries leverage\n[Kusto Query Language (KQL), a query language specifically designed to work with large](https://docs.microsoft.com/en-us/azure/data-explorer/kusto/query/)\ndatasets in Azure. Unless otherwise noted, the detection and hunting guidance in this blog\nare designed for official, non-customized Sliver codebase available as of this writing.\n\nCustomers can [run the following queries in the Microsoft 365 Defender portal. These queries](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA81Y227bRhCd5wD9h82TZMSXFGmbNoWABrKduEjjIFILJGlrUCIjK5FNgrStpG3y7TlzdpfiVRZjPxQEydXu7OzMmTO7Q-3Jnhh5IpFcyEg-SoZ3JGfoeyqXco5fczxn8o3ckQWlDOQi2cc9gcRMXkgKmSv0D3B_K_flO_lRvpeH8oP8zHkqewWZKd4HaEXUm3HsP8xZyin6UtxGDiGn6zyXAFZE1Kp6e5BPJMa1QOtKdjH2AXevUctjrKWWx1hpDK-SkqYhpQJ6-pLexmyPocGOhNCQYP4Q7QWu5lWOoH3OdYIcJ0UjpqcZrro3d-UzbZhiNKVM3ZOEOt6hb0q8r1_nCBZvQ7KItO8rejvGmNoxyFsab7UtoWzVXm_RO6yl6xp5z3cIDfo-JxZG-pQ07loXby_TLWJlby3jzmBjCskxRt5zjd_QCjHyFneEVq-2oiJ9QdkQv6ozPSaWyXWEvLYt3DHRaMJ7s2g18andngkzb4lnxHX7uJriamQH9wPkYEYrd3E1M2Art6CMya_I7mPEfwB_AzI0khPEP6PHfcQpJMY-Vpofh8R7gf7M6d3jrqL5NEefwdicXNFWTC-19y1aaet-Ypk4y_23SBqsfMo-tfKZvHL5Up0xhVTAGZGLy5LWaL9xVp1i_SV_XeR9c0Z6wV3B8jYiLpb9I3pyxYg1RXBCOcvLE-Cq_vWhI6bfak0_R3gXT7V75uYsCvH3GBxwZEJ7QmC73aprCOxSWqE2X69pK8-uZvRXUTwGHsVoL-Cb4hsDIY-R5sMl3z46ulZMpAzjoBhekk1WpsyL5vicET-dMeM6EW2bFjRmebw-upjrntmVXefc_8ssmxey2PsclTD0CK3ngLX0djnQ5tMqpvc3YOd1lnVl1Hq77jq7jGPVkCvqTp0igh7162NlmVGOhM_OssXF_bR5rxsTixn31vXn9qD1ZCyf1TtcXXkXupOxeEL4uZudEtUVtztZ3O0k8reNzYicUdY3VYFFj8raime9aWRgWX7o9hDLxGf5GeFP_YT7c8RTyFvkqyU96Z5j_AC_7P69U9Fn5I1jWUaGR_KXPMJ1zJ0q4VM5PHVVg_o3wJyxY8mu_I72IWrZqpTV40d7jQjOyQDNq4C22F49U5fQse_Q1d4D-jOlPRG8eExs9PyZuH3na2PQvTKuxmdVN4QtNfCmEbVV77mrtBOiUq98Q-a39fSmte__pXb92q-NttW65dA6xNtWqFe-TRVoG1c8Dr4itTXopvL3-AWZsUJRG2-r1i7n5wtmis27an4ZRmnmmKhnZTXjquM3y7mqtj_Igkv0joh5c97118yrfzsfkSEz7hYB669eoYpq17RP6YC1mLZshaW7e-pO5A9o_wJtf2PnDLB7_QNv9al75J-4li7ndCfP2GP_X0jYLs55jbjvyE-Y-S858AnjK75aHqQl3vqrGxb7lNOaMYCkH--Kh9dW_CJYWWluxU5FesoaaFWB34adq6-cgKztuVzrkiMjavIZ0fVfnvUZUdZ9xBP8wu2N5ZOo-dvVfr_f5Pu1nm2HrCFsVedzyLiVM7Jce074v47NiEcN7PfcL0ax_h9Rt1zbLG9MqbYvI1znXpXVXwA9xcOsJhQAAA&timeRangeId=week)\nare examples of how hunters can key in on unique default configurations implemented by\nSliver.\n\nFigure 5. Running advanced hunting queries in Microsoft 365 Defender\n\n\n-----\n\n**GetSystem**\n\nThe following query finds potential launch of the built-in GetSystem command, where the\ndefault target process of spoolsv.exe is used as the target process for injection. The query\nlooks for SeDebug privileges being added to a process, followed by that same process\ncreating a remote thread in spoolsv.exe within 30 seconds.\n```\n// SeDebugPrivilege constant used to identify if this privilege is enabled in Token\n\nlet SeDebugPriv = 1048576;\n\nDeviceEvents\n\n| where FileName == 'spoolsv.exe'\n\n| where ActionType == 'CreateRemoteThreadApiCall'\n\n| where InitiatingProcessFileName !~ 'csrss.exe'\n\n| project InitiatingProcessId, DeviceId, CreateTime=Timestamp, FileName\n\n| join kind=inner (\n\n  DeviceEvents\n\n  | where ActionType == 'ProcessPrimaryTokenModified'\n\n  | extend TokenModTime = Timestamp\n\n ) on DeviceId, InitiatingProcessId\n\n| where TokenModTime between ((CreateTime - 30s) .. CreateTime)\n\n| extend JSON=parse_json(AdditionalFields)\n\n// This line looks for SeDebugPrivilege being the ONLY privilege changed, which is\nhow it is implemented in Sliver\n\n| where\nbinary_xor(tolong(JSON.OriginalTokenPrivEnabled),tolong(JSON.CurrentTokenPrivEnabled))\n == SeDebugPriv\n\n// Optionally comment out the above and use this line, which is more generic and\nsimply checks for SeDebugPrivilege not being initially enabled\n\n//| where binary_and(tolong(JSON.OriginalTokenPrivEnabled), SeDebugPriv) == 0\n\n| where binary_and(tolong(JSON.CurrentTokenPrivEnabled), SeDebugPriv) != 0 //\nConfirming SeDebugPrivilege is enabled in Current Token\n\n| extend TargetProcessFileName=FileName\n\n| project-reorder DeviceName, InitiatingProcessFileName, TargetProcessFileName,\nInitiatingProcessId\n\n```\n**Shell**\n\nThe following query finds the default, unique PowerShell command used when Sliver creates\nan interactive shell with the ‘Shell’ command.\n```\nDeviceProcessEvents\n\n| where ProcessCommandLine == 'powershell.exe -NoExit -Command\n[Console]::OutputEncoding=[Text.UTF8Encoding]::UTF8'\n\n```\n**Sideload/SpawnDll/Execute-Assembly**\n\nThe Sideload, SpawnDll, and Execute-Assembly commands spawn and inject into\n_notepad.exe by default. The following query finds process creation events where the same_\nprocess creates and injects into notepad.exe within 10 seconds.\n\n\n-----\n\n```\nDeviceProcessEvents\n\n| where ActionType == 'ProcessCreated'\n\n| where ProcessCommandLine =~ 'notepad.exe'\n\n| distinct InitiatingProcessId, DeviceId\n\n| join kind=inner (\n\n  DeviceEvents\n\n  | where ActionType == 'CreateRemoteThreadApiCall'\n\n  | where ProcessCommandLine == 'notepad.exe'\n\n  | where Timestamp between (ProcessCreationTime .. (ProcessCreationTime+10s))\n) on DeviceId, InitiatingProcessId\n\n```\n**PsExec**\n\nThe following query finds default values for the ImagePath, DisplayName, and Description of\nthe service installed on the remote system when using Sliver’s PsExec command.\n```\nDeviceRegistryEvents\n\n| where ActionType == 'RegistryValueSet'\n\n| where (RegistryValueName == 'ImagePath' and RegistryValueData matches regex @'^[azA-Z]:\\\\windows\\\\temp\\\\[a-zA-Z0-9]{10}\\.exe') or\n\n    (RegistryValueName == 'DisplayName' and RegistryValueData == 'Sliver') or\n\n    (RegistryValueName == 'Description' and RegistryValueData == 'Sliver\nimplant')\n\n```\nThe following query is an alternative method of searching on the same service properties but\nwithin service installation events instead of registry keys.\n```\nDeviceEvents\n\n| where ActionType == 'ServiceInstalled'\n\n| extend JSON = parse_json(AdditionalFields)\n\n| where (FolderPath endswith_cs @':\\windows\\temp' and FileName matches regex @'^[azA-Z0-9]{10}\\.exe') or (JSON.ServiceName == 'Sliver')\n\n## Building resilience against future attacks with threat hunting\n\n```\nOur analysis of Sliver’s source code and functionality reveals hunting opportunities that can\nalso be adapted for use against other malware frameworks. In addition, Sliver and many\nother C2 frameworks are yet another example of how threat actors are continually attempting\nto evade automated security detections. Threat hunting provides an added layer to other\nsecurity mitigations and can help address areas of defense evasion. By focusing research\nefforts on the underlying attacker techniques used within Sliver, detections and threat hunting\nstrategies are more resilient to future changes in attacker toolsets implementing those\ntechniques.\n\nDefender Experts is part of Microsoft’s global network of more than 8,500 security experts\nthat further enriches our vast cross-domain signals and lets us deliver coordinated threat\ndefense in our security products and solutions. As seen in our research on Sliver, our\nmonitoring of the threat landscape informs advanced, high-fidelity KQL queries that are then\n\n\n-----\n\n[thoroughly tested to form the basis of our Defender Experts Notifications. These notifications](https://docs.microsoft.com/microsoft-365/security/defender/onboarding-defender-experts-for-hunting?view=o365-worldwide#receive-defender-experts-notifications)\nare designed to identify the most important risks, and provide technical information, as well\nas hunting and mitigation guidance.\n\nOur insights from threat hunting and monitoring also feed into products like Microsoft\nDefender for Endpoint that then alert customers to malicious activity seen with C2\nframeworks like Sliver. The following titles in the security center can indicate threat activity on\ntheir networks:\n\nRansomware-linked emerging threat activity group detected\nSuspicious behavior by cmd.exe was observed\nSuspicious sequence of exploration activities\nSuspicious data transfer\nSuspicious System Network Configuration Discovery\nProcess hollowing detected\nA process was injected with potentially malicious code\nSuspicious Peripheral Device Discovery\nAbnormal Remote Service Execution\nSuspicious file dropped\nSuspicious command launched from a remote location\nSuspicious files or content obfuscation/de-obfuscation activity\n\nMicrosoft customers can also apply the following security mitigations to reduce the impact of\nSliver and other similar threats:\n\nTurn on [network protection. Network protection helps prevent users from accessing](https://endpoint.microsoft.com/#blade/Microsoft_Intune_DeviceSettings/DevicesMenu/configurationProfiles)\ndangerous domains and IP addresses. Check your perimeter firewall and proxy to\nrestrict servers from making arbitrary connections to the internet to browse or download\nfiles. Such restrictions help inhibit malware downloads and C2 activity including mobile\ndevices.\nUse [Microsoft Defender Firewall, which, along with your network firewall, prevents](https://support.microsoft.com/windows/turn-microsoft-defender-firewall-on-or-off-ec0844f7-aebd-0583-67fe-601ecf5d774f)\nremote procedure call (RPC) and service message block (SMB) communication along\nendpoints whenever possible. This limits lateral movement and other attack activities.\nTurn on [cloud-delivered protection and automatic sample submission on Microsoft](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/enable-cloud-protection-microsoft-defender-antivirus?view=o365-worldwide)\nDefender Antivirus. These capabilities use artificial intelligence and machine learning to\nquickly identify and stop new and unknown threats.\nCheck your Office 365 email filtering settings to ensure you block spoofed emails,\n[spam, and emails with malware. Use Microsoft Defender for Office 365 for enhanced](https://docs.microsoft.com/microsoft-365/security/office-365-security/overview?view=o365-worldwide)\nphishing protection and coverage against new threats and polymorphic variants.\nConfigure Office 365 to [recheck links on click and](https://docs.microsoft.com/microsoft-365/security/office-365-security/safe-links?view=o365-worldwide) [delete sent mail in response to newly](https://docs.microsoft.com/microsoft-365/security/office-365-security/zero-hour-auto-purge?view=o365-worldwide)\nacquired threat intelligence.\n\n\n-----\n\nOrganizations can also follow these general best practices to make their networks resilient\nagainst attacks:\n\n**Harden the cloud. As attackers move towards cloud resources, it’s important to secure**\ncloud resources and identities as well as on-premises accounts. Security teams should\nfocus on hardening security identity infrastructure, enforcing multifactor authentication\n(MFA) on all accounts, and treating cloud admins/tenant admins with the same level of\nsecurity and credential hygiene as Domain Admins.\n**Close security blind spots. Organizations should verify that their security tools are**\nrunning in optimum configuration and perform regular network scans to ensure a\nsecurity product protects all systems.\n**[Reduce the attack surface. Establish attack surface reduction rules to prevent](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/attack-surface-reduction?view=o365-worldwide)**\ncommon attack techniques used by C2 frameworks.\n**Evaluate the perimeter. Organizations must identify and secure perimeter systems**\n[that attackers might use to access the network. Public scanning interfaces can be used](https://www.microsoft.com/security/business/cloud-security/microsoft-defender-external-attack-surface-management)\nto augment data.\n**Harden internet-facing assets. Attackers use unpatched vulnerabilities, whether**\nalready disclosed or zero-day, especially in the initial access stage to get the C2\n[framework onto the target systems. They also rapidly adopt new vulnerabilities. To](https://digital.nhs.uk/cyber-alerts/2022/cc-4002)\nfurther reduce exposure, organizations can use endpoint detection and response\n(EDR) products with threat and vulnerability management capabilities, such as\nMicrosoft Defender for Endpoint, to discover, prioritize, and remediate vulnerabilities\nand misconfigurations.\n\nTo find out how you can extend your ability to defend and manage your security with\n[managed services from Microsoft, learn more about Microsoft Security Experts.](https://www.microsoft.com/security/business/services)\n\n## Appendix\n\n### Microsoft 365 Defender detections\n\n**Microsoft Defender Antivirus**\n\nMicrosoft Defender Antivirus detects Sliver threat components as the following malware:\n\nMicrosoft Defender Antivirus also detects Bumblebee loader as the following malware:\n\n[Trojan:Win64/Bumblebee](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win64/Bumblebee!MSR&threatId=-2147149680)\n[Trojan:Win64/BumbleBeeLoader](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win64/BumbleBeeLoader.AG!MSR&threatId=-2147148047)\n[Trojan:PowerShell/Bumblebee](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:PowerShell/Bumblebee.RQB!MTB&threatId=-2147147633)\n\n[[1]Automated string de-gobfuscation, Kryptos Logic](https://www.kryptoslogic.com/blog/2020/12/automated-string-de-gobfuscation/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-24 - Looking for the ‘Sliver’ lining- Hunting for emerging command-and-control frameworks.pdf"
    ],
    "report_names": [
        "2022-08-24 - Looking for the ‘Sliver’ lining- Hunting for emerging command-and-control frameworks.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535846,
    "ts_updated_at": 1743041508,
    "ts_creation_date": 1662028003,
    "ts_modification_date": 1662028003,
    "files": {
        "pdf": "https://archive.orkl.eu/4083c5202fa4e174c5609981f259d72e155d6d64.pdf",
        "text": "https://archive.orkl.eu/4083c5202fa4e174c5609981f259d72e155d6d64.txt",
        "img": "https://archive.orkl.eu/4083c5202fa4e174c5609981f259d72e155d6d64.jpg"
    }
}