{
    "id": "f57e31bf-46a6-4a36-ac37-571828fd6c75",
    "created_at": "2023-01-12T15:09:08.646076Z",
    "updated_at": "2025-03-27T02:17:11.178356Z",
    "deleted_at": null,
    "sha1_hash": "48a8c38a615713cfd9b645af2ab4b77fe73db384",
    "title": "2015-12-04 - Sofacy APT hits high profile targets with updated toolset",
    "authors": "",
    "file_creation_date": "2022-05-28T02:01:26Z",
    "file_modification_date": "2022-05-28T02:01:26Z",
    "file_size": 838875,
    "plain_text": "# Sofacy APT hits high profile targets with updated toolset\n\n**[securelist.com/sofacy-apt-hits-high-profile-targets-with-updated-toolset/72924/](https://securelist.com/sofacy-apt-hits-high-profile-targets-with-updated-toolset/72924/)**\n\nAuthors\n\nGReAT\n\nSofacy (also known as “Fancy Bear”, “Sednit”, “STRONTIUM” and “APT28”) is an advanced\nthreat group that has been active since around 2008, targeting mostly military and\ngovernment entities worldwide, with a focus on NATO countries. More recently, we have also\nseen an increase in activity targeting Ukraine.\n\nBack in 2011-2012, the group used a relatively tiny implant (known as “Sofacy” or\nSOURFACE) as its first stage malware. The implant shared certain similarities with the old\n[Miniduke implants. This led us to believe the two groups were connected, at least to begin](https://securelist.com/the-miniduke-mystery-pdf-0-day-government-spy-assembler-0x29a-micro-backdoor/31112/)\nwith, although it appears they parted ways in 2014, with the original Miniduke group\nswitching to the [CosmicDuke implant.](https://securelist.com/miniduke-is-back-nemesis-gemina-and-the-botgen-studio/64107/)\n\nAt some point during 2013, the Sofacy group expanded its arsenal and added more\nbackdoors and tools, including CORESHELL, SPLM (aka Xagent, aka CHOPSTICK),\nJHUHUGIT (which is built with code from the Carberp sources), AZZY (aka\n\n\n-----\n\nADVSTORESHELL, NETUI, EVILTOSS, and spans across four to five generations) and a\nfew others. We’ve seen quite a few versions of these implants and they were relatively\nwidespread for a time.\n\n#Sofacy group has been active since 2008, targeting mostly military and government\nentities in NATO countries\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fsofacy-apt-hits-high-profile-targets-with-updated-toolset%2F72924%2F&text=%23Sofacy+group+has+been+active+since+2008%2C+targeting+mostly+military+and+government+entities+in+NATO+countries)\n\nEarlier this year, we noticed a new release of the AZZY implant which, at the time, was\nlargely undetected by anti-malware products. We observed several waves of attacks using\nthis version, most recently in October. The new waves of attacks also included a new\ngeneration of USB stealers deployed by the Sofacy actor, with the first versions dating back\nto February 2015, and which appear to be geared exclusively towards high profile targets.\n\n## Sofacy’s August 2015 attack wave\n\nIn the months leading up to August, the Sofacy group launched several waves of attacks\nrelying on zero-day exploits in Microsoft Office, Oracle Sun Java, Adobe Flash Player and\nWindows itself. For instance, its JHUHUGIT implant was delivered through a Flash zero-day\nand used a Windows EoP exploit to break out of the sandbox. The JHUHUGIT implant\nbecame a relatively popular first stage for the Sofacy attacks and was used again with a\nJava zero-day (CVE-2015-2590) in July 2015.\n\nWhile the JHUHUGIT (and more recently, “JKEYSKW”) implant used in most of the Sofacy\nattacks, high profile victims are being targeted with another first level implant, representing\nthe latest evolution of their AZZYTrojan.\n\nTwo recurring characteristics of the #Sofacy group are speed and the use of multibackdoor packages\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fsofacy-apt-hits-high-profile-targets-with-updated-toolset%2F72924%2F&text=Two+recurring+characteristics+of+the+%23Sofacy+group+are+speed+and+the+use+of+multi-backdoor+packages)\n\nThe first versions of the new AZZY implant appeared in August of this year. During a high\nprofile incident we investigated, our products successfully detected and blocked a “standard”\nSofacy “AZZY” sample that was used to target a range of defense contractors. The sample\nused in this attack (md5 A96F4B8AC7AA9DBF4624424B7602D4F7, compiled July 29th,\n2015) was a pretty standard Sofacy x64 AZZY implant, which has the internal name\n“advshellstore.dll”.\n\nInterestingly, the fact that the attack was blocked didn’t appear to stop the Sofacy team. Just\nan hour and a half later they had compiled and delivered another AZZY x64 backdoor (md5:\n9D2F9E19DB8C20DC0D20D50869C7A373, compiled August 4th, 2015). This was no\n\n\n-----\n\nlonger detectable with static signatures by our product. However, it was detected dynamically\nby the host intrusion prevention subsystem when it appeared in the system and was\nexecuted.\n\nThis recurring, blindingly-fast Sofacy attack attracted our attention as neither sample was\ndelivered through a zero-day vulnerability — instead, they appeared to be downloaded and\ninstalled by another malware. This separate malware was installed by an unknown attack as\n“AppData\\Local\\Microsoft\\Windows\\msdeltemp.dll” (md5:\nCE8B99DF8642C065B6AF43FDE1F786A3).\n\nThe top level malware, CE8B99DF8642C065B6AF43FDE1F786A3 (named by its authors\n“msdeltemp.dll” according to internal strings, and compiled July 28th, 2015) is a rare type of\nthe Sofacy AZZY implant. It has been modified to drop a separate C&C helper, (md5:\n8C4D896957C36EC4ABEB07B2802268B9) as “tf394kv.dll“.\n\nThe dropped “tf394kv.dll” file is an external C&C communications library, compiled on July\n24th, 2015 and used by the main backdoor for all Internet-based communications.\n\n\n-----\n\n_Decrypted configuration block of the C&C helper library “tf394kv.dll“_\n\nThis code modification marks an unusual departure from the typical AZZY backdoors, with its\nC&C communication functions moved to an external DLL file. In the past, the Sofacy\ndevelopers modified earlier AZZY backdoors to use a C&C server encoded in the registry,\ninstead of storing it in the malware itself, so this code modularisation follows the same line of\nthinking.\n\nIn addition to the new AZZY backdoors with side-DLL for C&C, we observed a new set of\ndata-theft modules deployed against victims by the Sofacy group. Among the most popular\nmodern defense mechanisms against APTs are air-gaps — isolated network segments\nwithout Internet access, where sensitive data is stored. In the past, we’ve seen groups such\nas [Equation and](https://securelist.com/equation-the-death-star-of-malware-galaxy/68750/) [Flame use malware to steal data from air-gapped networks. The Sofacy](https://securelist.com/the-flame-questions-and-answers/34344/)\ngroup uses such tools as well.\n\nThe first versions of these new USB stealer modules appeared around February 2015 and\nthe latest appear to have been compiled in May 2015. Older versions of these\n[USBSTEALER modules were previously described by our colleagues from ESET.](http://www.welivesecurity.com/2014/11/11/sednit-espionage-group-attacking-air-gapped-networks/)\n\nOne example of the new Sofacy USBSTEALER modules is\n8b238931a7f64fddcad3057a96855f6c, which is named internally as msdetltemp.dll.\n\n\n-----\n\nThis data theft module appears to have been compiled in May 2015 and is designed to watch\nremovable drives and collect files from them, depending on a set of rules defined by the\nattackers. The stolen data is copied into a hidden directory as “%MYPICTURES%\\%volume\n**serial number%“, from where it can be exfiltrated by the attackers using one of the AZZY**\nimplants. More details on the new USB stealers are available in the section on technical\nanalysis.\n\n## Conclusions\n\nOver the last year, the Sofacy group has increased its activity almost tenfold when compared\nto previous years, becoming one of the most prolific, agile and dynamic threat actors in the\narena. This activity spiked in July 2015, when the group dropped two completely new\nexploits, an Office and Java zero-day.\n\nAt the beginning of August, Sofacy began a new wave of attacks, focusing on defenserelated targets. As of November 2015, this wave of attacks is ongoing. The attackers deploy\na rare modification of the AZZY backdoor, which is used for the initial reconnaissance. Once\na foothold is established, they try to upload more backdoors, USB stealers as well as other\nhacking tools such as “Mimikatz” for lateral movement.\n\nOver the last year, the #Sofacy group has increased its activity almost tenfold, that\nspiked in July 2015\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fsofacy-apt-hits-high-profile-targets-with-updated-toolset%2F72924%2F&text=Over+the+last+year%2C+the+%23Sofacy+group+has+increased+its+activity+almost+tenfold%2C+that+spiked+in+July+2015)\n\nTwo recurring characteristics of the Sofacy group that we keep seeing in its attacks are\nspeed and the use of multi-backdoor packages for extreme resilience. In the past, the group\nused droppers that installed both the SPLM and AZZY backdoors on the same machine. If\none of them was detected, the other one provided the attacker with continued access.\n\nAs usual, the best defense against targeted attacks is a multi-layered approach. Combine\ntraditional anti-malware technologies with patch management, host intrusion detection and,\nideally, allowlisting and default-deny strategies. According to a study by the Australian DSD,\n85% of the targeted attacks analysed could have been stopped by four simple defense\nstrategies. While it’s impossible to achieve 100% protection, in practice and most cases all\nyou have to do is increase your defenses to the point where it becomes too expensive for the\nattacker – who will just give up and move on to other targets.\n\nMore information about the Sofacy group is available to customers of Kaspersky Intelligent\n**Services.**\n\nIs there a ‘silver bullet’ to protect yourself against Sofacy? Learn more on Kaspersky\nBusiness blog.\n\n\n-----\n\n## Technical analysis\n\n**Internal name: DWN_DLL_MAIN.dll**\n**File format: PE32 DLL**\n**MD5: ce8b99df8642c065b6af43fde1f786a3**\n**Linker version: 11.0, Microsoft Visual Studio**\n**Linker timestamp: 2015.07.28 13:05:20 (GMT)**\n**Exported functions:**\n\n10003F30: ?Applicate@@YGHXZ\n10004270: ?SendDataToServer_2@@YGHPAEKEPAPAEPAK@Z\n10003F60: ?k@@YGPAUHINSTANCE__@@PBD@Z\n\nThe library starts its main worker thread from the DllMain function.\n\nMost of the strings inside the module are encrypted with a homebrew XOR-based algorithm.\nIn addition to that, API function names are reversed, presumably to avoid detection in\nmemory.\n\nOnce started, the code in the main thread resolves the basic API functions it needs and\nloads an additional library from the following location: “%TEMP%\\tf394kv.dll”. If this file is\nnot present, it is recreated from a hardcoded encrypted array inside the body of the DLL.\n\nNext, the module enters an infinite loop. Every five minutes it collects basic system\ninformation and sends it to the C2 server:\n\nWindows version number\nHardcoded string “4.3” (the backdoor’s internal version number)\nList of running processes\n\nThe main thread also spawns a separate thread for receiving new commands from the C2\nservers. Every 10 minutes, it sends a new request to the server. The server is expected to\nsend back executable code and one of the following commands:\n\nWrite a new file “%LOCAL_APPDATA%\\dllhost.exe” or “%TEMP%\\dllhost.exe” and\nexecute it, then delete the file\nWrite a new file “%LOCAL_APPDATA%\\sechost.dll” or “%TEMP%\\sechost.dll” and call\nits first exported function using “rundll32.exe” or Windows API, then delete the file\nRun shellcode provided by the server in a new thread\n\nWhile processing the commands, the backdoor logs all errors and execution results. The\nmodule also reads the contents of the file “%APPDATA%\\chkdbg.log” and appends it to the\nresults. It then sends the aggregated log back to the C2 server.\n\n\n-----\n\nThe module aborts the thread receiving C2 command after it fails to correctly execute\ncommands more than six times in a row, i.e. if file or process creation fails.\n\nThe export called “k” is a wrapper for the “LoadLibraryA” API function.\n\nThe export called “SendDataToServer_2” does exactly what the name means: it encrypts all\ncollected data, encodes it using Base64 encoding and calls its additional library to send the\ndata to the C2 server. The names of the C2 servers are hardcoded.\n\n_Hardcoded C&C servers in the main module_\n\nThe two C&C’s hardcoded in the configuration block of the main binary are:\n\n**intelnetservice[.]com**\n**intelsupport[.]net**\n\nThe export called “Applicate” runs a standard Windows application message loop until a\n“WM_ENDSESSION” message is received. It then terminates the main thread.\n\n**Internal name: snd.dll**\n\n**File format: PE32 DLL**\n\n**MD5: 8c4d896957c36ec4abeb07b2802268b9**\n\n**Linker version: 11.0, Microsoft Visual Studio**\n\n**Linker timestamp: 2015.07.24 12:07:27 (GMT)**\n\n**Exported functions:**\n\n10001580: Init\n10001620: InternetExchange\n10001650: SendData\n\nThis external library implements a simple Wininet-based transport for the main module.\n\n\n-----\n\nThe strings inside the binary are encrypted using 3DES and XOR and reversed.\n\nThe DllMain function initializes the library and resolves all required Windows API functions.\n\nThe “Init” export establishes connection to port 80 of a C2 server using Wininet API. The\nuser agent string employed is “MSIE 8.0”.\n\nThe “SendData” export sends a HTTP POST request using a hardcoded URI “/store/“. The\nreply, if its length is not equal to six and its contents do not contain “OK” is returned back to\nthe caller.\n\nThe “InternetExchange” export closes the established connection and frees associated\nhandles.\n\n### Sofacy AZZY 4.3 dropper analysis\n\n**File format: PE32 EXE**\n\n**File size: 142,336 bytes**\n\n**MD5: c3ae4a37094ecfe95c2badecf40bf5bb**\n**Linker version: 11.0, Microsoft Visual Studio**\n\n**Linker timestamp: 2015.02.10 10:01:59 (GMT)**\n\nMost of the strings and data in the file are encrypted using 3DES and XOR.\n\nThe code makes use of the Windows Crypto API for 3DES and the decryption key is stored\nas a standard Windows PUBLICKEYSTRUC structure:\n\n_Part of the decryption algorithm_\n\n\n-----\n\n_Header of one encrypted data buffer containing the hardcoded 3DES key_\n\nFirst, it creates a new directory: “%LOCAL_APPDATA%\\Microsoft\\Windows”. If the directory\ncreation fails it tries to install into “%TEMP%” directory instead.\n\nNext it writes a hardcoded binary from its body to “msdeltemp.dll” into the target directory.\nIf the file exists it then moves it to “__tmpdt.tmp” in the same directory and continues the\ninstallation. Sets file creation timestamp to that of “%SYSTEM%\\sfc.dll”\n\nTo ensure the dropped payload starts automatically on user log-in it creates the following\nregistry key:\n\n_[HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run]_\n\n_StartUpChekTemp=RUNDLL32.EXE “%path to msdeltemp.dll%”,#1_\n\nNext, it starts the dropped dll using the same command line:\n\n**RUNDLL32.EXE “%path to msdeltemp.dll%“,#1**\n\nFinally, the program removes itself by starting the following command: “cmd /c DEL %path to\n_self%“_\n\nThe MD5 of the dropped file is f6f88caf49a3e32174387cacfa144a89\n\n### Dropper payload – downloader DLL\n\n**Internal name: msdetltemp.dll**\n\n**File format: PE32 DLL**\n\n**File size: 73 728 bytes**\n\n**MD5: f6f88caf49a3e32174387cacfa144a89**\n\n**Linker version: 11.0, Microsoft Visual Studio**\n\n**Linker timestamp: 2015.02.10 07:20:02 (GMT)**\n\n**Exported functions:**\n\n10002B55: Applicate\n\nMost of the strings inside the binary are encrypted using a homebrew XOR-based algorithm\nand reversed.\n\n\n-----\n\nThe library is an older version of the DWN_DLL_MAIN.dll (md5:\nce8b99df8642c065b6af43fde1f786a3).\n\nThe DllMain function is identical and starts the main thread; the “Applicate” function is\nidentical to the one in the newer library. This version of the module does not rely on an\nexternal transport DLL for communicating with its C2 servers; instead it directly uses Wininet\nAPI functions.\n\nThe module contains the following hardcoded C2 server names:\n\n**drivres-update[.]info**\n**softupdates[.]info**\n\nThe module uses a hardcoded URL (“/check/“) for sending HTTP POST requests to its C2\nservers.\n\nThe server is expected to send back executable code and one of the following commands:\n\nWrite a new file “%LOCAL_APPDATA%\\svchost.exe” or “%TEMP%\\svchost.exe” and\nexecute it, then delete the file\nWrite a new file “%LOCAL_APPDATA%\\conhost.dll” or “%TEMP%\\conhost.dll” and call\nits first exported function using “rundll32.exe” or Windows API, then delete the file\nRun shellcode provided by the server in a new thread\n\n### File collection module (“USB Stealer”)\n\n**Internal name: msdetltemp.dll (from resources)**\n\n**File size: 50,176 bytes**\n\n**File format: PE32 EXE**\n\n**MD5: 0369620eb139c3875a62e36bb7abdae8**\n\n**Linker version: 10.0, Microsoft Visual Studio**\n\n**Linker timestamp: 2015.02.09 11:48:01 (GMT)**\n\nMost of the strings inside the binary are encrypted using 3DES and XOR and reversed.\n\nThe program creates the mutex “mtx” and an event named “WerTyQ34C”.\n\nUpon start, it creates a window with the class name “Hello” and title “Program”, subscribes\nfor device arrival notifications for that window and enters a standard Windows message\nprocessing loop. The message processing function waits for the WM_DEVICECHANGE\nevent and starts a new thread on its arrival.\n\nThe module inspects every new disk volume attached to the system. For every disk it creates\na “stash” directory in “%root stash directory location%\\%volume serial number in hex%” with\nattributes FILE_ATTRIBUTE_HIDDEN and FILE_ATTRIBUTE_SYSTEM. The root stash\n\n\n-----\n\ndirectory location may be read from the configuration file or set to the default location which\nis “%MYPICTURES%”.\n\nThen, it traverses the filesystem of the volume looking for files. Depending on the settings\nread from the configuration file, the scope may be narrowed to files with particular extensions\nand/or files created after a specified date.\n\nIt is worth noting that if the source file location contains the string “System Volume\nInformation\\S-1-5-21-1315235578-283289242\\”, then the file is deleted after copying to the\n“stash” directory. There are known related samples that are able to create such directories on\nremovable drives, i.e. the sample with md5: 8cb08140ddb00ac373d29d37657a03cc.\n\nThe configuration file is loaded from the same directory as the module and is expected to\nhave a name “NvCpld.dat“. It is a text file that may contain the following configuration\nparameters:\n\nPath – location of the root “stash” directory\nExt – search for files with one of these extensions only\nDate – search for files not earlier than this date\n\n**Internal name: NvCpld.dll (from export table), msdetltemp.dll (from resources), IGFSRVC.dll**\n(from resources)\n**File format: PE32 DLL**\n**File size: 76,288 bytes**\n**MD5s: 8b238931a7f64fddcad3057a96855f6c,ce151285e8f0e7b2b90162ba171a4b90**\n**Linker version: 11.0, Microsoft Visual Studio**\nLinker timestamps: 2015.05.29 11:20:32 (GMT), 2006.11.25 04:39:15 (GMT)\nExported functions:\n10002500: NvMswt\n10002860: NvReg\n10002880: NvStart\n10002A80: NvStop\n\nThis library is a newer version of the file collection module (md5:\n0369620eb139c3875a62e36bb7abdae8) wrapped in a DLL file.\n\nThere are two known variants of this module; they only differ in timestamp values and\nversion information in the resource section.\n\nThe DllMain function only decrypts the data structures and initializes Windows API pointers.\n\nThe function “NvMswt” is a wrapper for the API function MsgWaitForMultipleObjects.\n\nThe function “NvReg” is a wrapper for the API function RegisterClassW.\n\n\n-----\n\nThe function **NvStart is similar to the main function of the older module; it creates a window**\nand enters the message loop waiting for device arrival notifications. The only difference\nintroduced is that an event named “WerTyQ34C” can be signalled by the function “NvStop”\nto terminate the message loop and stop processing.\n\n## Indicators of compromise:\n\n### AZZY 4.3 installer:\n\nc3ae4a37094ecfe95c2badecf40bf5bb\n\n### New generation (4.3) AZZY implants:\n\nce8b99df8642c065b6af43fde1f786a3\n\nf6f88caf49a3e32174387cacfa144a89\n\n### Dropped C&C helper DLL for AZZY 4.3:\n\n8c4d896957c36ec4abeb07b2802268b9\n\n### File collectors / USB stealers:\n\n0369620eb139c3875a62e36bb7abdae8\n\n8b238931a7f64fddcad3057a96855f6c\n\nce151285e8f0e7b2b90162ba171a4b90\n\nf6f88caf49a3e32174387cacfa144a89\n\n### Stand-alone AZZY backdoors:\n\na96f4b8ac7aa9dbf4624424b7602d4f7\n\n9d2f9e19db8c20dc0d20d50869c7a373\n\n### C&C hostnames:\n\ndrivres-update[.]info\nintelnetservice[.]com\nintelsupport[.]net\nsoftupdates[.]info\n\n### Kaspersky Lab products detect the malware mentioned here with the following names:\n\nTrojan.Win32.Sofacy.al\nTrojan.Win32.Sofacy.be\nTrojan.Win32.Sofacy.bf\n\n\n-----\n\nTrojan.Win32.Sofacy.bg\nTrojan.Win32.Sofacy.bi\nTrojan.Win32.Sofacy.bj\nTrojan.Win64.Sofacy.q\nTrojan.Win64.Sofacy.s\nHEUR:Trojan.Win32.Generic\n\n[APT](https://securelist.com/tag/apt/)\n[Backdoor](https://securelist.com/tag/backdoor/)\n[Cyber espionage](https://securelist.com/tag/cyber-espionage/)\n[Nation State Sponsored Espionage](https://securelist.com/tag/nation-state-sponsored-espionage/)\n[Sofacy](https://securelist.com/tag/sofacy/)\n\nAuthors\n\nGReAT\n\nSofacy APT hits high profile targets with updated toolset\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-12-04 - Sofacy APT hits high profile targets with updated toolset.pdf"
    ],
    "report_names": [
        "2015-12-04 - Sofacy APT hits high profile targets with updated toolset.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536148,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653703286,
    "ts_modification_date": 1653703286,
    "files": {
        "pdf": "https://archive.orkl.eu/48a8c38a615713cfd9b645af2ab4b77fe73db384.pdf",
        "text": "https://archive.orkl.eu/48a8c38a615713cfd9b645af2ab4b77fe73db384.txt",
        "img": "https://archive.orkl.eu/48a8c38a615713cfd9b645af2ab4b77fe73db384.jpg"
    }
}