{
    "id": "f58a1d4d-5d36-442f-8f7d-eba3ada51afd",
    "created_at": "2023-01-12T15:01:42.29507Z",
    "updated_at": "2025-03-27T02:11:41.793459Z",
    "deleted_at": null,
    "sha1_hash": "5d6db6617f4fde6d1048b455a63bdd8041fa63ae",
    "title": "2021-09-09 - LockBit 2.0- Ransomware Attacks Surge After Successful Affiliate Recruitment",
    "authors": "",
    "file_creation_date": "2022-05-28T18:26:05Z",
    "file_modification_date": "2022-05-28T18:26:05Z",
    "file_size": 2137331,
    "plain_text": "# Ransomware Attacks Surge After Successful Affiliate Recruitment\n\n**[securityintelligence.com/posts/lockbit-ransomware-attacks-surge-affiliate-recruitment/](https://securityintelligence.com/posts/lockbit-ransomware-attacks-surge-affiliate-recruitment/)**\n\n[Home&nbsp/](https://securityintelligence.com/) [Malware](https://securityintelligence.com/category/x-force/malware-threat/)\nLockBit 2.0: Ransomware Attacks Surge After Successful Affiliate Recruitment\n\n[Malware September 9, 2021](https://securityintelligence.com/category/x-force/malware-threat/)\n\n\n-----\n\nBy [Megan Roddie 7 min read](https://securityintelligence.com/author/megan_roddie/)\nAfter a brief slowdown in activity from the LockBit ransomware gang following increased\nattention from law enforcement, LockBit is back with a new affiliate program, improved\npayloads and a change in infrastructure. According to IBM X-Force, a major spike in data\nleak activity on the gang’s new website indicates that their recruitment attempts have been\nsuccessful. IBM’s data shows that LockBit is nearly six times more active than other groups,\nsuch as the Conti ransomware operators. This blog post delves into LockBit’s 2.0 version, its\nrecent activity and an analysis of the new payloads.\n\nLockBit is a ransomware-as-a-service (RaaS) gang that writes and distributes its malware\nthrough affiliates. RaaS has become an increasingly popular business model for ransomware\noperators in the past few years, helping gangs expand their reach without growing their core\nteam or their expenses. These groups are able to make a profit while turning over the actual\ndeployment of their ransomware payloads to affiliates, who also shoulder part of the risk of\nbeing exposed by law enforcement.\n\n## Announcing LockBit 2.0\n\nThe LockBit gang was first found advertising their affiliate program in January 2020 on a\nwell-known, Russian-speaking forum known as XSS. This underground forum has been used\nby many RaaS gangs in the past to advertise their malware and hunt for new affiliates. That\n[includes gangs like REvil/Sodinokibi, DarkSide, Netwalker and others. But with increased](https://securityintelligence.com/posts/sodinokibi-ransomware-incident-response-intelligence-together/)\n[attention from law enforcement, XSS banned all ransomware topics from their forum in early](https://www.bleepingcomputer.com/news/security/popular-russian-hacking-forum-xss-bans-all-ransomware-topics/)\n2021.\n\nWith this avenue shut down, LockBit’s owners pivoted to using their own infrastructure for\nadvertising. At the end of June 2021, those behind LockBit posted a page on their leak site\n(bigblog[.]at) announcing recruitment for their LockBit 2.0 affiliate program.\n\n\n-----\n\n_Figure 1: LockBit’s June 2021 advertisement with new features, seeking new affiliates_\n_(source: bigblog[.]at)_\n\nAccording to their post, the affiliate is responsible for gaining access to “the core server”,\nlikely referring to a domain controller, and then the rest will be carried out by the LockBit\npayload.\n\nThe group mentions their payload does not operate in Russian-language speaking countries\nand specifies that they will only work with experienced penetration testers. Additionally, the\ngroup claims their ransomware is faster than any other ransomware families and includes a\ntable for comparing supposed encryption speeds against other prolific ransomware codes.\n\nThe affiliate also gets to decide the ransom amount and will receive the payment directly,\nsending the LockBit gang’s cut of the profit after the ransom is paid.\n\n\n-----\n\n_Figure 2: LockBit operators’ encryption speed comparison vs. top competitors (source:_\n_bigblog[.]at)_\n\nTo facilitate extortion if a victim refuses to pay for a decryption key, LockBit also includes\naccess to an information stealer they call StealBit, which allegedly exfiltrates files from victim\nnetworks to the LockBit blog. This malware is also touted as a high-speed uploader, which is\nsupposed to reassure affiliates that their operation will be swift.\n\n\n-----\n\nX-Force researchers were able to identify files submitted to VirusTotal in August 2021 that\nmay be samples of the StealBit malware, but analysis is still ongoing at the time of this\npublication.\n\n_Figure 3: LockBit operators boast StealBit’s upload speeds (source: bigblog[.]at)_\n\n## A Spike in Victims’ Data Exposure\n\nPrior to the announcement of LockBit 2.0’s affiliate program, the last dark web leak from the\ngang appears to have been published on December 30, 2020. Posting activity resumed\napproximately seven months later on July 21, 2021, shortly after new recruitment attempts\nbegan, with about 76 new posts published within a six-day period.\n\n\n-----\n\n_Figure 4: Stolen data posts created per day on bigblog[.]at_\n\nLooking at other ransomware families’ leak sites in the three-week period since LockBit’s\nreturn (7/21/2021-8/11/2021), LockBit appears to be currently operating one of the most\nactive ransomware leak sites.\n\n_Figure 5: Leak site activity by the number of posts within the monitored period_\n\n\n-----\n\n## Victims by Industry, Geography\n\nWith regards to victims, IBM X-Force identified the below industries and geographies being\nimpacted by LockBit and its affiliates:\n\n_Figure 6: Top LockBit victims by industry (source: IBM X-Force)_\n\n_Figure 7: Top LockBit victims by region (source: IBM X-Force)_\n\n\n-----\n\nWhile a few regions and industries have multiple victims involved, IBM was unable to identify\nany clear targeting patterns. Each LockBit affiliate likely has its own choices of targeting,\nwhich may be targeted or opportunistic.\n\nGiven the timing of the new affiliate program being advertised and the spike in activity, IBM\nX-Force suspects that LockBit was able to recruit affiliates who had already begun\ncompromising networks.\n\n## New Infrastructure\n\nLockBit’s use of a data leak site first appeared in September 2020. Their leak sites and\nsupport sites (where victims can purchase a decryptor) are offered at both surface and dark\nweb addresses. Along with the observed uptick in activity, IBM researchers discovered the\nuse of newly registered infrastructure for these sites.\n\nLockBit’s primary blog that publishes victim data and advertises its affiliate program is\ncurrently being hosted on the clear web at bigblog[.]at. Whois information for this domain\nindicates that LockBit registered the domain on July 6, 2021. Pivoting off the unique\nregistrant email reveals that their new clear web decryptor site, decoding[.]at, was also\nregistered on the same date.\n\nIBM X-Force was able to uncover the domain locksupp[.]at, which was leveraging the same\nname servers as decoding[.]at. Whois and nameserver history indicates that this domain was\nin use around June 6, 2021, but it appears it was suspended by June 29, 2021. It is not\ncurrently reachable and its purpose is unknown at this time.\n\n## New Samples\n\nX-Force identified over a dozen new submissions of LockBit samples to VirusTotal occurring\nsince the launch of the LockBit 2.0 affiliate program. Analysis was performed on several of\nthese samples to determine any changes in these new variants.\n\nMuch of LockBit’s functionality remains the same in version 2.0, with a similar encryption\nroutine. A hybrid AES/RSA encryption approach is still used. The two minor updates are the\nrenaming of the registry key in which the RSA public session key is stored and the creation\nof a file used as a mutex while files are being encrypted. Additionally, the registry run key\nused for persistence is now a GUID-type string instead of an alpha-numeric string.\n\nOn top of these minor changes, two major additions were discovered: the addition of a new\ndeployment technique and the physical printing of ransom notes.\n\n## Active Directory Deployment\n\n\n-----\n\nOne of the most significant changes identified during the analysis was the implementation of\na novel technique for deployment. The payload has the capability to automatically deploy\nitself to Microsoft Active Directory clients via Group Policy Objects (GPO). When executed\non an Active Directory Domain Controller, LockBit 2.0 creates several GPOs to carry out the\ninfection process. The Windows Defender configuration is altered to avoid detection. It\nrefreshes network shares, stops certain services and kills processes. The LockBit executable\nis then copied into the client desktop directories and executed. PowerShell is used to apply\nthe new GPOs to all domain-joined hosts in a specified organization unit (OU).\n\n## Ransom Note\n\nThe following is an example of the ransom note left behind after files are encrypted:\n\n_Figure 8: LockBit’s post-encryption ransom note (source: IBM X-Force)_\n\nAnother interesting addition to the extortion techniques is a new LockBit functionality to\nrepeatedly print the ransom note to any printers connected to the victim host.\n\n## A Growing Threat to Watch For\n\nLockBit does not appear to be slowing down, with regular leaks being published daily since\nthe launch of their 2.0 affiliate program. It is likely that the ransomware payload will also\ncontinue to evolve and expand its capabilities. This ransomware group and the many others\ncurrently operating in the threat landscape present a major threat to organizations in all\nindustries and geographies, except those in the Commonwealth of Independent States (CIS)\ncountries where most malware operators avoid attacking local organizations.\n\nOrganizations should prioritize protecting their networks and data from this threat or risk\njoining the growing list of victims of RaaS affiliates. The following are a few actions\ncompanies can take that can help mitigate risks and minimize damage:\n\nEstablish and drill an incident response team. Whether in-house or as a retained\nservice, the formation of an incident response team and drilling the most relevant\n[attack scenarios can make a big difference in attack outcomes and costs.](https://www.ibm.com/security/data-breach/threat-intelligence)\n\n\n-----\n\nEstablish and maintain offline backups. Ensure you have files safely stored from\nattacker accessibility with read-only access. Also, consider the use of offsite/cold\nstorage solutions. The availability of backup files is a significant differentiator for\norganizations that can help them recover from a ransomware attack.\nImplement a strategy to prevent unauthorized data theft, especially as it applies to\nuploading large amounts of data to legitimate cloud storage platforms that attackers\ncan abuse. Consider blocking outbound traffic to unapproved cloud hosting services.\nEmploy user and entity behavior analytics to identify potential security incidents. When\ntriggered, assume a breach has taken place. Audit, monitor and quickly act on\nsuspected abuse related to privileged accounts and groups.\n[Deploy multifactor authentication on all remote access points into an enterprise](https://securityintelligence.com/posts/multifactor-authentication-the-next-battleground/)\nnetwork — with particular care given to secure or disable remote desktop protocol\n(RDP) access. Multiple ransomware attacks have been known to exploit weak RDP\naccess to gain initial entry into a targeted network.\nUse [penetration testing to identify weak points in enterprise networks and](https://www.ibm.com/security/services/offensive-security-services)\nvulnerabilities that should be prioritized for patching. In particular, we recommend\n[implementing mitigations for CVE-2019-19781, which multiple threat actors have used](https://nvd.nist.gov/vuln/detail/CVE-2019-19781)\nto gain initial entry into enterprises in 2020 and 2021 — including for ransomware\nattacks.\nConsider prioritizing the immediate remediation, as applicable, of the following\nfrequently exploited software vulnerabilities:\n\nCVE-2019-2725\nCVE-2020-2021\nCVE-2020-5902\nCVE-2018-8453\n\nVPN-related CVEs\n\nCVE-2019-11510\nCVE-2019-11539\nCVE-2018-13379\nCVE-2019-18935\nCVE-2021-22893\n\nRDP\n\n\n-----\n\nRestrict port access on TCP port 3389\nApply multifactor authentication to remote access logins\nRemediate RDP vulnerabilities such as Windows RDP CVE-2019-0708\n(BlueKeep)\nCVE-2020-3427\nCVE-2020-0610\nCVE-2020-0609\nSegment networks according to the data they host.\nEncrypt the data most likely to be stolen in an attack.\n[Consider adopting a zero trust approach and framework to better control what users](https://www.ibm.com/security/zero-trust)\ncan access and potentially halt an attack in its tracks.\n\nIf you are experiencing cybersecurity issues or an incident, contact X-Force for assistance:\nU.S. Hotline: 1-888-241-9812 | Global Hotline: +(001) 312-212-8034. Learn more about XForce’s [threat intelligence and](https://www.ibm.com/security/services/threat-intelligence) [incident response services.](https://www.ibm.com/security/services/incident-response-services)\n\n## Indicators of Compromise\n\nSHA256 Hashes\n\n00260c390ffab5734208a7199df0e4229a76261c3f5b7264c4515acb8eb9c2f8\n\n0545f842ca2eb77bcac0fd17d6d0a8c607d7dbc8669709f3096e5c1828e1c049\n\n2ba9fab56458fe832afecf56aae37ff89a8b9a494f3c2570d067d271d3b97045\n\n4de287e0b05e138ab942d71d1d4d2ad5fb7d46a336a446f619091bdace4f2d0a\n\n743ecc953dcd83a48140c82d8a7dcac1af28e0839aed16628ddfc9454bec8dfa\n\n8155c6bea7c1112f022e9c70279df6759679295bd4d733f35b6eea6a97d3598f\n\n856d5253f68bebcba161bc8f8393f34c806717faa6297c669c75fb13b17f8d03\n\n9bca4fe6069de655467e59929325421b93617bccfdf23e9fba02615d36d60881\n\na98ffa66c07f634d19dc014bb2d63fa808d7af5dc9fb9b33aa19a8b944608816\n\nacad2d9b291b5a9662aa1469f96995dc547a45e391af9c7fa24f5921b0128b2c\n\nb3faf5d8cbc3c75d4c3897851fdaf8d7a4bd774966b4c25e0e4617546109aed5\n\ndd8fe3966ab4d2d6215c63b3ac7abf4673d9c19f2d9f35a6bf247922c642ec2d\n\nea028ec3efaab9a3ce49379fef714bef0b120661dcbb55fcfab5c4f720598477\n\nf32e9fb8b1ea73f0a71f3edaebb7f2b242e72d2a4826d6b2744ad3d830671202\n\n\n-----\n\nf3e891a2a39dd948cd85e1c8335a83e640d0987dbd48c16001a02f6b7c1733ae\n\n[Megan Roddie](https://securityintelligence.com/author/megan_roddie/)\nCyber Threat Researcher - IBM X-Force IRIS\n\nMegan Roddie is a Cyber Threat Researcher with IBM's X-Force IRIS. She has a M.S. in\nDigital Forensics along with several industry Digital Forensics and Inci...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-09 - LockBit 2.0- Ransomware Attacks Surge After Successful Affiliate Recruitment.pdf"
    ],
    "report_names": [
        "2021-09-09 - LockBit 2.0- Ransomware Attacks Surge After Successful Affiliate Recruitment.pdf"
    ],
    "threat_actors": [
        {
            "id": "0fc739cf-0b82-48bf-9f7d-398a200b59b5",
            "created_at": "2022-10-25T16:07:23.797925Z",
            "updated_at": "2025-03-27T02:02:09.983353Z",
            "deleted_at": null,
            "main_name": "LockBit Gang",
            "aliases": [
                "Bitwise Spider",
                "Operation Cronos"
            ],
            "source_name": "ETDA:LockBit Gang",
            "tools": [
                "3AM",
                "ABCD Ransomware",
                "CrackMapExec",
                "EmPyre",
                "EmpireProject",
                "LockBit",
                "LockBit Black",
                "Mimikatz",
                "PowerShell Empire",
                "PsExec",
                "Syrphid"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535702,
    "ts_updated_at": 1743041501,
    "ts_creation_date": 1653762365,
    "ts_modification_date": 1653762365,
    "files": {
        "pdf": "https://archive.orkl.eu/5d6db6617f4fde6d1048b455a63bdd8041fa63ae.pdf",
        "text": "https://archive.orkl.eu/5d6db6617f4fde6d1048b455a63bdd8041fa63ae.txt",
        "img": "https://archive.orkl.eu/5d6db6617f4fde6d1048b455a63bdd8041fa63ae.jpg"
    }
}