{
    "id": "f5a79fe0-4790-445a-b566-56e273515ee3",
    "created_at": "2023-01-12T15:09:43.411652Z",
    "updated_at": "2025-03-27T02:08:51.26365Z",
    "deleted_at": null,
    "sha1_hash": "c1c23b2f18f13abb2435fd76079c66137de07ae8",
    "title": "2021-01-16 - Iran’s Cyber Campaign, and Coercive Recruitment Methods",
    "authors": "",
    "file_creation_date": "2022-05-28T15:52:27Z",
    "file_modification_date": "2022-05-28T15:52:27Z",
    "file_size": 933456,
    "plain_text": "# Iran’s Cyber Campaign, and Coercive Recruitment Methods\n\n**[mideastcenter.org/post/iran-s-cyber-campaign-and-coercive-recruitment-methods](https://www.mideastcenter.org/post/iran-s-cyber-campaign-and-coercive-recruitment-methods)**\n\nMECRA January 16, 2021\n\nMECRA\n\nJan 16, 2021\n\n7 min read\n\n**Regime recruits hackers by coercion**\n\n\n-----\n\nA [number of Iranian IRGC-related computer hackers are currently on the FBI wanted list.](https://www.fbi.gov/wanted/cyber/iranian-ddos-attacks/irancybercollage.pdf/view)\nEvidence is emerging, however, that some Iranian hackers, participants in Iran's cyber\nsabotage operations against foreign governments, have been coerced into taking part in\nthese operations. MECRA’s Iran correspondent investigated this issue.\n\n‘Ali’ (not his real name) is a computer programmer and is one of the hackers on the FBI\nwanted list. A friend of his, in conversation with MECRA, gave the following testimony:\n\n“Ali was forced to cooperate. They made a trap for him. Very few of his friends know that he\nis a homosexual. In a religious city with his religious family, it would be a major disaster for\nhim and his family if people knew about this\n\nAli was contacted by an anonymous person who sent him an excerpt from a recorded video\nshowing him having sexual relations with another man, and threatening to publish the video.\nOver a period of weeks, Ali was sent additional excerpts from the same individual. At first, Ali\nwas convinced that the anonymous caller was his former partner. He contacted his former\npartner, who denied any involvement.\n\nAfter a month, Ali received a call from a number, which invited him to come in for a meeting.\nHe realized that the number was from the Ministry of Intelligence. He attended the meeting.\nInitially, his questioners asked him about his online private customers and activities. They\nexplained that they were concerned because of the recent hacking of an Iranian bank. In a\nsubsequent meeting, Ali was then asked to cooperate with the ministry’s team of hackers in\nattacking anti-government sites.\n\nThese were websites of political groups located outside of Iran. Ali agreed to become\ninvolved with the project. The ministry then offered that if he continued his cooperation, he\nwould be exempted from Sarbazi – conscription. [According to the Iranian constitution, men\nolder than 18 years old are required to perform military service. The length of service is 18\nmonths-2 years ].\n\nAli remained under tremendous stress because of the video. He had no way of finding who\nhad sent it to him, though he was convinced it came from the Intelligence Ministry. He trusted\nno one anymore. He didn’t want to see me. Then, after three weeks of no communication, I\n\n\n-----\n\nreceived an SMS from him saying this was the end of line. I went to him. The video, he said,\nhad clearly been taken by the ministry, who wished to threaten him in order to coerce him to\ndo their will. Their expectations increased day by day. He didn’t want to be involved with\ncyber crimes on the international level. But he had little choice. His father was suffering from\nheart disease. Ali knew that if he took his own life, it would mean disaster for his family. If the\nvideo were to be published, this would also be a disaster for his family. They didn’t leave any\noption for him.\n\nThis is the situation facing many hackers recruited by coercion by the Iranian authorities.\nDays and nights, on anti-stress medication and worrying about their tomorrow. Continuous\nthreats from the IRGC or the Intelligence Ministry. Ignored by their friends, receiving\nblackmail threats. And wanted by international law enforcement because of their activities.\n\nDetails of Iran’s Cyber Campaign\n\n“Today, we are in an atmosphere of a full-blown intelligence war with the US, and the front of\nenemies of the Revolution and the Islamic system,” IRGC Commander Hussein Salami said\nrecently, adding that, “This atmosphere is a combination of psychological warfare and cyber\noperations, military provocations, public diplomacy and intimidation tactics.”\n\nCyber war in Iran is part of the military strategy of Iran's soft war. ‘Iranian Cyber Army’ is a\nname used for the regime’s cyber activities on the internet.\n\nIran has been condemned for cyber attacks against the United States, Israel and the Arab\nGulf states. But the regime has issued a blanket denial concerning all such activities.\n\nIran's ‘Cyber Army’ is a subset of the IRGC's cyber surveillance team, with a budget of $76\nmillion and over a billion dollar investment in infrastructure . ِDefense Tech estimated the\nnumber of ‘troops’ in this army at about 2,400, with 1,200 reserves.\n\n\n-----\n\nThe plan to form Iran s Cyber Army was proposed by the IRGC in 2005. The Cyber Army\nmanpower unit teams, after identifying professional hackers, contact them and threaten to\nsend them to prison if they do not cooperate.\n\n[A statement from Iran’s Cyber Police (FATA) said “White hat hackers are valuable people](https://www.cyberpolice.ir/taxonomy/term/68851)\nwho benefit from the knowledge of cyberspace. Police identify white hat hackers, The police\nis in contact with these hackers, and many of these hackers express a desire to cooperate\nwith the police. We use this nucleus to advance our goals.”\n\nStructure and targets\n\nIran's cyber army is divided into five sections\n\nThe first section’s mission is defense. It tracks the identity of attacking hackers and thwarts\ntheir activities.\n\nThe second section ‘s mission is offensive, targeting infrastructure facilities belonging to\ncountries in \"opposition to the Islamic Republic\", including energy, water, train networks and\nairports. The group also seeks to target some countries' nuclear facilities, banks and global\nmarkets.\n\nThe Basij Cyber Council is a main center which trains volunteer hackers under the\nsupervision of IRGC. These volunteers are called 'cyber war commandos.'\n\nThe third section is responsible for decrypting passwords and data transfer tools.\n\nThe fourth section’s mission is to jam the frequencies of certain Arab and Western television\nchannels. This group was established some months ago, and so far it has been able to jam\nsome Persian and Arabic-language television channels.\n\n\n-----\n\nThe fifth groups mission is to carry out DDOS and DOS (denial of service) attacks against\nimportant sites in enemy countries.\n\nThe Basij Cyber Council is a main center which trains volunteer hackers under the\nsupervision of IRGC. These volunteers are called \"cyber war commandos.\"\n\nMalek Ashtar Base and Kheibar Security Base are the hacking centers that have a key role\nin educating young talent and recruiting new staff [both Iranians and non-Iranians].\n\n[Ashianeh Group is the oldest, most active and most famous cyber security group in Iran.](https://pirastehfar.blogsky.com/1397/12/27/post-10/%D9%87%DA%A9%D8%B1%D9%87%D8%A7%DB%8C-%D8%AC%D9%87%D8%A7%D9%86-%D8%A7%DB%8C%D8%B1%D8%A7%D9%86%DB%8C-%DA%AF%D8%B1%D9%88%D9%87-%D8%A2%D8%B4%DB%8C%D8%A7%D9%86%D9%87-%D9%85%D8%B5%D8%A7%D8%AD%D8%A8%D9%87-%D8%A8%D8%A7%DB%8C%DA%A9-%D9%87%DA%A9%D8%B1)\nَAshianeh members are among the most active members of Iran’s cyber army. Their activities\n\nhave been extensively covered by IRGC affiliated news agencies under the title of “Iran's\nVictories”. The group was established eight years ago with the aim of educating users and\nnetwork administrators and improving the security level of computer networks in Iran. But in\nthe course of its evolution, it did not adhere to these goals alone. At the present time, their\nactivities have more of a political flavor than an educational one.\n\n[Ashianeh has carried out several projects to infiltrate foreign sites and networks. ِ On](https://tavaana.org/sites/default/files/interview_1_0.pdf)\n[December 21st, 2020, Tasnim, an IRGC affiliated news website, wrote “ Iranian hackers](https://www.tasnimnews.com/fa/news/1399/10/01/2414894/%D8%B3%D8%A7%D8%AE%D8%AA%D8%A7%D8%B1-%D8%B3%D8%A7%DB%8C%D8%A8%D8%B1%DB%8C-%D8%A7%D8%B3%D8%B1%D8%A7%D8%A6%DB%8C%D9%84-%D8%AF%D8%B1-%D9%85%D9%82%D8%A7%D8%A8%D9%84-%D9%87%DA%A9%D8%B1%D9%87%D8%A7-%D8%B2%D8%A7%D9%86%D9%88-%D8%B2%D8%AF-%D8%A2%DB%8C%D8%A7-%D8%B1%D8%A7%D8%AF%D8%A7%D8%B1%D9%87%D8%A7%DB%8C-%DA%AF%D9%86%D8%A8%D8%AF-%D8%A2%D9%87%D9%86%DB%8C%D9%86-%D9%87%DA%A9-%D8%B4%D8%AF%D9%87-%D8%A7%D8%B3%D8%AA)\nmanaged to enter the servers of the Israeli Air Force. Israel's Cyber Structure Kneels before\nour hackers. Are Iron Dome Radars Hacked?”\n\n[“US federal authorities have prosecuted a zealous young Iranian hacker for allegedly being](https://www.khabaronline.ir/photo/1433120/%D8%B9%DA%A9%D8%B3-FBI-%DB%8C%DA%A9-%D8%AC%D9%88%D8%A7%D9%86-%D8%BA%DB%8C%D9%88%D8%B1-%D8%A7%DB%8C%D8%B1%D8%A7%D9%86%DB%8C-%D8%B1%D8%A7-%D8%AA%D8%AD%D8%AA-%D8%AA%D8%B9%D9%82%DB%8C%D8%A8-%D9%82%D8%B1%D8%A7%D8%B1-%D8%AF%D8%A7%D8%AF)\ninvolved in a cyber attack on a number of US websites following the brutal assassination of\nHaj Qassem Soleimani, commander of the IRGC's Quds Force.”\n\n[Operations against major US facilities, including cyber-attacks on several dams, several](https://shabtabnews.com/1395/10/26/%D9%82%D8%B1%D8%A7%D8%B1-%DA%AF%D8%A7%D9%87-%D8%A7%D9%85%D9%86%D9%8A%D8%AA%D9%89-%D8%AE%D9%8A%D8%A8%D8%B1-%D9%88-%D9%81%D8%B9%D8%A7%D9%84%D9%8A%D8%AA%E2%80%8C%D9%87%D8%A7%D9%89-%D8%A7/)\nmajor US banks and power plants, and a number of cyber attacks on Saudi banks and\nstatistical centers, a 12-hour power outage in Turkey, attacks on various Israeli centers and\nsatellites, were all carried out via the Kheibar base.\n\n\n-----\n\nKheibar was established with the aim of concentrating the technical forces of offensive and\ncyber defense in 2012 with a combination of cyber technical forces of the technical\ndepartment of the Ministry of Intelligence, the cyber department of the IRGC, and the\ntechnical forces of the Ministry of Defense and Armed Forces Support.\n\nIn 2016, the commander of Iran's cyber army, formerly stationed at the Kheibar base,\n[Mohammad Hossein Tajik, was executed by the Iranian intelligence service. Tehran’s coroner](https://www.youtube.com/watch?v=S_pptGCYS2k)\ndeclared the cause of death to be cardiac arrest.\n\nTajik, born in 1981, was one of the elite students of Iran in the field of physics. He was killed\nin the presence of his father and a Ministry of Intelligence employee at his home in east\nTehran. He had been arrested in 2014 on charges of espionage. Following the intervention of\nhis father, he was temporarily released after six months.\n\nTajik’s father, a member of the Quds Force and a longtime friend of Qassem Soleimani,\nworked with various Quds Force-affiliated organizations in the Middle East and various\nintelligence services on his missions from 1998 to 2013.\n\nAnother base, Malek Ashtar, is mainly focused on the field of attacking Farsi news websites\nand hacking the social media accounts of activists and oppositionists inside and outside the\ncountry. They established a number of branches under different names all over Iran.\n\nWhile government hackers are carrying out acts of sabotage against activists and\nَpopular anti-regime users on social media, anonymous independent groups of hackers\n\nsupport the opposition, especially during the recent protests, by hacking the accounts\nof cyber army members/IRGC propagandists, and revealing their real identities.\n\nCounter activities by opposition cyber activists\n\n\n-----\n\nWhile government hackers are carrying out acts of sabotage against activists and popular\nanti-regime users on social media, anonymous independent groups of hackers support the\nopposition, especially during the recent protests, by hacking the accounts of cyber army\nmembers/IRGC propagandists, and revealing their real identities.\n\n[In January 2019, One of these hack groups “Tapandegan” which is famous for targeting](https://vimeo.com/279298544)\nIRGC assets, took over the computer systems at one of the largest airports in Iran.\n\nOn the billboards and television screens at Mashhad airport, passengers saw a symbolic\nimage of the December 2017 protests with the Popular hashtag in farsi \"#national_protests\"\nاﻋﺘﺮاﺿﺎت_ ﺳﺮاﺳﺮی\n\nThis was accompanied by the following message: “Attention, attention. We are Tapandegan.\nWe have taken control of the computer system at Mashhad Airport as an act of protest. It has\nbeen five months since unrest has gripped the country. However, the IRGC continues to\nwaste money, lives, and resources in Syria, Gaza, and Lebanon. We will continue our\nprotests until they cannot silence our voices any longer. We are acting in solidarity with the\ncourageous people of Kazerun [in the southern province of Fars, site of a violent protest on\nMay 16]. We have just started our campaign. If you support our cause, then we ask that you\nshare with us any crucial information including footage of protests around the country.”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-16 - Iran’s Cyber Campaign, and Coercive Recruitment Methods.pdf"
    ],
    "report_names": [
        "2021-01-16 - Iran’s Cyber Campaign, and Coercive Recruitment Methods.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536183,
    "ts_updated_at": 1743041331,
    "ts_creation_date": 1653753147,
    "ts_modification_date": 1653753147,
    "files": {
        "pdf": "https://archive.orkl.eu/c1c23b2f18f13abb2435fd76079c66137de07ae8.pdf",
        "text": "https://archive.orkl.eu/c1c23b2f18f13abb2435fd76079c66137de07ae8.txt",
        "img": "https://archive.orkl.eu/c1c23b2f18f13abb2435fd76079c66137de07ae8.jpg"
    }
}