{
    "id": "f5d207ed-7648-4994-80e4-b7afcc7dfac5",
    "created_at": "2023-01-12T15:02:51.597886Z",
    "updated_at": "2025-03-27T02:05:25.882121Z",
    "deleted_at": null,
    "sha1_hash": "722516acb0531291f01dcbc84c976fa9cfd1535f",
    "title": "2021-02-03 - Emotet Disruption- what it means for the cyber threat landscape",
    "authors": "",
    "file_creation_date": "2022-05-27T21:37:56Z",
    "file_modification_date": "2022-05-27T21:37:56Z",
    "file_size": 615448,
    "plain_text": "# Emotet Disruption: what it means for the cyber threat landscape\n\n**[digitalshadows.com/blog-and-research/emotet-disruption/](https://www.digitalshadows.com/blog-and-research/emotet-disruption/)**\n\nFebruary 3, 2021\n\nLast week, the European Union Agency for Law Enforcement Cooperation (EUROPOL)\n[published a press release detailing the operation that led to the disruption of Emotet, one of](https://www.europol.europa.eu/newsroom/news/world%E2%80%99s-most-dangerous-malware-emotet-disrupted-through-global-action)\nthe most prominent trojans that populated the cyber threat landscape. This operation,\ndubbed “Operation Ladybird”, was a joint effort led by the authorities of several European\ncountries and the US and resulted in the takedown of Emotet’s infrastructure and the arrest\nof two Ukrainian members of this cybercriminal organization.\n\nThis operation has the potential to significantly shape the threat landscape. Emotet has been\n[used in numerous cybercriminal operations, including ransomware operations, to gain initial](https://www.digitalshadows.com/blog-and-research/ransomware-analyzing-the-data-from-2020/)\naccess. Given its widespread distribution, the Emotet trojan has likely infected millions of\ndevices worldwide. In this blog, we’ll analyze how Emotet came to be, the significance of\nOperation Ladybird, and reactions from the cybercriminal underground.\n\n## The Evolution of Emotet: From Banking Trojan to Ransomware Facilitator\n\nThe importance of Emotet in the threat landscape cannot be overstated. First discovered in\n2014, Emotet initially functioned as a common banking trojan highly committed to remaining\nunnoticed. It was not long, however, before Emotet’s operators noticed that their malware\nvariant could also serve other purposes, further increasing their payouts.\n\nEmotet’s modular structure allowed the malware to be versatile. Its developers can\nreconfigure the trojan and reshape it as a loader in order to deploy second-stage payloads\nafter getting access to a victim network. These changes turned Emotet into a multi-functional\ntool. Its ability to distribute other malware variants meant that it is also able to facilitate\nlarger-scale ransomware campaigns.\n\n\n-----\n\n_Emotet FAQ Infographic (Europol)_\nThis shift has been crucial for Emotet’s success within the cybercriminal community— used\nin tandem with other information-stealing trojan and ransomware variants, Emotet has been\nable to significantly expand and scale its operations at an astounding pace. At the same\ntime, Emotet continued to use enticing lures in its social engineering efforts and developed\n[highly successful spear-phishing techniques to ensure victims interact with its malicious](https://www.digitalshadows.com/blog-and-research/the-ecosystem-of-phishing/)\nemails.\n\nEmotet’s operators primarily use malicious email attachments and links to deliver its payload.\nIts operators have employed numerous techniques to remain undetected by antivirus\nsoftware and download these malicious files onto the victims’ devices. Once Emotet gains\naccess to the targeted machine, it proliferates within a network. This can be achieved very\nquickly, thanks to its “worm-like” features and aggressive behavior.\n\nIn the past years Emotet partnered with other cybercriminals to scale its operations and\nincrease its reach. Some of its more prominent partnerships include its association with the\n“Ryuk” ransomware and “TrickBot” trojan. Operators of these two malware variants were\nreported to have leveraged machines compromised by Emotet to install their own malware\nand solicit additional malware attacks.\n\n\n-----\n\n_Digital Shadows’ SearchLight view of an Emotet and Trickbot incident briefing_\nBased on estimates (conservative ones), Emotet has insofar managed to make away with\nmillions of US dollars throughout its campaigns—the Ukrainian police estimates a whopping\n$2.5 billion. One of Emotet’s latest malicious operations was conducted in partnership with\nTrickBot and used different [COVID-19-related phishing lures to increase the likelihood of a](https://www.digitalshadows.com/blog-and-research/how-cybercriminals-are-taking-advantage-of-covid-19-scams-fraud-misinformation/)\nsuccessful infection. Hopefully, the law enforcement intervention will cause this operation to\nbe their last one for quite some time.\n\n## Operation Ladybird: How Law Enforcement Disrupted Emotet\n\nOn 27 January 2021, Europol declared that it had successfully infiltrated and disrupted\nEmotet’s infrastructure in a coordinated international action. The “Operation Ladybird” was\nreported to have severely dismantled the “most dangerous malware in the world” and taken\nover its command-and-control (C2) infrastructure.\n\nAccording to the information disclosed by Europol, a team of law enforcement officers,\njudicial authorities, and security researchers simultaneously hijacked numerous C2 servers\nused by Emotet and redirected their traffic towards law enforcement-controlled infrastructure.\nThis practice known as “DNS sinkholing” is crucial to disrupting the infected machines’\ncommunication and can cause considerable damage to the botnet’s operation.\n\n\n-----\n\n_DNS sinkholing à la Jonah Hill_\n[Following Europol’s press release, a Ukrainian law enforcement agency published a video of](https://www.youtube.com/watch?v=_BLOmClsSpc&t)\ntheir raid against alleged Emotet operators. In the video, officers were seen seizing computer\nequipment, gold bars, and a large quantity of foreign currencies. Given Emotet’s operation\nsize, one would have expected the operation being conducted from a fancy mansion in a\nCaribbean island—but maybe cybercrime isn’t always as glamorous as it looks on TV shows.\n\n_A screenshot of the Ukrainian law enforcement raid video_\nWith this takedown, German law enforcement officers are using their access to affected\nservers to deploy an Emotet update that will remove the malware from all compromised\ndevices on 25 April 2021. This update will prevent Emotet’s C2 servers from communicating\nwith compromised devices, thus inhibiting any further malware download. The delay has\nbeen set to give law enforcement agencies the opportunity to investigate compromised\nmachines prior to the malware’s removal.\n\n\n-----\n\n## Reactions from the cybercriminal underground to Emotet s disruption\n\nSuch a move will likely raise some eyebrows. From a researcher standpoint, looking at the\nbehavior and reaction of cybercriminals is crucial to understanding the impact of these\noperations on the threat landscape. It can give us important insights into potential further\n[activity. So, as soon as Operation Ladybird’s news broke, we turned to cybercriminal forums](https://resources.digitalshadows.com/whitepapers-and-reports/the-modern-cybercriminal-forum)\nto see how the cybercriminal community has responded to the operation.\n\n[Actionable intelligence remains one of the most vital aspects of Cyber Threat Intelligence](https://www.digitalshadows.com/blog-and-research/threat-intelligence-a-deep-dive/)\n(CTI) and it appears that cybercriminals too, are interested in having some actionable\ninformation of their own. Besides nationalistic derogatory comments about Ukrainian law\nenforcement’s involvement in the operation, we observed users on Russian-language\ncybercriminal forums complaining about the lack of technical details in Europol’s press\nrelease on the operation.\n\nCybercriminal forum user complaining about how takedown stories are reported by the\nmedia\nOthers offered some common cybercriminal wisdom. One user mused that “the longer you\nwork, the more footprints there are”, implying that threat actors behind a successful\ncybercriminal operation leave traces that could lead to their identification and downfall.\nCybercriminals usually pay careful attention to their operational security (OPSEC), but every\nnow and then someone will inevitably get comfortable and let their guard down, leading law\nenforcement to their doors.\n\n\n-----\n\n_Cybercriminal forum user warning about threat actors making mistakes and getting caught_\nOn another cybercriminal forum, a different user provided their take and raised an interesting\npoint regarding the lasting impact of these operations. CTI enthusiasts will remember that\n[back in October 2020, the US Cyber Command attempted to neutralize the TrickBot botnet in](https://www.washingtonpost.com/national-security/cyber-command-trickbot-disrupt/2020/10/09/19587aae-0a32-11eb-a166-dc429b380d10_story.html)\nthe run-up to the US Presidential elections. Although effective in the short-term, the reality is\nthat TrickBot’s operations continue to run today and the trojan is nowhere near being\ncompletely crippled. Drawing comparisons to that attempt, this user suggested that it\nremains to be seen whether Operation Ladybird will actually knock Emotet down.\n\n\n-----\n\n_Cybercriminal forum user comparing Operation Ladybird to last year’s TrickBot takedown_\n\n## Future Implications and Mitigation tools\n\nPrevious attempts to combat these malicious activities have so far yielded mixed results. On\nthe one hand, the malicious activities associated with these malware variants are halted. On\nthe other, these takedown operations don’t often have permanent effects. The TrickBot\nexample is a poignant one and is testament to the adaptability of these cybercriminals.\nThese botnets’ operators are extremely versatile and can recover from these attacks after a\nshort time. If Operation Ladybird were to follow a similar fate, then it is likely that Emotet is\nnot completely immobilized.\n\nHowever, the “new and unique approach” of this law enforcement action has likely caused\nsevere disruption to Emotet’s networks and command-and-control infrastructure. While\nconducting this operation, law enforcement officers may have gained a unique understanding\nof Emotet’s inner workings and modus operandi. Hopefully, this knowledge will translate to\nmore long-lasting effects, and we can live a world of peace without Emotet haunting the\nscene.\n\nOnly time will tell how severe the damages caused by Europol to Emotet are. Besides, users\nshould be warned that previously-infected machines may still run other malware variants\nsuch as TrickBot and QakBot. Since the uninstall update for Emotet will only happen on 21\nApril 2021, malicious files associated with Emotet will likely remain in compromised\nmachines until then. And who knows what these malicious files can do.\n\n[In the meantime, it is highly recommended to use this tool provided by the Dutch police to](https://www.politie.nl/themas/controleer-of-mijn-inloggegevens-zijn-gestolen.html)\nverify whether Emotet had previously compromised your email address and password. On\ntop of this, Digital Shadows’ SearchLight service maintains a constantly-updated threat\n\n\n-----\n\nintelligence library that monitors trends and key-players in the cyber threat landscape. If\nyou’d like to access the library for yourself, you can sign up for a free seven-day test drive of\nSearchLight here.\n\nTags: [Cyber Threats /](https://www.digitalshadows.com/blog-and-research/tag/cyber-threats/) [Cybercriminality /](https://www.digitalshadows.com/blog-and-research/tag/cybercriminality/) [emotet](https://www.digitalshadows.com/blog-and-research/tag/emotet/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-03 - Emotet Disruption- what it means for the cyber threat landscape.pdf"
    ],
    "report_names": [
        "2021-02-03 - Emotet Disruption- what it means for the cyber threat landscape.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535771,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653687476,
    "ts_modification_date": 1653687476,
    "files": {
        "pdf": "https://archive.orkl.eu/722516acb0531291f01dcbc84c976fa9cfd1535f.pdf",
        "text": "https://archive.orkl.eu/722516acb0531291f01dcbc84c976fa9cfd1535f.txt",
        "img": "https://archive.orkl.eu/722516acb0531291f01dcbc84c976fa9cfd1535f.jpg"
    }
}