{
    "id": "f617414c-769b-4b42-b4cb-12baa4d35dc2",
    "created_at": "2023-01-12T15:05:22.336564Z",
    "updated_at": "2025-03-27T02:10:49.361965Z",
    "deleted_at": null,
    "sha1_hash": "6fec5d93f01b3c21f25ae160ac0287f139ba53c6",
    "title": "2021-06-14 - Introducing Script Watch- Detect Magecart style attacks, fast!",
    "authors": "",
    "file_creation_date": "2022-05-28T02:35:36Z",
    "file_modification_date": "2022-05-28T02:35:36Z",
    "file_size": 634647,
    "plain_text": "# Introducing Script Watch: Detect Magecart style attacks, fast!\n\n**[scotthelme.co.uk/introducing-script-watch-detect-magecart-style-attacks-fast/](https://scotthelme.co.uk/introducing-script-watch-detect-magecart-style-attacks-fast/?utm_source=dlvr.it&utm_medium=twitter)**\n\nScott Helme June 14, 2021\n\n[Report URI](https://scotthelme.co.uk/tag/report-uri/)\n\n\n-----\n\n## Scott Helme\n\nSecurity researcher, entrepreneur and international speaker who specialises in web\ntechnologies.\n\n[More posts by Scott Helme.](https://scotthelme.co.uk/author/scott/)\n\n**[Scott Helme](https://scotthelme.co.uk/author/scott/)**\n\n14 Jun 2021 • 7 min read\n\nI'm really excited to be announcing something that we've been working towards for a long\ntime at Report URI, Script Watch! Continuing our goal of making browser security features\nlike CSP easier to use and empowering application owners to neutralise serious risks, Script\nWatch represents a significant step forwards!\n\n\n-----\n\n**Magecart**\n\nFor almost 6 years now, a collective known as Magecart have been wreaking havoc on\necommerce sites with their attacks. By finding a way to inject hostile JavaScript into an\napplication, a Magecart attack would skim credit card data being entered into payment pages\nand then siphon that off to a server controlled by the attackers using one of many exfiltration\nvectors. Because the data was being entered onto a payment page, the attackers would get\neverything including names, addresses, full card numbers, expiry dates and even security\ncodes.\n\nMany large organisations have fallen victim to these kinds of attacks including names like\nBritish Airways and Ticketmaster, organisations of significant size. The attacks all begin\nwhen the attacker finds any way to get their hostile JS into the page and often there are no\nvisible clues on the page that data is being stolen.\n\nI've long spoken about Content Security Policy and the power it offers in mitigating attacks\nlike these. CSP allows you to define an allowed list of locations that your resources load\nfrom, with JS being of particular interest here. If you control all of the locations that JS is\nallowed to load from, then the attackers can't get their hostile JS to load on your site.\n\nWriting a good CSP is hard, though, and at Report URI we've been constantly looking for\nways to make CSP easier to setup and ways to extract useful information from reporting with\nless effort. The [CSP Wizard that we introduced 3 years ago is still one of the easiest ways to](https://scotthelme.co.uk/report-uri-csp-wizard/)\ngenerate a CSP that I've come across and now with the announcement of Script Watch,\nwe're hoping you can start getting useful information from your CSP reports even sooner.\n\n**Script Watch**\n\n\n-----\n\nWhen you deploy a CSP on your site, the browser will only load JS from locations that you\nspecifically allow. This means that JS loading from locations you do not allow will be blocked\nand a report will be sent. The core value proposition of Report URI is to collect these reports\nfor you, filter and aggregate them and then present the information to you in useful\ndashboards. There is still a step in the process here though where you need to monitor\nwhat's happening on your site, and that's one of the main things that Script Watch is starting\nto change.\n\nWhen we collect your reports we can see what JS you expect to load on your site, which is\nthe JS allowed in your CSP, and the JS which you do not expect to be on your site, which is\nwhat triggers a report to be sent. This means that we can see all JS being loaded on your\nsite and this is the first piece of information that Script Watch can make available, an entire\naudit of all JS present on your site!\n\nThat is the information that Script Watch gathered about my site in just a few minutes, with\nbasically no effort to deploy. Whilst you can go to our site and view all of your JS\ndependencies, which is great, it'd be even better if you didn't have to go to our site to do that.\n\n\n-----\n\nWhen we detect a new script being reported on your site you will now receive an email\nnotification informing you of what we found! As you can see here, because I've just turned on\nScript Watch, quite a few JS dependencies were found all at the same time, but on an\nongoing basis you will likely only find one or two new dependencies being reported to you at\na time.\n\nWhat's even better is that Script Watch monitors individual JS files, so even if someone does\nsomething as simple as bump the version of a library you use, Script Watch can detect that\nand report a new dependency to you!\n\n**Past Examples**\n\nYou don't have to look too far to see exactly the kind of scenario we need to be worried about\nhappening and over the years there have been many examples of how Magecart have\ninjected their hostile JS into target sites. There was a particular period of time where a large\n\n\n-----\n\nnumber of Magento ecommerce sites were being targeted and here are a few samples of the\nscript tags that were being injected into those sites.\n\n```\n<script src=\"https://jquery-cdn.top/mage.js\"></script>\n\n```\n```\n<script src=\"https://angular.cub/js/everlast.js\"></script>\n\n```\n```\n<script src=\"https://sj-syst.link/sj-syst/ocart.js\"></script>\n\n```\n\nOnce these script tags are on the page the keylogger is loaded and begins stealing credit\ncard data typed into the page and sending it to a drop server controlled by the attackers.\nEven a keen eye in the developer tools might skim over such a script with what seems to be\na fairly normal looking name, but if you received a notification to say this is a brand new\ndependency on your site, you might look at it a bit more carefully!\n\n**Availability**\n\nWe've been testing Script Watch internally for some time now, refining and improving things\nas we go, and we've also had select customers test Script Watch in our Beta Program. As a\nresult, Script Watch is now generally available for all customers subscribed on a mid-tier plan\nor higher, including all of our Enterprise customers who automatically get access to all new\nfeatures.\n\nScript Watch does not increase the cost of your plan and it will also not consume any\nadditional quota. For customers on a plan that includes Script Watch, it is completely free to\nuse! Once you enable Script Watch on one of your sites, the tool will ingest and work with a\ncopy of your existing, incoming reports, meaning no additional usage is required and no\nadditional costs are incurred.\n\n**Getting Started**\n\n[If you want more detailed information then you should check our docs page for Script Watch](https://docs.report-uri.com/setup/script-watch/)\nbut I will give you the basic idea here too. Under the CSP menu in your account, there is now\na Script Watch menu item:\n\n\n-----\n\nHere you can see any sites that Script Watch is currently monitoring for you, or add new sites\nto be monitored. It's worth noting that Script Watch monitors 'sites' based on the FQDN so\n```\nwww.report-uri.com and blog.report-uri.com would be monitored separately to\n\n```\neach other. Check the docs page or click the little 'i' information icons on the page for more\ndetails. If I click Inspect for a particular site I can view all of the reported JS dependencies for\nthat site!\n\n\n-----\n\nYou will also receive an email notification as we detect new dependencies and these will be\ngrouped if we detect several new dependencies at the same time.\n\n\n-----\n\nOther than the Inspect button you also have Reset, which will clear all currently documented\ndependencies and start building a new list (great if you've made changes to your site and\nwant to start a fresh list) or the Delete option to delete all data for that site and stop\nmonitoring for changes.\n\n**CSP and Script Watch are not a silver bullet**\n\nIf we're going to get serious about attacks like Magecart and others with a hope of stopping\nthem, we also need to understand that even with a good CSP and Script Watch enabled,\nthere are still ways that attackers can succeed. Site operators should also consider another\n\n\n-----\n\n[technology called Subresource Integrity, or SRI, to secure their assets. I ve spoken about](https://scotthelme.co.uk/subresource-integrity/)\n[SRI in the context of Magecart before, Magecart are coming for you, are you ready?, and](https://scotthelme.co.uk/hardening-payment-forms-with-csp/)\n[Protect your site from Cryptojacking with CSP + SRI, which is a slightly different attack but](https://scotthelme.co.uk/protect-site-from-cryptojacking-csp-sri/)\nconducted in exactly the same way. Fortunately, it's quite easy to deploy SRI in almost all\n[circumstances, we have a tool to help you, and the combination of CSP and SRI together is](https://report-uri.com/home/sri_hash)\na very powerful protection against hostile script. By setting up Script Watch you can\npotentially neutralise attacks like these before they even happen, but you will always get\nrapid alerting that an attack is just beginning which could be invaluable in stopping it before\ntoo much damage takes place.\n\n**More to come**\n\nIt's taken us a little while to get to a point where we can launch Script Watch, but that's\nbecause we've been building up the technology behind it which can now be used in other\nscenarios much more easily. We have other features coming in the near future that will\nleverage the same near-real-time monitoring and alerting for other things that you will\ndefinitely be interested in learning about on your site, so stay tuned for those. Just think,\ngetting script into your page is only one step in a Magecart style attack, and there's a\nsecond, arguably more important, step that follows...\n\nFor now, though, please give Script Watch a try, send me some feedback and feel free to use\nthis discount code to get you started! This will give new customers, and existing customers\nwho need to upgrade their plan, a 50% discount on their first month so you can try out Script\nWatch to see if it's for you: SCRIPTWATCH\n\n[If you want to get notified when I publish a new blog, please consider subscribing! Tags:](https://scotthelme.ghost.io/#/portal/signup)\n[Report URI,](https://scotthelme.co.uk/tag/report-uri/) [Script Watch,](https://scotthelme.co.uk/tag/script-watch/) [magecart](https://scotthelme.co.uk/tag/magecart/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-14 - Introducing Script Watch- Detect Magecart style attacks, fast!.pdf"
    ],
    "report_names": [
        "2021-06-14 - Introducing Script Watch- Detect Magecart style attacks, fast!.pdf"
    ],
    "threat_actors": [
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535922,
    "ts_updated_at": 1743041449,
    "ts_creation_date": 1653705336,
    "ts_modification_date": 1653705336,
    "files": {
        "pdf": "https://archive.orkl.eu/6fec5d93f01b3c21f25ae160ac0287f139ba53c6.pdf",
        "text": "https://archive.orkl.eu/6fec5d93f01b3c21f25ae160ac0287f139ba53c6.txt",
        "img": "https://archive.orkl.eu/6fec5d93f01b3c21f25ae160ac0287f139ba53c6.jpg"
    }
}