{
    "id": "f6b1f208-3e4b-48b5-a573-1fd3044406c5",
    "created_at": "2023-01-12T15:07:34.826804Z",
    "updated_at": "2025-03-27T02:05:51.620331Z",
    "deleted_at": null,
    "sha1_hash": "13b0237442aefed584b3f4a0befb542df45410a0",
    "title": "2010-07-24 - Why won’t my sample run-",
    "authors": "",
    "file_creation_date": "2022-05-29T01:33:27Z",
    "file_modification_date": "2022-05-29T01:33:27Z",
    "file_size": 254370,
    "plain_text": "# Why won’t my sample run?\n\n**nakedsecurity.sophos.com/2010/07/24/sample-run/**\n\nBy James Wyke 24 Jul 2010\n\nHere at SophosLabs we have recently been seeing samples of Zbot (also\nknown as the Zeus crimeware kit) that refuse to execute on any of our\ntesting machines.\n\nOften when this happens it is because the sample is corrupt or will only\nexecute on specific versions of Windows, or maybe because the file will only\nrun on a specific date, or because a certain payload is only activated on a\n[certain date (e.g. CIH).](http://www.sophos.com/security/analyses/viruses-and-spyware/w95cih1106.html)\n\nHowever, these Zbot samples have been crafted to ensure that they only\nwork when executed on one specific machine and from one specific path.\nAny attempt to execute the sample on a different machine or from a different\npath will result in early termination of the malware and no impact on the target system.\n\nThis is achieved through a form of hardware based digital watermarking that makes dymanic\nanalysis of the sample effectively impossible for AV researchers.\n\nOlder versions of Zbot (pre version 2.0), when first installed would copy their executable to a\nfixed location (%SYSTEM%\\sdra64.exe), sometimes appending random amounts of data to\nthe end of the file to avoid checksum based detections. Version 2 creates a new file with a\nrandom file name inside a new folder under the user’s %APPDATA% directory. It then\ndeletes the original file with a batch script.\n\nThe new file is almost identical to the original file except for a small block of encrypted data\nat the start of the “.data” section. This block contains the hardware and pathname\ninformation that ties the sample’s successful execution to one location on one machine.\n\n\n-----\n\nThe block contains several key pieces of information including:\n\nA string that includes information from the Computer Name and DWORD values\ngenerated using the OS install date and product key.\nA GUID generated using GetVolumeNameForVolumeMountPoint and\nCLSIDFromString.\nThe randomly named directory and exe file that the new file will be dropped to.\n\nThe block is then encrypted using RC4 and embedded into the new file which is written to\ndisk and executed. When the new file is executed it decrypts the block, re-computes the\nGUID based on the information from the machine it is now running on, compares it to the\ndecrypted value and exits if they differ. The current path of the executable is then also\nchecked against the decrypted path information from the block.\n\nSo when the malware sample is discovered on the machine and sent off for analysis it will be\nexecuted on a new machine and generate a new GUID based on different hardware and OS\ninformation, which will fail the comparison and result in a sample that does nothing, causing\nAV researchers to scratch their heads and wonder what’s going on.\n\nThis sophisticated technique is very similar to hardware based licensing systems employed\nby major software companies to protect their products from piracy. But until now I had not\nseen the technique used to protect malware binaries from analysis.\n\n[Fortunately Sophos customers are protected from Mal/Zbot-U.](http://www.sophos.com/security/analyses/viruses-and-spyware/malzbotu.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2010/2010-07-24 - Why won’t my sample run-.pdf"
    ],
    "report_names": [
        "2010-07-24 - Why won’t my sample run-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536054,
    "ts_updated_at": 1743041151,
    "ts_creation_date": 1653788007,
    "ts_modification_date": 1653788007,
    "files": {
        "pdf": "https://archive.orkl.eu/13b0237442aefed584b3f4a0befb542df45410a0.pdf",
        "text": "https://archive.orkl.eu/13b0237442aefed584b3f4a0befb542df45410a0.txt",
        "img": "https://archive.orkl.eu/13b0237442aefed584b3f4a0befb542df45410a0.jpg"
    }
}