{
    "id": "f6bb67e8-fa8e-42ea-849a-cc751b0bcf58",
    "created_at": "2023-01-12T15:01:34.149146Z",
    "updated_at": "2025-03-27T02:05:51.408266Z",
    "deleted_at": null,
    "sha1_hash": "02c61dcc584dc0ec0e1a765313d3c79cf8dcae1b",
    "title": "2022-07-28 - Attackers Profiting from Proxyware",
    "authors": "",
    "file_creation_date": "2022-09-01T10:10:00Z",
    "file_modification_date": "2022-09-01T10:10:00Z",
    "file_size": 3148308,
    "plain_text": "# Attackers Profiting from Proxyware\n\n**asec.ahnlab.com/en/37276/**\n\nJuly 28, 2022\n\nProxyware is a program that shares a part of the Internet bandwidth that is currently\navailable on a system to others. Users who install the program are usually paid with a certain\namount of cash in exchange for providing the bandwidth. Companies that provide such a\n[service include Peer2Profit and](https://peer2profit.io/) **[IPRoyal. They gain profit by providing the bandwidth to](https://iproyal.com/pawns/)**\nother companies and claim on their webpages that they have various business partners\nusing the service for distributing software, investigating markets, verifying advertisements,\ntesting software, and so on.\n\nWhile users can earn some money from installing proxyware on their systems, they should\nknow they are taking risks by allowing external users to perform certain behaviors by using\ntheir networks. For instance, users cannot know in detail the companies that the proxyware\nplatforms claim to use their services. Even if they can verify their customers on their own, it is\nimpossible to check if your bandwidth will be maliciously exploited in the future or not.\n\n\n-----\n\nFigure 1. IPROYAL claiming how your network is used\nThe ASEC analysis team recently discovered malware strains installing proxyware without\nthe user’s permission. Users whose systems are infected with the malware have their\nnetwork bandwidth stolen by attackers to gain profit. The method of earning profit by using\nthe infected system’s resources is similar to that of CoinMiner. This type of malware has\nbeen continuously around for a while. Cisco Talos once made an analysis on proxyware in\n[2021.[1]](https://blog.talosintelligence.com/2021/08/proxyware-abuse.html)\n\n**1. Case using Adware**\n\nThe post will first discuss malware distributed through adware. AhnLab’s ASD log shows that\nthe proxyware is installed through adware such as Neoreklami.\n\nFigure 2. Proxyware installed through Neoreklami\nIt is a dropper-type malware that installs proxyware of Peer2Profit and IPROYAL on the\nsystem as a user account without the user’s permission\n\n\n-----\n\n…. 1.1. PEER2PROFIT\n\nAs for Peer2Profit, the malware creates Peer2Profit SDK DLL saved in the data section in\nthe same path. According to the manual shown below, Peer2Profit SDK can use the\np2p_is_active() function to check if a proxy client is running or not. It can also start a proxy\nwith the p2p_start() function.\n\nFigure 3. Peer2Profit SDK manual\nThe malware follows the instruction shown in the manual: it loads the created SDK DLL and\ngives the attacker’s email address as an argument to execute the p2p_start() function. The\nmalware can operate in the infected system without the user realizing it to steal the Internet\nbandwidth as a result. The attacker can gain profit through the designated email address (the\nattacker’s account).\n\n\n-----\n\nFigure 4. Creating and\n\nrunning Peer2Profit SDK\n\n…. 1.2. IPROYAL PAWNS\n\nThe dropper malware also installs IPRoyal’s Pawns as well. The dropper initially used the\nCLI exe form of Pawns. IPRoyal programs are usually in GUI forms. Yet as it supports the\nCLI form as well, it can be executed with command lines and installed without users\nrecognizing the process.\n\nFigure 5. IPRoyal Pawns CLI programs\nThe file forcibly terminates Pawns in CLI form if it is currently running. It then creates Pawns\nin the same path, similar to Peer2Profit SDK. It gives the attacker’s email address and\npassword as arguments to run Pawns, gaining profit from the infected system.\n\n\n-----\n\nFigure 6. Installation routine for IPRoyal Pawns\nRecent cases use Pawns in DLL form instead. The dropper creates pawns.dll in the same\npath and loads it. It then calls two functions Initialize() and startMainRoutine().\n\nFigure 7. Execution routine for DLL form of Pawns\nUnlike Pawns in CLI form that received the attacker’s email address and password directly\nthrough command line arguments, Pawns in DLL form receives encoded data as an\nargument. The string is Base64-encoded. Decoding it will show the following json settings\ndata.\n\nFigure 8. Base64-decoded argument data\nThe data is presumably used for verification. In fact, the GUI form IPRoyal uses a similar\nmethod. When logging in to IPRoyal, the GUI client loads libpawns.dll file (libpawns32.dll in\nthe x86 environment) located in %PROGRAMFILES%\\IPRoyal\nPawns\\resources\\packages\\main\\resources\\libpawns inside the installation path and gives\nthe settings data encoded in the same method as an argument to call the startMainRoutine()\nfunction.\n\n\n-----\n\nFigure 9. GUI form of IPRoyal client\n\n**2. Cases of attacks targeting vulnerable MS-SQL servers**\n\nPeer2Profit is used by other attackers as well. The Figure 10 shows a log of Peer2Profit SDK\nbeing installed on a vulnerable MS-SQL server. The system also has infection logs of various\nmalware strains distributed through the dictionary attack such as CoinMiner and backdoor. It\nis likely that the malware installing proxyware was distributed through the dictionary attack as\nthe system had vulnerable account credentials.\n\nFigure 10. Peer2Profit SDK installed through a vulnerable MS-SQL process\nThe “sdk.mdf” file is packed with UPX. It has been installed on multiple vulnerable MS-SQL\nservers starting from early June in 2022. Due to the nature of Peer2Profit, the file is a DLL\nand sends the attacker’s email address as an argument for the export function: the file alone\ncannot reveal additional information such as the attacker’s email address.\n\n\n-----\n\nThe proxyware dropper malware that is recently being discovered is similar to CoinMiner in\nthat it gains profit by exploiting the infected system’s resources. The malware strains are\ndistributed through adware or installed on vulnerable MS-SQL servers. Users should refrain\nfrom installing programs from unknown sources. If their systems are installed with database\nservers, they should manage access control policies and account credentials settings\nappropriately. Also, V3 should be updated to the latest version so that malware infection can\nbe prevented.\n\n**[File Detection]**\n\n– Dropper/Win.Proxyware.C5173477 (2022.07.18.03)\n\n– Dropper/Win.Proxyware.C5173478 (2022.07.18.02)\n\n– Dropper/Win.Proxyware.C5210584 (2022.07.18.02)\n\n– Unwanted/Win.Peer2Profit.R505332 (2022.07.18.02)\n\n– Unwanted/Win.Pawns.C5211846 (2022.07.21.01)\n\n– Unwanted/Win.Pawns.C5211847 (2022.07.21.01)\n\n**[IOC]**\n\n**MD5**\n\n**Dropper**\n\n– 05ed95d997662ee0ba15f76949955bf0\n\n– dd709b8529802d6489311a27372044aa\n\n– 29cbc8a8cdb0e24f3561fac8ac0c0174\n\n**Peer2Profit SDK**\n\n– b1781c2670a2e0a35a10fb312586beec\n\n– e34d9ec5d43501dc77ee93a4b464d51b\n\n**IPRoyal Pawns**\n\n– 7f8c85351394fd8221fc84d65b0d8c3e\n\n– 3e4bb392494551a89e090fbe1237f057\n\n**Subscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to**\n**check related IOC and detailed analysis information.**\n\n[Categories:Malware Information](https://asec.ahnlab.com/en/category/malware-information/)\n\n[Tagged as:Adware,](https://asec.ahnlab.com/en/tag/adware-en/) [IPRoyal,](https://asec.ahnlab.com/tag/iproyal/) [Peer2Profit,](https://asec.ahnlab.com/tag/peer2profit/) [proxy,](https://asec.ahnlab.com/en/tag/proxy-en/) [Proxyware](https://asec.ahnlab.com/tag/proxyware/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-28 - Attackers Profiting from Proxyware.pdf"
    ],
    "report_names": [
        "2022-07-28 - Attackers Profiting from Proxyware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535694,
    "ts_updated_at": 1743041151,
    "ts_creation_date": 1662027000,
    "ts_modification_date": 1662027000,
    "files": {
        "pdf": "https://archive.orkl.eu/02c61dcc584dc0ec0e1a765313d3c79cf8dcae1b.pdf",
        "text": "https://archive.orkl.eu/02c61dcc584dc0ec0e1a765313d3c79cf8dcae1b.txt",
        "img": "https://archive.orkl.eu/02c61dcc584dc0ec0e1a765313d3c79cf8dcae1b.jpg"
    }
}