{
    "id": "f72f9df4-88cb-482b-984f-a7b54745e79f",
    "created_at": "2023-01-12T15:05:50.659459Z",
    "updated_at": "2025-03-27T02:11:39.838672Z",
    "deleted_at": null,
    "sha1_hash": "28919c116fbbbe31cefba512c491655f40c3a38c",
    "title": "2020-03-30 - A New Look at Old Dragonfly Malware (Goodor)",
    "authors": "",
    "file_creation_date": "2022-05-28T17:33:46Z",
    "file_modification_date": "2022-05-28T17:33:46Z",
    "file_size": 1664087,
    "plain_text": "# A New Look at Old Dragonfly Malware (Goodor)\n\n**[norfolkinfosec.com/a-new-look-at-old-dragonfly-malware-goodor/](https://norfolkinfosec.com/a-new-look-at-old-dragonfly-malware-goodor/)**\n\nnorfolk March 30, 2020\n\nFrom time to time, new tools emerge that make it significantly easier to examine older\n[malware. In 2017, Symantec’s threat intelligence team published research regarding the](https://symantec-blogs.broadcom.com/blogs/threat-intelligence/dragonfly-energy-sector-cyber-attacks)\nDragonfly group, an adversary with an apparent interest in performing reconnaissance\nagainst energy sector companies. One of the reported malware families, “Backdoor.Goodor,”\nis written in Golang and the blog post states that it “provides the attackers with remote\naccess to the victim’s machine.”\n\nIn recent years, several free options have become available to help reverse engineer these\n[types of Golang binaries, replacing premium (but extremely well documented) methods and](https://rednaga.io/2016/09/21/reversing_go_binaries_like_a_pro/)\nmaking this type of analysis particularly more accessible.\n\nThis post walks through the reverse engineering of a Goodor file, examining its capabilities\nand discussing key principles of these types of files.\n\n**Key Concepts**\n\nThis blog notes that there are a few key concepts relevant to understanding Golang binaries:\n\n– When first disassembled, Golang binaries will have a nearly unreadable number of\nunlabeled functions\n\n– Golang binaries contain a section referred to as “gopclntab” that stores function\ninformation.\n\n– For Linux/Unix binaries, this is an actual named section. For Windows binaries, it is not.\n\n– This section has the same “magic bytes” in both types of binaries and follows a uniform\nstructure.\n\nIn particular, this blog recommends that those interested in a deeper understand of the\nsubject start by watching Joakim Kennedy’s [two](https://www.youtube.com/watch?v=KFitDf_XPYE) [presentations which provide significant](https://www.youtube.com/watch?v=Nq2fiw8LeIo)\ndetail regarding the structure of Golang binaries. Mr. Kennedy’s tool, [Redress, is a key part](https://github.com/goretk/redress)\nof current Golang reverse engineering and is used in this analysis.\n\nFinally, this analysis uses [Cutter, a GUI-based implementation of the Radare2 framework.](https://github.com/radareorg/cutter)\nWhen a Golang Linux binary is opened in Radare2 or Cutter, both tools automatically identify\nthe gopclntab section, parse function names from this section, and relabel the assembly as\nneeded. However, this blog noted that they did not behave this way for Windows binaries,\nwhere this section is not explicitly created. Redress provides a workaround for this issue.\n\n\n-----\n\nThis post relies on a Linux VM for Cutter, Radare2, and Redress, as the Windows version of\nCutter didn’t allow for the execution of Redress in the command line and the Windows\nversion of Radare2 functioned poorly with #!pipe commands. The debugging itself takes\nplace in a Windows VM.\n\n**Technical Analysis – Initial File**\n\nFile: ntdll_installer.exe\nMD5: f2edff3d0e5a909c8d05b04905642105\nSHA1: c8c8329449c18445330903dd6a59d0b4098d9670\nSHA256: 5a7ace894461c2432fe9b52254cbc5c3f5bbce0c91a416154511a554dba6f913\n\nThis blog revisits an older malware family with newer tools to obtain a better understanding\nof the file. One place to start is Symantec’s [original write-up, which stated:](https://web.archive.org/web/20190410115532/https://www.symantec.com/security-center/writeup/2017-071207-0015-99)\n\n1. “Backdoor.Goodor… opens a backdoor on the compromised computer”\n2. “When the Trojan is executed, it copies itself to the following location…”\n3. It “creates the following registry entry…”\n%AppData%\\NT\\ntdll.exe ddd-073d7bac5d624bb40adbb25f55eb693d\n\nThis blog notes that the current Google-indexed page for this malware leads to a Broadcom\npage that states, “You have arrived at this page either because you have been alerted by\nyour Symantec product about a risk, or you are concerned that your computer has been\naffected by a risk.” As neither statement is true, this blog has linked to the archived version\ninstead.\n\nAs this analysis will show, Symantec’s write-up is a close approximation that’s not quite\nforensically accurate. The “copied” file is actually a dropped embedded file, and the registry\nentry changes slightly from device to device.\n\n_Identify Function Names_\n\nThe first step for this analysis is to use the Redress tool with the -src switch to identify\nfunction names. When run against this file, the tool produces the following output:\n\nPackage main: C:\\Users\\User\\go\\src\\i\nFile: i_main.go\nmain Lines: 15 to 19 (4)\nTryDoMain Lines: 19 to 29 (10)\nTryDoMainfunc1 Lines: 20 to 24 (4)\nDoMain Lines: 29 to 61 (32)\nGetFn Lines: 61 to 76 (15)\nCreateBat Lines: 76 to 110 (34)\nStartA Lines: 110 to 113 (3)\n\n\n-----\n\nFile: r.go.template.impl.go\ninit Lines: 6 to 6 (0)\nPackage e: C:\\Users\\User\\go\\src\\e\nFile: e.go\nDecode Lines: 53 to 93 (40)\nDecodefunc1 Lines: 70 to 155 (85)\nFromB64 Lines: 93 to 121 (28)\nDecrypt Lines: 121 to 144 (23)\nHashStr Lines: 144 to 150 (6)\nRandomHashString Lines: 150 to 153 (3)\ninit Lines: 155 to 155 (0)\n\nThis output represents the author-added functions to a Golang binary. Golang binaries are\nlarge as they also incorporate dozens (or hundreds) of additional library functions, and so\nthis output separates the most important sections.\n\nThe output also provides some hints: we can postulate that the malware likely performs\nsome sort of Base64 decoding and decryption (FromB64, Decode, Decrypt) and may also\ncreate a .bat file (CreateBat). Notably, we don’t see anything indicative of command-andcontrol (C2) traffic.\n\n_Create a Function Map_\n\nWith the primary functions identified, we can map them out. Open the binary in Cutter with\nthe slider for analysis all the way to the left, indicating no analysis. Using #!pipe, run the\nRedress tool. Finally, run “aaaa” to perform analysis and go to View-> Refresh Contents.\n\n**#!pipe command used**\n\n**within the Cutter console to launch Redress. Note that some error messages were**\n**cropped for readability. These can be ignored.**\n\n\n-----\n\nWith the function names populated, we can begin mapping out a smaller call-tree. As with\nother disassemblers, we can select each function name in graph mode or use the crossreferencing features to identify function relationships. For example, DoMain makes several\nadditional calls in the following order:\n\n– Decode\n– GetFn\n– RandomHashString\n– StartA\n– CreateBat\n\nDecode, in turn, calls “FromB64” and “Decrypt.” Using this information, we can construct a\nsimple call map.\n\n**DoMain calling StartA**\n\n\n-----\n\n**Simplified function map. Calls are ordered from left-to-right and top-to-bottom.**\n\nThis particular sample only uses each of these functions one time, providing an easy-tounderstand workflow. This is of course not necessarily typical for all malware. The graph\nabove may also be too simple, as it omits several important native Golang calls that could\nprovide a broader understanding of some of these functions.\n\nConsider the GetFN function: within this function are calls such as “GetEnv,” “TempDir,” and\n“MkdirAll” that strongly suggest that a file and/or folder is being written to a specific path.\nWithout this information, one might have assumed “GetFN” was simply obtaining the name of\na file (or the file running). With that in mind, we can create a more complete graph, with\nboxes differentiating the native calls.\n\n\n-----\n\n**GetFN function**\n\n\n**with native calls**\n\n\n-----\n\n**Function call graph with native calls added in as rectangles.**\n\nWith these functions mapped out, we can hypothesize a workflow such as:\n\n1. The malware Base64 decodes and then decrypts something.\n\n2. The malware creates a filename and/or directory somewhere, possibly in the Temp\ndirectory.\n\n3. The malware writes something to the disk.\n\n4. The malware calls StartA, which executes something.\n\n5. The malware creates and runs a .bat file.\n\nIt’s time to begin debugging to test these hypotheses.\n\n_Debugging_\n\nI prefer the x96 suite for debugging. The most important thing to do before actually running\nthe debugger is to rename the key functions we’ve identified. These include the authoradded Golang functions plus any other interesting ones, such as those within the GetFN call.\nThere are a few options here; in this case, I opted to do this manually, but you can also use\nRadare/Cutter + Redress + the “aaaa” and “afl” commands to get an address-function pair\n[list (copying it to a file), and then create a comment or label script for x96dbg. For a larger](https://isc.sans.edu/diary/Enriching+Radare2+and+x64dbg+malware+analysis+with+statically+decoded+strings/24146)\nfile, that might be the most practical approach.\n\nThe first order of business is to examine the decoding hypothesis. The malware contains a\nlarge block of Base64-encoded data, visible in the strings via Process Hacker. As the string\nis several thousand characters long, it is easy to stop in a single memory section. After\nstepping over the Decode function (which in turn triggers the FromB64 and Decrypt calls),\nthis section will populate with the decoded and then decrypted data:\n\n\n-----\n\n**Decoding and Decrypting**\n\n**Executable decrypted in memory**\n\nNext, is the GetFN function call. Earlier, we hypothesized that this should create a file path or\ndirectory in the user’s Temp folder. Stepping through this function, we can see it creates a\ndirectory at AppData\\Roaming\\NT\\\n\n\n-----\n\n**Directory creation within GetFN function.**\n\nThe malware will also create a filename, ntdll.exe, and append it to this path. When the\nfunction exits, it uses the WriteFile call to write the decoded executable to this location. The\nStartA function then issues a system command to run this. For the purposes of this analysis,\nI copied the executable to the desktop and replaced it with a renamed FakeNet Mini\nexecutable to examine the CreateBat function.\n\nFrom a static perspective, CreateBat demonstrates a string load. The program identifies the\naddress and length (in this case, 25 characters) of a string containing a ping command. The\nrest of the function also performs a string replacement for a registry key value to be added.\nThe end result is a .bat file written to disk:\n\n**.bat file written to disk**\nThis file creates an HKCU runkey that will cause the dropped payload to execute any time\nthe user logs in. It will also silently delete the initial dropper and delete itself. Following the\nexecution of this batch file, the program terminates itself. At this point, we can look at the\ndropped payload.\n\n**Technical Analysis – Dropped Payload**\n\nThe dropped payload is a UPX-packed Windows executable.\n\nFilename: ntdll.exe\n\nMD5 (packed): 8943E71A8C73B5E343AA9D2E19002373\n\nMD5 (unpacked): ca818c14f69bef7695c0e2ff127e6d9b\n\nSHA1 (unpacked): 115d12e0fb73445a788ebe7bdf3cab552b3cb9af\n\nSHA256 (unpacked):\nb5278301da06450fe4442a25dda2d83d21485be63598642573f59c59e980ad46\n\n\n-----\n\nFollowing the same steps as above, we can identify the author-created functions.\n\nPackage e: C:\\Users\\User\\go\\src\\e\nFile: e.go\nDecode Lines: 53 to 93 (40)\nDecodefunc1 Lines: 70 to 155 (85)\nFromB64 Lines: 93 to 121 (28)\nDecrypt Lines: 121 to 144 (23)\nHashStr Lines: 144 to 150 (6)\nRandomHashString Lines: 150 to 153 (3)\ninit Lines: 155 to 155 (0)\nPackage main: C:\\Users\\User\\go\\src\\m\nFile: m_main.go\nmain Lines: 17 to 21 (4)\nTryDoMain Lines: 21 to 31 (10)\nTryDoMainfunc1 Lines: 22 to 44 (22)\nDoMain Lines: 31 to 43 (12)\nTryDoIter Lines: 43 to 57 (14)\nTryDoIterfunc1 Lines: 44 to 166 (122)\nDoIter Lines: 57 to 100 (43)\nGetU Lines: 100 to 117 (17)\nOnData Lines: 117 to 146 (29)\nExecute Lines: 146 to 151 (5)\nGetHttp Lines: 151 to 160 (9)\nCreateTempFileName Lines: 160 to 164 (4)\ninit Lines: 166 to 166 (0)\n\nA few things should stand out. First, the “e” package appears to be reused, alongside all of\nthe decoding and decryption functions. However, this is clearly not a “copy” of the initial\ndropper. The primary package has new functions, such as GetHttp, OnData,\nCreateTempFileName, and execute. Using the same strategy as before, we can map some\nkey functions out.\n\n**Function tree for dropped Goodor payload**\n\n\n-----\n\nAs with the previous graph, the code structure (for this particular example – again, most\nsamples are less linear) is such that we can read left-to-right and top-to-bottom. We might\nexpect that:\n\n1. The malware runs GetU. Perhaps this obtains the username (it does not, but that was my\ninitial guess).\n2. The malware establishes an HTTP connection.\n3. The malware checks to see if it gets a response, and if so, Base64 decodes and then\ndecrypts that response.\n4. The malware creates a filename for a target in the Temp directory.\n5. The malware writes the decoded data to this file.\n6. The malware executes this file.\n\nFor this example, I opted to use radare2 + redress, followed by piping the output of the “afl”\nfunction to a file. With some Notepad++ regex, I used the function addresses to make a\n[basic x96dbg script to re-label all of the addresses. See here for an example from another](https://isc.sans.edu/diary/Enriching+Radare2+and+x64dbg+malware+analysis+with+statically+decoded+strings/24146)\n[analyst (replacing cmt with lbl). I mainly did this for performance reasons, and to](https://help.x64dbg.com/en/latest/commands/user-database/labelset.html)\ndemonstrate an additional option readers.\n\n**Redress and dumping a function list**\n\n\n-----\n\n**Example of a labeling script for x96dbg**\nDebugging the malware, we can get through the GetU function before we start to run into\nsome obstacles that will hinder a full analysis. Recall that we hypothesized that GetU could\nreturn the username. It actually creates the string for the GET request sent to the C2 server:\n\n\n-----\n\n**C2 string building function**\n\nRight click and open in a new tab to zoom in a bit. The GetU function pulls one of five\nhardcoded C2 servers and appends an identifier string to it:\n\nhxxp: // 176.53.11[.]130/aspnet_client/system_web/4_0_30319/update/DefaultForm.txt\n\nhxxp: // 82.222.188[.]18/aspnet_client/system_web/4_0_30319/update/DefaultForm.txt\n\nhxxp: // 130.25.10[.]158/aspnet_client/system_web/4_0_30319/update/DefaultForm.aspx\n\nhxxp: // 41.205.61[.]221/aspnet_client/system_web/4_0_30319/update/DefaultForm.aspx\n\nhxxp: // 5.150.143[.]107/aspnet_client/system_web/4_0_30319/update/DefaultForm.aspx\n\nOne of these values, boxed in red above, remained consistent through different runs of the\n[malware. This value, 881456fc, also appears in VirusTotal runs of the malware in the](https://www.virustotal.com/gui/file/b5278301da06450fe4442a25dda2d83d21485be63598642573f59c59e980ad46/behavior/VirusTotal%20Cuckoofork)\nbehavior tab. If the file is run with a command line argument (as the runkey would cause),\nthis value is appended with that argument. If not, the value is appended with “no” instead.\nOne possibility is that this serves as a campaign ID and a device identifier.\n\nAt this stage, the analysis ran into some hurdles that could not be overcome. The malware\ndidn’t appear to call out to the C2 server during the GetHTTP call, limiting confirmation of the\nremainder of the suspected functionality. Still, we can make some pretty strong inferences\nfrom the final call of the workflow, OnData:\n\n\n-----\n\n**OnData workflow**\n\nThe workflow strongly suggests that something is Base64 decoded and decrypted, written to\ndisk at a generated location, and then executed. Symantec’s original report suggested that\nseveral other backdoors were deployed against victims. It is therefore possible that Goodor\nwas used to deliver a tool such as a screen grabber, the Karagany backdoor, or one of\nseveral other payloads.\n\n**Concluding Thoughts**\n\n\n-----\n\nA few simple contemporary tools make analyzing Golang malware significantly easier than it\nwas in the past, particularly for those lacking access to premium tools such as IdaPro.\nRadare2, Cutter, and Redress can combine to create a workflow where the user can rename\nGolang functions, navigate a graph, and debug malware significantly easier than in the past.\n\nDuring this research, I ran a retrohunt to try to identify additional samples that contained the\nsame encoding functions or matched other function names from the dropper and payload.\nUnfortunately, while I found other hashes, none were “new.” This may have been a one-time\nuse tool from the threat actor, or the function names may have been renamed in different\nversions.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-30 - A New Look at Old Dragonfly Malware (Goodor).pdf"
    ],
    "report_names": [
        "2020-03-30 - A New Look at Old Dragonfly Malware (Goodor).pdf"
    ],
    "threat_actors": [
        {
            "id": "6728f306-6259-4e7d-a4ea-59586d90a47d",
            "created_at": "2023-01-06T13:46:39.175292Z",
            "updated_at": "2025-03-27T02:00:03.013291Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "TEMP.Warlock",
                "UNC902"
            ],
            "source_name": "MISPGALAXY:FIN11",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1db21349-11d6-4e57-805c-fb1e23a8acab",
            "created_at": "2022-10-25T16:07:23.630365Z",
            "updated_at": "2025-03-27T02:02:09.897138Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "DEV-0950",
                "Lace Tempest",
                "Operation Cyclone"
            ],
            "source_name": "ETDA:FIN11",
            "tools": [
                "AZORult",
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "BLUESTEAL",
                "Cl0p",
                "EMASTEAL",
                "FLOWERPIPE",
                "FORKBEARD",
                "FRIENDSPEAK",
                "FlawedAmmyy",
                "GazGolder",
                "Get2",
                "GetandGo",
                "JESTBOT",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MINEDOOR",
                "MIXLABEL",
                "Meterpreter",
                "NAILGUN",
                "POPFLASH",
                "PuffStealer",
                "Rultazo",
                "SALTLICK",
                "SCRAPMINT",
                "SHORTBENCH",
                "SLOWROLL",
                "SPOONBEARD",
                "TiniMet",
                "TinyMet",
                "VIDAR",
                "Vidar Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535950,
    "ts_updated_at": 1743041499,
    "ts_creation_date": 1653759226,
    "ts_modification_date": 1653759226,
    "files": {
        "pdf": "https://archive.orkl.eu/28919c116fbbbe31cefba512c491655f40c3a38c.pdf",
        "text": "https://archive.orkl.eu/28919c116fbbbe31cefba512c491655f40c3a38c.txt",
        "img": "https://archive.orkl.eu/28919c116fbbbe31cefba512c491655f40c3a38c.jpg"
    }
}