{
    "id": "f73ac9f3-96cc-4928-b6ea-2fcf58b96ce6",
    "created_at": "2023-01-12T15:04:35.019293Z",
    "updated_at": "2025-03-27T02:05:40.18929Z",
    "deleted_at": null,
    "sha1_hash": "cd9e500bfc92c836aa89bfd4c00baba624fc9235",
    "title": "2017-03-17 - Diamond Fox – part 1- introduction and unpacking",
    "authors": "",
    "file_creation_date": "2022-05-28T04:56:23Z",
    "file_modification_date": "2022-05-28T04:56:23Z",
    "file_size": 687195,
    "plain_text": "# Diamond Fox – part 1: introduction and unpacking\n\n**[blog.malwarebytes.com/threat-analysis/2017/03/diamond-fox-p1/](https://blog.malwarebytes.com/threat-analysis/2017/03/diamond-fox-p1/)**\n\nMalwarebytes Labs March 17, 2017\n\nDiamond Fox (also known as Gorynch) is a stealer written in Visual Basic that has been\npresent on the black market for several years. Some time ago, builders of its older versions\n[(i.e. 4.2.0.650) were cracked and leaked online – thanks to this we could have a closer view](http://www.freetrojanbotnet.com/)\nat the full package that is being sold by the authors to other criminals.\n\nIn 2016 the malware was almost completely rewritten – its recent version, called “Crystal”\n[was described some months ago by Dr. Peter Stephenson from SC Media (read more).](https://www.scmagazine.com/inside-diamondfox/article/578478/)\n\nIn this short series of posts, we will take a deep dive in a sample of Diamond Fox delivered\n[by the Nebula Exploit Kit (described here). We will also make a brief comparison with the old,](http://malware-traffic-analysis.net/2017/03/02/index.html)\nleaked version, in order to show the evolution of this product.\n\nIn this first part, we will take a look at Diamond Fox’s behavior in the system, but the main\nfocus will be about unpacking the sample and turning it into a form that can be decompiled\nby a [Visual Basic Decompiler.](https://www.vb-decompiler.org/)\n\n## Analyzed samples\n\n Behavioral analysis\n\n\n-----\n\nAfter being deployed, Diamond Fox runs silently, however, we can notice some symptoms of\nits presence in the system. First of all, the UAC (User Account Control) gets disabled and we\ncan see an alert about it:\n\nAnother pop-up is asking the user to restart the system so that this change will take effect:\n\nThe initial executable is deleted and the malware re-runs itself from the copy installed in the\n%TEMP% folder. It drops two copies of itself – dwn.exe and spoolsv.exe. Viewing the\nprocess activity under Process Explorer, we can observe the spawned processes:\n\nIt also deploys wscript.exe.\n\n\n-----\n\nFor persistence, Diamond Fox creates a new folder with a special name (read more about\nthis feature): %TEMP%\\lpt8.{20D04FE0-3AEA-1069-A2D8-08002B30309D}.\n\nThanks to this trick, the user cannot access the files dropped inside. Another copy (backup)\nis dropped in the Startup folder.\n\nWhile running, the malware creates some files with .c extensions in %APPDATA% folder:\n\nAlso, new files are created in the folder from which the sample was run:\n\nThe file keys.c contains an HTML formatted log about the captured user activities, i.e.\nkeystrokes. Here’s an example of the report content (displayed as HTML):\n\n\n-----\n\nThe files log.c and Off.c are unreadable.\n\nExamining the content of the %TEMP% folder we can also find that the malware dropped\ndownloaded payload inside:\n\n\n-----\n\nIt is a XOR encrypted PE file (key in the analyzed case is: 0x2), that turns out to be an\nupdate of the main Diamond Fox bot.\n\n## Network communication\n\nDiamond Fox communicates with the CnC using an HTTP-based protocol. It beacons\nto gate.php\n\nData from the bot is sent to the CnC in form of a POST request. Pattern:\n```\n13e=<encoded content>\n\n```\n\n-----\n\nResponses from the CnC have the following pattern:\n```\n<number of bytes in content>\n<content>\n<error code>\n\n```\n\n-----\n\nWe can observe the bot downloading in chunks some encrypted content (probably the\npayload/bot update):\n\nIt also periodically uploads the stolen data. In the example below: sending the report about\nthe logged user activities (content of the previously mentioned file keys.c):\n\n\n-----\n\n## Unpacking\n\nDiamond Fox is distributed packed by various crypters, that require different approaches for\nunpacking. They are not specifically linked with this particular family of malware, that’s why\nthis part is not going to be described here. However, if you are interested in seeing the\ncomplete process of unpacking the analyzed sample you can follow the video:\n[https://www.youtube.com/watch?v=OBAVHiX-j_A.](https://www.youtube.com/watch?v=OBAVHiX-j_A)\n\nAfter defeating the first layer of protection, we can see a new PE file. It is wrapped in another\nprotective stub – this time typical for this version of Diamond Fox. The executable has three\nunnamed sections followed by a section named L!NK. The entry point of the program is\natypical – set at the point 0.\n\nIt makes loading the application under common debuggers a bit problematic. However, under\na disassembler (i e PE-bear) we can see where this Entry Point really leads to:\n\n\n-----\n\nThe header of the application is interpreted as code and executed. Following the jump leads\nto the real Entry Point, that is in the second section of the executable:\n\nI changed the the executable Entry Point and set it to the jump target (RVA 0xEDB0).\n\nSaved application could be loaded in typical debuggers (i.e. OllyDbg) without any issues, to\nfollow next part of unpacking.\n\nThe steps to perform at this level are just like in the case of manual unpacking of UPX. The\nexecution of the packer stub starts by pushing all registers on the stack (instruction\nPUSHAD). We need to find the point of execution where the registers are restored, because\nit is usually done when the unpacking of the core finished. For the purpose of finding it, after\nthe PUSHAD instruction is executed, we follow the address of the stack (pointed by ESP).\nWe set a hardware breakpoint on the access to the first DWORD.\n\n\n-----\n\nWe resume the execution. The application will stop on the hardware breakpoint just after the\nPOPAD was executed restoring the previous state of the registers.\n\nThis block of code ends with a jump to the unpacked content. We need to follow it in order to\nsee the real core of the application and be able to dump it. Following the jump leads to the\nEntry Point typical for Visual Basic applications. It is a good symptom because we know that\nthe core of Diamond Fox is a Visual Basic application.\n\nNow we can copy the address of the real Entry Point (in the analyzed case it is 0x4012D4)\nand dump the unpacked executable for further analysis.\n\nI will use Scylla Dumper. Not closing OllyDbg, I attached Scylla to the running process of\nDiamond Fox (named s_1.exe in my case).\n\n\n-----\n\nI set as the OEP (Original Entry Point) the found one, then I clicked IAT Autosearch and Get\n_Imports:_\n\nScylla found several imports in the unpacked executable:\n\n\n-----\n\nWe can view the eventual invalid and suspected imports and remove them – however, in this\ncase, it is not required. We can just dump the executable by pressing button Dump.\n\nThen, it is very important to recover the found import table by clicking Fix Dump and pointing\nto the dumped file. As a result, we should get an executable named by Scylla in the following\npattern: <original name>_dump_SCY.exe.\n\nNow, we got the unpacked file that we can load under the debugger again. But, most\n[importantly, we can decompile it by a Visual Basic Decompiler to see all the insights of the](https://www.vb-decompiler.org/)\ncode.\n\nExample of the decompiled code – part responsible for communication with the CnC (click to\nenlarge):\n\n\n-----\n\n## Conclusion\n\nUnpacking Diamond Fox is not difficult, provided we know a few tricks that are typical for this\nmalware family. Fortunately, the resulting code is no further obfuscated. The authors left\nsome open strings that make functionality of particular blocks of code easy to guess. In the\nnext post, we will have a walk through the decompiled code and see the features provided by\nthe latest version of Diamond Fox.\n\n_This was a guest post written by Hasherezade, an independent researcher and programmer_\n_with a strong interest in InfoSec. She loves going in details about malware and sharing threat_\n_[information with the community. Check her out on Twitter @hasherezade and her personal](https://twitter.com/hasherezade)_\n_[blog: https://hshrzd.wordpress.com.](https://hshrzd.wordpress.com/)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-03-17 - Diamond Fox – part 1- introduction and unpacking.pdf"
    ],
    "report_names": [
        "2017-03-17 - Diamond Fox – part 1- introduction and unpacking.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535875,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653713783,
    "ts_modification_date": 1653713783,
    "files": {
        "pdf": "https://archive.orkl.eu/cd9e500bfc92c836aa89bfd4c00baba624fc9235.pdf",
        "text": "https://archive.orkl.eu/cd9e500bfc92c836aa89bfd4c00baba624fc9235.txt",
        "img": "https://archive.orkl.eu/cd9e500bfc92c836aa89bfd4c00baba624fc9235.jpg"
    }
}