{
    "id": "f762e4bf-650d-4101-8f9a-2f62508a3a43",
    "created_at": "2023-01-12T15:01:32.609779Z",
    "updated_at": "2025-03-27T02:12:03.95977Z",
    "deleted_at": null,
    "sha1_hash": "c6f6ccd03f2c078b3f752adcc90ae45f644c898b",
    "title": "2021-03-04 - Falcon Complete Stops Microsoft Exchange Server Zero-Day Exploits",
    "authors": "",
    "file_creation_date": "2022-05-28T23:10:04Z",
    "file_modification_date": "2022-05-28T23:10:04Z",
    "file_size": 3182353,
    "plain_text": "# How Falcon Complete Stops Microsoft Exchange Server Exploits\n\n**[crowdstrike.com/blog/falcon-complete-stops-microsoft-exchange-server-zero-day-exploits](https://www.crowdstrike.com/blog/falcon-complete-stops-microsoft-exchange-server-zero-day-exploits)**\n\nFalcon Complete Team March 4, 2021\n\nThis week, [Microsoft reported a rare cybersecurity event: an ongoing mass exploitation of](https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/)\nMicrosoft Exchange servers by an alleged state-sponsored adversary, driven through a\nvariety of [zero-day exploits. This kind of attack — a previously unknown threat from a highly](https://www.crowdstrike.com/cybersecurity-101/zero-day-exploit/)\nsophisticated adversary — presents one of the most challenging situations a security team\nwill encounter.\n\nJust another routine day for the CrowdStrike Falcon Complete™ team.\n\n[In this blog, we describe how the Falcon Complete team acted as an extension of our](https://www.crowdstrike.com/endpoint-security-products/falcon-complete/)\ncustomers’ security teams to quickly detect and disrupt this sophisticated attack, which is still\nongoing at the time of this blog publication. Along the way, we’ll explore the critical role of\ncollaboration among and within security teams. Joining the Falcon Complete team is the\n[CrowdStrike Falcon OverWatch™ team of proactive threat hunters, who are imperative in](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)\nproviding early visibility into this new emerging threat, along with the CrowdStrike Intelligence\nteam. Together, our threat experts were able to seamlessly detect, understand and react to\nthis novel threat within minutes, ultimately stopping breaches.\n\n\n-----\n\n## Campaign Overview\n\nThis campaign is scanning and automatically exploiting multiple zero-day vulnerabilities\n(CVE-2021-26855, CVE-2021-26857, CVE-2021-26858 and CVE-2021-27065) to drop an\nASPX-based webshell onto vulnerable Microsoft Exchange servers. Where the webshell is\ndropped successfully, it is then being used in post-exploitation activity. This is seen to impact\nmultiple Exchange versions including 2013, 2016 and 2019. In nearly all instances, the\nwebshell dropped was observed to be a China Chopper-like webshell.\n\nIn the remainder of this report, you’ll get unique insight into the processes and operations of\na world-class security operations team dealing with a confounding threat. The Falcon\nComplete team provided a fast and effective response to the activity by quickly\nunderstanding the novel threat and potential (now confirmed) zero-day, identifying and\nisolating impacted systems, removing the associated webshells, and keeping impacted\ncustomers informed every step of the way.\n\n## The Initial Detection\n\nStarting Sunday, Feb. 28, the Falcon OverWatch team of threat hunters saw the first signs of\na novel intrusion. They observed instances of an unknown attacker gaining unauthorized\naccess to on-premises Microsoft Exchange application pools running on several hosts\nacross multiple customer environments, and immediately commenced notifying affected\norganizations. The Falcon Complete team began deep investigation into the nature of the\nthreat immediately.\n\n[The initial detection within the CrowdStrike Falcon® platform console showed a prevented](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)\nsuspicious command line that is consistent with behavior of common webshells. Further\n[analysis revealed that this webshell was consistent with variants related to a China Chopper-](https://www.crowdstrike.com/blog/an-end-to-smash-and-grab-more-targeted-approaches/)\nlike webshell, which has widespread prevalence due to its lightweight nature and low barrier\nof entry for threat actors.\n\n\n-----\n\nFigure 1. Detection of w3wp process\n\nFigure 1 above demonstrates how this infection chain appeared within the Falcon platform’s\nProcess Explorer. This process tree had two nodes of interest. First, OverWatch flagged the\n“W3WP.EXE” process as malicious due to an observed attempt to exploit the Exchange\napplication pool named “MSExchangeOWAAppPool.” Next, another command was executed\nthat was prevented automatically by the Falcon agent because it contained characteristics\noften associated with an adversary performing reconnaissance.\n\nThe exploited application pool can be identified by reviewing the Execution Details from\nwithin the associated detection. This is shown below in Figure 2, where the application pool\nis highlighted from the malicious command running under the previously identified\nW3WP.EXE process. This command is not obviously malicious on its own, so further triage\nwas conducted.\n\n\n-----\n\nFigure 2. CMD under w3wp.exe\n\nThe activity was confirmed to be malicious as additional context was analyzed within the\nExecution Details for the CMD process. This malicious activity is shown below in Figure 3.\nThe string patterns in this command, particularly those highlighted below, indicate that a\nwebshell attempted to delete the administrator account from the “Exchange Organization\nadministrators” group. It is unclear why they would execute this command, although it could\nsimply be an indication their intent was to deny legitimate admins the capability to thwart\ntheir actions. Either way, the destructive activity was ultimately blocked by the Falcon agent.\n\n\n-----\n\nFigure 3. Webshell command\n\nThe initial infection vector was still unknown at this point. Once we reviewed the detection\ninformation at hand and confirmed that the activity noted was malicious, the next step was to\nidentify the full scope of this activity.\n\n## Investigation With Endpoint Detection and Response Data\n\nThe Falcon agent provides a rich source of endpoint detection and response (EDR)\ntelemetry that provides critical insights into the behavior of each endpoint. Our Endpoint\nActivity Monitor (EAM) application gives the Falcon Complete team and Falcon platform\ncustomers the ability to search this execution data in real time, and to quickly investigate and\nscope the extent of compromise.\n\nFor our Falcon Complete customers, we leverage the power of EAM to find the webshell files\nwritten to disk, speeding response time and saving them effort.\n\nFigure 4. EAM Query to search for ASPX file writes\n\nA lucrative initial pivot point for investigating intrusions involving webshells is a search to\nidentify recent files written to disk with the “.ASPX” file extension. These files represent the\nwebshells the threat actor has uploaded to the compromised host. Here, the team leveraged\na simple command that searched for any “NewScriptWritten” events. Several files were\nidentified by this broad query, however, it was ultimately determined that only the file under\n\n\n-----\n\n\\inetpub\\wwwroot\\aspnet_client\\system_web directory was the malicious webshell. The\ntarget directories for these exploits vary. Additional paths observed are included in the IOC\nsection below.\n\nFalcon Complete has the capability to analyze these files via our Real Time Response tool in\na terminal window, or they can be downloaded for further offline analysis. Once identified, we\ncan drill down into these files for additional contextual information as shown in Figure 5\nbelow.\n\nThe other files that were observed here with similar write times are actually related to an\nExchange update and were benign.\n\n\n-----\n\nFigure 5. Additional EAM details\n\nOnce initial investigation was completed, Falcon Complete transitioned to containing and\nremediating the threat.\n\n## Eradicating the Threat\n\nWhen it comes to a highly sophisticated, never-before-seen, nation-state-backed attack,\nsometimes technology is not enough — that’s why our analysts are always at the ready at\nevery step of the kill chain. When the Falcon sensor detected the post-exploitation activity,\nFalcon Complete immediately began following our Critical Escalation Playbook to contact our\ncustomers. The impacted hosts were network contained, and we began calling our\ncustomers and following up with an email detailing the activity.\n\nPart of the Falcon Complete team’s initial recommended recovery actions was to patch this\nhost with the most recent available updates. To allow hosts to be patched, the hosts were\nreleased from containment after coordinating with various customers; however, as this threat\nactor leveraged multiple zero-day exploits, no patch was available to mitigate all the issues,\nand the server from the above example was subsequently re-exploited. Despite the\nremaining vulnerabilities, with no effective patch mitigations, Falcon Complete prevented and\ncontained this second attempt as well.\n\nIn this industry unexpected hurdles should be expected when responding to security events.\nOne such hurdle presented itself due to the Falcon Complete team’s ability to quickly and\nremotely network contain hosts in order to protect them from further activity and stop the\nactor in their tracks; in instances where a customer only had a single Exchange server\nnetwork containing a host would cut off the customer from their email communication. Using\nour Critical Escalation SOPs with pre-agreed customer out-of-band communication paths we\nwere quickly able to inform our customers of the events and continuously update them with\nfurther information and recommendations in a timely manner.\n\nUsing the Real Time Response capability of the Falcon agent, Falcon Complete connected\nto the impacted hosts to begin the collection and remediation of malicious artifacts.\n\nStarting with the directory `C:\\inetpub\\wwwroot\\aspnet_client\\system_web\\ location`\nknown from the “Change Directory” command in the initial detection, along with the matching\ndirectory from the NewScriptWritten EAM event, analysts began looking at files within that\ndirectory for potential webshells.\n\nAcross all of the hosts we found webshells with a naming pattern matching the regex string\nshown in Figure 6.\n\nFigure 6 Full file path with Regex string for webshell names\n\n\n-----\n\nThe contents of these files appeared to be Microsoft Exchange Server Offline Address Book\n(OAB) Configuration Files with a China Chopper shell in the External URL portion as seen\nbelow in Figure 7.\n\nFigure 7. Webshell Discovered on Hosts with China Chopper-like script highlighted in red\n\n\n-----\n\nAdditionally, at the same time as the exploitation activity was occurring, under the process\ntree for W3WP.EXE there were CSC.EXE (C# Command-Line Compiler) processes writing\nand compiling temporary DLLs on disk.\n\nFigure 8. Example of New Executable Write and Temporary DLL File Path regex (Click to enlarge)\n\nFalcon Complete pivoted to recover and remediate these DLLs. These DLL files are typically\nseen when ASP.NET compiles the .aspx file into assemblies. This compilation happens when\nthe .aspx file is first accessed in which ASP.NET copies the result assemblies to this\ntemporary directory.\n\nFigure 9. Example of __BuildControlTree() function. Assembly generated by ASP.NET runtime (Click to\n\nenlarge)\n\nFigure 10. Example of PageLoad() function. Assembly generated by ASP.NET runtime (Click to enlarge)\n\n\n-----\n\nIn one case which deviated from the general China Chopper-like Shell theme, the Falcon\nComplete team identified a shell which instead was designed to act as a file uploader and\nwrite a given file to disk. This aptly followed the naming convention “MultiUp.aspx.”\n\nFigure 11. Assembly variation observed (Click to enlarge)\n\nFigure 12. Non-Chopper Like Shell\n\nFalcon Complete proceeded to continue to locate and remediate any webshells found and\ntheir associated build DLL files.\n\n## Understanding the Root Cause\n\nWhenever responding to activity like this, the Falcon Complete team puts an emphasis on\nunderstanding what has been detected, and how the activity can be contained and\nremediated to ensure our customers remain protected. In addition to understanding this\ncritical data, being able to also understand the root cause of exploitation is extremely\nvaluable as it helps to more clearly identify how exploitation occurred in the first place, and\nimplement additional safeguards to prevent further exploitation in the future.\n\nOnce the threat had been neutralized, our team was able to pivot efforts to pull data from the\nhost itself in order to ascertain additional information and conduct root cause analysis. This\nanalysis included but was not limited to, analysis of IIS log files, ECP log files, and Event\nlogs from the host.\n\n\n-----\n\nWhen investigating any web exploitation, parsing through the web logs is a valuable source\nof information. Falcon Complete immediately began pulling the IIS logs from the impacted\nhosts to search for artifacts in an attempt to confirm the initial entry vector. As discussed in\nthe 2021 CrowdStrike Global Threat Report, CVE-2020-0688 impacting Microsoft Exchange\nServers was among the exploits most commonly observed by CrowdStrike during 2020.\n\nNaturally, Falcon Complete began by searching for evidence of exploitation via CVE-20200688 and quickly realized that there was no forensic evidence that vulnerability was\nexploited. Additionally, Falcon Complete double-checked the patch levels of the hosts and\nnoticed that some of the hosts that were compromised appeared to be up to date on\nMicrosoft’s released Exchange patches.\n\nFalcon Complete then began investigating other potential vulnerabilities including the\nrecently released and patched Microsoft Exchange Server Server Spoofing vulnerability\nCVE-2021-24085 (which can be leveraged to escalate privileges). Notably, the PoC code for\nthis vulnerability was publicly released on Feb. 15.\n\nSearching through IIS logs for artifacts related to CVE-2021-24085 yielded a few interesting\nresults, specifically POSTs to the DDIService.svc.\n\nFigure 13. Posts to DDIService.svc\n\nHowever, these POSTs observed in the logs did not appear to be exploitation of CVE-202124085, and specifically we did not see additional evidence pointing to the CSRF Token\ngeneration (and subsequent privilege escalation) portion of CVE-2021-24085.\n\nWe were now armed with two facts: first, the webshells remediated from the hosts appeared\nto be Microsoft Exchange Server Offline Address Book (OAB) config files with a China\nChopper-like shell in the External URL portion; second, POSTs to\n\n`DDIService.svc/SetObject` that set the `OABVirtualDirectory` did not match any\nknown vulnerabilities to Microsoft Exchange that CrowdStrike was aware of. We began to\nsuspect potential zero-day exploitation and immediately notified the CrowdStrike Intelligence\nteam for collaboration.\n\n\n-----\n\nLooking around the timestamps that these files were written, Falcon Complete uncovered a\npattern of behavior in multiple customers IIS logs, thus indicating that this log pattern likely\nhas to do with the exploitation activity.\n\nPOSTing to a single letter JavaScript file is unusual behavior that stands out when doing IIS\nLog Analysis. The POST appears to be a central part of the exploit chain in being able to\nwrite the webshells to the hosts. Of note, Falcon Complete was unable to collect a copy of\ny.js from any of this activity to confirm the file’s purpose.\n\n\n-----\n\nFigure 14. Log Pattern corresponding to the timestamps of the DLL and Webshell File Writes\n\nAdditionally within the IIS logs were the artifacts showing the actors POST Requests to the\nwritten webshells. These POSTs corresponded to the command execution seen in the initial\ndetections for the activity.\n\n\n-----\n\nFigure 15. Posts to webshells\n\nAt this point we knew that the exploitation activity somehow has to do with updating the\n\n`OABVirtualDirectory ExternalURL` field to include a China Chopper-like webshell, and\nin hindsight involved the PowerShell commandlet “Set-OabVirtualDirectory.”\n\nWe proceeded to collect memory dumps of the W3WP (IIS) processes in an attempt to\nrecover the y.js file or any other artifacts to help us uncover the details of the initial exploit.\nWorking closely with the OverWatch team, the below artifact was extracted from gathered\nmemory dumps.\n\nFigure 16. Data from W3WP Memory Dump\n\nUpon decoding this we were left with evidence of the initial command being passed to a\ndropped webshell.\n\n\n-----\n\nFigure 17. Decoded Data from W3WP Memory Dump\n\nWhile continuing to actively respond and remediate, we proceeded to analyze additional logs\nfrom the Exchange server to further understand what we were observing.\n\nDuring our timelining process we reviewed the Application Event Logs and we were able to\nidentify further log sources to pivot to that helped build a bigger picture of the exploitation:\n\n**Event ID 47 MSExchange Control Panel: Administrator SID being used indicating privilege**\nescalation has occurred\n\n**Event ID 4007 MSComplianceAudit: This entry pointed to an Exchange audit log contained**\nwith the following filepath:\n\n“%PROGRAMFILES%\\Microsoft\\Exchange Server\\V15\\Logging\\LocalQueue\\Exchange\\”\n\nTriaging that audit log provided us further insight into the exploitation process, specifically the\ndropping of webshells by an Administrator account using Set-OabVirtualDirectory to modify\nthe External URL field with the “Chopper” Shell script. It is interesting to note that this log\nalso shows the actor cleaning up after themselves, using the Remove-OabVirtualDirectory\ncommand followed by a further Set-OabVirtualDirectory to return the configuration back to its\noriginal state — likely an attempt to avoid detection by anyone reviewing the Exchange\nconfiguration.\n\n\n-----\n\nSimilar activity can be seen in MSExchange Management event logs if you have access to\nthese.\n\nNext, we pivoted to analysis of the ECP server logs. We identified this log as an item of\ninterest because of the observation within the IIS log of POST requests to URIs that\ncontained strings similar to “/ecp/y.js”. This indicated an attempt to bypass authentication and\nremotely execute code.\n\nThe ECP server logs in figure 18 revealed a Chopper-like webshell embedded within the\nExternal URL portion that leveraged the Set-OabVirtualDirectory cmdlet to modify the offline\naddress book (OAB) virtual directories.\n\nFigure 18. ECP Server Log\n\nThe ECP Activity logs in figure 19 shows the request of the SetObject command for the\n\n`OABVirtualDirectory` pointing to the /ecp/y.js.\n\nFigure 19. ECP Activity Log\n\nCorrelating the ECP server log timestamps with the IIS logs, we noticed multiple HTTP\nPOST requests originating from a virtual private server (VPS) address that we now know\nresembles remote code execution likely chaining together CVE-2021-26858 and CVE-202127065.\n\nFigure 20. IIS Log\n\n[At this point in our investigation is when Microsoft reported the four zero-days in Exchange](https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/)\nand we were able to correlate the activity observed by Falcon Complete as the now-reported\nzero-days and provide recommendations to our customers on how to patch to prevent further\nre-exploitation.\n\n\n-----\n\n## Mitigation Measures\n\nIn order to safeguard against this ongoing threat, CrowdStrike recommends organizations\nimplement the following measures:\n\n**Restrict Access. The initial exploitation method as mentioned by Microsoft involves**\n“the ability to make an untrusted connection to Exchange server port 443.” Because of\nthis, CrowdStrike recommends that web access to the Exchange Server be restricted\nto only trusted, internal IPs at a minimum where a patch cannot be applied in a timely\nmanner, or that this be placed behind a VPN which can only be accessed by\nauthenticated clients.\n**Patch Exchange Systems. As an immediate response CrowdStrike recommends that**\n[patches contained within KB5000871, which addresses the vulnerabilities exploited in](https://support.microsoft.com/en-us/topic/description-of-the-security-update-for-microsoft-exchange-server-2019-2016-and-2013-march-2-2021-kb5000871-9800a6bb-0a21-4ee7-b9da-fa85b3e1d23b)\nthis campaign, be installed on all Exchange Servers. More information on associated\n[patches can be found from in the following Microsoft Exchange Team Article.](https://techcommunity.microsoft.com/t5/exchange-team-blog/released-march-2021-exchange-server-security-updates/ba-p/2175901)\n**Block Associated Malicious IPs. The associated activity in these campaigns has thus**\nfar only been seen exploiting a limited number of IP addresses. By blocking these at\nyour firewall, attempts to exploit vulnerable systems will be denied so long as the\nactors who have these exploits continue to originate from the same IP.\n**Proactively Hunt for Webshells. Indicators have been included throughout this blog**\nto help locate webshells which may have been dropped by an adversary in this\ncampaign. Investigating newly created or modified ASPX files located within Exchange\nor web-server directories that are publicly facing is a good starting point in identifying\npossible webshells. By leveraging a remote response capability such as CrowdStrike’s\nReal-Time-Response (RTR), and reviewing available logs, such as that available with\nCrowdStrike’s Endpoint Activity Monitor (EAM), administrators and security\nprofessionals can investigate their Exchange instances for any indications of this\nactivity.\n\n## Conclusion\n\nWe continue to work in close collaboration with our customers to respond swiftly to detect\nand disrupt this activity in order to stop these intrusion attempts from becoming breaches.\nCrowdStrike leverages a variety of analysis tools and techniques to further understand the\nthreat and better enable us to protect our customers, allowing them to focus on continuing\ntheir business without interruption. With every encounter we learn, we hone our process, and\nwe improve protection for the global CrowdStrike community.\n\nEven during an ongoing mass exploitation campaign encompassing four zero-day exploits\nagainst Microsoft Exchange, Falcon Complete is always at the ready to respond to these\nthreats 24/7/365 and deliver on the CrowdStrike promise: We Stop Breaches.\n\n### Indicators of Compromise\n\n\n-----\n\n**IP Address:**\n\n```\n104.248.49[.]97\n\n```\n```\n161.35.1[.]207\n\n```\n```\n161.35.1[.]225\n\n```\n```\n157.230.221[.]198\n\n```\n```\n165.232.154[.]116\n\n```\n```\n167.99.239[.]29\n\n```\n\n**User Agents**\n```\nMozilla/5.0+(Windows+NT+10.0;+WOW64)+AppleWebKit/537.36+\n(KHTML,+like+Gecko)+Chrome/74.0.3729.169+Safari/537.36\n\n```\n```\npython-requests/2.24.0\n\n```\n```\nExchangeServicesClient/0.0.0.0\n\n```\n\n**Webshell Indicator Paths**\n\n```\n\\[IIS Install Path]\\aspnet_client\\\n\n```\n```\n\\[IIS Install Path]\\aspnet_client\\system_web\\\n\n```\n```\n\\[Exchange Install Path]\\FrontEnd\\HttpProxy\\owa\\auth\\\n\n```\n\n**Webshell Names**\n\n```\n[0-9a-zA-Z]{8}.aspx\n\n```\n```\nerror.aspx\n\n```\n```\nLogout.aspx\n\n```\n```\nOutlookJP.aspx\n\n```\n```\nMultiUp.aspx\n\n```\n```\nShell.aspx\n\n```\n```\nRedirSuiteServerProxy.aspx\n\n```\n```\nOutlookRU.aspx\n\n```\n```\nOnline.aspx\n\n```\n\n-----\n\n```\nDiscover.aspx\n\n```\n```\nOutlookEN.aspx\n\n```\n```\nHttpProxy.aspx\n\n```\n\n**Temporary DLL Write Locations Indicators**\n```\nC:\\Windows\\Microsoft.NET\\Framework64\\*\\Temporary ASP.NET\nFiles\\root\\*\\*\\App_Web_[0-9a-z]{8}.dll\n\n```\n**Additional Resources**\n\n_[Learn more by visiting the Falcon Complete product webpage.](https://www.crowdstrike.com/endpoint-security-products/falcon-complete/)_\n_Read a white paper: CrowdStrike Falcon Complete: Instant Cybersecurity Maturity for_\n_Organizations of All Sizes. \\_\n_Test CrowdStrike next-gen AV for yourself:_ _[Start your free trial of Falcon Prevent™.](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_[Learn more by reading the IR data sheet: CrowdStrike Incident Response Services.](https://www.crowdstrike.com/resources/data-sheets/incident-response/)_\n_[Learn more about CrowdStrike Services offerings by visiting our website.](https://www.crowdstrike.com/services/)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-04 - Falcon Complete Stops Microsoft Exchange Server Zero-Day Exploits.pdf"
    ],
    "report_names": [
        "2021-03-04 - Falcon Complete Stops Microsoft Exchange Server Zero-Day Exploits.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535692,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653779404,
    "ts_modification_date": 1653779404,
    "files": {
        "pdf": "https://archive.orkl.eu/c6f6ccd03f2c078b3f752adcc90ae45f644c898b.pdf",
        "text": "https://archive.orkl.eu/c6f6ccd03f2c078b3f752adcc90ae45f644c898b.txt",
        "img": "https://archive.orkl.eu/c6f6ccd03f2c078b3f752adcc90ae45f644c898b.jpg"
    }
}