{
    "id": "f78385f0-ae43-45fa-b613-ca600ccb8478",
    "created_at": "2023-01-12T15:03:33.662118Z",
    "updated_at": "2025-03-27T02:06:11.591706Z",
    "deleted_at": null,
    "sha1_hash": "d183464a620fc0d8676fc0285d3ceea02a3db702",
    "title": "2020-08-06 - Water Nue Phishing Campaign Targets C-Suite’s Office 365 Accounts",
    "authors": "",
    "file_creation_date": "2022-05-27T22:34:35Z",
    "file_modification_date": "2022-05-27T22:34:35Z",
    "file_size": 118944,
    "plain_text": "# Water Nue Phishing Targets Execs’ Office 365 Accounts\n\n**[blog.trendmicro.com/trendlabs-security-intelligence/water-nue-campaign-targets-c-suites-office-365-accounts/](https://blog.trendmicro.com/trendlabs-security-intelligence/water-nue-campaign-targets-c-suites-office-365-accounts/)**\n\nAugust 6, 2020\n\nCloud\n\nA series of ongoing BEC campaigns that uses spear-phishing schemes on Office 365\naccounts has been seen targeting senior positions of over 1,000 companies across US and\nCanada since March 2020.\n\nBy: Marshall Chen, Loseway Lu, Yorkbing Yap, Fyodor Yarochkin August 06, 2020 Read\ntime: ( words)\n\nContent added to Folio\n\n[A series of ongoing business email compromise (BEC) campaigns that uses spear-phishing](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/business-email-compromise-bec-schemes)\nschemes on Office 365 accounts has been seen targeting business executives of over 1,000\ncompanies across the world since March 2020. The recent campaigns target senior positions\nin the United States and Canada.\n\nThe fraudsters, whom we named “Water Nue,” primarily target accounts of financial\nexecutives to obtain credentials for further financial fraud. The phishing emails redirect users\nto fake Office 365 login pages. Once the credentials are obtained and accounts are\n\n\n-----\n\nsuccessfully compromised, emails containing invoice documents with tampered banking\ninformation are sent to subordinates in an attempt to siphon money through fund transfer\nrequests.\n\n## Tracking Water Nue’s activities\n\nThe threat actor behind this campaign is interesting for several reasons. It appears that their\ntechnical capabilities are limited despite being able to successfully target high-level\nemployees globally. While their phishing tools are basic (i.e., no backdoors, trojans, and\nother malware), they made use of public cloud services to conduct their operations. The use\nof cloud services allowed them to obfuscate their operations by hosting infrastructures in the\nservices themselves, making their activities tougher to spot for forensics. This tactic has\nbecome more commonplace among cybercriminals.\n\nWe first noticed the campaign from a large group of email domains used in phishing\nattempts. We found that most of the recipients hold high corporate positions, particularly in\nthe finance department. In one of the first cases we encountered, the senior financial officer\nof a bank located in Africa purportedly sent a PDF invoice to a colleague, specifying a bank\naccount in Hong Kong. The email was sent from an IP address recorded on one of the\nphishing sites that the attacker tested its functionality on.\n\nThe campaign is ongoing, with the threat actor switching to new infrastructures when used\ndomain names get reported or blacklisted in systems.\n\n## Water Nue Campaign Analysis\n\nThe attackers use cloud-based email distribution services like SendGrid to deliver emails\nwith a clickable link that redirects targets to a fake Office 365 page. (We have reached out to\nSendGrid and shared our findings with them.) When the target user attempts to log in,\ncredentials are recorded through a simple PHP script.\n\nWater Nue attack scenario Figure 1. Water Nue attack scenario\nSample of recorded credentials Figure 2. Sample of recorded credentials\nWhile the techniques aren’t new, the attack attempts appear to be successful, collecting over\n800 credentials from company executives at the time of writing.\n\n**How accounts are targeted for phishing attacks**\n\nIn a July email sent to a C-level executive, we learned that the base domain URL is\nU10450540[.]ct[.]sendgrid[.]net, with the final URL being *getting-panes[.]sfo2*.\n\nEmail header “from” field shows New York and various email accounts indicating\n“Swiftme@{company domain names}”\nFigure 3. Email header “from” field shows New York and various email accounts indicating\n“Swiftme@{company domain names}”\n\n\n-----\n\nSwiftme appears in the phishing email headers and is accompanied by account names with\nforged company email domains. The displayed email header “from” and subject also pretend\nas a voicemail service. “Swiftme” is possibly a nod to electronic or wire transfers and reveals\nthe campaign’s purpose after harvesting credentials.\n\nEmail sample Figure 4. Email sample\nIt should be noted that the SendGrid platform does not appear to attach the X-Mailers\noriginally. Emails with different X-Mailers and headers are likely appended through tools that\ncan confuse scan engines. Here are some of the X-Mailers we observed:\n\n**X-Mailer: Mozilla/5.0 (Windows; U; Win98; de-AT; rv**\n\n**X-Mailer: Claws Mail 3.7.6 (GTK+ 2.22.0; x86_64-pc-linux-gnu)**\n\n**X-Mailer: Mozilla 4.7 [en]C-CCK-MCD NSCPCD47 (Win98; I)**\n\n**X-Mailer: iPhone Mail (8A293)**\n\n**X-Mailer: Opera7.22/Win32 M2 build 3221**\n\n**X-Mailer: ZuckMail [version 1.00]**\n\n**X-Mailer: CommuniGate Pro WebUser v5.3.2**\n\nA phishing site imitates Office 365 login Figure 5. A phishing site imitates Office 365 login\nThe originating IP of Water Nue’s test/deployment machine was left in a clear text file in the\nphishing site’s server for collected credentials.\n\nSitemap Figure 6. Sitemap\nThe landing page index.html has a dummy speech functio Figure 7. The landing page\nindex.html has a dummy speech functio\n\nWhile the main collection function resides in app.js, command and control (C&C) location\nis embedded in JavaScript code\nFigure 8. While the main collection function resides in app.js, command and control (C&C)\nlocation is embedded in JavaScript code\n\njQuery method is used to post the target’s credentials to hosting site Figure 9. jQuery\nmethod is used to post the target’s credentials to hosting site\nThe phishing pages record passwords inputted by site visitors. Once the compromised\ncredentials are used to successfully log in to accounts, fraudsters can identify themselves as\nexecutives. They will then send a fraudulent wire transfer request to trick recipients into\nwiring money into the criminals’ accounts.\n\nWe found a BEC mail sample that was sent from the same IP. The email in question is an\ninvoice request that has a legitimate email header, which is a known tactic used in BEC\nscams.\n\nAn email sample with the same originating IP Figure 10. An email sample with the same\noriginating IP\n\nA sample fake PDF invoice in a BEC email Figure 11. A sample fake PDF invoice in a BEC\nemail\n\n\n-----\n\n## How to defend against BEC and other phishing scams\n\n[Unlike other cybercriminal schemes, phishing and](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/best-practices-identifying-and-mitigating-phishing-attacks) [BEC scams can be tricky to detect as they](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/how-to-spot-business-email-scam)\nare targeted toward specific recipients. Attackers seek to compromise email accounts to gain\naccess to financial and other sensitive information related to business operations.\n\nHere are some tips on how to stay protected from email scams:\n\n**Educate and train employees. Deflect company intrusions through InfoSec education.**\nAll staff — from the CEO to rank-and-file employees — must learn about the different\nkinds of scams and what to do in case of any encounters (i.e., double-check with\nothers and verify email details).\n**Confirm requests using other channels. Exercise caution by following a verification**\nsystem (e.g., multiple signoffs or additional verification protocols) among employees\nthat work with sensitive information.\n**Scrutinize all emails. Be wary of irregular emails with suspicious content such as**\ndubious sender email, domain name, writing style, and urgent requests.\n\nIn the case discussed here, the attacker email itself does not include the typical malware\npayload of malicious attachments. As a result, traditional security solutions won’t be able to\nprotect accounts and systems from such attacks. Users can also turn on mail inspection for\nsender “sendgrid[.]net” in the email gateway.\n\nTrend Micro protects both small- to medium-sized businesses and enterprises against\nphishing- and BEC-related emails. Using enhanced machine learning combined with expert\nrules, [Trend Micro™ Email Security solution analyzes both the header and the content of an](https://blog.trendmicro.com/en_us/business/products/user-protection/sps/email-and-collaboration/email-security.html)\nemail to stop BEC and other email threats. For source verification and authentication, it uses\nSender Policy Framework (SPF), DomainKeys Identified Mail (DKIM), and Domain-Based\nMessage Authentication, Reporting and Conformance (DMARC).\n\nThe [Trend Micro™ Cloud App Security solution enhances the security of Microsoft Office 365](https://blog.trendmicro.com/en_us/business/products/user-protection/sps/email-and-collaboration/cloud-app-security.html)\nand other cloud services through sandbox malware analysis for BEC and other advanced\nthreats. It uses Writing Style DNA to detect BEC impersonations and computer vision to find\ncredential-stealing phishing sites. It also protects cloud file sharing from threats and data loss\nby controlling sensitive data usage.\n\n**Indicators of compromise (IOCs)**\n\nThreat actor-managed C&C URLs:\n\nhttps://highstreetmuch[.]xyz/hug/gate[.]php\nhttps://takeusall[.]online/benzz/gate[.]PHP\n\n**MITRE ATT&CK® Matrix**\n\nWater Nue MITRE ATT&CK Mapping\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-06 - Water Nue Phishing Campaign Targets C-Suite’s Office 365 Accounts.pdf"
    ],
    "report_names": [
        "2020-08-06 - Water Nue Phishing Campaign Targets C-Suite’s Office 365 Accounts.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535813,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653690875,
    "ts_modification_date": 1653690875,
    "files": {
        "pdf": "https://archive.orkl.eu/d183464a620fc0d8676fc0285d3ceea02a3db702.pdf",
        "text": "https://archive.orkl.eu/d183464a620fc0d8676fc0285d3ceea02a3db702.txt",
        "img": "https://archive.orkl.eu/d183464a620fc0d8676fc0285d3ceea02a3db702.jpg"
    }
}