{
    "id": "f793810b-25d8-4e58-9258-534ace4a24d6",
    "created_at": "2022-10-25T16:48:11.674954Z",
    "updated_at": "2025-03-27T02:15:17.311049Z",
    "deleted_at": null,
    "sha1_hash": "e4c9189b12b624d00aebddce020dc21235824382",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-06-16T04:25:22Z",
    "file_modification_date": "2020-06-16T04:25:22Z",
    "file_size": 1091867,
    "plain_text": "# India: Human Rights Defenders Targeted by a Coordinated Spyware Operation\n\n**amnesty.org/en/latest/research/2020/06/india-human-rights-defenders-targeted-by-a-coordinated-spyware-**\noperation\n\n#### Nine human rights defenders, most of whom have been fighting for the release of the Bhima Koregaon 11 through litigation, research, or activism, were unlawfully targeted with a spyware attack\n\n[This blog post is jointly written by Amnesty International and Citizen Lab. Citizen Lab is](https://citizenlab.ca/)\nan interdisciplinary laboratory based at the Munk School of Global Affairs & Public Policy\nat the University of Toronto.\n\n# Summary\n\nAmnesty International and the Citizen Lab have uncovered a coordinated spyware\ncampaign targeting at least nine human rights defenders (HRDs) in India. Eight of\nthe nine HRDs have been calling for the release of other prominent activists,\npopularly known as the Bhima Koregaon 11, most of whom have been imprisoned in\nMaharashtra, India since 2018.\n\nBetween January and October 2019, the HRDs were targeted with emails containing\nmalicious links. If these links were clicked, a form of commercially-manufactured\nWindows spyware would have been deployed, compromising the target’s Windows\ncomputers, in order to monitor their actions and communications. This is a\nviolation of their rights to freedom of expression and privacy.\n\nAt least three of the nine HRDs were also targeted with NSO Group’s Pegasus\nspyware in 2019.\n\n# Introduction\n\nAmnesty International and the Citizen Lab have uncovered a coordinated spyware\ncampaign targeting at least nine human rights defenders (HRDs) in India. These targets\ninclude activists, lawyers, academics, and journalists.\n\nBetween January and October 2019, each of the targets were sent spearphishing emails\ncontaining malicious links that, if opened, would have installed NetWire, a commercially\navailable spyware. A spearphishing attack is a targeted attempt to install a spyware (a\nmalicious software) on the victim’s computer or smartphone. Spearphishing is generally\nperformed by sending very carefully crafted and personalized emails to the target, often\nimpersonating colleagues or loved ones.\n\n\n-----\n\n[While NetWire is known to be used in cybercrime and corporate espionage, Amnesty](https://www.fortinet.com/blog/threat-research/new-netwire-rat-variant-spread-by-phishing)\nInternational and the Citizen Lab believe that in this case it was used to target the HRDs\nbecause of their human rights work.\n\nSurveillance of people based solely on their human rights work amounts to an arbitrary\nand unlawful attack on their privacy and violates their right to freedom of expression and\nother rights that are enshrined in the International Covenant on Civil and Political Rights,\nto which India is a state party.\n\n# Context\n\nThe targeted HRDs have been openly speaking out about human rights violations in the\ncountry. Recently, eight called for the release of 11 prominent activists arrested two years\nago in relation to the protests and violence at Bhima Koregaon in Maharashtra, a state in\nsouth-west India. One of the targets is not directly linked to this case, but has been vocal\nin calling for the release of GN Saibaba, a disabled academic jailed in Maharashtra.\n\n**The Bhima Koregaon Case**\n\nOn 31 December 2017, activists organized a public event in Bhima Koregaon, Maha[rashtra. The following day, violence erupted between Dalits and Hindu nationalists. Po-](https://www.indiatoday.in/india/story/what-happened-at-bhima-koregaon-1326175-2018-08-29)\nlice claim that activists at the event allegedly instigated the violence through inflammatory speeches.The police allegedly found evidence of other criminal activities as well. In\n2018, the Maharashtra Police arrested nine activists including Sudha Bharadwaj,\nShoma Sen, Surendra Gadling, Mahesh Raut, Arun Ferreira, Sudhir Dhawale, Rona\nWilson, Vernon Gonsalves and Varavara Rao. The subsequent charge sheets filed by the\npolice accuse the HRDs of terror-related activities. In February 2020, the National Investigation Agency (NIA) took over the case from the Maharashtra police after the newly-elected Maharashtra Government raised doubts about the police investigation and\nsignalled a probe against the officials. In March 2020, the Supreme Court of India denied anticipatory bail applications of two other activists, Gautam Navlakha and Anand\nTeltumbde, who were also charged in the same case. They were both arrested on 14\nApril 2020. The case relies almost entirely on digital evidence obtained from the arrested activists’ devices. In a breach of due process, some materials found on their devices\n[were also released to the media in an effort to smear the activists.](https://www.firstpost.com/india/bhima-koregaon-arrests-police-releases-letters-linked-to-activists-claims-evidence-proves-maoist-connection-5089971.html)\n\nThe arrest of the eleven HRDs is an egregious example of how Indian authorities are\nclamping down on dissent and activism. These activists have been charged under various\npenal provisions and the draconian Unlawful Activities (Prevention) Act (UAPA), an antiterror law that violates several international human rights standards and circumvents fair\ntrial guarantees. It is also routinely used to intimidate HRDs, journalists, activists and\nstudents through arbitrary arrests and prolonged detention. These 11 activists are\ncurrently imprisoned and rights groups, including Amnesty International India, have\n[demanded their release.](https://amnesty.org.in/take-action/urgent-demand-the-release-of-the-bhima-koregaon-9-now/)\n\n\n-----\n\nThe attempts at unlawful surveillance outlined in this blog are not the first time that\nactivists and HRDs have been targeted with malware in India. In October 2019,\n[Facebook’s WhatsApp revealed that NSO Group, a surveillance tool vendor, had exploited](https://www.washingtonpost.com/context/read-the-whatsapp-complaint-against-nso-group/abc0fb24-8090-447f-8493-1e05b2fc1156/)\na zero-day vulnerability on their platform to target 1400 individuals earlier in the year. A\nzero-day vulnerability is a security flaw in software which is unknown to the vendor or\n[developer. In collaboration with Citizen Lab, WhatsApp revealed that more than 100 of](https://citizenlab.ca/2019/10/nso-q-cyber-technologies-100-new-abuse-cases/)\nthose targeted were HRDs, activists, journalists, across numerous countries and notified\n[them of the breach. Subsequent reports revealed that at least 22 of the 100 were activists,](https://scroll.in/latest/942218/nagpur-lawyer-notified-by-whatsapp-of-surveillance-says-bhima-koregaon-accused-were-also-targetted)\nlawyers, and scholars, including many HRDs who have been involved in advocating for\n[the release of the 11 activists. NSO Group says that it sells its products only to](https://www.nsogroup.com/governance/)\n“government intelligence and law enforcement agencies”.\n\n# Targeted Campaign against HRDs demanding the release of the Bhima Koregaon 11\n\nThe spyware campaign revealed in this blog targeted lawyers and activists Nihalsing B\n**Rathod, Degree Prasad Chouhan, Yug Mohit Choudhary, and Ragini Ahuja;**\nacademics Partho Sarothi Ray and PK Vijayan, a journalist who prefers to stay\nanonymous, and a human rights collective – Jagdalpur Legal Aid Group (JAGLAG),\nreceived malicious e-mails on the group’s official ID, which is accessed by all of its\nmembers, including lawyer Shalini Gera. Another JAGLAG member, Isha\n**Khandelwal also received malicious emails on her personal account. All the people**\nmentioned consented to be named in this blog.\n\n**Nihalsing B Rathod is a human rights lawyer based in Maharashtra. He has**\nworked closely with the imprisoned lawyer Surendra Gadling as a junior lawyer.\nCrucially, he is one of the leading lawyers representing one of the 11 imprisoned\nHRDs in their legal proceedings.\n**Isha Khandelwal is a lawyer associated with JAGLAG, a Chattisgarh-based**\nlawyers collective which provides legal aid to the Adivasi/indigenous and other\nmarginalised communities. The group’s primary email, which was targeted, is also\naccessed by lawyer Shalini Gera. They are also involved in the legal defense of the\nHRDs in the same case.\n**Degree Prasad Chouhan is a Dalit HRD who has worked closely with Sudha**\nBharadwaj in the past. Degree has been documenting and campaigning against land\ndispossession and forced evictions of indigenous communities in India, which have\nbeen carried out by coal companies and governments.\n**Partho Sarothi Ray is a Kolkata-based activist and academic, who has been a**\nvocal critic of rights violations in the country. He has also been a member of a\ncollective called Persecuted Prisoners’ Solidarity Committee, and has spoken out\nopenly against the imprisonment of these 11 activists.\n**Yug Mohit Chaudhry and Ragini Ahuja are criminal lawyers based in Mumbai.**\nTheir main area of work include litigating death penalty and civil liberties cases.\nThey represent two of the 11 imprisoned activists in the legal proceedings.\n\n\n-----\n\nA journalist based in Maharashtra, who wishes to remain anonymous was also\ntargeted. The journalist has been closely reporting on the Bhima Koregaon case.\nFinally, PK Vijayan is a Delhi-based academic. He is not directly linked to the\ncampaign for the release of the 11 HRDs, but is known to have campaigned for the\nrelease of GN Saibaba, a disabled academic who remains imprisoned in\nMaharashtra. Saibaba has been convicted under the draconian UAPA.\n\nWhile the spyware campaign detailed in this blog has no known links to NSO Group,\nthree of the nine HRDs targeted - Shalini Gera (from JAGLAG), Nihal Singh Rathod, and\n[Degree Prasad Chouhan- were targeted using NSO Group’s surveillance tools. Anand](https://scroll.in/latest/942218/nagpur-lawyer-notified-by-whatsapp-of-surveillance-says-bhima-koregaon-accused-were-also-targetted)\nTeltumbde, who is one of the 11 charged and imprisoned in the Bhima Koregaon incident,\n[was also targeted using NSO Group’s tools. That some of these individuals were targeted](https://scroll.in/latest/942218/nagpur-lawyer-notified-by-whatsapp-of-surveillance-says-bhima-koregaon-accused-were-also-targetted)\nmultiple times shows that there is a disturbing pattern of spyware attacks against HRDs\ninvolved in the Bhima Koregaon case.\n\n# A Campaign of Malicious Emails\n\nDuring this investigation, we identified 12 spearphishing emails sent between January\nand October 2019 targeting the nine activists.\n\nA spearphishing attack is an attempt to install spyware (a malicious software) on the\nvictim’s computer or smartphone by sending very carefully crafted and personalized\nemails to the target, often impersonating colleagues or loved ones. In a successful attack,\ncomputers or mobile devices may, in essence, become wiretaps, revealing confidential\nand intimate conversations and interactions but nullifying the possibility of privacy or\nconfidentiality. Besides this direct effect, the secretive and ubiquitous nature of these\nattacks means that the victims never know for certain if they are being targeted or have\nunwittingly downloaded some kind of spyware. The consequence is that they begin to fear\nthat every communication poses a threat, which can be highly disruptive to trust and\ncollaboration.\n\n## Spearphishing Emails\n\nOne of the spearphishing emails was sent from an email ID impersonating the name of an\nactivist that may be known by the targets. Other spearphishing emails came from the email IDs pretending to be journalists or masquerading as officials from local courts.\n\n\n-----\n\n_Email sent to JAGLAG by someone pretending to work for IBC24 in October 2019_\n\n[All these spearphishing emails included a malicious link to a file hosted on Firefox Send, a](https://send.firefox.com/)\nfree and secure file sharing platform developed by Mozilla. We suspect that this technique\nwas used to avoid detection by e-mail spam and malware filters, as a malicious file sent in\nsuch a way cannot be analyzed by security solutions used by email providers.\n\n_Email sent to a Human Rights Defender in October 2019 masquerading as a court_\n_summons_\n\nA detailed list of emails is available in Appendix 1.\n\n## Commercial Off-the-Shelf Spyware: NetWire\n\n[NetWire is a commercially available spyware reportedly used for cyber-criminality and](https://attack.mitre.org/software/S0198/)\n[corporate espionage since at least 2014. It has been analyzed in depth by several security](https://unit42.paloaltonetworks.com/new-release-decrypting-netwire-c2-traffic/)\n[companies including the Computer Incident Response Center Luxembourg and Fortinet,](http://www.circl.lu/pub/tr-23/)\nwho have shown that NetWire exhibits classic spyware features such as stealing\ncredentials, audio recordings, logging keystrokes and more.\n\n\n-----\n\n_Screenshot of the website selling Netwire (Retrieved in December 2019)_\n\nThe spearphishing emails targeting these nine HRDs attempted to deliver NetWire by\nattaching what looked like a PDF document but which was actually malicious Windows\nprograms that, when opened, would install NetWire on the HRD’s device. The disguise of\nthese supposed PDFs included opening a decoy, real PDF when clicked. This tactic was\nclearly intended to trick the targeted HRD into believing that no infection had taken\nplace. Additionally, this attack takes advantage of numerous other obfuscation techniques\noften abused by the surveillance industry to make NetWire more challenging to find and\nanalyze (see: Appendix 1 for more information).\n\n# Conclusion\n\nA coordinated spyware campaign targeted prominent HRDs, most of whom were vocal\nagainst the arbitrary and prolonged imprisonment of the Bhima Koregaon 11. The\nspearphishing emails and spyware suggest that this is not a cyber-crime attack, but a\nspyware campaign trying to compromise devices of HRDs. If successful it would have\nenabled the attackers, to monitor the HRDs actions and communications and is therefore\na violation of their rights to freedom of expression and privacy. This spyware campaign is\nvery concerning in the context of an already perilous situation for HRDs in India where\nsurveillance is used along with threats, imprisonment and smear campaigns against\nactivists to shrink the space for civil society.\n\nOur investigation was not able to conclusively attribute the attack to a particular group\nwith high confidence. However, it is not the first time that activists and journalists in\nIndia have been targeted using malware intended to put them under surveillance. Three\nof the HRDs in this incident were targeted earlier in 2019 with NSO Group’s Pegasus\nspyware, a commercial product only sold to government entities. This new campaign\nconfirms that there is a pattern of digital attacks against HRDs supporting the imprisoned\n\n\n-----\n\nBhima Koregaon activists. This pattern underscores the necessity of India fulfilling its\nobligation to provide a remedy for these abuses by conducting a full, independent and\nimpartial investigation into these attacks, including by determining whether there are\nlinks between this spyware campaign and specific government agencies.\n\nTargeting people solely for exercising their right to peaceful dissent amounts to an\narbitrary or unlawful attack on their privacy and violates their right to freedom of\nexpression. States have an obligation to protect human rights by ensuring that HRDs are\nprotected from unlawful surveillance.\n\n# Recommendations\n\n**To Indian Authorities:**\n\nConduct an independent, impartial, and transparent investigation into the unlawful\ntargeted surveillance of the nine human rights defenders, including determining\nwhether there are links between this spyware campaign and any specific\ngovernment agencies\n\nEnsure that all surveillance meets the tests of legality, necessity, and proportionality\nas enshrined in international human rights standards and affirmed in the Supreme\n[Court of India's landmark judgement of KS Puttaswamy v. Union of India.](https://indiankanoon.org/doc/127517806/?__cf_chl_jschl_tk__=64cf11b529f2cbd5837eb88d1620f1075f93a11e-1591978045-0-AfI46vIsktknj-pW2tT-fdtQinE8MmZQsZJYhS9gisa71yaPhLeoJ0-l7sNjAdGe676SZiHdSNnAG9sykmx4VTLNmYq5AVE9esxlbyNaiQVmv6v8dWYCOy6ft2e6zUYtfISlONNw05bPxM7SOKZLU6_mipnATxa5EHb2L80Qh6UQEB--SCHNSh9LIxW2676Gzm-_CA-rSfaNK3ArvXkVLT-izsienQsdLsQ4pE42_5hLuEOGBPAhoxcSx3nAI3pwPuh_y1ROH4aAy5qo0bDZk6hBUpOtpKHKktUTz_kbAaTgLZZ8cOR1DDNN-bxbScJCHsQqBys5qSWEdVxIFDDgpVbZNvqJqmPXjXoLxgOF23ro)\n\nEnsure adequate and effective legal remedies are available for people to challenge\nviolations of their human rights linked to surveillance\n\nReview Section 69 of the Information Technology Act and the 2018 order of the\nMinistry of Home Affairs that allows government agencies to intercept, monitor and\ndecrypt information without any judicial oversight and other procedural safeguards.\n\nImplement domestic legislation that imposes limits on digital surveillance, ensuring\nthat:\n\nSurveillance is governed by precise and publicly accessible laws\nSurveillance is only against specified persons, authorized by a competent,\nindependent and impartial judicial body with limitations on time, manner,\nplace and scope of surveillance\nAuthorized digital surveillance is subject to detailed record keeping, in\naccordance with documented legal processes for a warrant, and targets are\nnotified as soon as practicable without jeopardizing the purpose of\nsurveillance\n\nEnsure that all digital surveillance is subject to public oversight mechanisms,\nincluding:\n\nPublic notice and consultation for new surveillance purchases\nAn approval process\nRegular public reporting\n\n\n-----\n\nEnsure that the Personal Data Protection Bill, 2019 is not enacted in its current\nform and is brought in line with international human rights standards.\n\n# Appendix 1: Technical Details\n\nWe retrieved 9 different malware binaries from the links in the original emails. These\nsamples use several layers of obfuscation before delivering a NetWire sample.\n\n## I. Emails and Samples\n\nWe identified 12 emails targeting Human Rights Defenders between January and October\n2019:\n\n**Date** **Sender** **Subject**\n\n\nJan 16,\n2019\n\nMay 13,\n2019\n\nSept 10,\n2019\n\nOctober 6,\n2019\n\nOctober 6,\n2019\n\nOctober 11,\n2019\n\nOctober 26,\n2019\n\nOctober 26,\n2019\n\nOctober 26,\n2019\n\n\njagdish.meshraam[@]g\nmail.com\n\ndrsnehapatil64[@]gmail\n.com\n\npayalshastri79[@]gmail.\ncom\n\nsinhamuskaan04[@]gm\nail.com\n\nsinhamuskaan04[@]gm\nail.com\n\nsinhamuskaan04[@]gm\nail.com\n\njennifergonzales789[@]\ngmail.com\n\njennifergonzales789[@]\ngmail.com\n\njennifergonzales789[@]\ngmail.com\n\n\nDUSU activist Sujata files harassment\ncomplaint\n\nIPC 120B [REDACTED] (PSSC) Accused of\nCriminal Conspiracy\n\nPune SHO Sexually Abuse Journalists\n\nSUMMONS NOTICE JAGDALPUR ARSON\nCASE\n\nSUMMONS NOTICE IN ARSON CASE\nJAGDALPUR\n\nJAGLAG to be Blacklisted Over Irregularities\n\nRioting Case Summons Reminder\n\nReminder Summons For Rioting Case\n\nReminder Summons For Rioting Case\n\n\n-----\n\nOctober 26,\n2019\n\nOctober 26,\n2019\n\nOctober 28,\n2019\n\n\njennifergonzales789[@]\ngmail.com\n\njennifergonzales789[@]\ngmail.com\n\njennifergonzales789[@]\ngmail.com\n\n\nReminder Summons For Rioting Case\n\nSummons Notice For Rioting Case\nCr.24/2018\n\nSummons Notice For Rioting Case\nCr.24/2018\n\n\nWe identified ten different malicious samples from 10 different emails shared with us:\n\n**File Name** **SHA 256 Hash**\n\n\nComplaints_from_Ragini_Markande_Harrassment_letter.exe\n\nRioting Case Indictment\nSummary.exe\n\nPune SHO Sexual Abuse\nSummary.exe\n\nVijayan Rioting Case Indictment Summary.exe\n\nDetonators_planted_Lawyers_house.exe\n\n55_maoists_killed_by_c60_commandos.exe\n\nReminder Notice SP\nNorth Goa Ponda\nDivision.exe\n\n\ne3dea449bf74434ee1c9cdc04ca68b8f3c9bac357768e07df303433f257d3b9a\n\n21d24e08889f75461a7ce6f21fc612a701bca35da1a218cf3cdd6e23f613bb4d\n\n16b5c74fb55f52ae0ae4328f65b2bf3bbe3e5ee34268c1d32a247a0a1dfa3186\n\n5a4aca57541954195953066a4be96dfb19776ba099d72f8f1d3677581594606e\n\n11cef331557eb693e718d27b6a7211a98d3982117a03ec1491db8098ea3cec00\n\n88b92d985b7d616c93c391731c1e4a6d3c8323fdcbf31cfc4d340e27253913a7\n\nb1b6e133aa320669c772ec7e5fd6fbe4cb3edca13ad5351f14df3c1f13939d09\n\n\nmail2.exe ea5f37e1feab670171963aa83b235c772202b2d4bb7289dd45302c3851dbd6f9\n\n\n-----\n\nmail3.exe de302a61e5f07b0e65753355d44d22181a2742ac3a92aa058\nbdcd00cc4dab788\n\n\nSUMMONS NOTICE\nJAGDALPUR ARSON\nCASE.exe\n\n\n31a3e3aba03b553d0f23f10b06ade30ae053cd667a8cc9660f310705ee471b68\n\n\nWe have also identified three other similar samples uploaded on VirusTotal that we\nattribute to the same campaign:\n\n**File Name** **SHA 256 Hash**\n\n\n“Supreme\nCourt Order Ban\nSanatan\nSanstha.exe\n“\n\n\nb09ca9d48a0455ed5e02a56aabeb397c41fb63320244719749e0741da72e79c4\n\n\n\n[unknown] 095ec879f323a0a3eceb97013125880d49ac701eef568e3b010fdddb1333941f\n\n[unknown] ac4d5d938009fd44b2f7587986862ab2278887a17d32f748278445b625b3efd9\n\n## II. Obfuscation and payload delivery\n\n### Variant 1\n\n1. SFX archive extracts AndvancedRun/VBS stage.\n\n1. AdvancedRun launches VBS script.\n\n1. VBS script extracts RAR archive containing 2nd level NetWire droppers. Task\n\nScheduler entries created for 3 2nd level NetWire droppers. Launches decoy PDF.\n\nIn this variant, payloads are only launched by Task Scheduler.\n\n\n-----\n\n_Delivery of the first payload variant_\n\n### Variant 2\n\nThis second variant was modified to add an additional execution of the NetWire payload\nin parallel to those launched by task scheduler, and in order to add a layer in between\nwith validly signed EXEs, likely to thwart antivirus detection heuristics.\n\n1. SFX archive extracts two payloads. A SFX archive and a NetWire dropper.\n\n1. Launch 1st NetWire dropper. Launch second SFX archive, which extracts Ad\nvancedRun/VBS stage.\n\n1. AdvancedRun launches VBS script.\n\n\n-----\n\n1. VBS script extracts RAR archive containing additional NetWire droppers. Task\n\nScheduler entries created for 3 new NetWire droppers. Launches decoy PDF.\n\n_Delivery of the second payload variant_\n\nThe Stage 1 SFX archive contains random README files, GPL licenses and even RFCs.\nLaunches both the payloads contained.\n\nThe 1st level and 2nd level NetWire droppers all launch the same payload, either by\nlaunching and hollowing dllhost.exe, or launching and hollowing rundll32.exe, or by\nlaunching and injecting a copy of themselves.\n\n\n-----\n\n### Bypassing Security Protections With Large Files\n\nIt is the first time we have observed large files being used as a trick to bypass security\nprotections. As described earlier, the first dropper is a Self-Extracting RAR archive that\nextracts several files, including either the dropper or another self-extracting RAR archive\nrunning the final dropper. In almost all cases analyzed here, the droppers were very large\nfiles, between 50MB and 300MB.\n\nThese files mostly contain the byte 00 that is efficiently compressed by the RAR format,\nmaking the initial file quite small. As many security solutions include a file size limitation\nto avoid overloading the detection system with heavy files, it is likely that this trick would\nprevent some solutions from detecting these files as malicious.\n\n### Digital Signatures\n\nWe identified five samples with valid digital signatures for three different UK-registered\ncompanies. We contacted the owner of one of these companies who told us that he was\nnever involved in signing any software. Further investigation led us to question the\ninvolvement of the companies for which they were issued. It appears that this may be part\nof a pattern of identity theft of small companies in order to issue signatures for malicious\n[software. A recent study has shown that since 2017, this underground market for code-](https://arxiv.org/pdf/1803.02931.pdf)\nsigning certificates has substantially increased.\n\n### Final Payload: NetWire\n\nThe final payload launched in memory by these samples is a NetWire sample\ncommunicating with the dynamic DNS domain researchplanet.zapto[.]org.\n\nNetwire is a commercial malware known since 2012, that has been analyzed in depth\n[several times. It has been used mostly in cyber-criminal activities, but has also been used](https://unit42.paloaltonetworks.com/new-release-decrypting-netwire-c2-traffic/)\nseveral times in cyber-espionage operations for instance by the Iranian attributed group\nAPT33 in 2017. It is today sold online for $15 a month by a company called World Wired\nLabs.\n\n## III. Network Analysis\n\nNetwork traffic appears to be similar in structure to typical NetWire C&C\ncommunications:\n\n\n-----\n\nAll the samples identified communicate with the dynamic DNS domain\nresearchplanet.zapto[.]org on port 1810.\n\n## IV. Infrastructure\n\nAll the samples identified in this attack used the domain researchplanet.zapto[.]org on\nport 1810 as Command & Control server. This domain is a dynamic DNS domain\n[managed by the company NoIP, and was first seen as used by RiskIQ in mid-December](https://www.noip.com/)\n2018. This domain has used multiple IPs over this year according to several passive DNS\ndatabases, we have confirmed the utilisation of the IP addresses 185.117.66[.]188\n(Edelaraudtee Infrastruktuuri AS) and 185.82.202[.]155 (Host Sailors) as NetWire C2\nservers receiving connections from compromised systems.\n\n\n-----\n\nThe dynamic DNS domain socialstatistics.zapto[.]org is very likely linked to this\ncampaign, as it was connected with several IPs also used by researchplanet.zapto[.]org in\nthe end of 2019. During the investigation, we confirmed that the IP address used with this\ndomain in December 2019, 185.45.193.14 (Host Sailor) was also running a NetWire server\non ports 7778 and 50070, confirming the link with this campaign.\n\nFinally, we consider a third dynamic DNS domain, duniaenewsportal.ddns[.]net to be\nlinked with this campaign, as it shared the same IP address 185.45.193[.]14 (Host Sailor).\n[This domain could have been created based on the name of Dunya News, an Urdu](https://en.wikipedia.org/wiki/Dunya_News)\nlanguage television channel from Pakistan.\n\n# Appendix 2: Indicators of Compromise\n\nYou can find the full list of indicators of compromise here\n[https://github.com/AmnestyTech/investigations](https://github.com/AmnestyTech/investigations)\n\n**Following are the domain names associated with this campaign:**\n\nresearchplanet.zapto[.]org\n\nsocialstatistics.zapto[.]org\n\nduniaenewsportal.ddns[.]net\n\n**The IP address hosting the malicious infrastructure is:**\n\n185.82.202[.]155\n\n185.117.66[.]188\n\n185.117.74[.]47\n\n\n-----\n\n185.117.74[.]28\n\n185.45.193[.]14\n\n**Following are the email addresses used in spearphishing emails:**\n\njagdish.meshraam[@]gmail.com\n\ndrsnehapatil64[@]gmail.com\n\nsinhamuskaan04[@]gmail.com\n\njennifergonzales789[@]gmail.com\n\npayalshastri79[@]gmail.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.06.15.india-human-rights-defenders-targeted/India_%20Human%20Rights%20Defenders%20Targeted%20by%20a%20Coordinated%20Spyware%20Operation%20_%20Amnesty%20International.pdf"
    ],
    "report_names": [
        "India_ Human Rights Defenders Targeted by a Coordinated Spyware Operation _ Amnesty International"
    ],
    "threat_actors": [
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9fe49a5b-f3e6-4fbf-99a1-db15dad460c3",
            "created_at": "2024-05-01T02:03:08.045004Z",
            "updated_at": "2025-03-27T02:05:17.325038Z",
            "deleted_at": null,
            "main_name": "COBALT TRINITY",
            "aliases": [
                "Elfin ",
                "HOLMIUM ",
                "MAGNALIUM ",
                "Peach Sandstorm ",
                "Refined Kitten ",
                "TA451 ",
                "APT33 "
            ],
            "source_name": "Secureworks:COBALT TRINITY",
            "tools": [
                " Cadlotcorg",
                " Dello RAT",
                " Imminent Monitor",
                " KDALogger",
                " Koadic",
                " NanoCore",
                " NetWire",
                " POWERTON",
                " PoshC2",
                " Poylog",
                " PupyRAT",
                " Schoolbag",
                "AutoCore"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041717,
    "ts_creation_date": 1592281522,
    "ts_modification_date": 1592281522,
    "files": {
        "pdf": "https://archive.orkl.eu/e4c9189b12b624d00aebddce020dc21235824382.pdf",
        "text": "https://archive.orkl.eu/e4c9189b12b624d00aebddce020dc21235824382.txt",
        "img": "https://archive.orkl.eu/e4c9189b12b624d00aebddce020dc21235824382.jpg"
    }
}