{
    "id": "f797c962-aff9-4c18-9fa8-d7f75694c93a",
    "created_at": "2022-10-25T16:48:17.569579Z",
    "updated_at": "2025-03-27T02:09:55.156869Z",
    "deleted_at": null,
    "sha1_hash": "da5367c9a88967ac55d056236f865d9f220995be",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-06-05T12:21:13Z",
    "file_modification_date": "2019-06-05T12:21:20Z",
    "file_size": 3373532,
    "plain_text": "###### AGARI CYBER INTELLIGENCE DIVISION\n\n THREAT ACTOR DOSSIER\n# Scattered Canary\n\n###### The Evolution and Inner Workings of a West African Cybercriminal Startup Turned BEC Enterprise\n\n\n-----\n\n### Executive Summary\n\n###### In a first, Agari has cataloged the evolution of a Nigerian cybercriminal organization from its emergence as a one-man shop into a powerful business email compromise (BEC) enterprise employing dozens of threat actors.\n\n\nBEC has continued to grow, taking the number one spot for greatest financial losses from\nInternet crime. In a recent report, the FBI’s Internet Crime Complaint Center (IC3) reported\nthat more than 20,000 businesses lost nearly $1.3 billion to BEC attacks in 2018. Globally, BEC\nattacks have cost more than $13 billion in losses over the past five years.\n\nBut with the West African gang we’ve named Scattered Canary, we have a deeper look at how\nbusiness email compromise is connected to the rest of the cybercrime. With over ten years of\nvisibility into Scattered Canary’s operations, we have deep insight into how the group grew\nfrom a single cybercriminal working Craigslist scams into an entire organization that consists of\ndozens of criminals, each with specific tasks.\n\nWhen the first member of Scattered Canary, who, for the purposes of this report, we call\nAlpha, began his operations, he was a lone wolf—working mostly Craigslist scams as he learned\nthe tricks of the trade from a mentor. However, within a few years, he had honed his craft\nenough to expand into romance scams, where he met his first “employee,” Beta. Once they\nhad secured enough mules via their romance scams to launder their stolen money, they shifted\nfrom targeting individuals to targeting enterprises, and the group’s BEC operation was born.\n\nSince its inception, at least 35 different actors have joined Scattered Canary in its fraudulent\nschemes. The group has turned to a scalable model through which they can run multiple types\nof scams at the same time. And with multiple tools designed to help them expand their operations\nand stay hidden from law enforcement, it is no wonder that they are seeing massive success.\n\nWhile BEC remains a favorite due to its ease and success, a look into Scattered Canary’s\noperations demonstrates that these groups are not one-trick ponies. At any given time,\nScattered Canary is involved in a number of different types of scams simultaneously—including\nromance scams, tax fraud, social security fraud, employment scams, and more. And this is only\none organization, out of the hundreds currently residing in West Africa and around the world.\nWith this much involvement between members, and so much connection between crime type,\nwe must look at the bigger picture to truly understand the enormity of the cybercrime problem.\n\n\ntoday’s most pernicious email scams, this report demonstrates that a much more holistic\napproach—one based on threat actor identity rather than type of fraudulent activity—is\n\n\nwe must look at the bigger picture to truly understand the enormity of the cybercrime problem.\n\nIf Scattered Canary can be seen as a microcosm for the rapidly evolving organizations behind\n\n\n**2**\n\n\nIf Scattered Canary can be seen as a microcosm for the rapidly evolving organizations behind\n\n\n-----\n\n## Table of Contents\n\n###### Scattered Canary: From 419 Startup to BEC— Big Enterprise Corporation 4\n\n First Contact: Scattered Canary Comes Calling 6\n\n Who Is Scattered Canary? A Flock of Fraudsters  Comes into Focus 10\n\n From Early Bird to BEC Juggernaut:  Making All the Right Moves 11\n\n Tools of the Trade: Anatomy of a BEC Scam 25\n\n\n**3**\n\n\n-----\n\n### Scattered Canary:  From 419 Startup to BEC— Big Enterprise Corporation\n\n###### This investigation by the Agari Cyber Intelligence Division (ACID) into the cybercriminal group we’ve named Scattered Canary offers unprecedented visibility into eleven years of fraud and criminal activities, and the growth of a 419 startup into a fully operational BEC business. From our research, we have discovered that BEC actors are playing very active roles in many other forms of criminal activities—a fact that showcases just how much of an impact these groups can create.\n\n\n###### Fraud as a Growth Industry\n\nIn today’s rapidly-evolving cybercrime economy, business email compromise (BEC) has\n[emerged as a growth industry all its own. According to the most recent Internet Crime Report](https://www.ic3.gov/media/annualreport/2018_IC3Report.pdf)\nfrom the FBI’s Internet Crime Complaint Center (IC3), “revenues” for this advanced form of\nemail fraud nearly doubled in 2018—to $1.3 billion. In all, more than $13.5 billion has been lost to\nBEC scams since 2013. But investigation into the criminals behind BEC shows that $13.5 billion\nis likely just the tip of the iceberg. Since 2015, BEC complaints have doubled year after year\nand currently account for 45% of all reported complaints to IC3.\n\n\n###### Agility: Essential for Rapid Diversification\n\nOne common misconception is that crime rings operate within set verticals—that BEC groups\nonly run BEC scams, groups focused on romance scams only run romance scams, and so forth.\nBut like entrepreneurs in any industry, cybercriminal organizations work to achieve growth by\ndeveloping and validating scalable business models across a diversified set of revenue streams.\n\n\nThroughout our research into Scattered Canary, we can see how the main threat actors\nencountered periods where opportunities for diversification presented themselves, and they\nboldly and rapidly pushed forward into new terrain.\n\n\nTrust encourages a nepotistic approach to candidate selection, and many relationships are\n\n\nrecruitment can flourish naturally.\n\n\nDue to their agile working practices, they have been able to bring in extra skilled “staff” at a\n\n\n**4**\n\n\nDue to their agile working practices, they have been able to bring in extra skilled “staff” at a\n\n\n-----\n\nAs we have discovered, the same groups that reap billions in BEC schemes each year are also\npartly to blame for the $360 million lost to romance scams, the $1 billion hijacked in real estate\ntransactions, and millions more pilfered through W-2 scams, payroll diversions, and other\ntypes of fraud. This suite of email-based attack vectors is operated concurrently by modernday cybergangs including Scattered Canary, and represent the apex of years of both massive\ngrowth and massive success.\n\n###### Catching Sight of Scattered Canary\n\n\nThrough extensive active defense engagements and research over the last six months, we\nhave been able to build a detailed picture of not just the tactics and techniques currently\nused by Scattered Canary, but also historically how they have adopted these over a period of\nmany years. While this criminal organization’s activities now center around BEC, and extend\nto romance scams, credit card fraud, check fraud, fake job listings, credential harvesting, tax\nschemes, and more, these actors came from much humbler beginnings, starting with basic\nCraigslist scams in 2008.\n\nGiven the wide range of its activities, the extended ecosystem of individual actors with which\nit collaborates, and the persistent optimism present in its range of email addresses, we have\ndubbed this organization “Scattered Canary.” Over the course of active engagement with\noperatives of this group, an ever-growing global footprint has emerged, eclipsing that of even\n[London Blue—the UK-based threat group we uncovered in December 2018.](https://www.agari.com/insights/whitepapers/london-blue-report/)\n\n\nScale aside, we are resolute in our conclusion that BEC can no longer be seen in isolation and\nthus unrelated to other email deployed criminal enterprises. Instead, we must view it as part of\na larger ecosystem of cybercrime, with BEC as its current apex. Infrastructure, and actors, are\ncommon across the entire cybercrime industry, and knowing this will help to generate further\ndiscussion about ways to curtail and shut down these maturing operations.\n\n\n**5**\n\n\n-----\n\n### First Contact  Scattered Canary Comes Calling\n\n###### We first identified Scattered Canary when, in a rather bold move, the group impersonated a senior executive at Agari in an email targeting our Chief Financial Officer.\n\n\nThis isn’t the first time our CFO has been targeted by a nefarious executive impersonator. The\n[criminal gang London Blue appeared on our radar in exactly the same way. So why have two](https://www.agari.com/insights/whitepapers/london-blue-report/)\nunrelated cybergangs made what seems like a high-risk decision to attack a firm focused on\nstopping advanced email threats?\n\nThe answer is multifaceted. In many cases, they have not deemed it necessary to their tactics,\ntechniques, and procedures (TTPs) to be aware of the industries of their targets. In order to\ncarry out the high volume of attacks that these larger gangs perpetrate, they strip the process\nback to its most basic components, as any smart business would. The “essentials” comprise of\nthe name and email address of a CFO (or comparable financial executive) and the name and\nemail address of the CEO for the same organization. Once they have secured this information,\ntheir reconnaissance need not go any further, as these details are fed into their existing\ninfrastructure, and any replies will be subject to non-industry specific social engineering.\n\n\nAnother reason cybercriminals are lax about their targets is likely due to their geographic\nlocation. Many feel that they have a home team advantage living in Nigeria, where they are\nfree to pay off law enforcement to look the other way. Despite the introduction of the Nigerian\nCybercrime Act 2015, which carries a fine of up to 10 million naira for unlawfully accessing\na computer system or perpetuating fraud by using electronic messages, cybercrime in the\ncountry has continued to expand. Criminals can often secure millions in profit through BEC and\nother tactics, and are both willing and able to give local law enforcement enough to keep them\nquiet. By doing so, they ensure that their operations can continue while they are protected\nfrom persecution.\n\n###### An Attack on Agari\n\n\nOn November 29, 2018, Scattered Canary sent an attack email to Agari CFO Raymond\nLim, enquiring as to his availability to send out a domestic wire transfer. This display name\ndeception attempt was quarantined by Agari Advanced Threat Protection™, and we then\nactively engaged with the attacker in an attempt to establish his true intentions. What followed\nwas a series of engagements that resulted in our team gaining deep insight into this group—\nincluding its scattershot origins, how its actors fit together, and how it achieved its remarkable\ngrowth trajectory.\n\n\nLim, enquiring as to his availability to send out a domestic wire transfer. This display name\ndeception attempt was quarantined by Agari Advanced Threat Protection™, and we then\n\n\n**6**\n\n\nactively engaged with the attacker in an attempt to establish his true intentions. What followed\n\n\n-----\n\nUsing an unrelated persona account, we reached out to the actor and asked them to send over\nthe details of the wire transfer they wished us to make.\n\n\nFrom\n\nPatrick Peterson <admin@filesxoffice.net>\n\n\n###### Thx, Karen\n\n\n###### details.\n\n\n###### I’m working from home this week, but I should be able to help. Please send\n\n\nSent from my iPhone\n\n\n###### Thx,\n\n\n###### details.\n\n\nSent from my iPhone\n\n\n###### I’m working from home this week, but I should be able to help. Please send\n\n\n-----\n\nIt wasn’t long before we received a reply containing the full details for both the bank account\nand the amount of $19,725.\n\n\nFrom Patrick Peterson <admin@filesxoffice.net>\n\nSubject URGENT REQUEST\n\n\n###### Mount Juliet tn. 37122\n\n\n**8**\n\n\n-----\n\nAs is common with nearly all our active engagements that request a bank payment, the\nrequest was caveated with a requirement for a confirmation receipt to be sent upon\ncompletion. This document is an essential part of the operational paperwork, as it allows\nindividual actors to prove to the Scattered Canary executive team that a successful payment\nhas been obtained. It also allows them to counter any argument by the mule account gobetween—especially if they are a third-party mule account broker—that no payment has been\nreceived, when in actual fact it has. Working as an opportunistic criminal, alongside other\nopportunistic criminals, does not come without its challenges.\n\nAfter this initial engagement, we continued interacting with Scattered Canary for nearly\ntwo more months. Over the course of this engagement, we coerced the group to send us\neight different mule accounts used to receive illicit funds from BEC victims and passed\nthis information to law enforcement and financial partners. Using a combination of active\nengagement and other tactics, we were able to gain significant insight into Scattered Canary’s\nhistory, methods, and primary actors. What follows is an overview of what we discovered\nduring our investigation.\n\n\n**9**\n\n\n-----\n\n### Who Is Scattered Canary?  A Flock of Fraudsters Comes into Focus\n\n###### BEC mastermind. Craigslist scammer. The romance victim recruited as a money mule. In our research into Scattered Canary’s growth and evolution, we were able to map out dozens of relationships, an entire infrastructure, thousands of email discussion threads, hundreds of romance and fraud victims, dozens of scam kits, and other evidence that helps connect the dots between a wide universe of threat actors and actions associated with this West African fraud ring.\n\n\nIn this and groups like them, hierarchical structures center on a few senior members who direct\noperations while outsourcing specific duties to an open web of freelance agents.\n\nIn distributed networks that in some ways resemble the recombinant structure of terrorist cells,\nhonor among these thieves runs deep. Symbiotic relationships are built, fostered, and rewarded.\nNews of betrayal and bad “business practices” travels fast and can have a detrimental effect on\nan actor’s ability to work with other fraudsters, and ultimately continue their business.\n\n\nIn this report, we examine many of Scattered Canary’s activities, approaches, and connections,\nwhich we believe encompass only a small subset of what may be a larger organization with a\nmore expansive circle of influence. Some of the overlapping connections to be discussed in this\nreport are depicted here.\n\nZeta Eta\n\nIota Theta\n\nDelta Epsilon\n\nBeta Gamma\n\nALPHA OMEGA\n\nROLES Major Player Mule Accounts Other Scams\n\nMentor Infrastructure\n\nOver the last decade, Scattered Canary has evolved similar to how a tech startup might.\nLooking past the illegality of its operating model for just a moment, the biggest driver of\nthis business was a desire to generate sustainable revenues by leveraging the global, digital\neconomy enabled by the Internet\n\n|2017–Present Zeta 2014–2017 Iota Delta 2008–2014 Beta ALPHA|Eta Theta Epsilon Gamma OMEGA|\n|---|---|\n\n\nZeta Eta\n\nIota Theta\n\nDelta Epsilon\n\nBeta Gamma\n\nALPHA OMEGA\n\nROLES Major Player Mule Accounts Other Scams\n\nMentor Infrastructure\n\n\nOver the last decade, Scattered Canary has evolved similar to how a tech startup might.\n\n\nOver the last decade, Scattered Canary has evolved similar to how a tech startup might.\n\n\nthis business was a desire to generate sustainable revenues by leveraging the global, digital\n\n\n**10**\n\n\n-----\n\n### From Early Bird to BEC Juggernaut  Making All the Right Moves\n\n###### Scattered Canary’s fraudulent history can be traced as far back as October 2008, when the group first arrived on the cybercriminal circuit. Throughout the past decade, what was once a single threat actor working the Craigslist angle has grown into a fully operational BEC and cybercrime machine.\n\n\nOver the last eleven years, Scattered Canary’s central figure, “Alpha,” transitioned from\nindividual contributor running Craigslist scams and check fraud to CEO of an organization\nfocused on business email compromise. Today, he directs operations and leverages outside\nexpertise on an ad-hoc basis to test and refine new approaches to email fraud in pursuit of\nevermore remunerative scams. Based on intelligence gathered from Scattered Canary, we have\nbeen able to reconstruct the group’s transformation through the years—as well as dozens of\ntactics used in its scams. This is the story of how a 419 start-up grew into a BEC powerhouse.\n\n###### 2008–2010: Starting Small\n\n\nBased on historical research into Scattered Canary’s operations, the group started with a single\nindividual, who we call Alpha in this report. Alpha started out in the trenches of Craigslist\nscams with his mentor, Omega, who would expose Alpha to things like check fraud and\nromance scams. Alpha’s early role was fairly simple: engage with individuals, who he chose\nbased on the goods they were selling, and then provide personal shipping addresses back\nto Omega. At the time, Craigslist was a training ground for West African scamming. New\nplayers to the cybercrime scene could use the platform to hone their social engineering skills\nbefore moving on to other types of fraud, such as romance scams. Two other groups we have\n[previously reported on—London Blue and Scarlet Widow—also cut their teeth on Craigslist](https://www.agari.com/insights/whitepapers/london-blue-report/)\nscams before evolving into other crimes.\n\n\n\n - \u0007Leader of Scattered Canary,\n\ndirects day-to-day operations\n\n - \u0007Specializes in BEC attacks\n\n - \u0007Involved in online scams for at\nleast 11 years\n\n - \u0007Engaged with three daughters\n\n\n##### OMEGA\n\n\n##### ALPHA\n\n\nLIVES IN IBADAN, NIGERIA\n\n\nLIVES IN IBADAN, NIGERIA\n\n\nLIVES IN IBADAN, NIGERIA\n\n\n-----\n\n2009\n\n\n2010\n\n\n2011\n\n\nTimeline for Scattered Canary’s Growth Since Its Inception\n\n\n**12**\n\n\n-----\n\nThe basic premise of a Craigslist check fraud has become a criminal classic, and it starts\nwith the target listing a good or service on the platform. The scam starts when the scammer\nreaches out to the potential victim, often asking for the face value of the product, then offering\nmore money in exchange for the victim sending a portion of that money to someone else. For\nseveral years, this is where Alpha would hone his scamming tradecraft, setting the stage for his\nBEC enterprise only seven years later.\n\n\nFrom\n\nAnna Maldavo\n\nSubject wishard art\n\n\n###### I am willing to pay an extra 100$\n\n\nExample Craigslist Scam Interaction\n\n\n**13**\n\n\n-----\n\nOnce the fraudster confirms the sale, they inform the seller that they wish to send a check\n(which is counterfeit) and that the check will be made out for an amount greater than the\nprice of the item—with the stated request to have the seller forward the remaining balance\nto another person. This person is commonly purported to be performing some function that\nappears to be related to the purchase, oftentimes a shipping company that will pick up the\nitem on their behalf. The shipping company is, of course, fictitious, and the bank account\nprovided for forwarding or wiring is controlled by the fraudster. Quite often, the item in\nquestion will just be left with the original owner once the criminal receives his money. But on\nrare occasions, the third-party accomplice will actually pick up the item or items in-person,\nwhile at the same time collecting the balance of the check in cash.\n\nIn the years of Craigslist scams, Alpha learned about targeting individuals and how these\n419 scams worked. With Omega as a mentor, Alpha learned how to use different scripts and\nformats to operate fraud at scale and how to convince victims to complete tasks on his behalf,\noftentimes coercing them into cashing checks.\n\n\nIn the early days, Alpha was completing most of the grunt work when it came to dealing with\npeople. In the fifteen month stint of Craigslist fraud, Alpha exchanged over 1,900 emails with\nvictims or scammers related to Craigslist and provided more than 100 addresses to Omega,\nwho was responsible for sending fake checks to victims. Alpha aimed high with each check—\ntypically between $2,000-$4,000.\n\nHow effective was this team? With Alpha averaging around eight victims per month in\nCraigslist scams, the group made an average amount of $24,000 per month, which was split\namongst them. Omega and Alpha were obviously two willing participants in the fraud, but\nthere are some pieces of the puzzle that are missing. Who was receiving the packages of\nmoney? Who picked up money face-to-face? Who was depositing the cash or sending it to\nNigeria? Based on our visibility, we believe that Omega handled most of these interactions.\nMeanwhile, Alpha began to diversify his portfolio by dabbling into other types of crime. His first\nmove was into romance scams.\n\n\n**14**\n\n\n-----\n\n###### 2010–2014: Branching Out\n\nUsing the social engineering knowledge he gained from working Craigslist scams, Alpha began\nengaging in romance scams where he communicated with several victims through social\nmedia, text messages, and Google Voice. Over this period, victims sent selfies, photos with\nfriends, love messages, and sweet nothings sharing that they’d been thinking about Alpha. In\norder to maintain the fraudulent persona, Alpha even sent flowers to two victims—once in 2012\nand again in 2014.\n\nBut why would someone invest the time and effort into pretending to be someone else just\nto break their hearts? As with all scams, actors have one goal in mind: money. By pretending\nto be a fake lover, romance scammers are able to fool victims into giving them access to their\nbank accounts and retirement accounts or into purchasing prepaid debit cards to send to the\nfraudsters. Once a romance victim has been milked out of all the money possible, they are\ngenerally then converted into mules for when the scammer needs something physically moved\nfrom one place to another, or when he needs fraudulent funds moved between accounts.\n\n\nRomance scammers typically assign small tasks to their victims, such as opening a bank\naccount, wiring money from one account to another, or sending a few fake checks in the mail.\nIn order to maximize their investment, some scammers ask their victims to open new loan\naccounts or credit lines for their “significant other,” only to get nothing back in return. In more\nextreme cases of romance scams, victims have even been asked to bring suitcases of drugs\nacross country borders, thinking it was a chemical or solvent for their lover.\n\nAlpha quickly learned the value of a romance mule. By using other people to do his dirty work,\nhe could engage with fewer clients and decrease his risk of being caught, all while seeing\nincreased profit margins. And as Scattered Canary grew over time, romance scam victims\nwould end up being a primary source for mule accounts.\n\n\nThe story of one Scattered Canary’s romance victim exemplifies the lengths to which these\ngroups use and reuse their victims until there is literally nothing left to exploit.\n\nBy March 2016, one of Scattered Canary’s members had built enough trust with a romance\nvictim—who we’ll call Jane—that she became a frequent source of new mule accounts for\nthe group. Since she had been converted to a mule at this point, it’s safe to assume that\nScattered Canary had already stolen as much money from her as they could. Over the next\neighteen months, Jane opened five mule accounts and bought twenty prepaid cards that were,\nunbeknownst to her, used by the group to facilitate other scams.\n\nAfter the new accounts were opened, Jane sent her fictitious online boyfriend the account\ncredentials, using passwords like weare4ever and 2hearts1love. Over time, these passwords\nbecame things like 2muchmystery and iam2wornout as Jane grew tired of the mysterious\nrelationship with her online lover. Unfortunately and sadly, Jane passed away in September 2017.\nEven after her death, though, Scattered Canary continued to victimize her. In October 2017, a\nmember of the group attempted to take out an auto loan using Jane’s personal information,\nproviding more evidence that these groups are only interested in one thing—money.\n\n\ncredentials, using passwords like\n\n\nproviding more evidence that these groups are only interested in one thing—money.\n\n\nAfter the new accounts were opened, Jane sent her fictitious online boyfriend the account\n_weare4ever_\nand iam2wornout\n\n\nbecame things like\n\n\n. Over time, these passwords\nas Jane grew tired of the mysterious\n\n\nand 2hearts1love\n\n\ncredentials, using passwords like\n\n\n**15**\n\n\nand\n\n\n_iam2wornout_\n\n\n-----\n\nWhile losses related to romance scams are typically tracked on their own, romance and BEC\nscams are very close cousins when it comes to fraud. In almost every case investigated by our\nteam, when banking details of a phishing email included a person’s name, that person was an\nunwitting participant of the BEC game. Over the years, we have had the honor of speaking\nwith several victims. In many cases, the victims simply believed that they were in a legitimate\nonline relationship and were unaware of the fraud they were committing. The devastating\npiece is that many of these victims spent years entangled in the scheme—in one case over nine\nyears—before being notified by external parties or law enforcement.\n\n###### 2015–2017: Pivoting to Enterprises\n\n\nAs Scattered Canary’s business expanded, mostly through romance scams, Alpha saw the\nvalue of larger targets and met with the person who eventually became his co-conspirator\nand who we refer to as Beta. Once these two men joined forces, they would pivot away from\ntargeting individuals to focus on enterprises. By all accounts, late 2015 was the beginning of\nBEC for Scattered Canary.\n\nIn mid-2015, Scattered Canary started moving away from “long con” social engineering attacks\nand toward more scalable—and ultimately more profitable—attack vectors. The first type of\nattack they pivoted to was credential phishing. Between July 2015 and February 2016, Scattered\nCanary’s primary focus seemed to be mass harvesting general credentials using a Google Docs\nphishing page. In the first few months of their credential phishing ventures, Scattered Canary’s\nsights were mostly set on Asian targets—Malaysia and Japan, in particular. In November 2015,\nthe group started to focus on North American users, mostly in the United States.\n\n\nThis activity ceased in February 2016, likely because the men who made up Scattered Canary\nbegan to focus on honing their BEC skills. However, more than a year later in March 2017, they\nreturned to the credential phishing game. This time, though, the group’s focus had clearly\nshifted away from individual users and toward corporate victims.\n\nInstead of using fake Google Docs phishing pages to collect personal email login credentials,\nScattered Canary began using phishing pages of commonly used business applications to\ncompromise enterprise credentials. Key pages included ones that impersonated Adobe,\nDocuSign, and OneDrive. For over eighteen months from March 2017 until November 2018,\nScattered Canary’s frequent enterprise-focused credential phishing campaigns almost exclusively\ntargeted businesses in the United States and Canada. In total, Scattered Canary received more\nthan 3,000 account credentials as a result of their phishing attacks.\n\n\n**16**\n\n\n-----\n\nHi,\nKindly view the invoice document below via office sign for records\n\n###### 182.7 KB Scanned_Invoice798261.Pdf\n\n\nor\n\n\n###### Thanks, Billing Team\n\n\n-----\n\nAside from credential phishing, Scattered Canary’s biggest evolution from individual targets\nto corporate users came in November 2015, when the group, like so many other West African\ncybercriminal groups, broke into the BEC space. In the early days of their BEC campaigns,\nScattered Canary tested multiple different methods of crafting deceptive emails, including\nusing different templates and impersonation tactics.\n\nAfter a few months, the group settled on a tactic that they felt worked for them: directly\nspoofing target company domains and requesting a payment via wire transfer to a supposed\nvendor. Scattered Canary used this tactic of impersonating target domains until September\n2016, when they switched to using obscure webmail accounts or email accounts linked to\ndomains registered by the group themselves.\n\nMessages\n\nFrom\n\nTo\n\nSubject Reply ASAP\n\n###### Hi,\n\n Are you in the office? Kindly let me know because i need you to do something very important for me.\n\n Thank you.\n\nFirst BEC Email Observed from Scattered Canary in November 2015\n\n\nFrom\n\nTo\n\nSubject Reply ASAP\n\n###### Hi ,\n\n Are you in the office? Kindly let me know because i need you to do something very important for me.\n\n Thank you.\n\n\n-----\n\nUntil this point, Scattered Canary was made up of\nonly Alpha working as an individual contributor on\nevery scam, with a few tangential associates helping\nout from time to time. However, as he became more\nsuccessful and transitioned into BEC, he looked to\nexpand his numbers and the first new “employee”\njoined the group in October 2015—Beta.\n\nBeta’s primary role at the time, and what he continues\nto focus on today, has been to act as the “mule\nherder” for the group. In other words, Beta’s job is\nto identify and recruit individuals who are then used\nto receive the stolen proceeds of BEC attacks. Since\n2015, Beta has relayed more than 150 mule accounts\nto Alpha—more than any other Scattered Canary\ngroup member by far. Over the years, Alpha has also\nrelied on Beta to assist in other types of scams, most\noften handling the distribution of fake checks as part\nof mystery shopper scams. By all accounts, this is\nshockingly similar to how Omega used Alpha in the\nfirst few years of Scattered Canary’s existence.\n\n\n\n - \u0007Specializes in romance scams\n\n - \u0007Provides Alpha with mule\naccounts set up by a network\nof romance scam victims\n\n - \u0007Provided more than 150 mule\naccounts in the last four years\n\n\nUnfortunately for the enterprises being targeted, Beta was not the only new member to join\nthe cybercriminal organization during this period of Scattered Canary’s rapid expansion. In\ntotal, 19 individuals joined the group in different capacities during this three-year period. Most\nof these new associates contributed to the group’s scams by providing a constantly fresh feed\nof new mule accounts to Alpha. Others came onboard to help facilitate other types of scams\nor build a more robust scamming infrastructure.\n\n###### GAMMA DELTA EPSILON\n\n\nJOINED SCATTERED STARTED WITH SCATTERED\nCANARY IN JANUARY 2017 CANARY IN APRIL 2016\n\n\n\n - \u0007Provides compromised bank\naccount information\n\n - \u0007Recently became involved in\nromance scams\n\n\n\n - \u0007Provides access to remote\nsystems that could be\naccessed via Remote Desktop\nProtocol (RDP)\n\n\n**19**\n\n\n-----\n\n###### 2017–Present: Becoming a Well-Oiled Machine\n\nBy 2017, Scattered Canary had business-critical tools and tactics in place and started to define\nfunctional roles across an ever-expanding array of revenue streams. Some group members\nwere responsible for managing BEC campaigns, some for forging checks and money orders,\nand still others for harvesting stolen credit card numbers for use in various cons. Like any\nrapidly-growing company, Scattered Canary took infrastructure into consideration and quickly\nadded Remote Desktop Protocol (RDP) servers to help them scale and coordinate operations.\nMeanwhile, the organization continued to market-test new approaches to defrauding a\ngrowing universe of victims.\n\n\nSimilar to how the group pivoted from individual victims to business targets during the\nprevious three-year period, Scattered Canary again set their sights on a new type of target\nin 2017—government agencies. Using personal information obtained from various sources,\nScattered Canary started perpetrating fraud against US federal and state government\nagencies. Notable targets include the ones listed here, among dozens of others.\n\n\n-----\n\nMuch of the fraudulent activity targeting government agencies has involved the use of a\ntechnique that takes advantage of a “feature” within Gmail accounts. Unlike most online\nservices, Google does not recognize periods in email addresses. Instead, the email address\nbadscammer007@gmail.com and bad.scammer.007@gmail.com are both interpreted as the\nsame address and route email sent to each of those addresses to the same account.\n\nSome cybercrime groups, including Scattered Canary, have exploited this feature by creating\nnumerous “dot variant” accounts on a single website that then directs communications for all\nof those accounts to a single Gmail account. This allows scammers to scale their operations\nmore effectively by removing the need to create and monitor a different email account for\nevery account they create on a website.\n\n\nGoogle Dot Accounts Used to File Fraudulent Tax Returns\n_Note: Actual Email Address Changed_\n\nUsing this tactic, Scattered Canary facilitated a significant amount of fraudulent activity\nagainst government institutions, including the following:\n\n\nFiled 13 fraudulent tax returns with a\nsingle online tax service\n\nSubmitted 12 change of address\nrequests with the US Postal Service\n\n\nApplied for Texas state unemployment\nbenefits under nine identities\n\nSubmitted applications for FEMA\ndisaster assistance under three\nidentities\n\n\nbenefit applications\n\n\nleast $65,000 in fraudulent credit.\n\n\nbenefit applications\n\n\n**21**\n\n\n-----\n\nWhile Scattered Canary’s targeting of government institutions demonstrates a notable\nevolution in their attacks, the group’s primary focus over the past few years has been\ncontinuing to improve their BEC phishing campaigns. In July 2018, following a trend we have\nobserved across the entire BEC threat landscape, Scattered Canary changed their preferred\ncash out mechanism from wire transfers to gift cards. For five months, the group’s primary\nfocus was to persuade employees to purchase Apple iTunes and Amazon gift cards based on a\nsupposed request from their CEO.\n\nLike other scammers involved in gift card BEC scams, Scattered Canary laundered the gift\ncards they received from victims through a peer-to-peer online cryptocurrency exchange\n[called Paxful. In our previous report on the Nigerian cybercriminal group Scarlet Widow, we](https://www.agari.com/insights/whitepapers/scarlet-widow-bec-scams/)\ndetailed the process by which stolen gift cards are converted into cash through a multi-step\nlaundering process using Paxful and other online cryptocurrency marketplaces.\n\n\nOver the five-month span that Scattered Canary focused on collecting gift cards in their BEC\nattacks, the group received at least 132 gift cards from victims, which netted them around\ntwo bitcoin once they were traded on Paxful. Based on the price range of bitcoin during this\nperiod, this translates to around $12,000 to $14,000 in profits. Interestingly, Scattered Canary\nabandoned gift cards as a BEC cash out method in November 2018, at the same time the price\nof bitcoin crashed.\n\n\nFrom <admin@410mb.com>\n\nTo\n\nSubject Re: One moment\n\n###### Okay.Kindly purchase physical Apple iTune gift cards for $1000 at any store,I will like them in the $100 denominations.Do scratch the silver lining gently and send me the picture of the cards with the receipt here via e mail attachment for reimbursement.\n\n Can you get on this now?\n\n Thanks\n\nSent from my iPad\n\n\nExample of a Scattered Canary BEC Email Asking for Gift Cards\n\n\n**22**\n\n\n-----\n\nAfter Scattered Canary moved on from gift card scams, they transitioned to another type of\nBEC attack: payroll diversion scams. In these types of scams, rather than socially engineering\na finance employee to wire money to a “vendor” account, the scammer targets employees in\na company’s human resources department to persuade them to change the direct deposit\naccount associated with a high-level executive’s payroll information.\n\nMessages\n\nFrom <exec1119@lycos.com>\n\nTo\n\nSubject Re: One moment\n\n###### I need you to help me with the change of my direct deposit information.Kindly let me know what is required.\n\n Thank you\n\nSent from my iPad\n\nExample of a Scattered Canary Payroll Diversion BEC Email\n\n\nFrom <exec1119@lycos.com>\n\nTo\n\nSubject Re: One moment\n\n###### I need you to help me with the change of my direct deposit information.Kindly let me know what is required.\n\n Thank you\n\nSent from my iPad\n\n\nOne of the reasons payroll diversion attacks have become a preferred BEC tactic for Scattered\n[Canary—as well as quickly emerging trend we’ve seen across the entire BEC threat landscape—](https://www.agari.com/email-security-blog/bec-gangs-payroll-scams/)\nis because of the ability to use easily accessible prepaid debit cards to receive payroll direct\ndeposits. These prepaid debit cards come with a corresponding bank account, and they’re\nmuch easier to set up. Rather than requiring a money mule to physically visit a bank branch to\nopen an account, the mule can simply register for a prepaid card online with a less stringent\napplication process and have a new card mailed directly to them. Combined with the fact\nthat most prepaid cards do not require credit checks, it is easy to see why this has become a\npopular method for scammers.\n\n\npopular method for scammers.\n\n\napplication process and have a new card mailed directly to them. Combined with the fact\n\n\nthat most prepaid cards do not require credit checks, it is easy to see why this has become a\n\n\npopular method for scammers.\n\n\n**23**\n\n\n-----\n\nThis tactic, along with the introduction of a fairly\nnew threat actor we’ve named Zeta, has allowed\nScattered Canary to scale their payroll diversion\nschemes very quickly. Since late 2017, Zeta\ncontributed the most prepaid card accounts to\nthe group and has fed Alpha with more than 140\nprepaid card numbers in the last eighteen months\nalone. Because of Scattered Canary’s focus and\nsuccess on this type of BEC scam, Zeta has quickly\nbecome one of the most impactful associates in\nthe group today.\n\nOverall, Scattered Canary’s membership has nearly\ndoubled over the past two years, adding another\n15 actors to help scale the group’s operations.\nWhile half of these new recruits came on board\nto harvest new BEC mule accounts, the other half\nwere involved in other scams during this time, such\nas mystery shopper scams and tax return fraud. In\ntotal, 35 actors have been tied to Scattered Canary’s\noperations since the group emerged in 2008.\n\n\n\n###### • \u0007Sends Alpha prepaid debit card information to be used in payroll diversion BEC attacks\n\n • \u0007Provided more than 140 prepaid cards in the last 18 months\n\n\n###### ETA\n\n\nJOINED SCATTERED\nCANARY IN JANUARY 2018\n\n\n\n - \u0007Provides Alpha guidance and\npersonal information used to\ncommit various scams, such\nas tax return fraud and\nSquare fraud\n\n\n\n - \u0007Sends Alpha mule accounts\nto be used for payroll\ndiversion scams\n\n - \u0007Provides direct deposit forms\nfor various payroll processing\nservices\n\n\n-----\n\n### Tools of the Trade  Anatomy of a BEC Scam\n\n###### A core component of a business email compromise attack is the email itself, which is the starting point for all successful BEC scams. Just as with romance scams, actors make use of scripts and templates they can copy-and-paste without having to create something on their own. In the case of Scattered Canary, these formats can be forwarded as a one-off task to group operatives to send to targets, or they can be shared as a collection in phishing kits. The components of a successful BEC attack include the following.\n\n\n###### Leads, Leads, Leads\n\nIn order to succeed in their BEC attacks, Scattered Canary first needed to find targets.\nTo do this, Scattered Canary, like other BEC criminal groups we’ve researched, uses online\ncommercial lead generation services—the same ones legitimate sales and marketing teams use\nall over the world. Like any startup, though, Scattered Canary wanted to pinch pennies and\nsave money.\n\n\nOne of the ways they did this was to use the Gmail dot variant account technique discussed\nearlier to sign up for a seven-day free trial period with a service like Lead411. The group would\nthen use the service to retrieve as many target leads as possible in the one-week timeframe.\nOnce the free trial ended, the group would let it lapse and then sign up for it again using\nthe same email address—but with periods in different places in the registered email address.\nScattered Canary did this a total of twenty times over a three-year period in order to maintain\naccess to this lead generation service without paying a monthly subscription.\n\nOnce the group had a list of leads, often for the Chief Financial Officer or other top executive,\nand corresponding information for the CEO, they could then begin sending their malicious emails.\n\n\n###### BEC “Formats”\n\n\nWhen it comes to engaging targets, Scattered Canary frequently maximized efficiencies\nthrough the use of scripts, or as some members of the group call them, “formats.” These\n\n\ncontaining 26 different message templates that could be used to target organizations in a\n\n\nformats are templated text documents that can contain several layers of phishing messages\n\n\n**25**\n\n\nformats are templated text documents that can contain several layers of phishing messages\n\n\n-----\n\n###### Br//\n\n VP Operations\n\n\n###### Hi\n As\n\n\n###### Let me know when to send the recipient details.\n\n\n###### Are you available in the office?Can we send an outgoing wire payment today?\n\n\n###### I will appreciate swift  correspondence.\n\n\n###### Let me know when to send the recipient details.\n\n\n###### Are you available in the office?Can we send an outgoing wire payment today?\n\n\n###### Thanks\n\n\n-----\n\n###### Bank Accounts to Transfer Funds\n\nThe next piece of the BEC puzzle Scattered Canary needed to solve was how to facilitate wire\ntransfers from victims without exposing the group’s own accounts. Beta specializes in romance\nscams and was the first Scattered Canary member to start providing these bank account and\nrouting numbers to Alpha.\n\n\nBy using social engineering, Alpha was able to convince organizations to send funds to\nromance victims. Once victims received the money, romance mule handlers would instruct\nthem to wire the money elsewhere, eventually making its way back to the actors. If more\naccounts were needed, the mule handler would simply ask the victims to open another\naccount for them, which is something Beta did with his victims.\n\n###### VPNs for (Hidden) VIPs\n\n\nWhile some actors do not hide the fact that they are operating from Nigeria, others have tried\nto mask their true locations. Scattered Canary maintained subscriptions for several pieces\nof software to communicate with potential BEC, check fraud, and romance scam victims\nwhile remaining somewhat anonymous. To accomplish this, the group made use of VPN\ninfrastructure and applications in order to make their traffic appear more legitimate.\n\n###### VOIP-Based Burner Phones\n\n\nOver an eight year period, Scattered Canary leveraged several methods for texting back\nand forth with victims. Three of the services the group used to engage with victims via SMS\nwere TextMe, Google Voice, and Hushed. While TextMe and Google Voice allow for unlimited\nmessaging, Hushed allows users to set up multiple phone numbers for voice and messaging\nfrom the city or country of their choice—a useful tactic for engaging with romance scam victims\nwho believed that the person they were communicating with was located in a specific place.\n\nFurthermore, the service allows users to switch to a new number whenever they wished. During\nour analysis, we were able to identify ten Hushed phone numbers that Scattered Canary used to\nengage with victims, as well as other threat actors and cybercrime groups. Of the ten Hushed\nphone numbers we identified, four were based in the United Kingdom. The remaining six were\nbased in the United States, with two in Alabama, and one each in Hawaii, Illinois, Connecticut,\nand Arkansas.\n\n\nIt is important to note that while Scattered Canary used Google Voice in romance scams\nspanning four years, the same phone number was used in a host of other schemes as well.\nStarting in late 2017, for instance, the actor listed it as a call-back number in fraudulent\napplications for Hurricane Harvey disaster recovery assistance, home mortgage assistance,\nonline loan applications, staffing agency services, and more. The point remains—few scams\nexist without a connection to one or more others run by the same criminal organization.\n\n\nStarting in late 2017, for instance, the actor listed it as a call-back number in fraudulent\napplications for Hurricane Harvey disaster recovery assistance, home mortgage assistance,\n\n\nexist without a connection to one or more others run by the same criminal organization.\n\n\n**27**\n\n\nonline loan applications, staffing agency services, and more. The point remains—few scams\n\n\n-----\n\n### Conclusion Where Do We Go From Here?\n\nWhen BEC first exploded in 2015, little was known about its origins or how it may relate to\nother types of fraud. In order to effectively defeat BEC and the threat actors behind it, it is\ncritically important that we step back and look at the bigger picture—regardless of how big\nthat picture may be.\n\n\nWith BEC overlapping with dozens of other types of scams—ranging from credit card and check\nfraud to romance scams to W-2 and payroll diversion schemes—approaching BEC as a singular\nproblem will not lead to success. Instead, it will only result in a frustrating game of digital\nwhack-a-mole, with no real success in finding and persecuting the actors responsible for it.\n\nIf Scattered Canary can be seen as a microcosm for the rapidly evolving organizations behind\ntoday’s most pernicious email scams, this report demonstrates that a much more holistic\napproach—one based on threat actor identity rather than type of fraudulent activity—is\nrequired to detect email fraud and protect organizations.\n\nThis fight is not just about business email compromise. It is about all types of fraud, no matter\nthe form it takes today—or tomorrow.\n\n\n**28**\n\n\n-----\n\n###### Appendix A – Email Addresses Associated with Scattered Canary BEC Attacks\n\n\n64gb@inbox.lv\n\nad177@lycos.com\n\n\nmyipad@homemail.com\n\nmyipad@internetemails.net\n\n\nadmin@410mb.com\n\nadmin@filesxoffice.net\n\n\nmyipad@lycos.com\n\nmyipad@mymacmail.com\n\n\nceo@admin-offices.com\n\nceo@emailceo.me\n\n\nmyipad@o26gb.com\n\nmyipad@o9mb.us\n\n\nceo@filesxoffice.net\n\nceo@ownmail.net\n\n\nmymac@ownmail.net\n\nmypersonal2016@yandex.com\n\n\nceocfo1956@yahoo.com\n\nconcrete.business@aol.com\n\n\noffmail912@gmail.com\n\nommail@inbox.lv\n\n\nemail_ceo@ownmail.net\n\nexec1119@lycos.com\n\n\nownmail@englandmail.com\n\nownmail@ownmail.net\n\n\nexec119@aol.com\n\nexec119@protonmail.com\n\nexec19@promessage.com\n\n\nprivate56@yandex.com\n\nmyipad@7mb.me\n\n\nexecutiveonly@yandex.com\n\nexecutiveonly1@mail.com\n\n\nmyipad@73mb.me\n\ntopman19@elitemail.org\n\n\nverizon@elitemail.org\n\nverizon@l0mb.me\n\n\nlpad@583mb.com\n\nme@9gp.in\n\n\nms519450@gmail.com\n\nmyipad@5uk.in\n\n\nverizon@o26gb.com\n\nverizon@o9mb.us\n\n\nverizon@o9d.in\n\nverizonmobile@ownmail.net\n\n\nmyipad@7mb.me\n\n\n**29**\n\n\n-----\n\n###### Appendix B – Historical Scattered Canary  Credential Phishing URLs\n\narnoremovals[.]com/wp-includes/rest-api/endpoints/onedrive_file/\n\n\nbelklucy[.]com/brit13/shares/\n\nbelklucy[.]com/opendocs/unlockfile/\n\n\nbreezewood[.]gq/onedrive_file/xb/\n\nbrokerlowongan[.]com/js/onedrive_file/xb/\n\n\nclippingabril[.]eanalises[.]com[.]br/INV-001/office/\n\nclippingabril[.]eanalises[.]com[.]br/INVOICE-002/office/\n\n\ncscrosall[.]online/document/office365/\n\ndretoz[.]com/administrator/onedrive_file/xb/\n\n\ndretoz[.]com/includes/onedrive_file/xb/\n\ndretoz[.]com/language/overrides/onedrive_file/xb/\n\n\ndretoz[.]com/plugins/authentication/onedrive/onedrive_file/xb/\n\ndretoz[.]com/plugins/authentication/onedrive_file/xb/\n\n\nearnhardtdrive[.]ga/onedrive/onedrive_file/xb/\n\nfeedbackrealtytrade[.]ml/onedrive_file/onedrive_file/xb/\n\n\nhinshawox[.]cf/dropboxx/home/\n\nhotelembassybodhgaya[.]com/Doc/viewaccess/\n\n\ninternationalvitamincorporation[.]dretoz[.]com/feedback/mirsoft[.]co/microsoftdocs/\n\njilikoyu[.]co[.]vu/bin/onedrive_file/xb/\n\n\njuliesurfacejohnson[.]com/solo/file/near/connecting/connecting/\n\njutenbag[.]com/images/onedrive_file/xb/\n\n\nonderivesecure[.]dretoz[.]com/onedrive_file/xb/\n\nonedrive[.]dretoz[.]com/onedrive_file/xb/\n\n\npeakit[.]pt/INVOICE-0001/office/\n\nrealtyisgoodbusiness[.]ml/office365/\n\n\nsamsunsehirrehberi[.]com/EXPENSE-9048848/office/\n\nsmpipd[.]sch[.]id/INVOICE-798261/office/\n\n\nwww[.]3lees[.]com/brit31/shares/\n\n\nunderarmour-ua[.]com\n\n\nunderarmour-ua[.]com\n\n\nwww[.]rll-eastafrica[.]com/shareeee/2015\n\n\nwww[.]feedbackrealtytrade[.]ml/onedrive_file/xb/\n\nwww[.]jackandjakesme[.]ml/bin/onedrive_file/xb/\n\n\n**30**\n\n\n-----\n\n###### AGARI CYBER INTELLIGENCE DIVISION\n\n The Agari Cyber Intelligence Division (ACID) is the only counterintelligence research team dedicated to worldwide BEC and spearphishing investigation. ACID supports Agari’s unique mission of protecting communications so that humanity prevails over evil. ACID uncovers identity deception tactics, criminal group dynamics, and relevant trends in advanced email attacks. Created by Agari in 2018, ACID helps to impact the cyber threat ecosystem and mitigate cybercrime activity by working with law enforcement and other trusted partners.\n\n**Agari Data, Inc.**\n950 Tower Lane, Suite 2000, Foster City, CA 94404\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.06.05.Scattered_Canary/scattered-canary.pdf"
    ],
    "report_names": [
        "scattered-canary"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cd06319e-56b8-4d0c-9c8b-de96a2d7c9df",
            "created_at": "2023-10-03T02:00:08.486231Z",
            "updated_at": "2025-03-27T02:00:03.138574Z",
            "deleted_at": null,
            "main_name": "Scattered Canary",
            "aliases": [],
            "source_name": "MISPGALAXY:Scattered Canary",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041395,
    "ts_creation_date": 1559737273,
    "ts_modification_date": 1559737280,
    "files": {
        "pdf": "https://archive.orkl.eu/da5367c9a88967ac55d056236f865d9f220995be.pdf",
        "text": "https://archive.orkl.eu/da5367c9a88967ac55d056236f865d9f220995be.txt",
        "img": "https://archive.orkl.eu/da5367c9a88967ac55d056236f865d9f220995be.jpg"
    }
}