{
    "id": "f7ab8af3-82be-4a59-8713-d5f1e4fa93e4",
    "created_at": "2022-10-25T16:48:21.194543Z",
    "updated_at": "2025-03-27T02:12:42.547727Z",
    "deleted_at": null,
    "sha1_hash": "660bd04b0d4b33301fcb47a98f3d671f126f66c0",
    "title": "The Mutter Backdoor: Operation Beebus with New Targets",
    "authors": "Fireeye",
    "file_creation_date": "2016-04-11T03:09:20Z",
    "file_modification_date": "2016-04-11T03:09:20Z",
    "file_size": 779372,
    "plain_text": "[Customer Stories](https://www.fireeye.com/customers.html) [Blogs](https://www.fireeye.com/blog.html)  \n\n\n# THE MUTTER BACKDOOR: OPERATION BEEBUS WITH NEW TARGETS\n\n[April 17, 2013 | by James T. Bennett | Threat Research, Advanced Malware, Targeted Attack](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-authors/cap-james-t-bennett)\n\nFireEye Labs has observed a series of related attacks against a dozen organizations in the aerospace, defense, and\ntelecommunications industries as well as government agencies located in the United States and India which have\nbeen occurring at least as early as December of 2011. In at least one case, a decoy document included in the attack\ncontained content that focused on Pakistan military advancements in unmanned vehicle, or “drone” technology.\n\nTechnically, these attacks exploited previously discovered vulnerabilities via document files delivered by email in\norder to plant a previously unknown backdoor onto victim systems. The malware used in these attacks employs a\nnumber of interesting techniques to “hide in plain sight” and to evade dynamic malware analysis systems. Similar to,\nthough not based on the attacks we saw in South Korea, the malware tries to stay inactive as long as possible to\nevade dynamic analysis detection methods.\n\n[We have linked these attacks back to Operation Beebus through the C&C infrastructure along with the similar targets](https://www.fireeye.com/blog/threat-research/2013/02/operation-beebus.html)\nand timeline observed. Although some of the targets of these attacks overlapped with Beebus targets, there were\nmany new targets discovered including some in India. As we uncover more targets related to these attacks, we are\nseeing a common link between them: unmanned vehicles, also known as “drones”. The set of targets cover all\naspects of unmanned vehicles, land, air, and sea, from research to design to manufacturing of the vehicles and their\nvarious subsystems. Other related malware have been discovered through the same C&C infrastructure that have a\nsimilar set of targets, that when included bring the total number of targets to more than 20 as of this writing. These\ntargets include some in academia which have received military funding for their research projects relating to\nunmanned vehicles.\n\n## INFILTRATION\n\nAll of the attacks we have observed occurred through document exploits attacking known vulnerabilities. We have\nseen RTF and XLS files used for delivery. Searching the internet for the author and document names yields\ninformation regarding South Asia politics. Although all of the document exploits we have analyzed drop a decoy\ndocument, most of them are either empty or filled with unreadable data with two exceptions.\n\n\n-----\n\nOne is an article about Pakistan’s indigenous UAV industry which is attributed to author Aditi Malhotra, an Indian\nwriter and Associate Fellow at the Centre for Land Warfare Studies (CLAWS) in New Delhi. Although we are not sure\nthis particular work is actually hers, we did find a reference to a similarly named article “Pakistan’s UAV programme:\nAmbitious, with some friendly help.” Unfortunately, this document was not available. Other works of hers on a similar\nnote include “India’s Silence on Chinese Incursions” and “China and Pakistan: Dangerous Liaisons.”\n\nThe other decoy document is contact info for an American with a military provided email address from Joint Base\nAndrews in Maryland, but with a physical address in Pakistan titled “Family Planning Association of Base (FPAB).” It\nlooks like they took the “Family Planning Association of Bangladesh” and combined it with “Joint Base Andrews.” The\ntitle of the email field is “FPAP Email”, “FPAP” could stand for “Family Planning Association of Pakistan.” Ultimately,\nwe could make no sense from this information.\n\n## THE MUTTER BACKDOOR\n\nTwo different versions of the same backdoor were used in all of these attacks. In every case we have found, the\nmain component is a DLL dropped by an executable compiled minutes after the DLL. The dropper shares the same\ndecoding functions as the DLL and performs some modifications on the DLL that will be described later. There was\none unique case we found where the initial dropper was a self­extracting archive that utilizes Visual Basic and batch\nscripts to download and install the DLL instead of extracting it from a resource.\n\nMutter is HTTP proxy aware, and attempts to determine if a proxy is required and what the proxy details are if\n\n\n-----\n\n“i”, which is set to an encoded representation of a string that follows this format:\n\n<Mutter version#>­<campaign marker?>­<victim hostname>­<victim IP address>\n\nWe are not certain about the second part of this string, it may be either a campaign marker or an extension of the\nversion number. In all our cases, it is set to either “SN0” or “SN1.\" Actual strings are shared in the appendix\ninformation at the end of this blog.\n\nThis HTTP request pictured in the screenshot is from the older version of Mutter. The newer versions of Mutter have\na very similar HTTP request, but with the Host and Connection headers swapped.\n\nThe response string is decoded and parsed for the following commands:\n\n“m”: executes a shell command\n\n“u”: uploads a file to the victim (downloads a file from the victim’s perspective)\n\n“d”: downloads a file to the attacker (uploads a file from the victim’s perspective)\n\n“R”: removes the auto­run registry value\n\nThese commands are referenced in the code in this order, and when said aloud it sounds like “mutter”, hence the\nname chosen for the malware. In the earlier version of this backdoor, the “d” command was referenced, but the code\nhad not been implemented yet. In both versions, another command string “f” appears along with the others, but is not\nreferenced in the code. This perhaps indicates a future feature to be added.\n\nThis malware employs several interesting evasion techniques. For starters, it employs several “hide in plain sight”\ntechniques common to malware used in targeted attacks. It specifies fake properties, pretending to be Google or\nMicrosoft.\n\n\n-----\n\nThis brings us to the next “hide in plain sight” tactic we noticed. Observe the size of the file above. It’s a whopping 41\nmegabytes. With rare exception, malware typically have a small size usually no larger than a few hundred kilobytes.\nWhen an investigator comes across a file megabytes in size, he may be discouraged from taking a closer look.\nInterestingly, the original size of this particular DLL is around 160 kilobytes, although the PE headers already indicate\nits future size as shown below. The dropper will decode this DLL from its resource section, drop it onto the victim’s\nsystem, and proceed to fill its resource section with randomly generated data. This has another useful side effect of\ngiving each DLL a unique hash, making it more difficult to identify.\n\n\n-----\n\nIn addition to these hiding techniques, this malware also appears to employ techniques to possibly evade dynamic\nmalware analysis systems. This has been an ongoing trend in malware development that we and others have\nobserved several times in past. The malware author will add code to delay the execution of the important\nfunctionality for some period of time with the idea being that if the malware stalls for long enough, the dynamic\nmalware analysis system will give up on it and pass it off as benign. This malware has two routines that we could find\nno other purpose than for such an evasion.\n\nOne routine is a function that simply runs a series of loops, incrementing a local variable over and over, thousands of\ntimes. It ultimately disregards the final value of this variable, meaning that the function serves no purpose. This\nfunction is called many times throughout the rest of the code. It may have been implemented for the purpose of\nwasting time.\n\nAnother routine seems to have a similar goal, but with a different approach. This time, a loop is implemented with a\ncall to sleep for a short time. This loop occurs many times, and each time it will also allocate a chunk of memory on\nthe heap, performing math operations on it and printing it to the console over and over again. Keep in mind that this\nmemory is not initialized to any value and is not used for anything later in the code, it is essentially junk memory. This\nseems to be another means of wasting time.\n\nWe detect this malware as Backdoor.APT.NS01.\n\n\n-----\n\nMost of the domains registered for C&C use in this campaign were done so through the free dynamic DNS Provider\nChangeIP.com. Dynamic DNS is a popular option for domain registration since it is free and provides a convenient\nlevel of anonymity. Looking at passive DNS records for other domains pointing to the IP addresses used to host the\nC&C services turned up many other related domains. Various subdomains of the domain winsupdate.com have\npointed to several IPs pointed to by the Mutter domains. This is interesting because this is the name of the folder\ncreated by Mutter on victims’ systems. Furthermore, this domain is not a publicly available dynamic DNS provider\nand the email address used to register this domain is binalakshminp@yahoo.com. We cannot be certain, but\nthis name could be in reference to Binalakshmi Nepram, a writer­activist born in Manipur India who is fighting for\ndisarmament. This fits the theme we have observed from other clues left behind in decoy documents. Another\ndomain that is indirectly linked is agfire.com with this interesting registration information.\n\nAgni is the Hindu god of fire. Notice the combination of India and China references here. The email address used to\nregister this domain was also referenced in a Chinese developer forum, but nothing else interesting was discovered\nabout it.\n\nThe IP addresses hosting the C&C services are scattered all over the world and are believed to be compromised\nhosts.\n\n## ATTACKERS, TARGETS, AND TIMELINE\n\n\n-----\n\nOperation Beebus. This link was made through finding several overlapping IP addresses used by Mutter and Beebus\nsuch as the following.\n\nThe theme of these attacks appears to be South Asia politics. The hints scattered throughout the documents and\ndomain registrant information were laid on pretty thick which is something be wary of. The only legible, sensible\ndecoy document observed so far is revealing of the interests of at least one of the targets of this campaign: namely\nthe military threat of Pakistan against India and its growing relationships with other countries including China. The\nparticular topic of this decoy document also appears to be a common link between most of the targets we have seen:\nunmanned vehicles.\n\nThe timeline below outlines the events specific to Mutter that we had visibility into. This campaign is still ongoing with\nMutter callbacks being made to this day.\n\n\n-----\n\n## APPENDIX\n\n### Documents\n\n\n**Exploit Document MD5:** b5f4a9aac67b53762ed98fafd067c803\n\n\n**Exploit:** CVE­2012­0158\n\n\n**Exploit Document Filename:** NA\n\n\n**Decoy Document Title:** Pakistan’s Indigenous UAV industry\n\n\n**Decoy Document Author:** GOPAL GURUNG\n\n\n**Decoy Document Last Modified:** Aug 2nd 2010\n\n\n**First Seen:** Aug 27th 2012\n\n\n**Exploit Document MD5:** 92643bfa4121f1960c43c78a3d53568b\n\n\n**Exploit:** CVE­2008­3005\n\n\n**Exploit Document Filename:** 2012_3_12.xls\n\n\n**Decoy Document Title:** NA\n\n\n-----\n\n**Decoy Document Last Modified:** Jan 26th 2003\n\n\n**First Seen:** Mar 22nd 2012\n\n\n**Exploit Document MD5:** 4d5a235048e94579aab0062057296186\n\n\n**Exploit:** CVE­2010­3333\n\n\n**Exploit Document Filename:** Change of Address.doc\n\n\n**Decoy Document Title:** Tele: 2619 4428\n\n\n**Decoy Document Author:** kdly\n\n\n**Decoy Document Last Modified:** Dec 6th 2011\n\n\n**First Seen:** Dec 7th 2011\n\n\n**Exploit Document MD5:** 589f10e2efdd98bfbdc34f247b6a347f\n\n\n**Exploit:** CVE­2010­3333\n\n\n**Exploit Document Filename:** Urgent message.doc\n\n\n**Decoy Document Title:** NA\n\n\n**Decoy Document Author:** Administrator\n\n\n**Decoy Document Last Modified:** Feb 2nd 2003\n\n\n**First Seen:** Mar 2nd 2012\n\n\n**Exploit Document MD5:** fd9777c90abb4b758b4aff29cfd68b98\n\n\n**Exploit:** CVE­2012­0158\n\n\n**Exploit Document Filename:** NA\n\n\n**Decoy Document Title:** Tariq Masud\n\n\n**Decoy Document Author:** Haroon­ur­Rashid/Administrator\n\n\n**Decoy Document Last Modified:** Sept 11 2012\n\n\n**First Seen:**\n\n\n### Malware\n\n\n**Dropper Filename:** update.exe\n\n\n**Dropper MD5:** 725fc0d7a8e7b9e01a83111619744b6f\n\n\n**DLL Filename:** msdsp.dll\n\n\n**Mutex:** 654234576804d\n\n\n-----\n\n**Compile Time:** Aug 28th 2012\n\n\n**Dropper Filename:** igfxtray.exe\n\n\n**Dropper MD5:** 681a014e9d221c1003c54a2a9a1d9df8\n\n\n**DLL Filename:** winsups.dll\n\n\n**Mutex:** mqe45tex13fw14op0\n\n\n**C&C Host:** http.4pu.com:80\n\n\n**Decoded 'i' Value:** V0.7­SN0­<hostname>h;­<IP address>\n\n\n**Compile Time:** Aug 28th 2012\n\n\n**Dropper Filename:** NA\n\n\n**Dropper MD5:** 6aac76fc8309e29ea8a7afea48ae9b29\n\n\n**DLL Filename:** msdsp.dll\n\n\n**Mutex:** 654234576804d\n\n\n**C&C Host:** oracledata.ns01.us:80\n\n\n**Decoded 'i' Value:** V0.9.6X­SN1­<hostname>­<IP address>\n\n\n**Compile Time:** Aug 12th 2012\n\n\n**Dropper Filename:** ctfmon.exe\n\n\n**Dropper MD5:** d5640ae049779bbb068eff08616adb95\n\n\n**DLL Filename:** winsups.dll\n\n\n**Mutex:** mqe45tex13fw14op0\n\n\n**C&C Host:** mydns.dns2.us:443\n\n\n**Decoded 'i' Value:** V0.7­SN0­<hostname>­<IP address>\n\n\n**Compile Time:** Aug 2nd 2010\n\n\n**Dropper Filename:** igfxtray.exe\n\n\n**Dropper MD5:** 681a014e9d221c1003c54a2a9a1d9df8\n\n\n**DLL Filename:** winsups.dll\n\n\n**Mutex:** mqe45tex13fw14op0\n\n\n**C&C Host:** http.4pu.com:80\n\n\n**Decoded 'i' Value:** V0.7­SN0­<hostname>­<IP address>\n\n\n**Compile Time:** Aug 2nd 2010\n\n\n**Dropper Filename:** igfxpers exe\n\n\n-----\n\n**DLL Filename:** msdsp.dll\n\n\n**Mutex:** NA\n\n\n**C&C Host:** NA\n\n\n**Decoded 'i' Value:** NA\n\n\n**Compile Time:**\n\n\nThanks to Darien Kindlund for his assistance in research.\n\n[This entry was posted on Wed Apr 17 15:49:57 EDT 2013 and filed under Advanced Malware, Blog, James T.](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-threat-research/threat-research/malware-research)\n[Bennett, Targeted Attack and Threat Research.](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-threat-research/threat-research/targeted-attack)\n\n## SIGN UP FOR \n EMAIL UPDATES\n\nFirst Name Last Name\n\nEmail Address\n\n**Executive Perspective Blog**\n\n**Threat Research Blog**\n\n**Products and Services Blog**\n\nSubscribe\n\n[Products](https://www.fireeye.com/products.html)\n\n[Solutions](https://www.fireeye.com/solutions.html)\n\n[Mandiant Consulting](https://www.fireeye.com/services.html)\n\n[Current Threats](https://www.fireeye.com/current-threats.html)\n\n[Partners](https://www.fireeye.com/partners.html)\n\n[Support](https://www.fireeye.com/support.html)\n\n\n-----\n\n[Careers](https://www.fireeye.com/company/jobs.html)\n\n[Press Releases](https://www.fireeye.com/company/press-releases.html)\n\n[Webinars](https://www.fireeye.com/company/webinars.html)\n\n[Events](https://www.fireeye.com/company/events.html)\n\n[Investor Relations](http://investors.fireeye.com/)\n\n[Incident?](https://www.fireeye.com/company/incident-response.html)\n\n[Contact Us](https://www.fireeye.com/company/contact-us.html)\n\n[Communication Preferences](https://www2.fireeye.com/manage-your-preferences.html)\n\n[Report Security Issue](https://www.fireeye.com/company/security.html)\n\n[Supplier Documents](https://www.fireeye.com/company/supplier.html)\n\n[Legal Documentation](https://www.fireeye.com/company/legal.html)\n\n\n##       \n\n\n[LinkedIn](https://www.linkedin.com/company/fireeye)\n\n[Twitter](https://twitter.com/fireeye)\n\n[Facebook](https://www.facebook.com/FireEye)\n\n[Google+](https://plus.google.com/+Fireeye/posts)\n\n[YouTube](https://www.youtube.com/user/FireEyeInc)\n\n[Podcast](https://itunes.apple.com/us/podcast/eye-on-security/id1073779629?mt=2)\n\n[Glassdoor](http://www.glassdoor.com/Overview/Working-at-FireEye-EI_IE235161.11,18.htm)\n\n\n**Contact Us:**\n877­FIREEYE (877­347­3393)\n\nCopyright © 2016 FireEye, Inc. All rights reserved.\n\n[Privacy & Cookies Policy | Safe Harbor](https://www.fireeye.com/company/privacy.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/zg8cx9of6h9kdol7wwvgz8lxkqlvyr2p"
    ],
    "report_names": [
        "FireEye_The-Mutter-Backdoor-Operation-Beebus-with-New-Targets(Apr-17-13)"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d18fe42c-8407-4f96-aee0-a04e6dce219a",
            "created_at": "2023-01-06T13:46:38.275292Z",
            "updated_at": "2025-03-27T02:00:02.79092Z",
            "deleted_at": null,
            "main_name": "APT12",
            "aliases": [
                "Calc Team",
                "IXESHE",
                "BRONZE GLOBE",
                "BeeBus",
                "DynCalc",
                "DNSCalc",
                "Crimson Iron",
                "NUMBERED PANDA",
                "TG-2754",
                "Group 22"
            ],
            "source_name": "MISPGALAXY:APT12",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dabb6779-f72e-40ca-90b7-1810ef08654d",
            "created_at": "2022-10-25T15:50:23.463113Z",
            "updated_at": "2025-03-27T02:00:55.47619Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "APT1",
                "Comment Crew",
                "Comment Group",
                "Comment Panda"
            ],
            "source_name": "MITRE:APT1",
            "tools": [
                "Seasalt",
                "ipconfig",
                "Cachedump",
                "PsExec",
                "GLOOXMAIL",
                "Lslsass",
                "PoisonIvy",
                "WEBC2",
                "Mimikatz",
                "gsecdump",
                "Pass-The-Hash Toolkit",
                "Tasklist",
                "xCmd",
                "pwdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c5f79f58-db78-4cd7-88cf-c029a2199360",
            "created_at": "2022-10-25T16:07:23.325227Z",
            "updated_at": "2025-03-27T02:02:09.738383Z",
            "deleted_at": null,
            "main_name": "APT 12",
            "aliases": [
                "APT 12",
                "BeeBus",
                "Bronze Globe",
                "CTG-8223",
                "Calc Team",
                "Crimson Iron",
                "DNSCalc",
                "DynCALC",
                "Group 22",
                "Numbered Panda"
            ],
            "source_name": "ETDA:APT 12",
            "tools": [
                "AUMLIB",
                "ETUMBOT",
                "Exploz",
                "Graftor",
                "HIGHTIDE",
                "IHEATE",
                "IXESHE",
                "RIPTIDE",
                "RapidStealer",
                "Specfix",
                "THREEBYTE",
                "bbsinfo",
                "mswab",
                "yayih"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716501,
    "ts_updated_at": 1743041562,
    "ts_creation_date": 1460344160,
    "ts_modification_date": 1460344160,
    "files": {
        "pdf": "https://archive.orkl.eu/660bd04b0d4b33301fcb47a98f3d671f126f66c0.pdf",
        "text": "https://archive.orkl.eu/660bd04b0d4b33301fcb47a98f3d671f126f66c0.txt",
        "img": "https://archive.orkl.eu/660bd04b0d4b33301fcb47a98f3d671f126f66c0.jpg"
    }
}