{
    "id": "f7ae78da-5edf-48bb-9621-79a3f690df95",
    "created_at": "2023-01-12T15:09:21.956056Z",
    "updated_at": "2025-03-27T02:05:58.257441Z",
    "deleted_at": null,
    "sha1_hash": "089d5280151b8ba578243e7def4495c1510a1e88",
    "title": "2020-10-14 - Secret Stealing Trojan Active in Brazil Releases the New Framework SolarSys",
    "authors": "",
    "file_creation_date": "2022-05-28T03:46:36Z",
    "file_modification_date": "2022-05-28T03:46:36Z",
    "file_size": 558667,
    "plain_text": "# Secret-stealing Trojan active in Brazil releases the new framework SolarSys\n\n**[blog.360totalsecurity.com/en/secret-stealing-trojan-active-in-brazil-releases-the-new-framework-solarsys/](https://blog.360totalsecurity.com/en/secret-stealing-trojan-active-in-brazil-releases-the-new-framework-solarsys/)**\n\nOctober 14, 2020\n\nOct 14, 2020kate\n\n[Tweet](https://twitter.com/share)\n\n[Learn more about 360 Total Security](https://www.360totalsecurity.com/en/)\nRecently, 360 Security Center has detected a variety of hacking Trojans through the fileless\nattack protection function，and Trojans spread through the new Trojan distribution\nframework. According to the framework’s peculiar naming method, we named it SolarSys.\nSolarSys is mainly active in Brazil (South America), and Brazil has always been one of the\nregions where banking Trojans are extremely active. The SolarSys framework is mainly\ncomposed of JavaScript backdoors, mail worms and multiple spy modules. The overall\nstructure is as follows:\n\nThe framework uses dozens of dynamic domain names as C&C server addresses and uses\nthe word-combination of DGA algorithm to generate domain names randomly. When security\nvendors block some of the domain names, hackers will quickly activate new domain names\nto ensure that the overall botnet will not be affect. The domain name that generates logic is\nas follows:\n\n\n-----\n\n## Backdoor components\n\nAt first, we intercepted a large number of fake MSI installers, many of them were Java,\nMicrosoft Html help and other programs. After the program runs, it will call InstallUtil\n(T1218.004) to execute the malicious .Net dynamic library uninstall.dll:\n\n\n-----\n\nuninstall.dll uses the interface provided by the Microsoft.Jscript module to execute the\nJavaScript backdoor in memory, register itself as a self-starting, and run Install.js according\nto the configuration file issued by the cloud:\n\nInstall.js downloads and executes the latest virus module execution every 11 hours:\n\n\n-----\n\nDownloaded components are used in Delphi, and both use the same core code obfuscator to\nobfuscate, confuse code as follows:\n\n\n-----\n\nThe algorithm for decrypting core PE files is as follows:\n\n\n-----\n\nThen get the backdoor instruction and execute it after parsing, the instruction content is as\nfollows:\n\n## Mail worm\n\nSolarSys will deploy a set of nodejs environment on user computers and run malicious\nJavaScript scripts. By simulating a click, send a phishing email to the current user’s friend:\n\n\n-----\n\nThe content of the phishing email sent by the remote server configuration:\n\n\n-----\n\nThe attachment of the phishing email is as follows:\n\n\n-----\n\nThe attachment uses template injection technology to download other malicious payloads:\n\n\n-----\n\nUnfortunately, we did not obtain the documents corresponding to the template during the\nanalysis process. It is estimated that the Trojan will be updated and distributed through this\nchannel in the future：\n\n## Spy components\n\nThe final released payload of chstea01.rar is the stealing module for Google Chrome\nbrowser. The stolen data includes the account password for logging in to the website,\nbrowsing history, etc. The code logic is as follows:\n\nThe final payload corresponding to BOM.bin is a banking Trojan. By detecting the webpage\nthe user browses, the fake online banking login interface shown in the figure below pops up,\ntricking the user into entering various credentials for login, and submitting these credentials\nto the hacker. Fraudulent banks include Banco do Nordeste, Banco Mercantil, CrediSIS,\nBanrisul, Safra, Banco do Brasil, Bradesco, Banco Itaú, Santander, Sicoob, banco inter,\nBanestes, Banpará and other banks in Brazil.\n\n\n-----\n\nSolarSys is a new Spy Trojan distribution framework. As of press time, only 360 company on\nVirusTotal can detect and kill the Trojan:\n\nTherefore, we recommend that the majority of users install the 360 Total Security to defend\nand kill the SolarSys in time:\n\n\n-----\n\nmd5:\n\nc53210e162e9eda370cf95dc6e1d1459\n\n276e306850bc2b3b14addaec65e3c8bf\n\n45fe933866d02a45d081b737251e04f9\n\n3d724dca9d42239aa606d2f90f325945\n\n31e4b10819b36989f9e6853a79d5bd45\n\n319d5239f301b0cf00a3d3aff7d0057f\n\n[Learn more about 360 Total Security](https://www.360totalsecurity.com/en/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-14 - Secret Stealing Trojan Active in Brazil Releases the New Framework SolarSys.pdf"
    ],
    "report_names": [
        "2020-10-14 - Secret Stealing Trojan Active in Brazil Releases the New Framework SolarSys.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536161,
    "ts_updated_at": 1743041158,
    "ts_creation_date": 1653709596,
    "ts_modification_date": 1653709596,
    "files": {
        "pdf": "https://archive.orkl.eu/089d5280151b8ba578243e7def4495c1510a1e88.pdf",
        "text": "https://archive.orkl.eu/089d5280151b8ba578243e7def4495c1510a1e88.txt",
        "img": "https://archive.orkl.eu/089d5280151b8ba578243e7def4495c1510a1e88.jpg"
    }
}