{
    "id": "f7c488f7-70e0-44eb-a289-b2509b51681e",
    "created_at": "2023-01-12T15:05:09.096274Z",
    "updated_at": "2025-03-27T02:06:11.670582Z",
    "deleted_at": null,
    "sha1_hash": "e2b04ba464a0aa03da1ac8ac15eb5c30efeae1e7",
    "title": "2020-12-08 - Unauthorized Access of FireEye Red Team Tools",
    "authors": "",
    "file_creation_date": "2022-05-28T00:41:25Z",
    "file_modification_date": "2022-05-28T00:41:25Z",
    "file_size": 77457,
    "plain_text": "# Unauthorized Access of FireEye Red Team Tools\n\n**[fireeye.com/blog/threat-research/2020/12/unauthorized-access-of-fireeye-red-team-tools.html](https://www.fireeye.com/blog/threat-research/2020/12/unauthorized-access-of-fireeye-red-team-tools.html)**\n\nThreat Research\n\nFireEye\n\nDec 08, 2020\n\n3 mins read\n\nThreat Research\n\n**Overview**\n\nA highly sophisticated state-sponsored adversary stole FireEye Red Team tools. Because we\nbelieve that an adversary possesses these tools, and we do not know whether the attacker\nintends to use the stolen tools themselves or publicly disclose them, FireEye is releasing\nhundreds of countermeasures with this blog post to enable the broader security community\n\n\n-----\n\nto protect themselves against these tools. We have incorporated the countermeasures in our\nFireEye products—and shared these countermeasures with partners, government agencies\n—to significantly limit the ability of the bad actor to exploit the Red Team tools.\n\n**You can find a list of the countermeasures on the FireEye GitHub repository found**\n**[HERE.](https://github.com/mandiant/red_team_tool_countermeasures)**\n\n**Red Team Tools and Techniques**\n\nA Red Team is a group of security professionals authorized and organized to mimic a\npotential adversary’s attack or exploitation capabilities against an enterprise’s security\nposture. Our Red Team’s objective is to improve enterprise cyber security by demonstrating\nthe impacts of successful attacks and by showing the defenders (i.e., the Blue Team) how to\ncounter them in an operational environment. We have been performing Red Team\nassessments for customers around the world for over 15 years. In that time, we have built up\na set of scripts, tools, scanners, and techniques to help improve our clients’ security\npostures. Unfortunately, these tools were stolen by a highly sophisticated attacker.\n\nThe stolen tools range from simple scripts used for automating reconnaissance to entire\nframeworks that are similar to publicly available technologies such as CobaltStrike and\nMetasploit. Many of the Red Team tools have already been released to the community and\n[are already distributed in our open-source virtual machine, CommandoVM.](https://github.com/mandiant/commando-vm)\n\nSome of the tools are publicly available tools modified to evade basic security detection\nmechanisms. Other tools and frameworks were developed in-house for our Red Team.\n\n**No Zero-Day Exploits or Unknown Techniques**\n\nThe Red Team tools stolen by the attacker did not contain zero-day exploits. The tools apply\nwell-known and documented methods that are used by other red teams around the world.\nAlthough we do not believe that this theft will greatly advance the attacker’s overall\ncapabilities, FireEye is doing everything it can to prevent such a scenario.\n\nIt’s important to note that FireEye has not seen these tools disseminated or used by any\nadversaries, and we will continue to monitor for any such activity along with our security\npartners.\n\n**Detections to Help the Community**\n\nTo empower the community to detect these tools, we are publishing countermeasures to help\norganizations identify these tools if they appear in the wild. In response to the theft of our\nRed Team tools, we have released hundreds of countermeasures for publicly available\ntechnologies like OpenIOC, Yara, Snort, and ClamAV.\n\n\n-----\n\n[A list of the countermeasure is available on the FireEye GitHub repository found here. We](https://github.com/mandiant/red_team_tool_countermeasures)\nare releasing detections and will continue to update the public repository with overlapping\ncountermeasures for host, network, and file-based indicators as we develop new or refine\nexisting detections. In addition, we are publishing a list of CVEs that need to be addressed to\nlimit the effectiveness of the Red Team tools on the GitHub page.\n\n**FireEye Products Protect Customers Against These Tools**\n\nTeams across FireEye have worked to build the countermeasures to protect our customers\nand the broader community. We have incorporated these countermeasures into our products\nand shared these countermeasures with our partners, including the Department of Homeland\nSecurity, who have incorporated the countermeasures into their products to provide broad\ncoverage for the community.\n\n[More information on the detection signatures available can be found in the GitHub repository.](https://github.com/mandiant/red_team_tool_countermeasures)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-08 - Unauthorized Access of FireEye Red Team Tools.pdf"
    ],
    "report_names": [
        "2020-12-08 - Unauthorized Access of FireEye Red Team Tools.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535909,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653698485,
    "ts_modification_date": 1653698485,
    "files": {
        "pdf": "https://archive.orkl.eu/e2b04ba464a0aa03da1ac8ac15eb5c30efeae1e7.pdf",
        "text": "https://archive.orkl.eu/e2b04ba464a0aa03da1ac8ac15eb5c30efeae1e7.txt",
        "img": "https://archive.orkl.eu/e2b04ba464a0aa03da1ac8ac15eb5c30efeae1e7.jpg"
    }
}