{
    "id": "f806db46-e23a-41d8-9ecb-5b453e931cdc",
    "created_at": "2023-01-12T15:09:20.75482Z",
    "updated_at": "2025-03-27T02:16:59.200575Z",
    "deleted_at": null,
    "sha1_hash": "176c8aeba0f8431b106478b9d8926aaba812ea9c",
    "title": "2019-10-10 - ESET discovers Attor, a spy platform with curious GSM fingerprinting",
    "authors": "",
    "file_creation_date": "2022-05-28T02:46:21Z",
    "file_modification_date": "2022-05-28T02:46:21Z",
    "file_size": 381659,
    "plain_text": "# ESET discovers Attor, a spy platform with curious GSM fingerprinting\n\n**welivesecurity.com/2019/10/10/eset-discovers-attor-spy-platform/**\n\nOctober 10, 2019\n\nESET researchers discover a previously unreported cyberespionage platform used in targeted attacks against diplomatic missions and\ngovernmental institutions, and privacy-concerned users\n\n[Zuzana Hromcová](https://www.welivesecurity.com/author/zhromcova/)\n10 Oct 2019 - 11:30AM\n\nESET researchers discover a previously unreported cyberespionage platform used in targeted attacks against diplomatic missions and\ngovernmental institutions, and privacy-concerned users\n\nESET researchers have discovered a new espionage platform with a complex architecture, a host of measures to make detection and\nanalysis more difficult and two notable features. First, its GSM plugin uses the AT command protocol, and second, it uses Tor for its network\ncommunications. ESET researchers thus named the cyberespionage platform Attor.\n\n[AT commands, TOR-based communications: Meet Attor, a fantasy creature and also a spy platform](https://www.welivesecurity.com/wp-content/uploads/2019/10/ESET_Attor.pdf)\n\n[Download Research Paper](https://www.welivesecurity.com/wp-content/uploads/2019/10/ESET_Attor.pdf)\n\n\n-----\n\n## Targets\n\nAttor’s espionage operation is highly targeted – we were able to trace Attor’s operation back to at least 2013, yet we only identified a few\ndozen victims. Despite that, we were able to learn more about the intended victims by analyzing artifacts in the malware.\n\nFor example, in order to be able to report on the victim’s activities, Attor monitors active processes to take screenshots of selected\napplications. Only certain applications are targeted – those with specific substrings in the process name or window title.\n\nBesides standard services such as popular web browsers, instant messaging applications and email services, the list of targeted applications\ncontains several Russian services, as detailed in Table 1.\n\n**Table 1. Domains misused in the campaign**\n\n**Process name/window title substring** **Context**\n\nОДНОКЛАССНИКИ (transl. Classmates) [Russian social network (Odnoklassniki)](https://ok.ru/)\n\nAGENTVKONTAKTE [Russian social network (VKontakte)](https://vk.com/)\n\nWEBMONEY Online payment system used in Russia\n[(WebMoney)](https://www.webmoney.ru/)\n\n\nMAIL.YANDEX, ЯНДЕКС.ПОЧТА (transl. Yandex.Mail), MAIL.RU, POCHTA (transl. Mail),\nMAGENT\n\n\n[Russian email services (Mail.ru,](https://mail.ru/) [Yandex.Mail)](https://mail.yandex.com/)\n\n\nПРИГЛАШЕНИЕ ДРУЖИТЬ (transl. Friend request) Russian text\n\nВАМ СООБЩЕНИЕ (transl. Message for you) Russian text\n\nMULTIFON Russian VoIP service\n\nQIP, INFIUM [Russian IM application (QIP)](https://qip.ru/)\n\nRAMBLER [Russian search engine (Rambler)](https://www.rambler.ru/)\n\nThe list includes the two most popular social networks in Russia (Odnoklassniki, VKontakte) and a VoIP service provided by a Russian\ntelecom operator (Multifon). Our conclusion is that Attor is specifically targeting Russian-speakers, which is further supported by the fact that\nmost of the targets are located in Russia, as seen in Figure 1. Other targets are located in Eastern Europe, and they include diplomatic\nmissions and governmental institutions.\n\n_Figure 1. Countries affected by Attor_\n\nIn addition to its geographical and language targeting, Attor’s creators appear to be specifically interested in users concerned about their\nprivacy.\n\nAttor is configured to capture screenshots of encryption/digital signature utilities, the VPN service HMA, end‑to‑end encryption email services\nHushmail and The Bat!, and the disk encryption utility TrueCrypt.\n\n\n-----\n\ne ct s usage o ueC ypt s u t e spected a ot e pa t o tto t o to s a d d s de ces co ected to t e co p o sed\ncomputer, and searches for the presence of TrueCrypt. If TrueCrypt is detected, its version is determined by sending IOCTLs to the TrueCrypt\ndriver (0x222004 (TC_IOCTL_GET_DRIVER_VERSION) and 0x72018 (TC_IOCTL_LEGACY_GET_DRIVER_VERSION)). As these are\nTrueCrypt-specific control codes, not standard codes, the authors of the malware must actually understand the open-source code of\nTrueCrypt installer. We have not seen this technique used before nor seen it documented in other malware.\n\n_Figure 2. The Device monitor plugin sends non-standard, TrueCrypt-specific control codes to the TrueCrypt driver, in order to determine the TrueCrypt_\n\n_version_\n\n## Platform architecture\n\nAttor consists of a dispatcher and loadable plugins, all of which are implemented as dynamic-link libraries (DLLs). The first step of a\ncompromise comprises dropping all these components on disk and loading the dispatcher DLL.\n\nThe dispatcher is the core of the whole platform – it serves as a management and synchronization unit for the additional plugins. On each\nsystem start, it injects itself into almost all running processes and loads all available plugins within each of these processes. As an exception,\nAttor avoids injection into some system and security‑product‑related processes.\n\nAll plugins rely on the dispatcher for implementing basic functionalities. Rather than calling Windows API functions directly, the plugins use a\nreference to a helper function (a function dispatcher) implemented by the dispatcher DLL. A reference to the function dispatcher is passed to\nthe plugins when they are loaded. Because the plugins are injected in the same process as the dispatcher itself, they share the same address\nspace and are thus able to call this function directly.\n\nCalls to the function dispatcher take as their arguments the function type and its numerical identifier. This design makes it harder to analyze\nindividual components of Attor without having access to the dispatcher, as it translates the specified identifier to a meaningful function that is\nthen executed.\n\nFigure 3 illustrates a part of one plugin, calling the function dispatcher on several occasions. In the disassembly on the right, we have\nreplaced the numeric identifiers (that we recovered by reverse-engineering the dispatcher) with descriptive names. Refer to our white paper\nfor a full analysis of the dispatcher’s interface.\n\n\n-----\n\n_Figure 3. Additional plugins use functions implemented in the main module, by calling the function dispatcher (dubbed helperFnc here)_\n\nFurthermore, the dispatcher is the only component of the platform that has access to the configuration data. Attor’s plugins retrieve their\nconfiguration data from the dispatcher via the interface, as described above.\n\n## Plugins\n\nAttor’s plugins are delivered to the compromised computer as DLLs, asymmetrically encrypted with RSA. The plugins are only fully recovered\nin memory, using the public RSA key embedded in the dispatcher. As a result, it is difficult to obtain Attor’s plugins, and to decrypt them,\nwithout access to the dispatcher.\n\nWe were able to recover eight of Attor’s plugins, some in multiple versions – we list them in Table 2. Assuming the numbering of plugins is\ncontinuous, and that actors behind Attor may use different sets of plugins on a per‑victim basis, we suspect there are even more plugins that\nhave not yet been discovered.\n\n**Table 2. The analyzed plugins and their versions**\n\n**Plugin ID** **Analyzed versions** **Functionality**\n\n0x01 0x0E Device monitor\n\n0x02 (no version), 0x0C Screengrabber\n\n0x03 (no version), 0x08, 0x09, 0x0B, 0x0C Audio recorder\n\n0x05 0x0A File uploader\n\n\n-----\n\n**Table 2. The analyzed plugins and their versions**\n\n0x06 0x0A Command dispatcher/SOCKS proxy\n\n0x07 0x02, 0x04, 0x09, 0x0A Key/clipboard logger\n\n0x0D 0x03 Tor client\n\n0x10 0x01 Installer/watchdog\n\nThe plugins are responsible for persistence of the platform (Installer/watchdog plugin), for collecting sensitive information (Device monitor,\nScreengrabber, Audio recorder, Key/clipboard logger) and for network communication with the C&C server (File uploader, Command\ndispatcher/SOCKS proxy, Tor client).\n\nAttor has built-in mechanisms for adding new plugins, for updating itself, and for automatically exfiltrating collected data and log files. These\nmechanisms are illustrated in Figure 4.\n\nIn the following sections, we focus on plugins responsible for the two notable features that gave Attor its name – GSM fingerprinting via AT\ncommands, and elaborate network communication using Tor.\n\n_Figure 4. Attor’s architecture. Note that ID 0x06 represents a single plugin, but the functionality is split here into two parts for clarity._\n\n## Network communication\n\nAttor’s espionage plugins collect sensitive data (such as a list of documents present on the disk) that are ultimately exfiltrated to a remote\nserver, but these plugins themselves do not communicate over the network.\n\nOnly two of Attor’s components communicate with its C&C server: File uploader and Command dispatcher.\n\nFiles collected by the “espionage plugins” (Device monitor, Screengrabber, Audio recorder, and Key/clipboard logger) are uploaded to the\nC&C server automatically by the File uploader plugin. These plugins use a dedicated Upload folder as a central folder to store collected data,\nand other plugins use it to store log files.\n\n\n-----\n\ne Co a d d spatc e p ug do oads co a ds a d add t o a too s o t e C&C se e a d te p ets t e ga, t uses\ndedicated folders to store its data – most prominently, freshly downloaded plugins and platform updates, and encrypted log data containing\nstatus/results of the executed commands.\n\nAttor’s dispatcher monitors the shared folders, and loads any new plugins and updates pushed to the compromised computer.\n\nThis means that neither Attor’s dispatcher, nor espionage plugins, ever communicate with the C&C server – they only use local shared folders\nfor storing data to be exfiltrated and for reading further instructions from the server.\n\nBoth File uploader, and Command dispatcher use the same infrastructure to reach the remote server – the network communication itself is\nscattered across four different Attor components, each implementing a different layer.\n\nAttor uses Tor: Onion Service Protocol, with an onion address for the C&C server. In order to communicate with the C&C server, any plugin\nmust thus first establish a connection with the Tor client plugin (listening on the non‑default 127.0.0.1:8045) which is responsible for resolving\nthe onion domain, choosing a circuit and encrypting data in layers. The Tor client plugin is based on the Tor client, and customized to the\ndesign of this malware (tor.exe with added interaction with Attor’s dispatcher).\n\nThe Tor client plugin must communicate with the dispatcher, which implements the cryptographic functions. Furthermore, it communicates\nwith the SOCKS proxy plugin (listening on 127.0.0.1:5153) that relays communications between the Tor client and the remote server.\n\nBoth File uploader and Command dispatcher use FTP; files are uploaded to/downloaded from an FTP server that is protected by credentials\nhardcoded in the configuration:\n\n**C&C server: idayqh3zhj5j243t[.]onion**\n**Username: do**\n**Password: [Redacted]**\n\nThe plugins log in to the FTP server and copy the collected data to, or download commands from, a victim‑specific directory.\n\nIn total, the infrastructure for C&C communication spans four Attor components – the dispatcher providing encryption functions, and three\nplugins implementing the FTP protocol, the Tor functionality and the actual network communication, as illustrated in Figure 5. This mechanism\nmakes it impossible to analyze Attor’s network communication unless all pieces of the puzzle have been collected.\n\n\n-----\n\n_Figure 5. Four Attor components cooperate to enable communication with the C&C server_\n\nIt is important to note that Attor uses several additional tricks to hide its communications from the user and security products:\n\nFirst, the C&C server is a Tor service, aiming for anonymity and untraceability.\n\nSecond, all network-communication-related plugins are only activated if running within the process of a web browser or an instant messaging\napplication or other network applications (this is determined by checking the process name against a hardcoded list). This trick hides the\nexfiltration-related network communication in a stream of legitimate communications made by that application, and thus reduces the risk of\nraising any suspicion.\n\n## GSM fingerprinting\n\nThe most curious plugin in Attor’s arsenal collects information about both connected modem/phone devices and connected storage drives,\nand about files present on these drives. It is responsible for collection of metadata, not the files themselves, so we consider it a plugin used\nfor device fingerprinting, and hence likely used as a base for further data theft.\n\nWhile Attor’s functionality of fingerprinting storage drives is rather standard, its fingerprinting of GSM devices is unique.\n\nWhenever a modem or a phone device is connected to a COM port, Device monitor uses AT commands to communicate with the device, via\nthe associated serial port.\n\nAT commands, also known as Hayes command set, were originally developed in the 1980s to command a modem to dial, hang up or change\nconnection settings. The command set was subsequently extended to support additional functionality, both standardized and vendor-specific.\n\nIn a [recent paper, it was discovered that the commands are still in use in most modern smartphones. Those researchers were able to bypass](https://atcommands.org/sec18-tian.pdf)\nsecurity mechanisms and communicate with smartphones using AT commands through their USB interface. Thousands of commands were\nrecovered and tested, including those to send SMS messages, emulate on-screen touch events, or leak sensitive information. That research\nillustrates that the old‑school AT commands pose a serious risk when misused.\n\n\n-----\n\ns o tto s p ug, o e e, e ay o y specu ate y co a ds a e e p oyed e a e detected a 6 b t e s o o t s p ug\n2019, and we can confirm it is still a part of the newest Attor version (that we first saw in 2018). On the other hand, it seems unlikely it is\ntargeting modern smartphone devices. The plugin ignores devices connected via a USB port, and only contacts those connected via a serial\nport (more precisely, devices whose friendly names match “COM*”).\n\nA more likely explanation of the plugin’s main motive is that it targets modems and older phones. Alternatively, it may be used to\ncommunicate with some specific devices (used by the victim or target organization) that are connected to the COM port or to the USB port\nusing a USB-to-serial adaptor. In this scenario, it is possible the attackers have learned about the victim’s use of these devices using some\nother reconnaissance techniques.\n\nIn any case, the plugin retrieves the following information from the connected devices, using the AT commands listed in Table 3:\n\nBasic information about the mobile phone or GSM/GPRS modem: name of manufacturer, model number, IMEI number and software\nversion\nBasic information about the subscriber: MSISDN and IMSI number\n\n**Table 3. The**\n**commands of the**\n**AT protocol used**\n**by the Device**\n**monitor plugin**\n\n**AT command** **Functionality**\n\nAT Signals start of communication (AT for attention).\n\nAT+MODE=2 Prepares the phone for an extended AT+ command set.\n\nAT+CGSN Requests IMEI number (International Mobile Equipment Identity), which is a unique number to identify a device.\n\nAT+CGMM Requests information about the model of the device (model number).\n\nAT+CGMI Requests name of the device manufacturer.\n\nAT+CGMR Requests the version of the software loaded on the device.\n\nAT+CNUM Requests MSISDN (Mobile Station International Subscriber Directory Number), which is the mapping of the\ntelephone number to the subscriber identity module in a mobile or cellular phone.\n\nAT+CIMI Requests IMSI (International Mobile Subscriber Identity), which is a unique number identifying a GSM subscriber.\nThis number has two parts. The initial part is comprised of six digits in the North American standard and five digits in\nthe European standard. It identifies the GSM network operator in a specific country with whom the subscriber holds\nan account. The second part is allocated by the network operator to identify the subscriber uniquely.\n\nNote that many more (vendor-specific) AT commands exist that are not used by this plugin. It is possible that the malware operators use the\nlisted commands to fingerprint the connected devices, and then deploy another plugin with more specific commands to extract information\nfrom the device.\n\n## Conclusion\n\nAttor is an espionage platform, used for highly targeted attacks against high-profile users in Eastern Europe, and Russian-speaking, securityconcerned users.\n\nThe malware, which has flown under the radar since 2013, has a loadable-plugin architecture that can be used to customize the functionality\nto specific victims. It includes an unusual plugin for GSM fingerprinting that utilizes the rarely used AT command set, and incorporates Tor\nwith the aim of anonymity and untraceability.\n\nOur research provides a deep insight into the malware and suggests that it is well worth further tracking of the operations of the group behind\nit.\n\nESET detection names and other Indicators of Compromise for these campaigns can be found in the full white paper: AT commands, TORbased communications: Meet Attor, a fantasy creature and also a spy platform.\n\n_Acknowledgements to Anton Cherepanov, Peter Košinár, and Zoltán Rusnák_ _for their work on this investigation._\n\n## MITRE ATT&CK techniques\n\n**Tactic** **ID** **Name** **Description**\n\nExecution [T1106](https://attack.mitre.org/techniques/T1106/) Execution through API Attor’s dispatcher uses Cre\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\n[T1129](https://attack.mitre.org/techniques/T1129/) Execution through\nModule Load\n\n\nAttor’s dispatcher executes additional plugins by loading the respective\nDLLs.\n\n\n[T1085](https://attack.mitre.org/techniques/T1085/) Rundll32 Plugin 0x10 schedules rundll32.exe to load the dispatcher.\n\n[T1053](https://attack.mitre.org/techniques/T1053/) Scheduled Task Plugin 0x10 schedules rundll32.exe to be executed on each boot/logon,\nand subsequently to load the dispatcher.\n\n[T1035](https://attack.mitre.org/techniques/T1035/) Service Execution Attor’s dispatcher can be executed as a service.\n\nPersistence [T1037](https://attack.mitre.org/techniques/T1037/) Logon Scripts Attor’s dispatcher can esta\nkey with a logon script:\nHKEY_CURRENT_USER\\\n\n[T1050](https://attack.mitre.org/techniques/T1050/) New Service Attor’s dispatcher can establish persistence by registering a new service.\nHKEY_LOCAL_MACHINE\\SYSTEM\\*ControlSet*\\Control\\SafeBoot\\Minimal\nregistry keys are updated to execute the service even in Safe mode and\nSafe mode with networking.\n\n[T1053](https://attack.mitre.org/techniques/T1053/) Scheduled Task Plugin 0x10 schedules a new task that loads the dispatcher on boot/logon.\n\n\nDefense\nEvasion\n\n\n[T1140](https://attack.mitre.org/techniques/T1140/) Deobfuscate/Decode Files or Information Strings are encrypted with\nConfiguration data, log files\nhybrid encryption scheme –\n\n\n[T1107](https://attack.mitre.org/techniques/T1107/) File Deletion The collected files and log files are deleted after exfiltration by plugin 0x05.\n\n\n[T1158](https://attack.mitre.org/techniques/T1158/) Hidden Files and\nDirectories\n\n\nThe attributes of log files and directories are set to\nHIDDEN/SYSTEM/ARCHIVE (or combination of those).\n\n\n[T1036](https://attack.mitre.org/techniques/T1036/) Masquerading Attor’s dispatcher disguises itself as a legitimate task (i.e., the task name\nand description appear legitimate).\n\n[T1112](https://attack.mitre.org/techniques/T1112/) Modify Registry Attor’s dispatcher can modify the Run registry key.\n\n[T1055](https://attack.mitre.org/techniques/T1055/) Process Injection Attor’s dispatcher injects itself into running processes, to gain higher\nprivileges and to evade detection. It avoids specific system and Symantec\nprocesses.\n\n[T1108](https://attack.mitre.org/techniques/T1108/) Redundant Access Both 32-bit and 64-bit versions of Attor’s dispatcher are executed; also they\nare injected into almost all processes.\nThere is a watchdog component, implemented in the dispatcher or as a\nseparate plugin, that reinstalls Attor if it has been removed.\n\n[T1099](https://attack.mitre.org/techniques/T1099/) Timestomp The time of last access to files and registry keys is manipulated after they\nhave been created/modified.\n\n\n[T1497](https://attack.mitre.org/techniques/T1497/) Virtualization/Sandbox\nEvasion\n\n\nAttor can detect whether it is executed in some virtualized or emulated\nenvironments. If detected, it terminates itself immediately.\n\n\nCredential\nAccess\n\n\n[T1056](https://attack.mitre.org/techniques/T1056/) Input Capture User credentials can be co\nkeystrokes.\n\n\nDiscovery [T1083](https://attack.mitre.org/techniques/T1083/) File and Directory Discovery Plugin 0x01 enumerates file\ndisk drives and stores file in\n\n\n[T1120](https://attack.mitre.org/techniques/T1120/) Peripheral Device\nDiscovery\n\n[T1082](https://attack.mitre.org/techniques/T1082/) System Information\nDiscovery\n\n\nPlugin 0x01 collects information about inserted storage devices, modems\nand phone devices.\n\nAttor monitors the free disk space on the system.\n\n\nCollection [T1123](https://attack.mitre.org/techniques/T1123/) Audio Capture Plugin 0x03 is capable of re\nsound devices.\n\n[T1119](https://attack.mitre.org/techniques/T1119/) Automated Collection Attor automatically collects data about the compromised system.\n\n[T115](https://attack.mitre.org/techniques/T1115/) Clipboard Data Plugin 0x07 collects data stored in the Windows clipboard by using the\nOpenClipboard and GetClipboardData APIs.\n\n[T1074](https://attack.mitre.org/techniques/T1074/) Data Staged Collected data is staged in a central upload directory prior to exfiltration.\n\n[T1056](https://attack.mitre.org/techniques/T1056/) Input Capture Plugin 0x07 captures keystrokes pressed within the window of the process\nwhere Attor is injected.\n\n[T1113](https://attack.mitre.org/techniques/T1113/) Screen Capture Plugin 0x02 captures screenshots of target applications.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\nCommand\nand Control\n\n\n[T1043](https://attack.mitre.org/techniques/T1043/) Commonly Used Port Attor uses port 21 for C&C\n\n\n[T1188](https://attack.mitre.org/techniques/T1188/) Multi-hop Proxy Attor uses Tor for C&C communication.\n\n[T1079](https://attack.mitre.org/techniques/T1079/) Multilayer Encryption Attor sends encrypted traffic using Tor, which itself uses multiple layers of\nencryption.\n\n[T1105](https://attack.mitre.org/techniques/T1105/) Remote File Copy Attor can download additional plugins, updates and other files.\n\n\n[T1071](https://attack.mitre.org/techniques/T1071/) Standard Application\nLayer Protocol\n\n[T1032](https://attack.mitre.org/techniques/T1032/) Standard\nCryptographic\nProtocol\n\n\nFTP protocol is used for C&C communication.\n\nA combination of Blowfish-OFB and RSA is used for data encryption.\n\n\nExfiltration [T1020](https://attack.mitre.org/techniques/T1020/) Automated Exfiltration Exfiltration of the collected\nautomatically by plugin 0x0\n\n[T1022](https://attack.mitre.org/techniques/T1022/) Data Encrypted Attor encrypts data with a combination of Blowfish and RSA ciphers before\nsending it to the C&C server.\n\n\n[T1041](https://attack.mitre.org/techniques/T1041/) Exfiltration Over\nCommand and\nControl Channel\n\n10 Oct 2019 - 11:30AM\n\n\nAttor exfiltrates data over the C&C channel.\n\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-10-10 - ESET discovers Attor, a spy platform with curious GSM fingerprinting.pdf"
    ],
    "report_names": [
        "2019-10-10 - ESET discovers Attor, a spy platform with curious GSM fingerprinting.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a76ba723-d744-472a-b683-19d80e105d9f",
            "created_at": "2023-01-06T13:46:39.089347Z",
            "updated_at": "2025-03-27T02:00:02.994033Z",
            "deleted_at": null,
            "main_name": "Attor",
            "aliases": [],
            "source_name": "MISPGALAXY:Attor",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536160,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1653705981,
    "ts_modification_date": 1653705981,
    "files": {
        "pdf": "https://archive.orkl.eu/176c8aeba0f8431b106478b9d8926aaba812ea9c.pdf",
        "text": "https://archive.orkl.eu/176c8aeba0f8431b106478b9d8926aaba812ea9c.txt",
        "img": "https://archive.orkl.eu/176c8aeba0f8431b106478b9d8926aaba812ea9c.jpg"
    }
}