{
    "id": "f865bbcc-1442-45ba-9362-b0044a94a675",
    "created_at": "2022-10-25T16:48:12.668778Z",
    "updated_at": "2025-03-27T02:16:26.207934Z",
    "deleted_at": null,
    "sha1_hash": "cfcdbf8001854261af856ab9e267096dd74baf88",
    "title": "FedexBanker",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1091001,
    "plain_text": "#### INFORME DE MALWARE\n\n\n# Campaña Fedex Banker\n\n\n**Dirección**\n\nC/ Fiscal Luis Portero García 7\n29010 Málaga\nEspaña\n\nTeléfono/Fax. (+34) 952 020 494\nEmail. comercial@hispasec.com\n\n\n###### SERVICIO MALWARE\n\nAutor:\nHispasec Sistemas\n\nFecha:\n2 Marzo 2021\n\n\n-----\n\n##### 2 hi hi\n\n\n-----\n\n## Índice\n\n**Introducción** **3**\n\n**Propagación e Infección** **4**\n\n**Robo de datos bancarios** **7**\n\n**Otras funciones de robo de datos** **12**\n\n**Comunicación con el servidor** **14**\n\n**Entidades afectadas** **20**\n\n**Conclusiones** **20**\n\n**Anexo: IOCs** **22**\n\n##### 3 hi hi\n\n\n-----\n\n### Introducción\n\nDurante el mes de febrero se han detectado varias campañas cuyo objetivo final es la instalación\n\nde un troyano bancario en los dispositivos móviles con Android de sus víctimas. Este troyano, en\n\nbase a los análisis que hemos realizado sobre las muestras, se trata de un nuevo banker para\n\nAndroid, y ya son tres los nuevos troyanos bancarios que han aparecido en este principio de 2021\n\n(Toddler, Oscorp y este).\n\n##### 4 hi hi\n\n\n-----\n\nTodas las campañas que se han realizado para distribuir el malware han utilizado una falsa página\n\nweb que se trata de una web de Fedex fraudulenta, que indica al usuario una serie de pasos para\n\ninstalar una supuesta aplicación que le permitirá rastrear sus paquetes. Aunque en realidad la\n\naplicación implementa un troyano bancario que afecta principalmente a entidades bancarias\n\nespañolas y a algunas aplicaciones wallet de criptomonedas.\n\nCon respecto al resto de familias de malware bancario para Android, este nuevo banker no destaca\n\nen las estrategias de robo, que siguen siendo las mismas utilizadas por el resto de familias (abuso\n\nde permisos de accesibilidad para registrar eventos y mostrar inyecciones de phishing), aunque sí\n\nque destaca en cuanto a su campaña de distribución, que como ya hemos indicado aprovecha a la\n\nempresa de paquetería FedEx para propagar el troyano. También destaca en su protocolo de\n\ncomunicación con el servidor de control, para el que utiliza el protocolo HTTP pero añadiendo una\n\ncapa extra de cifrado en la que utiliza algoritmos de cifrado simétrico y asimétrico.\n\nAunque sin duda, el principal aspecto en el que destaca frente al resto de familias de malware\n\nbancario para Android es en el uso de un algoritmo de generación de dominios (Domain\n\nGeneration Algorithm; DGA), que le permite generar 2000 dominios diferentes cada mes, y a los\n\nque intenta conectar para determinar cuál de ellos es el que debe utilizar para el envío de datos y\n\nrecepción de comandos.\n\nEn el presente informe se va a profundizar en los aspectos técnicos de este nuevo troyano,\n\nincluyendo las técnicas utilizadas por los atacantes para llevar a cabo la distribución de este, la\n\nfuncionalidad implementadas por el malware para robar credenciales bancarias y otro tipo de\n\ninformación sensible, y su protocolo de comunicación con el servidor de control.\n\n### Propagación e Infección\n\nEn cuanto a la propagación y distribución de este troyano, como ya se ha introducido\n\nanteriormente, los atacantes aprovechan a la empresa de paquetería FedEx como ‘gancho’ para\n\nque sus víctimas acaben instalando el malware. Las víctimas reciben un SMS en el que se les indica\n\nque su paquete llegará pronto, junto a un enlace en el que podría rastrear el paquete, tal y como\n\nocurría en un caso real.\n\n##### 5 hi hi\n\n\n-----\n\n[SMSrecibido por la víctima con el enlace fraudulento (Fuente: Daniel López)](https://twitter.com/danlopgom/status/1359966295307993091)\n\nUna vez que la víctima accede al enlace del SMS, ésta accede a una página web fraudulenta que se\n\nhace pasar por FedEx. Tal y como podemos apreciar en la siguiente imagen, la víctima se\n\nencuentra con una página en la que se le proporcionan una serie de pasos para descargar e instalar\n\nuna supuesta aplicación que le permitirá rastrear su paquete. Sin embargo, esta aplicación es en\n\nrealidad el banker, que una vez instalado seguirá una serie de pasos, como son la recopilación de\n\ninformación del dispositivo y la preparación para robar las credenciales bancarias o las\n\ncriptomonedas de la víctima, en caso de que utilice alguna de las aplicaciones de wallet afectadas.\n\n##### 6 hi hi\n\n\n-----\n\n[Página web fraudulenta utilizada en la campaña para la distribución del malware (Fuente: Daniel López)](https://twitter.com/danlopgom/status/1359966295307993091)\n\nDesde el mismo momento en que la aplicación finaliza la instalación, ésta solicita permisos de\n\naccesibilidad, algo habitual en todas las familias de malware bancario para Android. Como\n\nveremos en la siguiente sección, estos permisos se utilizan para recopilar los eventos de\n\naccesibilidad que se producen en el dispositivo infectado. Esto permite principalmente detectar\n\ncuando se abre alguna de las aplicaciones afectadas, pudiendo así mostrar una ventana con el\n\nformulario de phishing para robar las credenciales.\n\n##### 7 hi hi\n\n\n-----\n\nMensaje que informa a la víctima de que es necesario proporcionar permisos de accesibilidad\n\nUna vez que se han proporcionado los permisos de accesibilidad, el troyano comienza la\n\ncomunicación con el servidor de control, aunque antes de eso necesita generar los 2000 dominios\n\nque puede utilizar durante el mes actual e ir uno a uno comprobando cuál de ellos ha sido\n\nregistrado y apunta a un servidor de control activo. Durante nuestro análisis hemos podido ver que\n\nuno de los primeros comandos que recibe el troyano para ejecutar es el de recopilación de\n\ncontactos, que probablemente se utilice para añadir nuevos números de teléfono en la base de\n\ndatos de los atacantes para enviar nuevos SMS a nuevas posibles víctimas. Aunque, al parecer, los\n\npropios dispositivos infectados podrían haber sido utilizados para llevar a cabo el envío de los SMS\n\nfraudulentos a la lista de contactos.\n\n### Robo de datos bancarios\n\nTal y como se ha introducido anteriormente, este troyano está pensado principalmente para robar\n\nlas credenciales bancarias de sus víctimas, en el caso de que éstas utilicen alguna de las\n\naplicaciones bancarias afectadas, o en caso de que utilicen alguna de las aplicaciones cartera de\n\ncriptomonedas afectadas.\n\n##### 8 hi hi\n\n\n-----\n\nLa estrategia de robo de credenciales no es nueva, y se basa en la ya clásica estrategia de robo a\n\ntravés de inyecciones de phishing (overlays) que se muestran tan pronto como se detecta la\n\napertura de la aplicación afectada. De esta forma, al mostrar el phishing al usuario no le parece\n\nextraño, ya que acaba de abrir la aplicación de su entidad bancaria, que parece que le está\n\nsolicitando las credenciales para acceder a su cuenta. De esta forma, una vez se recibe algún\n\nevento de accesibilidad relativo a la app afectada, este abre una nueva actividad de Android con\n\nuna vista web (WebView) en la que cargar el phishing.\n\nCódigo que inicia BrowserActivity para mostrar la inyección de phishing\n\n##### 9 hi hi\n\n\n-----\n\nCódigo de BrowserActivity que recibe el Intent, obtiene el parámetro ‘a’ y carga el phishing indicado en dicho parámetro\n\nLas inyecciones de phishing se obtienen desde el servidor de control durante los primeros\n\nintercambios de información, en los que el troyano envía la lista de aplicaciones instaladas, y el\n\nservidor de control responde con el subconjunto de apps afectadas. Posteriormente, el troyano\n\nrealiza varias peticiones para descargar una por una las inyecciones (el código HTML) de cada\n\nentidad afectada. Este código se almacena en la memoria de la aplicación para ser utilizado\n\ncuando se muestra la WebView al abrir una de las aplicaciones afectadas. Como podemos apreciar\n\nen la siguiente imagen, la función LoadHtml se encarga de obtener el código de la inyección de\n\nmemoria y cargarlo en la WebView.\n\n##### 10 hi hi\n\n\n-----\n\nFunción LoadHtml que carga el código de la inyección a mostrar\n\nAdemás del robo a través de inyecciones de phishing, este nuevo troyano incluye la estrategia de\n\nrobo a través del registro de los propios eventos de accesibilidad, algo que el pasado año ya\n\ncomenzó a popularizar el banker Eventbot, y que con el paso del tiempo cada vez más familias\n\nestán incorporando dentro de su abanico de funcionalidades. Gracias a los eventos de\n\naccesibilidad el troyano no solamente es capaz de obtener información sobre los toques que\n\nrealiza el usuario en la pantalla, sino que también recibe información sobre cambios que se\n\nrealizan en determinados elementos. En el caso de los campos de texto, el evento de accesibilidad\n\nque recibe el malware incluye el identificador del campo y el texto, lo que permite al malware\n\nregistrar si se trata de un campo de usuario y contraseña, y el contenido del propio campo.\n\n##### 11 hi hi\n\n\n-----\n\nCódigo encargado de registrar los eventos de accesibilidad y enviarlos al C2\n\nEsta estrategia de robo a través del registro de eventos de accesibilidad y cambios en los campos\n\nde texto, tiene como principal ventaja que la víctima sospechará menos aún, ya que no se muestra\n\nuna actividad nueva, sino que se roba a partir de los campos de texto de la aplicación legítima. Sin\n\nembargo, la principal desventaja es que no es posible robar las credenciales si el usuario ya tenía\n\nla aplicación bancaria instalada y configurada, puesto que en ese caso la app no solicitará las\n\ncredenciales al usuario para iniciar sesión. Lo más habitual es que el usuario ya tuviese la sesión\n\niniciada antes de que se instalase el malware, por lo que esta técnica por sí sola no es muy efectiva.\n\nComo hemos visto, las inyecciones de phishing se muestran al detectar la apertura de la aplicación\n\nbancaria afectada, sin embargo, como veremos más adelante, el servidor de control puede enviar\n\ncomandos específicos para solicitar al troyano que muestre alguna de las inyecciones\n\ndescargadas. De esta forma, los operadores pueden forzar el robo de credenciales si lo consideran\n\noportuno.\n\n##### 12 hi hi\n\n\n-----\n\n### Otras funciones de robo de datos\n\nAdemás del típico robo de credenciales bancarias que implementa el malware bancario, es\n\nhabitual que este tipo de malware implemente otras funcionalidades que le permitan robar otro\n\ntipo de datos, principalmente aquellos que pueden ser necesarios junto con las credenciales para\n\nlograr el robo final del dinero.\n\nEn el caso de este nuevo troyano, se incluye funcionalidad que permite a los operadores obtener\n\nlos mensajes de texto recibidos. De esta forma, los mensajes de texto recibidos que contiene\n\ncódigos de un solo uso para autorizar transacciones o para autorizar el inicio de sesión en la\n\ncuenta, pueden ser reenviados al servidor de control, donde los atacantes pueden finalmente\n\nllevar a cabo el robo de dinero. En la siguiente imagen podemos observar como el troyano instala\n\nun SmsReceiver de Android que recibe cada mensaje de texto que llega al dispositivo, lo procesa y\n\nlo reenvía al servidor de control.\n\n##### 13 hi hi\n\n\n-----\n\nCódigo que registra y envía al C2 los mensajes recibidos\n\nAdemás de la recopilación de SMS, también se envía la agenda completa de contactos, lo que en\n\nprimera instancia parece que podría estar utilizándose para enviar mensajes a los contactos de las\n\nvíctimas para distribuir nuevas versiones de este troyano.\n\n##### 14 hi hi\n\n\n-----\n\nEnvío de la agenda de contactos\n\nEn cuanto a funcionalidad de robo de información esto sería todo, aunque el troyano implementa\n\nfuncionalidad adicional que le de aún más control a los atacantes, como: Realización de llamadas\n\nUSSD (de pago/suscripción), configurar proxy SOCKS en el dispositivo, desinstalar aplicaciones,\n\ndesactivar Google Play Protect y envío de SMS.\n\n### Comunicación con el servidor\n\n##### 15 hi hi\n\n\n-----\n\nPara terminar con la descripción técnica de este nuevo troyano, debemos hablar de su protocolo\n\nde comunicación con el servidor de control, sobretodo si tenemos en cuenta que introduce ciertos\n\naspectos que no es tan habitual encontrar en este tipo de malware.\n\nSe hace uso del protocolo HTTP para la comunicación con el C2, sin embargo, se implementa\n\ncifrado sencillo XOR, utilizado para cifrar el cuerpo del mensaje enviado y las respuestas recibidas.\n\nPara cada petición se genera una clave de 10 bytes aleatoria, que es utilizada para cifrar los datos\n\nenviados y los datos recibidos por parte del servidor.\n\nLa parte realmente novedosa es el intercambio de esta clave, que se lleva a cabo cifrandola junto\n\ncon el identificador del bot (dispositivo infectado). Para cifrarla se hace uso de algoritmos\n\nasimétrico RSA, y se incluye la clave pública del servidor de control en la propia aplicación. De esta\n\nforma, solamente el servidor de control debería ser capaz de descifrar el mensaje, aunque en la\n\npráctica no es así, puesto que el cifrado XOR es demasiado débil, y la primera parte del mensaje\n\ncifrado es el comando que indica el tipo de mensaje, por lo que se puede realizar fuerza bruta con\n\ntodos los posibles comandos y obtener la clave original de cifrado.\n\n##### 16 hi hi\n\n\n-----\n\nCódigo que implementa el cifrado RSA asimétrico utilizando la clave pública del C2 hardcodeada\n\nAlgoritmo de cifrado XOR\n\nSin embargo, el uso de RSA si que permite verificar que el servidor de control está realmente\n\ncontrolado por el atacante y no por otra entidad (que haya configurado un servidor sinkhole), ya\n\nque la respuesta del C2 debe contener al comienzo el identificador del bot seguido por la clave\n\nXOR utilizada para cifrar la comunicación, y esto es comprobado por el troyano cuando recibe la\n\nrespuesta. Sin la clave privada el servidor de control no puede obtener en ningún momento el\n\nidentificador del bot, por lo que no puede enviarlo en la respuesta.\n\nLa petición realizada por el troyano se divide en dos líneas, la primera incluye el identificador del\n\nbot y la clave de cifrado XOR (separados por comas), y la segunda línea incluye los datos que se\n\nquieren enviar al servidor.\n\n##### 17 hi hi\n\n\n-----\n\nEjemplo de petición realizada por el troyano con el comando PREPING\n\nEl uso de cifrado asimétrico no introduce realmente una mayor seguridad de forma que una\n\nentidad externa pueda descifrar los datos (al menos una vez que conoce el funcionamiento del\n\nmalware), sin embargo, si que impide el registro de una cantidad reducida de dominios de entre\n\nlos generados para actuar como sinkhole y forzar al troyano a ejecutar el comando de\n\ndesinstalación, ya que no se tiene la clave privada para descifrar el header (la primera línea) que\n\ncontiene el BOTID.\n\nPara la generación de dominios se utiliza como semilla del generador de números aleatorios el\n\nmes y año actual, y a partir de esa semilla se generan un máximo de 2000 dominios diferentes por\n\nmes. Tal y como podemos apreciar en las siguiente imágenes, al generar cada dominio se\n\ncomprueba si este está registrado y si al realizar la petición con el comando PREPING éste responde\n\ncorrectamente. En caso de que todo vaya bien, se utilizará dicho dominio para posteriores\n\ncomunicaciones.\n\n##### 18 hi hi\n\n\n-----\n\nGeneración de la semilla en base al año y mes\n\n##### 19 hi hi\n\n\n-----\n\nFunción FindHost que genera y comprueba cada uno de los 2000 dominios\n\nComo podemos observar, la comprobación de dominios se implementa haciendo uso de múltiples\n\nhebras, por lo que la tarea de comprobación de 2000 dominios que debería llevar bastante tiempo\n\nen realizarse, puede realizarse en menos tiempo gracias al uso de un pool de hebras que se\n\nreparten el trabajo.\n\nPor último, la lista de comandos que puede recibir el troyano para ejecutar diferentes acciones en\n\nel dispositivo infectado es la siguiente:\n\n      - **RETRY_INJECT: vuelve a intentar mostrar la inyección.**\n\n      - **GET_CONTACTS: solicita la recopilación y envío de la agenda de contactos.**\n\n      - **SEND_SMS: solicita el envío del SMS indicado al número indicado.**\n\n##### 20 hi hi\n\n\n-----\n\n      - **RELOAD_INJECTS: solicita al troyano que se vuelvan a descargar las inyecciones para las**\n\naplicaciones afectadas.\n\n      - **DISABLE_PLAY_PROTECT: solicita la desactivación de Google Play Protect.**\n\n      - **RUN_USSD: solicita la realización de llamadas con coste adicional/suscripción (USSD).**\n\n      - **OPEN_URL: abre una URL indicada en la WebView utilizada para mostrar las inyecciones.**\n\n      - **UPLOAD_SMS: solicita la recopilación y envío de todos los SMS**\n\n      - **SOCKS: solicita la configuración de proxy SOCKS en el dispositivo.**\n\n      - **UNINSTALL_APP: solicita la desinstalación de la aplicación indicada.**\n\n      - **BLOCK_CARD: bloquea el dispositivo utilizando una inyección que solicita información**\n\nespecífica de la tarjeta de crédito.\n\n### Entidades afectadas\n\nLa lista de entidades afectadas que hemos podido obtener es la siguiente:\n\n      - net.inverline.bancosabadell.officelocator.android\n\n      - piuk.blockchain.android\n\n      - com.bankinter.launcher\n\n      - net.inverline.bancosabadell.officelocator.activobank\n\n      - com.bbva.bbvacontigo\n\n      - com.coinbase.android\n\n      - com.rsi\n\n      - es.evobanco.bancamovil\n\n      - com.grupocajamar.wefferent\n\n      - com.tecnocom.cajalaboral\n\n      - com.kutxabank.android\n\n      - com.binance.dev\n\n      - es.bancosantander.apps\n\n      - es.cm.android\n\n### Conclusiones\n\n##### 21 hi hi\n\n\n-----\n\nDurante este inicio de 2021 hemos visto nuevas familias de troyanos bancarios, como Toddler u\n\nOscorp, y a estas parece que se les une una nueva familia que ha hecho su aparición este mes de\n\nfebrero. Este nuevo banker está principalmente centrado en entidades bancarias y usuarios\n\nespañoles, y ha estado utilizando como método de distribución los mensajes de texto en nombre\n\nde compañías de mensajería.\n\nA partir de estos SMS fraudulentos, los atacantes tratan de conseguir que la víctima visiten el\n\nenlace que se le proporciona y acabe instalando la falsa aplicación para rastreo de paquetes. Una\n\nvez que el usuario cae en el engaño e instala la aplicación, ésta comienza a tomar control del\n\ndispositivo, y pone en marcha las estrategias de robo de credenciales típicas para robar las\n\ncredenciales de sus víctimas.\n\nAl igual que el resto de bankers de Android, abusa de los permisos de accesibilidad para instalar un\n\nservicio de accesibilidad que recibe todos los eventos de accesibilidad que se producen en el\n\ndispositivo con el uso del usuario. Gracias a esto, el troyano puede mostrar inyecciones de\n\nphishing (overlays) tan pronto como se inicia la aplicación afectada, reduciendo las sospechas del\n\nusuario. Además, se recopilan los eventos de cambio en campos de texto, lo que permite el robo\n\nde credenciales más allá de las inyecciones web de phishing.\n\nJunto a la funcionalidad de robo de credenciales, y de igual forma que suele ocurrir con otras\n\nfamilias de malware bancario, también se incluye funcionalidad para robar otro tipo de\n\ninformación que almacena el dispositivo, como los mensajes de texto o la lista de contactos, que\n\npermiten al atacante llevar a cabo el robo final de dinero o la propagación del malware a los\n\ncontactos de la víctima.\n\nComo elemento diferenciador ante el resto de familias que existen actualmente en el entorno del\n\nmalware bancario para Android, encontramos el uso de un algoritmo generador de nombres de\n\ndominio (DGA), que permite al troyano seguir funcionando durante mucho más tiempo,\n\ncomplicando el cierre completo de la infraestructura del malware.\n\nEn lo que llevamos de 2021 ya hemos visto tres nuevas familias de malware bancario, lo que\n\npodemos entender como un aviso ante lo que podría estar por venir en lo que queda de año.\n\n##### 22 hi hi\n\n\n-----\n\nDebemos seguir atentos a cualquier novedad relativa a estas nuevas familias y a las posibles\n\nnuevas familias que aparezcan en el futuro.\n\n### Anexo: IOCs\n\n**Hash de las muestras:**\n\n      - 88e4e1801fa1518382ee8b6b6f4b5ce52b380ddee29044f360b8f90ec87d3099\n\n**Dominios, IPs y URLs:**\n\n      - hxxp://carlomansystems.com/fedex\n\n      - hxxp://mwconsulting.co.za/fedex/\n\n      - hxxp://crowd1tr.com/fedex/\n\n      - hxxp://mkinstalacje.pl/fedex/\n\n      - hxxp://mehp.com.br/fedex/\n\n      - hxxp://212sennakliyat.com/fedex/\n\n      - hxxp://esarengineering.com/fedex/\n\n**Dominios C2 generados registrados e IPs:**\n\n**Febrero 2021:**\n\n      - ddeocyowmeaygbk[.]com [193.38.55.28]\n\n      - mhuwkbajtolskrh[.]ru [8.209.80.73]\n\n      - qmycwjlxmqongbg[.]ru [8.209.80.73]\n\n**Marzo 2021:**\n\n      - nfiuerwtftasnuk.com [51.254.172.105]\n\n      - xjnwqdospderqtk.ru [46.173.218.93]\n\n      - mbhpikampombehi.com [46.173.218.93]\n\n##### 23 hi hi\n\n\n-----",
    "language": "ES",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://hispasec.com/resources/FedexBanker.pdf"
    ],
    "report_names": [
        "FedexBanker.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/cfcdbf8001854261af856ab9e267096dd74baf88.pdf",
        "text": "https://archive.orkl.eu/cfcdbf8001854261af856ab9e267096dd74baf88.txt",
        "img": "https://archive.orkl.eu/cfcdbf8001854261af856ab9e267096dd74baf88.jpg"
    }
}