{
    "id": "f8a75dde-0e25-4d49-9e69-e8cdb3021ef5",
    "created_at": "2023-01-12T15:08:26.70051Z",
    "updated_at": "2025-03-27T02:05:23.464965Z",
    "deleted_at": null,
    "sha1_hash": "77e12cb5d0998b68e3e0ddeb7822c31e72b91707",
    "title": "2015-05-10 - Third-Party Software Was Entry Point for Background-Check System Hack",
    "authors": "",
    "file_creation_date": "2022-05-28T19:53:20Z",
    "file_modification_date": "2022-05-28T19:53:20Z",
    "file_size": 141107,
    "plain_text": "# Third-Party Software Was Entry Point for Background- Check System Hack\n\n**[nextgov.com/cybersecurity/2015/05/third-party-software-was-entry-point-background-check-system-hack/112354/](https://www.nextgov.com/cybersecurity/2015/05/third-party-software-was-entry-point-background-check-system-hack/112354/)**\n\nHackers broke into third-party software in 2013 to open personal records on federal\nemployees and contractors with access to classified intelligence, according to the\ngovernment's largest private employee investigation provider.\n\nThat software apparently was an SAP enterprise resource planning application. It’s unclear if\nthere was a fix available for the program flaw at the time of the attack. It’s also not clear\nwhether SAP—which was responsible for maintaining the application—or USIS would have\nbeen responsible for patching the flaw.\n\nBut in the end, sensitive details on tens of thousands of national security personnel were\nexposed in March 2014.\n\nAssailants infiltrated USIS by piggybacking on an “exploit,” a glitch that can be abused by\nhackers, that was “present in a widely used and highly-regarded enterprise resource\nplanning (‘ERP’) software package,” an internal investigation obtained by Nextgov found.\n\n\n-----\n\nUSIS officials declined to explicitly name the software application, saying they would let the\nreport, compiled by Stroz Friedberg, a digital forensics firm retained by USIS, speak for\nitself.\n\nThe report, written in December 2014, noted: “Forensic evidence shows the cyberattacker\ngained access to USIS systems through an exploit in a system managed by a third party, and\nfrom there migrated to company managed systems. . . . Our findings were largely informed\nby a variety of logs, including, firewall logs, security event logs, VPN logs, and SAP\napplication trace logs.”\n\nA September 2014 letter from Stroz reported, \"The initial attack vector was a vulnerability in\nan application server, housed in a connected, but separate network, managed by a third\nparty not affiliated with USIS.” The reference to “SAP application trace logs” in the report\nindicates the third party was SAP.\n\nDuring the period of the hacking operation, which began in 2013 and was exposed in June\n[2014, 20 to](https://web.nvd.nist.gov/view/vuln/search-results?adv_search=true&cves=on&query=SAP&pub_date_start_month=0&pub_date_start_year=2013&pub_date_end_month=2&pub_date_end_year=2014&cvss_sev_base=HIGH&cve_id=) [30 new critical vulnerabilities were identified in SAP’s enterprise resource](https://web.nvd.nist.gov/view/vuln/search-results?adv_search=true&cves=on&query=SAP&pub_date_start_month=2&pub_date_start_year=2014&pub_date_end_month=5&pub_date_end_year=2014&cvss_sev_base=HIGH&cve_id=)\nplanning software.\n\nThe number of SAP vulnerabilities \"would have given attackers many options to\ntarget SAP directly,” based on how USIS deployed the ERP tool, said Richard Barger, chief\nintelligence officer at ThreatConnect, a firm that tracks cyber threats. Barger is a former Army\nintelligence analyst.\n\nIt is unclear which vulnerability the intruders exploited. Defects in programs used by the\ngovernment and contractors sometimes aren’t fixed for years after software developers\nannounce a weakness.\n\nReferencing the Stroz report, USIS spokeswoman Ellen Davis said, \"the third-party\ncontractor was hacked and the hacker was then able to navigate into the USIS network via\nthe third party’s network.\"\n\nStroz officials deferred comment to USIS.\n\nSAP, a major IT contractor with 50,000 customer organizations worldwide, would neither\nconfirm nor deny allegations that assailants reached USIS through one of its systems. SAP\nspokesman Mat Small said in an email, \"Since we don’t comment on the specifics of any\ncustomer engagement without their explicit consent, SAP is unable to make a statement on\nthe situation.”\n\nAddressing SAP’s response to security vulnerabilities, he added, \"No company is more\ncommitted to data privacy and security than SAP, and we respond rapidly, vigorously and\nthoroughly when potential security risks are identified.”\n\n\n-----\n\nThe targeting of middlemen and downstream suppliers has become common in sophisticated\nhacking campaigns, according to researchers.\n\nThe top three sectors victimized by cyber espionage last year were professional services\nfirms, which typically support large organizations; manufacturing; and government, according\n[to an annual Verizon data breach investigations study released last month.](http://news.verizonenterprise.com/2015/04/2015-data-breach-report-info/)\n\nComputer snoops have learned it is easier to compromise “the partner and the third party\ndealing with that intellectual property than the source of the intellectual property itself,\" Jay\nJacobs, a Verizon senior analyst and study co-author, said at the time of the study’s\npublication.\n\nAnd PWC's most recent [State of Cybercrime Survey found that only 22 percent of U.S.](http://www.pwc.com/en_US/us/increasing-it-effectiveness/publications/assets/us-state-of-cybercrime.pdf)\norganizations plan incident response strategies with outside suppliers.\n\n\"Not all companies recognize that supply chain vendors and business partners . . . can have\nlower—even nonexistent—cybersecurity policies and practices, a situation that can increase\ncybercrime risks across any entity that partner or supplier touches,” according to the survey,\nwhich came out a year ago.\n\n[(Image via wk1003mike/ Shutterstock.com)](http://www.shutterstock.com/pic-197986028/stock-photo-hacked-symbol-on-computer-circuit-board-with-open-red-padlock.html?src=fbjBx_1k2jsjnNidPq-W9w-1-1)\n\nX\n\nThis website uses cookies to enhance user experience and to analyze performance and\ntraffic on our website. We also share information about your use of our site with our social\nmedia, advertising and analytics partners. Learn More / [Do Not Sell My Personal Information](https://www.nextgov.com/do-not-sell/)\nAccept Cookies\n\nX\n\nCookie Preferences Cookie List\n\nDo Not Sell My Personal Information\n\nWhen you visit our website, we store cookies on your browser to collect information. The\ninformation collected might relate to you, your preferences or your device, and is mostly used\nto make the site work as you expect it to and to provide a more personalized web\nexperience. However, you can choose not to allow certain types of cookies, which may\nimpact your experience of the site and the services we are able to offer. Click on the different\ncategory headings to find out more and change our default settings according to your\npreference. You cannot opt-out of our First Party Strictly Necessary Cookies as they are\ndeployed in order to ensure the proper functioning of our website (such as prompting the\n\n\n-----\n\ncookie banner and remembering your settings, to log into your account, to redirect you when\nyou log out, etc.). For more information about the First and Third Party Cookies used please\nfollow this link.\n\nAllow All Cookies\n\nManage Consent Preferences\n\nStrictly Necessary Cookies - Always Active\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the\nproper functioning of our website (such as prompting our cookie banner and remembering\nyour privacy choices) and/or to monitor site performance. These cookies are not used in a\nway that constitutes a “sale” of your data under the CCPA. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not work as intended if you\ndo so. You can usually find these settings in the Options or Preferences menu of your\n[browser. Visit www.allaboutcookies.org to learn more.](https://www.allaboutcookies.org/)\n\nSale of Personal Data, Targeting & Social Media Cookies\n\nUnder the California Consumer Privacy Act, you have the right to opt-out of the sale of your\npersonal information to third parties. These cookies collect information for analytics and to\npersonalize your experience with targeted ads. You may exercise your right to opt out of the\nsale of personal information by using this toggle switch. If you opt out we will not be able to\noffer you personalised ads and will not hand over your personal information to any third\nparties. Additionally, you may contact our legal department for further clarification about your\nrights as a California consumer by using this Exercise My Rights link\n\nIf you have enabled privacy controls on your browser (such as a plugin), we have to take that\nas a valid request to opt-out. Therefore we would not be able to track your activity through\nthe web. This may affect our ability to personalize ads according to your preferences.\n\nTargeting cookies may be set through our site by our advertising partners. They may be used\nby those companies to build a profile of your interests and show you relevant adverts on\nother sites. They do not store directly personal information, but are based on uniquely\nidentifying your browser and internet device. If you do not allow these cookies, you will\nexperience less targeted advertising.\n\nSocial media cookies are set by a range of social media services that we have added to the\nsite to enable you to share our content with your friends and networks. They are capable of\ntracking your browser across other sites and building up a profile of your interests. This may\nimpact the content and messages you see on other websites you visit. If you do not allow\nthese cookies you may not be able to use or see these sharing tools.\n\n\n-----\n\nIf you want to opt out of all of our lead reports and lists, please submit a privacy request at\nour [Do Not Sell page.](https://www.nextgov.com/do-not-sell/)\n\nSave Settings\n\nCookie Preferences Cookie List\n\nCookie List\n\nA cookie is a small piece of data (text file) that a website – when visited by a user – asks\nyour browser to store on your device in order to remember information about you, such as\nyour language preference or login information. Those cookies are set by us and called firstparty cookies. We also use third-party cookies – which are cookies from a domain different\nthan the domain of the website you are visiting – for our advertising and marketing efforts.\nMore specifically, we use cookies and other tracking technologies for the following purposes:\n\nStrictly Necessary Cookies\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the\nproper functioning of our website (such as prompting our cookie banner and remembering\nyour privacy choices) and/or to monitor site performance. These cookies are not used in a\nway that constitutes a “sale” of your data under the CCPA. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not work as intended if you\ndo so. You can usually find these settings in the Options or Preferences menu of your\n[browser. Visit www.allaboutcookies.org to learn more.](https://www.allaboutcookies.org/)\n\nFunctional Cookies\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the\nproper functioning of our website (such as prompting our cookie banner and remembering\nyour privacy choices) and/or to monitor site performance. These cookies are not used in a\nway that constitutes a “sale” of your data under the CCPA. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not work as intended if you\ndo so. You can usually find these settings in the Options or Preferences menu of your\n[browser. Visit www.allaboutcookies.org to learn more.](https://www.allaboutcookies.org/)\n\nPerformance Cookies\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the\nproper functioning of our website (such as prompting our cookie banner and remembering\nyour privacy choices) and/or to monitor site performance. These cookies are not used in a\nway that constitutes a “sale” of your data under the CCPA. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not work as intended if you\ndo so. You can usually find these settings in the Options or Preferences menu of your\n[browser. Visit www.allaboutcookies.org to learn more.](https://www.allaboutcookies.org/)\n\n\n-----\n\nSale of Personal Data\n\nWe also use cookies to personalize your experience on our websites, including by\ndetermining the most relevant content and advertisements to show you, and to monitor site\ntraffic and performance, so that we may improve our websites and your experience. You may\nopt out of our use of such cookies (and the associated “sale” of your Personal Information)\nby using this toggle switch. You will still see some advertising, regardless of your selection.\nBecause we do not track you across different devices, browsers and GEMG properties, your\nselection will take effect only on this browser, this device and this website.\n\nSocial Media Cookies\n\nWe also use cookies to personalize your experience on our websites, including by\ndetermining the most relevant content and advertisements to show you, and to monitor site\ntraffic and performance, so that we may improve our websites and your experience. You may\nopt out of our use of such cookies (and the associated “sale” of your Personal Information)\nby using this toggle switch. You will still see some advertising, regardless of your selection.\nBecause we do not track you across different devices, browsers and GEMG properties, your\nselection will take effect only on this browser, this device and this website.\n\nTargeting Cookies\n\nWe also use cookies to personalize your experience on our websites, including by\ndetermining the most relevant content and advertisements to show you, and to monitor site\ntraffic and performance, so that we may improve our websites and your experience. You may\nopt out of our use of such cookies (and the associated “sale” of your Personal Information)\nby using this toggle switch. You will still see some advertising, regardless of your selection.\nBecause we do not track you across different devices, browsers and GEMG properties, your\nselection will take effect only on this browser, this device and this website.\n\nNextgov uses cookies for analytics and personalization. By continuing to use this site, you\n[agree to our use of cookies. Read our Privacy Policy to find out more.](https://www.nextgov.com/about/privacy-policy/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-05-10 - Third-Party Software Was Entry Point for Background-Check System Hack.pdf"
    ],
    "report_names": [
        "2015-05-10 - Third-Party Software Was Entry Point for Background-Check System Hack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536106,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1653767600,
    "ts_modification_date": 1653767600,
    "files": {
        "pdf": "https://archive.orkl.eu/77e12cb5d0998b68e3e0ddeb7822c31e72b91707.pdf",
        "text": "https://archive.orkl.eu/77e12cb5d0998b68e3e0ddeb7822c31e72b91707.txt",
        "img": "https://archive.orkl.eu/77e12cb5d0998b68e3e0ddeb7822c31e72b91707.jpg"
    }
}