{
    "id": "f8af2198-315d-482a-a4d5-3daa9efad4fe",
    "created_at": "2023-01-12T15:06:37.863002Z",
    "updated_at": "2025-03-27T02:05:34.841653Z",
    "deleted_at": null,
    "sha1_hash": "fa61b1499f630761fbab329b89a4826f39787bb9",
    "title": "2017-11-13 - New Banking Trojan IcedID Discovered by IBM X-Force Research",
    "authors": "",
    "file_creation_date": "2022-05-28T03:52:24Z",
    "file_modification_date": "2022-05-28T03:52:24Z",
    "file_size": 1330269,
    "plain_text": "# New Banking Trojan IcedID Discovered by IBM X-Force Research\n\n**[securityintelligence.com/new-banking-trojan-icedid-discovered-by-ibm-x-force-research/](https://securityintelligence.com/new-banking-trojan-icedid-discovered-by-ibm-x-force-research/)**\n\nNovember 13, 2017\n\n[Home&nbsp/](https://securityintelligence.com/) [Banking & Finance](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nNew Banking Trojan IcedID Discovered by IBM X-Force Research\n\n\n-----\n\n[Banking & Finance November 13, 2017](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nBy [Limor Kessem co-authored by Maor Wiesen,](https://securityintelligence.com/author/limor-kessem/) [Tal Darsan,](https://securityintelligence.com/author/tal-darsan/) [Tomer Agayev 7 min read](https://securityintelligence.com/author/tomer-agayev/)\nIBM X-Force research follows developments in the financial cybercrime arena to map the\nevents and trends that shape the threat landscape for organizations and consumers alike.\n[After a year that has been very active in terms of banking malware,](https://securityintelligence.com/trickbot-takes-to-latin-america-continues-to-expand-its-global-reach/) point-of-sale (POS)\nmalware and rampant [ransomware attacks, the X-Force team identified a new banking](https://securityintelligence.com/bad-rabbit-ransomware-attacks-highlight-risk-of-propagating-malware-outbreaks/)\nTrojan active in the wild dubbed IcedID.\n\n[Read the white paper: How digital banking is transforming fraud detection](https://www.ibm.com/marketing/iwm/dre/signup?source=urx-18586&S_PKG=ov60471)\n\n## IcedID Emerges\n\nAccording to [X-Force research, the new banking Trojan emerged in the wild in September](https://www.ibm.com/security/xforce/)\n2017, when its first test campaigns were launched. Our researchers noted that IcedID has a\nmodular malicious code with modern banking Trojan capabilities comparable to malware\nsuch as the Zeus Trojan.\n\nAt this time, the malware targets banks, payment card providers, mobile services providers,\npayroll, webmail and e-commerce sites in the U.S. Two major banks in the U.K. are also on\nthe target list the malware fetches.\n\nIcedID does not seem to have borrowed code from other Trojans, but it implements\ncomparable features that allow it to perform advanced browser manipulation tactics.\nAlthough IcedID’s capabilities are already up to par with those of other banking Trojans such\nas Zeus, Gozi and Dridex, our researchers believe it will see further updates in the coming\nweeks.\n\n## Served by Emotet\n\n\n-----\n\nX-Force s analysis of IcedID s delivery method suggests that its operators are not new to the\ncybercrime arena, opting to infect users via the Emotet Trojan. X-Force research believes\nthat a threat actor or a small cybergang has been operating Emotet as a distribution\noperation for banking Trojans and other malware codes this year. Emotet’s most prominent\nattack zone is the U.S. To a lesser extent, it also targets users in the U.K. and other parts of\nthe world.\n\nEmotet has been one of the notable malware distribution methods in 2017, serving elite\n[cybercrime groups from Eastern Europe, such as those operating QakBot and](https://malwarebreakdown.com/2017/05/06/malspam-leads-to-malicous-word-document-which-downloads-geodoemotet-banking-malware/) [Dridex. It has](https://nakedsecurity.sophos.com/2017/08/10/watch-out-for-emotet-the-trojan-thats-nearly-a-worm/)\nnow added IcedID as a new payload drop.\n\nEmotet emerged in 2014 after a leak of the original source code of the Bugat Trojan. It was\noriginally a banking Trojan that preceded Dridex. As such, it is designed to amass and\nmaintain botnets. Emotet persists on the machine and then fetches additional components\n[such as a spamming module, a network worm module, and password and data stealers for](https://www.infosecurity-magazine.com/news/emotet-crimeware-adds/)\nMicrosoft Outlook email and browser activity.\n\nEmotet itself comes [via malspam, usually inside rigged productivity files that contain](https://isc.sans.edu/forums/diary/Malspam+pushing+Emotet+malware/22650/)\n[malicious macros. Once Emotet infects the endpoint, it becomes a silent resident and is](https://isc.sans.edu/diary/rss/22658)\noperated to serve malware from other cybercriminal groups.\n\n## IcedID’s TTPs\n\nWhen it comes to tactics, techniques and procedures (TTPs), IcedID has a few tricks up its\nsleeve.\n\nAside from the more common Trojan features, IcedID can propagate over a network. It\nmonitors the victim’s online activity by setting up a local proxy for traffic tunneling, which is a\n[concept reminiscent of the GootKit Trojan. Its attack tactics include both webinjection attacks](https://securityintelligence.com/gootkit-developers-dress-it-up-with-web-traffic-proxy/)\n[and sophisticated redirection attacks similar to the scheme used by Dridex and TrickBot.](https://securityintelligence.com/an-aggressive-launch-trickbot-trojan-rises-with-redirection-attacks-in-the-uk/)\n\n### Network Propagation\n\nIcedID’s operators probably plan on targeting businesses because they added a network\npropagation module to the malware from the get-go. IcedID possesses the ability to move to\nother endpoints, and X-Force researchers also observed it infecting terminal servers.\nTerminal servers typically provide terminals, such as endpoints, printers and shared network\ndevices, with a common connection point to a local area network (LAN) or a wide area\nnetwork (WAN), which suggests that IcedID has already been targeting employee email to\nland on organizational endpoints.\n\n_Figure 1: IcedID’s network propagation functions, viewed on IDA-Pro_\n\n\n-----\n\nTo find other users to infect, IcedID queries the lightweight directory access protocol (LDAP).\n\n_Figure 2: IcedID queries the LDAP for more users on the network_\n\nIcedID’s financial fraud TTPs include two attack modes: webinjection attacks and redirection\nattacks.\n\nTo begin, the malware downloads a configuration file from the Trojan’s command-and-control\n(C&C) server when the user opens the internet browser. The configuration includes targets\nfor which a webinjection attack will be activated — mostly banks and other targets that were\nfitted with redirection attacks, such as payment cards and webmail sites.\n\n[Read the white paper: How digital banking is transforming fraud detection](https://www.ibm.com/marketing/iwm/dre/signup?source=urx-18586&S_PKG=ov60471)\n\n## Technical Details\n\nX-Force researchers ran a dynamic analysis on IcedID samples. At this time, the malware\ndeploys on endpoints running various versions of the Windows operating system. It does not\nappear to possess any advanced anti-virtual machine (VM) or anti-research techniques,\naside from the following:\n\nIt requires a reboot to complete full deployment, possibly to evade sandboxes that do\nnot emulate rebooting.\nIt communicates via secure sockets layer (SSL) to add a layer of security to the\ncommunications and to bypass automated scans by intrusion detection systems.\n\nThat being said, X-Force researchers assert that anti-forensic features could be added to this\nTrojan over time.\n\n### Payload Deployment\n\nIcedID is deployed to target endpoints using the Emotet Trojan as a dropper. After a reboot,\nthe payload is written to the Windows %LocalAppData% folder with a value generated per\nsome parameters from the operating system. That value is used both in the deployment path\nand the RunKey value for the file.\n\nThe full convention for the value is: %LOCALAPPDATA%\\[a-z]{9}\\[a-z]{9}.exe.\n\nC:\\Users\\User\\AppData\\Local\\ewonliarl\\ewonliarl.exe\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\ewonliarl\n\nThe malware sets its persistence mechanism by creating a RunKey in the registry to ensure\nits survival after system reboot events.\n\n\n-----\n\nNext, IcedID writes an RSA crypto key to the system into the AppData folder. The malware\nmay write to this RSA key during the deployment routine, which could be linked to the fact\nthat web traffic is tunneled through IcedID’s process even as it channels SSL traffic. X-Force\nis still investigating the exact use of the RSA key.\n\nThe temp file is written according to the following convention: %TEMP%\\[A-F0-9]{8}.tmp.\n\nC:\\Users\\User\\AppData\\Roaming\\Microsoft\\Crypto\\RSA\\S-1-5-21-21371457312486784493-1554833299-1000\\fdbe618fb7eb861d65554863fc5da9a0_883f9a43-a12c410f-b47d-bb7275830b53\nC:\\Users\\User\\AppData\\Local\\Temp\\CACCEF19.tmp\n\nIcedID’s process continues to run, which is rather uncommon for malware. This could mean\nthat some parts of the code are still being fixed and that this issue will change in the next\nupdate.\n\nThe deployment process ends here and the dropper continues to run under the Explorer\nprocess until the next reboot of that endpoint. Upon the reboot event, the payload is\nexecuted and the IcedID Trojan becomes resident on the endpoint. At this point, the\nmalware’s components are in place to begin redirecting the victim’s internet traffic through a\nlocal proxy that it controls.\n\n### Tunneling the Victim’s Web Traffic\n\nIcedID sets up a local proxy to listen and intercept communications from the victim’s endpoint\nand redirects all internet traffic through it in two hops. First, the traffic is transferred to the\nlocalhost (127.0.0.1) via port 49157, which is part of the dynamic/private TCP/IP ports.\nSecond, the malware’s malicious process listens on that port and exfiltrates relevant\ncommunications to its C&C server.\n\n### Triggering the Redirection to a Bank Site Replica\n\n[Although it has only recently been launched, IcedID already uses redirection attacks. The](https://securityintelligence.com/dridex-launches-dyre-like-attacks-in-uk-intensifies-focus-on-business-accounts/)\nredirection scheme IcedID uses is not a simple handover to another website with a different\nURL. Rather, it is designed to appear as seamless as possible to the victim. These tactics\ninclude displaying the legitimate bank’s URL in the address bar and the bank’s correct SSL\ncertificate, which is made possible by keeping a live connection with the actual bank’s site.\n\nIcedID’s redirection scheme is implemented through its configuration file. The malware\nlistens for the target URL from the list and, once it encounters a trigger, executes a\ndesignated webinjection. The webinjection sends the victim to a fake bank site set up in\nadvance to match the one originally requested.\n\n\n-----\n\nThe victim is fooled into submitting his or her credentials on the fake page replica, which\nunknowingly sends him or her to the attacker’s server. From that point on, the attacker\n[controls the session the victim goes through, which typically includes social engineering to](https://securityintelligence.com/pick-a-card-any-card-deception-the-human-mind-and-the-social-engineering-challenge/)\ntrick the victim into divulging transaction authorization elements.\n\n### Malware Communications\n\nIcedID’s communications take place over encrypted SSL. During a campaign analyzed in\nlate October, the malware communicated with four different C&C servers.\n\nA schematic view of IcedID’s infection and communication infrastructure is shown below.\n\n_Figure 3: IcedID’s infection and communication infrastructure_\n\nTo report new infections to the botnet, IcedID sends an encoded message with the bot ID\nand basic system information:\n\n_Figure 4: IcedID’s C&C communication_\n\nParts of the decoded message shows the following details being sent to the C&C:\n\nB = Bot ID\nK = Computer Name\nL = Workgroup\nM = OS version\n\n### Remote Inject Panel\n\nTo orchestrate webinjection attacks for each targeted bank site, IcedID’s operators have a\ndedicated, web-based remote panel accessible with a username and password combination.\n\nWebinjection panels are typically commercial offerings criminals buy in underground\nmarkets. It is possible that IcedID’s uses a commercial panel or that IcedID itself is\ncommercial malware. However, at this time there is no indication that IcedID is being sold in\n[the underground or Dark Web marketplaces.](https://securityintelligence.com/the-dark-web-marketplace-a-shopping-center-for-attackers/)\n\n_Figure 5: IcedID’s remote webinject panel login page_\n\n[The panel communicates back to a server based on the OpenResty web platform. According](https://openresty.org/en/)\nto its official website, OpenResty is designed to help developers easily build scalable web\napplications, web services and dynamic web gateways.\n\n## A New Player in the Cybercrime Arena?\n\n\n-----\n\nIcedID is a newly identified threat in the financial cybercrime arena. While it is still early to tell\nhow it will fare, its current capabilities, distribution choices and targets point to a group that is\nno stranger to this domain.\n\n[IBM X-Force research continues to follow and post updates on IcedID on X-Force Exchange.](https://exchange.xforce.ibmcloud.com/collection/Icedid-e1afb90c4217131cca5821d00f841838)\nTo learn more about mitigating financial threats such as IcedID, please visit IBM Security\nTrusteer products page.\n\n## Indicators of Compromise\n\nIBM X-Force analyzed the following dropper MD5s for this research.\n\n38921f28bb74fea2cab6e70039ee65f3\n6899d3b51430679254635d78357c087e\nc01dcdba9223d037eb8bf0944f1c1c9e\nd982c6de627441765c89da5cfeb04d6f\nde4ef2e24306b35d29891b45c1e3fbfd\n\n## Browser Patching\n\nIBM X-Force analyzed the following hooks for this research.\n\nInternet Explorer:\n\nConnect\nCreateProcessInternalW\nCertGetCertificateChain\nCertVerifyCertificateChainPolicy\n\nFireFox:\n\nnss3.dll!SSL_AuthCertificateHook\n\nOther hooks:\n\nCreateProcessInternalW\nCreateSemaphoreA\n\nFor IP addresses and URLs from our investigation, please check reports in the IcedID\ncollection on X-Force Exchange.\n\n[Read the white paper: How digital banking is transforming fraud detection](https://www.ibm.com/marketing/iwm/dre/signup?source=urx-18586&S_PKG=ov60471)\n\n[Limor Kessem](https://securityintelligence.com/author/limor-kessem/)\nExecutive Security Advisor, IBM\n\n\n-----\n\nLimor Kessem is an Executive Security Advisor at IBM Security. She is a widely sought-after\nsecurity expert, speaker and author and a strong advocate for wom...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-11-13 - New Banking Trojan IcedID Discovered by IBM X-Force Research.pdf"
    ],
    "report_names": [
        "2017-11-13 - New Banking Trojan IcedID Discovered by IBM X-Force Research.pdf"
    ],
    "threat_actors": [
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535997,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653709944,
    "ts_modification_date": 1653709944,
    "files": {
        "pdf": "https://archive.orkl.eu/fa61b1499f630761fbab329b89a4826f39787bb9.pdf",
        "text": "https://archive.orkl.eu/fa61b1499f630761fbab329b89a4826f39787bb9.txt",
        "img": "https://archive.orkl.eu/fa61b1499f630761fbab329b89a4826f39787bb9.jpg"
    }
}