{
    "id": "f8da38ba-9c7d-42c9-934a-9d6aafb6af3d",
    "created_at": "2023-01-12T15:05:03.407893Z",
    "updated_at": "2025-03-27T02:06:09.033291Z",
    "deleted_at": null,
    "sha1_hash": "6e112844c8d4d568c74ea96c0fc0eb364176e1ab",
    "title": "2021-10-05 - Malware analysis- Details on LockBit ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T21:48:38Z",
    "file_modification_date": "2022-05-28T21:48:38Z",
    "file_size": 115121,
    "plain_text": "# Malware analysis: Details on LockBit ransomware\n\n**seguranca-informatica.pt/malware-analysis-details-on-lockbit-ransomware/**\n\nlampion\n\n## Introduction\n\n\nOctober 5, 2021\n\n\nLockBit is a [data encryption malware in operation since September 2019 and a recent Ransomware-as-a-Service (RaaS), in which developers](https://seguranca-informatica.pt/group-edp-ransomware-attack-from-scratch)\nare in charge of the payment site and development and affiliates sign up to distribute the threat in the wild. This piece of malware was\ndeveloped to encrypt large companies in a few hours as a way of preventing its detection quickly by security appliances and IT/SOC teams.\nAccording to [McAfee, LockBit encrypted approximately 25 servers and 225 workstations in just three hours during a recent attack.](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/tales-from-the-trenches-a-lockbit-ransomware-story/)\n\nWhen executed, the ransomware renames the files with the extension “.abcd” after compromising a device. After this process, a text file –\n“Restore-My-Files.txt” is created in all affected folders.\n\n## LockBit in depth\n\nThis malware is usually launched by criminals after a network has been compromised as one of the final stages of infection. LockBit\n[deployment is launched via a PowerShell command also observed on other mediatic ransomware, including Netwalker.](https://resources.infosecinstitute.com/netwalker-malware-what-it-is-how-it-works-and-how-to-prevent-it-malware-spotlight/)\n\n**_Figure 1: PowerShell command launching the first stage of LockBit._**\n\nIn detail, the PowerShell command retrieves a .png file (rs40 and rs35 according to the .NET version installed on the infected device) from a\nwebsite probably compromised by criminals, which starts the second stage. The second stage is a .NET downloader written in C# and\ncompiled via Microsoft Visual Studio. As presented below, the binary has three sections and it is not packed, so it can be reversed for better\nunderstanding.\n\n\n-----\n\n**_Figure 2: LockBit second stage — number of sections._**\n\nThis file is a .NET loader that when executed downloads the final payload — LockBit — from the internet. Analyzing the Main() function, it\nshows that an array with the AES-encrypted base64 string contains the LockBit binary.\n\n\n-----\n\n**_Figure 3: String base64 encrypted with AES to protect the final payload — LockBit ransomware._**\n\nIn some observed samples, the symmetric encryption key ENCRYPTION29942 was used to decrypt (and encrypt) the content observed in\nFigure 3\n\n\n-----\n\n**_Figure 4: AES ciphertext (the LockBit payload) and the symmetric decryption key._**\n\nThe .NET loader checks for the existence of vbc.exe on the infected device or downloads it from a compromised host (Figure 3). This binary is\nused for the process hollowing — a well-known technique for injecting LockBit into the memory.\n\nIn brief, the following calls were observed:\n\n**NtUnmapViewOfSection: Unmap the original code in execution**\n**NtWriteVirtualMemory: Writing the base address of the injected image into the PEB**\n**VirtualAllocEx: Allocating the space before injecting the malicious payload**\n\n[More details about this technique can be found here.](https://www.ired.team/offensive-security/code-injection-process-injection/process-hollowing-and-pe-image-relocations)\n\nRegarding the VBC utility: it is the visual basic compiler for Windows. LockBit uses it to compile and execute the payload in runtime.\n\n\n-----\n\n**_Figure 5: VBC utility used to compile and execute the payload on the fly._**\n\nAfter this, the ransomware is executed. It creates a new thread to manage services, terminate processes and delete the shadow volumes.\n\n\n-----\n\n**_Figure 6: Delete shadow copies from infected device._**\n\nThe ransomware has some entries hardcoded, related to services that are stopped during its execution.\n\n**_Figure 7: Hardcoded services inside the binary._**\n\nThe completed list of services that LockBit tries to terminate are the following:\n\n\n-----\n\ne atc (Sy a tec t us)\nccEvtMgr (Norton AntiVirus Event Manager)\nccSetMgr (Common Client Settings Manager Service of Symantec)\nSavRoam (Symantec Antivirus)\nsqlserv\nsqlagent\nsqladhlp\nCulserver\nRTVscan (Symantec Antivirus Program)\nsqlbrowser\ndbsrv12\ndbeng8 (Sybase’s Adaptive Server\nSQLADHLP\nQBIDPService (QuickBooksby Intuit.)\nQuickBoooks.FCS (QuickBooksby Intuit.)\nQBCFMonitorService (QuickBooksby Intuit.)\nsqlwriter\nmsmdsrv ( Microsoft SQL Server)\ntomcat6 (Apache Tomcat)\nzhundongfangyu (this belongs to the 360 security product from Qihoo company)\nvmware-usbarbitator64\nvmware-converter\nAnywhere version 8 database program)\nwrapper\n\nDuring the ransomware execution, a ransom note is created in each directory it encrypts with the following content:\n\n\n-----\n\n-----\n\n**_Figure 8: Ransom note dropped by LockBit during the encryption process._**\n\nA TOR link is available and used to get additional information about the ransom payment and to establish a straight communication with the\nransomware operators. As depicted below, a support chat is available, and also a feature named “Trial decrypt”, used to upload a damaged file\nand recover it. In short, this feature is just a proof-of-work provided by criminals.\n\n\n-----\n\n**_Figure 9: Trial decrypt and chat — LockBit ransomware._**\n\nThe ransomware also performs lateral movement by using ARP protocol and via sending SMB requests on the network. If any device is\naccessed with success, it tries to execute the payload present in Figure 1 to infect the next device.\n\nAnother interesting detail is that the malware tries to eliminate itself at the end of the execution and creates two entries in the registry so that in\npotential infections it realizes that the computer has already been infected.\n\n\n-----\n\n**_Figure 10: Registry entries created during LockBit execution to prevent further infections._**\n\n## Prevention measures\n\nThis type of ransomware is not disseminated through social engineering attacks like phishing or spearphishing. It is deployed after a foothold\non the network and to close the infection chain.\n\nBecause of this, fighting this threat is a headache! Monitoring can be a good friend, at least to detect potential intrusions on the network in an\nearly stage. Monitoring network assets and to install endpoint protection agents in each device should be a mandatory rule present on the\n“security menu” for each company. This is an effective measure that can warn IT administrators about potential abnormal events on the entire\necosystem.\n\n**[The article was initially published by Pedro Tavares on resources.infosecinstitute.com.](https://resources.infosecinstitute.com/topic/lockbit-malware-what-it-is-how-it-works-and-how-to-prevent-it-malware-spotlight/)**\n\n\n-----\n\n[Pedro Tavares](https://seguranca-informatica.pt/author/pipocaz/)\n**[Pedro Tavares is a professional in the field of information security working as an Ethical Hacker/Pentester, Malware Researcher and also a](https://www.linkedin.com/in/sirpedrotavares/)**\n[Security Evangelist. He is also a founding member at CSIRT.UBI and Editor-in-Chief of the security computer blog seguranca-informatica.pt.](https://seguranca-informatica.pt/)\n\nIn recent years he has invested in the field of information security, exploring and analyzing a wide range of topics, such as pentesting (Kali\nLinux), malware, exploitation, hacking, IoT and security in Active Directory networks. He is also Freelance Writer (Infosec. Resources Institute\n[and Cyber Defense Magazine) and developer of the 0xSI_f33d – a feed that compiles phishing and malware campaigns targeting Portuguese](https://feed.seguranca-informatica.pt/)\ncitizens.\n\n[Read more here.](https://seguranca-informatica.pt/contacto/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-05 - Malware analysis- Details on LockBit ransomware.pdf"
    ],
    "report_names": [
        "2021-10-05 - Malware analysis- Details on LockBit ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535903,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653774518,
    "ts_modification_date": 1653774518,
    "files": {
        "pdf": "https://archive.orkl.eu/6e112844c8d4d568c74ea96c0fc0eb364176e1ab.pdf",
        "text": "https://archive.orkl.eu/6e112844c8d4d568c74ea96c0fc0eb364176e1ab.txt",
        "img": "https://archive.orkl.eu/6e112844c8d4d568c74ea96c0fc0eb364176e1ab.jpg"
    }
}