{
    "id": "f90fedec-81aa-4046-81e7-e9afa505f088",
    "created_at": "2023-01-12T15:03:36.83717Z",
    "updated_at": "2025-03-27T02:17:05.559306Z",
    "deleted_at": null,
    "sha1_hash": "047c06784d232cf24e4c1248361cc00cdd20c91c",
    "title": "2021-07-19 - Fresh Malware Hunts for Crypto Wallet and Credentials",
    "authors": "",
    "file_creation_date": "2022-05-29T10:46:51Z",
    "file_modification_date": "2022-05-29T10:46:51Z",
    "file_size": 122450,
    "plain_text": "# Fresh Malware Hunts for Crypto Wallet and Credentials\n\n**[fortinet.com/blog/threat-research/fresh-malware-hunts-for-crypto-wallet-and-credentials](https://www.fortinet.com/blog/threat-research/fresh-malware-hunts-for-crypto-wallet-and-credentials)**\n\n**[FortiGuard Labs Threat Research Report](https://www.fortinet.com/fortiguard/labs.html?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)**\n\nAffected platforms: Microsoft Windows\n\nImpacted parties:   Windows Users\n\nImpact:           Collects sensitive information from victims’ computers\n\nSeverity level:      Critical\n\n\nJuly 19, 2021\n\n\n[The FortiGuard Labs team was recently monitoring a new phishing campaign that uses the classic](https://www.fortinet.com/resources/cyberglossary/phishing?utm_source=blog&utm_campaign=phishing)\nstrategy of attaching a malicious Microsoft Word document to an unsolicited email that recipients were\nthen asked to open. However, after I performed some deep research on this phishing campaign, I\nrealized that a fresh malware was being delivered by the Word document designed to steal crypto\n[wallet information and credentials from the victims’ infected devices. This malware doesn’t seem to](https://www.fortinet.com/resources/cyberglossary/malware?utm_source=blog&utm_campaign=malware)\nbelong to any known malware family, so we named it \"dmechant\", which is a constant string compiled\nin the malware sample.\n\nIn this analysis I reveal my findings on this new malware, including how it is launched by the Word\ndocument, how the executable deploys itself on the victim’s device, what kind of sensitive information\nit searches for, and how stolen data is sent to the attacker via SMTP protocol.\n\n\n-----\n\n## The Email Captured by FortiGuard Labs and the Word Document\n\nThe spam email looks like an urgent order reminder from a purchase manager. It asks the recipient to\nreview the materials in the attached Word document and then reply to the email as soon as possible.\n\nFigure 1.1 – The captured phishing email\n\nAs with Word documents used in other phishing campaigns, this one includes a malicious Macro.\nOnce opened, Word displays a security warning bar to inform the user of the risk of opening it.\n\nFigure 1.2 – The content of the attached Word document\n\nInterestingly, the content of this document is written in Spanish. Our best guesses are that this\ncampaign is targeting multiple regions and the wrong document was attached, or this is being done\ndeliberately to disguise the warning. In either case, I translated it into English using Google translate:\n\n**Document created in an earlier version of Microsoft Office Word**\n\n**To see this content, click on \"enable editing\" from the yellow bar and then click \"Enable**\n**content\"**\n\nThe malicious Macro is executed once the button Enable Content is clicked. It has a VBA function\ncalled Document_Open(). This is a built-in function of the Macro and is called automatically when the\ndocument is opened. It then calls other functions to extract a JS (JavaScript) code into a file\n(rtbdxsdcb.js) under the %temp% folder. After that, it executes this “JS” file to finish the Macro’s work.\n\nFigure 1.3 is a screenshot of Macro VBA code displaying the JS code to be extracted and the process\nof writing into local file rtbdxsdcb.js, as well as it being executed.\n\nAs you can see, it calls the Shell function to execute the command to run the JS file:\n\n**cmd.exe /start %Temp%\\rtbdxsdcb.js**\n\nFigure 1.3 – JS code, JS file and executing the JS file\n\nGoing through the JS code we find that its code is highly obfuscated. According to my analysis, its\nmajor task is to request the URL:\n\nhxxps[:]//cdn[.]discordapp[.]com/attachments/789415918744764447/857131714521202688/blessed[.]exe\n\nThis downloads an executable file into %Temp% and saves it as erbxcb.exe, which is the payload file\nof this malware. Later, it creates a WScript.Shell object to start up the payload executable file on the\ninfected device.\n\n## Stage I – Starting the Payload Executable File\n\nThe payload file, erbxcb.exe, is disguised as a PDF document to confuse the victim. Figure 2.1 shows\nwhat this file looks like.\n\nFigure 2.1 – The downloaded executable file – erbxcb.exe\n\n\n-----\n\nOnce it starts, erbxcb.exe loads a block of compressed data from its PE file and decompresses it into\na local file named %Temp%\\arwtfgxjpx80. (This is an encrypted PE file that I will discuss shortly.) It\ncontinues to dynamically extract a piece of code into the Stack memory and get it executed.\n\n**The Extracted Code Mainly Performs:**\n\n1. It copies erbxcb.exe into a newly-created folder (%AppData%\\bplg) and renames “aoqn.exe”. As\nyou can see in Figure 2.2, it was about to call a function (call 12F675, whose arguments are the\nsource file and the target file) to copy this executable file into a new location.\n\nFigure 2.2 – File copy function\n\n2. It adds the copied file into the auto-run group in the system registry. To do this, it calls several APIs,\nlike RegOpenKeyExW() and RegSetValueExW(). Figure 2.3 is a screenshot of the system registry\nwith the added auto-run item, making this malware able to run at Windows startup.\n\nFigure 2.3 – Display of the added auto-run item in system registry\n\n3. It then loads the decompressed file %Temp%\\ arwtfgxjpx80, mentioned earlier, into memory and\ncalls a function to decrypt it. As a result, it is able to extract an executable PE file in memory.\n\nThe dynamic code then creates a duplicate of the current process (erbxcb.exe) in a suspended state\n(by calling the API CreateProcessW() with a CREATE_SUSPENDED flag). In this way it is able to\ndeploy the decrypted PE file into the newly-created second process. It then transports each section of\n[the decrypted PE file into the second process to override its existing code. By calling the API](https://www.fortinet.com/resources/cyberglossary/api-security?utm_source=blog&utm_campaign=api-security)\nSetThreadContext() it is able to set the entry point of the second process to the deployed PE file, and\ncalling ResumeThread() lets the deployed PE file run inside the second process.\n\nThe last thing the dynamic code does in the first process is to call the API ExitProcess() to exit the\nprogram.\n\n## Stage II – Real Malware Runs Inside the Second Process\n\nAccording to my analysis, the decrypted PE file running inside the second process is written in MS\nVisual Basic 5.0-6.0 language without any packer. I dumped it into a local file, and Figure 3.1 shows\nthe detection result in an analysis tool—Exeinfo PE.\n\nFigure 3.1 – Decrypted PE file detection result\n\nWhen it starts, it first gathers basic information about the victim’s device, such as current System\nTime, Windows Version, User Name, Computer Name, and so on. This information will be sent to the\nattacker along with other stolen data.\n\nIt then sets %AppData%\\Microsoft\\Windows\\Templates as its home folder, where it puts some of its\ntemporary files, such as extracted files, collected browser profiles, and collected crypto wallet data.\n\n**Collecting Crypto Wallet Data**\n\n\n-----\n\nThis malware focuses on collecting profiles of crypto wallets (if installed) from the infected device. It\nhas ten predefined crypto wallet software instances in the malware with a dynamically combined\ndefault profile folder path, as shown at the bottom of Figure 3.2.\n\nThis crypto wallet software includes: Zcash, Armory, Bytecoin, Jaxx Liberty, Exodus, Ethereum,\nElectrum, Atomic, Guarda, and Coinomi.\n\nFigure 3.2 –The full path list of crypto wallets\n\nOnce a crypto wallet is detected, it copies the entire folder containing the wallet’s profile data\n(including sub-folders and files—like the path listed in Figure 3.2) to its home folder (at\n“%AppData%\\Microsoft\\Windows\\Templates”). It then compresses the copied profile folders into a ZIP\narchive—CryptoWallets.zip—which is eventually sent to the attacker as an email’s attachment.\n\nAs far as we have been able to determined, the attacker could obtain your bitcoin private key, bitcoin\naddress, crypto wallet address and other significant information.\n\n**Collect Saved Credentials by Executing an Extracted EXE file**\n\nIt also extracts an EXE file (“sdedffggdg.exe”) from the Resource section, which is written by .Net\nFramework. This malware collects credentials from predefined browsers and saves the collected\ninformation into a newly-created credentials.txt file under its home folder.\n\nFigure 3.3 is an example of a credentials.txt file, after it executes the extracted .net EXE\nfile(“sdedffggdg.exe”), where it shows the credentials collected from the Google Chrome browser from\nmy testing device.\n\nFigure 3.3 – Collected credentials saved in Chrome\n\n“sdedffggdg.exe” is able to collect saved credentials from the following predefined browsers (if\ninstalled): \"Chrome\",\"Opera\",\"Yandex\",\"360 Browser\",\"Comodo Dragon\",\"CoolNovo\",\"SRWare\nIron\",\"Torch Browser\",\"Brave Browser\",\"Iridium Browser\",\"7Star\",\n\"Amigo\",\"CentBrowser\",\"Chedot\",\"CocCoc\",\"Elements Browser\",\"Epic Privacy\nBrowser\",\"Kometa\",\"Orbitum\",\"Sputnik\",\"uCozMedia\",\"Vivaldi\",\"Sleipnir 6\", \"Citrio\",\"Coowon\",\"Liebao\nBrowser\",\"QIP Surf\" and \"Edge Chromium\".\n\n**Collect Other Saved Credentials**\n\nOther than the browsers identified above, this malware also collects saved credentials from other\ninstalled software clients, including Outlook, CoreFTP, FileZilla, NordVPN, FoxMail, Thunderbird, and\nsimilar browsers such as Firefox, Waterfox, K-Meleon, Cyberfox, and BlackHawk.\n\nFigure 3.4 – Screenshot of collected credentials in a debugger\n\nIn the memory, shown in Figure 3.4, you can see an example of the credentials just after they are\ncollected from the application FileZilla on my research machine. Each group of credentials consists of\nURL, Username, Password, and Application. Each group of the credentials is split by\n“=============================”.\n\n## Stage III – Sending Collected Data to the Attacker via SMTP\n\n\n-----\n\nThis malware has a specific function used to generate and send an email that includes the stolen\nsensitive information using the created CDO.Message object.\n\nFigure 4.1 shows a snippet of this function code (I only included the key code).\n\nFigure 4.1 – Snippet of code generating the exfiltration email\n\nAs you can see, it calls rtcCreateObject2() to create the CDO.Message object, which then sets the\nemail’s From, To, Subject, TextBody, and AddAttachment fields.\n\nSubject starts with a keyword and follows with the victim’s Computer Name and User Name. The\nkeyword string should be one of the “CryptoWallets” for the crypto wallet profile, “Passwords” for\ncredentials, or “Keylogger” for key logger data (this function was not enabled in this version).\n\nAfter an email is created, the CDO.Message’s Send() function is called to send the Email out to the\nattacker’s email address.\n\nBelow are two examples of sending these emails via SMTP protocol.\n\nFigure 4.2 sends an email with the crypto wallets profiles in the attachment CryptoWallets.zip to the\nattacker. The attachment is encoded in base64.\n\nFigure 4.2 – SMTP packet example of sending collected Crypto Wallet profile\n\nFigure 4.3 shows sending stolen credentials, where the text body contains basic information, stolen\ncredentials, and its attachment includes collected browser profiles that contain saved credentials. The\nattachment is also encoded in base64.\n\nFigure 4.3 – Packet example of sending stolen credentials data\n\n## Conclusion\n\n[In this post I first detailed the phishing email captured by our FortiGuard Labs and its attached Word](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)\ndocument. Next, I demonstrated how a JS file is extracted and executed by the Macro to download\nthe malware’s payload executable file.\n\nI also introduced how the malware adds itself into the auto-run group and runs in the second process.\nI also demonstrated the main tasks of the malware, how and what kind of sensitive information it\ncollects from the infected device, including crypto wallet profile information and the credentials of\nbrowsers and clients, and how that collected data is sent to the attacker using the SMTP protocol.\n\nI mentioned many processes in this blog. To help you better comprehend the relationship of the\nrelevant processes initiated by the opening of the Word document, I have made a screenshot of the\nProcess Tree, shown in Figure 5.1. The involved processes are WINWORD.EXE, cmd.exe,\nWScript.exe, erbxcb.exe, and sdedffggdg.exe.\n\nFigure 5.1 – Process Tree led by opening the Word document\n\n## Fortinet Protections\n\n\n-----\n\nFortinet customers are already protected from this malware by FortiGuard s [Web Filtering, AntiVirus,](https://www.fortinet.com/support-and-training/support-services/fortiguard-security-subscriptions/web-filtering.html?utm_source=blog&utm_campaign=web-filtering)\n[FortiEDR and CDR (content disarm and reconstruction) services, as follows:](https://www.fortinet.com/products/endpoint-security/fortiedr.html?utm_source=blog&utm_campaign=fortiedr)\n\nThe downloading URL has been rated as \"Malicious Websites\" by the FortiGuard Web Filtering\nservice.\n\nThe Word document and downloaded executable file are detected as \"VBS/Agent.4885!tr\" and\n\"W32/Kryptik.J!tr\" and are blocked by the FortiGuard AntiVirus service.\n\n[FortiMail users are protected by FortiGuard AntiVirus, which detects the original Word document as a](https://www.fortinet.com/products/email-security/fortimail.html?utm_source=blog&utm_campaign=fortimail-main-page)\nmalicious attachment in the phishing email, and further protected with the CDR service, which can be\nused to neutralize the threat of any macros within Office documents.\n\nFortiEDR detects the downloaded executable file as malicious based on its behavior.\n\n## IOCs\n\n**URLs:**\n\nhxxps[:]//cdn[.]discordapp[.]com/attachments/789415918744764447/857131714521202688/blessed.exe\n\n**Sample SHA-256:**\n\n[Ncc June Purchase -Contract 0262320216486488574.doc]\n\n105D9496D4F80AE5EF3C7642F55117B65A10398AFE5FF9C30D706FA9873CFD6A\n\n[erbxcb.exe or aoqn.exe]\n\n9C7023EFB920442DFD73D96D303A1B2CFB53A727F2B6B55DE8B4D25BC90FE95E\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization and the](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n_Learn more about Fortinet’s_ _[free cybersecurity training, an initiative of Fortinet’s Training](https://www.fortinet.com/training/cybersecurity-professionals?utm_source=blog&utm_medium=campaign&utm_campaign=Freetraininginitiative)_\n_Advancement Agenda (TAA), or about the_ _[Fortinet Network Security Expert program, Security](https://training.fortinet.com/?utm_source=blog&utm_campaign=nse-institute)_\n_Academy program, and_ _[Veterans program. Learn more about FortiGuard Labs global threat](https://www.fortinet.com/corporate/careers/vets.html?utm_source=blog&utm_campaign=fortivet)_\n_[intelligence and research and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/support/support-services/fortiguard-security-subscriptions/fortiguard-services-bundles.html?utm_source=blog&utm_campaign=fortiguard-service-bundles)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-19 - Fresh Malware Hunts for Crypto Wallet and Credentials.pdf"
    ],
    "report_names": [
        "2021-07-19 - Fresh Malware Hunts for Crypto Wallet and Credentials.pdf"
    ],
    "threat_actors": [
        {
            "id": "75455540-2f6e-467c-9225-8fe670e50c47",
            "created_at": "2022-10-25T16:07:23.740266Z",
            "updated_at": "2025-03-27T02:02:09.955585Z",
            "deleted_at": null,
            "main_name": "Iridium",
            "aliases": [],
            "source_name": "ETDA:Iridium",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "LazyCat",
                "Powerkatz",
                "SinoChopper",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0661a292-80f3-420b-9951-a50e03c831c0",
            "created_at": "2023-01-06T13:46:38.928796Z",
            "updated_at": "2025-03-27T02:00:02.953963Z",
            "deleted_at": null,
            "main_name": "IRIDIUM",
            "aliases": [],
            "source_name": "MISPGALAXY:IRIDIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535816,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653821211,
    "ts_modification_date": 1653821211,
    "files": {
        "pdf": "https://archive.orkl.eu/047c06784d232cf24e4c1248361cc00cdd20c91c.pdf",
        "text": "https://archive.orkl.eu/047c06784d232cf24e4c1248361cc00cdd20c91c.txt",
        "img": "https://archive.orkl.eu/047c06784d232cf24e4c1248361cc00cdd20c91c.jpg"
    }
}