{
    "id": "f9111aba-4ef5-4d6a-bc41-100575f5e221",
    "created_at": "2023-06-05T02:06:23.106504Z",
    "updated_at": "2025-03-27T02:05:27.757234Z",
    "deleted_at": null,
    "sha1_hash": "92056bb42285b0e2d83fa430ec4240d54a6e230c",
    "title": "2023-05-19 - Analysis of Amadey Bot Infrastructure Using Shodan",
    "authors": "",
    "file_creation_date": "2023-06-04T12:50:44Z",
    "file_modification_date": "2023-06-04T12:50:44Z",
    "file_size": 5716718,
    "plain_text": "# Analysis of Amadey Bot Infrastructure Using Shodan\n\n**embee-research.ghost.io/amadey-bot-infrastructure/**\n\nMatthew May 19, 2023\n\n[intel](https://embee-research.ghost.io/tag/intel/)\nIdentifying Amadey Bot Servers Using Shodan.\n\n[Analysing a suspicious ip address found in my previous post on Amadey Bot Malware.](https://embee-research.ghost.io/redline-stealer-basic-static-analysis-and-c2-extraction/)\nUtilising Shodan and Censys to pivot to additional Amadey infrastructure.\n\nHere you'll see how to use a known c2 to craft additional queries based on html content and\ncertificate information. In total, 12 unique servers will be identified.\n\n[Original sample can be found here and original post here.](https://bazaar.abuse.ch/sample/449d9e29d49dea9697c9a84bb7cc68b50343014d9e14667875a83cade9adbc60/?ref=embee-research.ghost.io)\n\n(If you're just here for the c2 list, it's at the bottom of this post)\n\n## Analysis\n\nIn the original post on Amadey bot, conditional breakpoints were used to extract decrypted\nstrings and obtain the address of a command and control (C2) server.\n\nA partial output of this can be seen below. Observing that the ip 77.91.124[.]207 has been\nextracted alongside a partial URL.\n\nBy utilising Shodan and Censys, I wanted to try and identify any additional C2 servers or\nrelated infrastructure.\n\n[Special thanks to Michael Koczwara for the initial inspiration for this post. Also thanks to](https://michaelkoczwara.medium.com/hunting-malicious-infrastructure-using-jarm-and-http-response-bb4a039d4119?ref=embee-research.ghost.io)\n[Chris Duggan and](https://twitter.com/TLP_R3D?ref=embee-research.ghost.io) [0xburgers for their inspiring and helpful posts.](https://twitter.com/0xBurgers?ref=embee-research.ghost.io)\n\n## Analysis of the IP with Shodan\n\nI initially analyzed the IP of 77.91.124[.]207 by inputting it directly into Shodan. My goal\nhere was to try to identify any unique pieces of information that could potentially be used to\npivot to additional servers.\n\n\n-----\n\nI m still new to Shodan and this type of analysis, but the kinds of information I was mainly\nlooking for were..\n\nUnique headers and header values\nSSL Certificates with unique information (issuer and subject in particular)\nSSL Fingerprints (JARM and JA3)\nUnique titles in HTTP Responses\nUnique content returned in HTTP bodies.\n\nMy first search was a plain search for the original Amadey C2 of 77.91.124[.]207 (without\nthe [.]), this identified a running server with three open ports. 21,80,443\n\nThe first port available was port 21, this appeared to be a plain FTP server without any\nunique information to pivot from.\n\nThe second available port was port 80, nothing stood out within the headers but I decided to\nlook further by inspecting the http response.\n\n\n-----\n\nThe html response was obtained from within the \"raw data\" Shodan tab and contained\nmultiple references to \"Sosi nahui!\". (Essentially a f*ck off in Russian)\n\nThis was a reasonably unique value that could serve as a pivot point.\n\nThis polite message was present in both the html body and html title. These two fields\nprovided two values that could be used for pivoting.\n\nOption one was the hash of the html response. Option two was the html title. Both are\ndependent on the \"unique\" content of \"Sosi Nahui!\"\n\n\n-----\n\n### Option 1 - Shodan Pivoting with the html hash\n\n[Pivoting with the html_hash produced 19 results for similar servers. Each server had an](https://www.shodan.io/search?query=http.html_hash%3A548631456&ref=embee-research.ghost.io)\nidentical html title of \"Sosi Nahui!\" and were all based in either Russia Finland. For me, this\nwas enough similarity to begin assuming similar origin.\n\nNote that of these 19 results there were only 12 unique IP addresses. Some IP's were\ncounted twice if the same hash appeared on multiple ports. (Eg same response on port\n```\n  80 and 443)\n\n```\n\n-----\n\nThe results of this scan have all been exported and added to the end of this post.\n\n**Option 2 - Shodan Pivoting With the HTML Title**\n\n[Pivoting based on the html title produces the same 19 results. Again noting that some of](https://www.shodan.io/search?query=http.title%3A%22Sosi+nahui%21%22&ref=embee-research.ghost.io)\nthese are duplicates.\n\n## Shodan Pivoting With the Subject Common Name\n\nBoth shodan searches contained references to desas.digital inside the subject common\n[name of the ssl certificate.](https://support.dnsimple.com/articles/what-is-common-name/?ref=embee-research.ghost.io)\n\nThis was another unique and interesting value that could be used as a pivot point.\n\n[Seven results could be found by modifying the Shodan query to](https://www.shodan.io/search?query=ssl.cert.subject.cn%3A%22desas.digital%22&ref=embee-research.ghost.io)\n```\nssl.cert.subject.cn:\"desas.digital\".\n\n```\n\n-----\n\n[This query was able to be crafted by referencing the Shodan Filter list.](https://www.shodan.io/search/filters?ref=embee-research.ghost.io)\nPivoting with the subject common name can produce new results and additional servers. In\nthis case, no new servers were found.\n\nThe returned results were all contained within the initial results for \"sosi nahui!\" and the\nhtml_hash.\n\nAt this point I was satisfied with my analysis of port 80 and decided not to pursue it further.\nThere may be other avenues that could have resulted in more servers.\n\nThese same results could also have been obtained by clicking directly on the\nhtml_hash from the original page. This is a good option if you don't have the paid\nversion of Shodan.\n\n\n-----\n\n## Shodan Analysis of Port 443\n\nMoving back to the original search for 77.91.124[.]207, there still remained port 443 to be\nanalyzed.\n\n[This revealed another reverse proxy running with nginx.](https://www.cloudflare.com/en-gb/learning/cdn/glossary/reverse-proxy/?ref=embee-research.ghost.io)\n\nThe html responses on this port were identical to those on port 80 and would produce the\nsame results when searched.\n\nPort 443 also contained references to the same desas.digital certificate that was\npreviously identified.\n\n\n-----\n\nThe rest of the certificate did not contain anything that I could pivot from.\n\nThe remaining certificate values were not interesting outside of additional references to\n```\ndesas.digital which had already been identified. The next task was to try to pivot further\n\n```\nusing the ssl ja3 and ssl jarm hashes.\n\nThe [ja3 and](https://engineering.salesforce.com/tls-fingerprinting-with-ja3-and-ja3s-247362855967/?ref=embee-research.ghost.io) [jarm are ssl/tls fingerprints that can be used to identify separate servers](https://engineering.salesforce.com/easily-identify-malicious-servers-on-the-internet-with-jarm-e095edac525a/?ref=embee-research.ghost.io)\ncontaining certificates with similar origins. They are often used as pivot points in blogs\nutilising Shodan.\n\nThese two fingerprint values were present in the raw_data tab of Shodan. (Expand All and\nCTRL+F if your raw data tab gets too wild)\n\nPivoting from the Jarm hash produced 154,426 results.\n\nI suspect this was because the Jarm was related to Let's Encrypt and not specifically to\n[this malware. (Let's Encrypt is a popular free service for producing TLS certificates, so it](https://letsencrypt.org/?ref=embee-research.ghost.io)\nmakes sense that there are a lot of \"similar\" certificates)\n\n\n-----\n\nEssentially, this meant that the Jarm (on its own) was not useful as a pivot point as the\nproperties that produce the Jarm fingerprint are shared with a huge number of other Let's\nEncrypt certificates.\n\nPivoting from the ja3 came to a similar conclusion with over nine million results returned.\n\nAs with the Jarm, the Ja3 fingerprint was not useful as a pivot point.\n\nIt's possible that the Jarm/ja3 fingerprints could be combined with other fields to produce a\nbetter result, but I decided not to pursue this route when 9 Million results were returned.\n\nI then moved on to [Censys to continue analysis.](https://search.censys.io/?ref=embee-research.ghost.io)\n\n## Analysing Infrastructure With Censys\n\nContinuing analysis using Censys, I decided to input the initial ip in order to compare results.\n\nA Censys search for the ip 77.91.124.207 returned the ip with no running services. Censys\nhas likely performed a scan whilst the server was down or not responding to Censys\nheaders.\n\nThis highlights why it is useful to use multiple tools.\n\n\n-----\n\nUtilising the previously obtained desas.digital, 6 results are found.\n\nThese results were all contained within the 19 results from Shodan. No new results were\nfound.\n\n\n-----\n\nAttempts to pivot using the html title produced the same 6 results as the search for\n```\ndesas.digital.\n\n```\n\n-----\n\nThe Censys page for 77.91.68[.]248 contained references to a body hash which could be\nuseful for additional pivoting.\n\n\n-----\n\nHowever, attempts to pivot from this html hash produced no new results.\n\nContinuing analysis, I was unable to identify any additional servers with Shodan or Censys.\n\nI exported my results from Shodan and they have been included at the end of this post.\n\n## Conclusion\n\nAt this point I was happy with the 12 unique servers initially identified by Shodan and I\ndecided to call it a day. These 12 servers all shared extremely similar html content, location\nand certificate information so I had high confidence that they were related.\n\nIf you wish to read the original analysis that produced the initial IP address, you can find that\nhere.\n\nRedline Stealer/Amadey Bot - Static Analysis and C2 Extraction\n\nDeep dive analysis of a redline stealer sample. I will use manual analysis to extract C2\ninformation using a combination of Ghidra and x32dbg\n\n\n-----\n\nEmbee ResearchMatthew\n\n\n-----\n\n## One Last Thing\n\nIf you enjoyed this post and would like to see more. Consider becoming a member of the\nsite.\n\nMembers will receive early access to blogs and threat intel, exclusive posts, as well as\naccess to a discord server where you can ask questions and get help with analysis.\n\n[Sign up here](https://embee-research.ghost.io/#/portal/)\n\n## Final Results\n\n**Shodan**\n```\n   http.html_hash:548631456\n   ssl.cert.subject.cn:\"desas.digital\"\n   http.title:\"sosi nahui!\"\n\n```\n**Censys**\n```\n   services.tls.certificates.leaf_data.subject.common_name:\"desas.digital\"\n   services.http.response.body_hash:\"sha1:e084a66d16925abf43390c59d783f7a2fb\n   49752d\"\n\n## List Of Identified Servers\n77.91.68.61\n\n77.91.68.62\n\n77.91.68.248\n\n77.91.124.20\n\n77.91.124.130\n\n77.91.124.203\n\n77.91.124.207\n\n77.91.124.242\n\n193.201.9.43\n\n193.201.9.44\n\n193.201.9.67\n\n193.201.9.241\n\n VirusTotal CrossCheck (2023-05-17)\n\n```\n\n-----\n\n```\n77.91.68.61 1/87\n\n77.91.68.62 - 11/87\n\n77.91.68.248 - 3/87\n\n77.91.124.20 - 1/87\n\n77.91.124.130 - 3/87\n\n77.91.124.203 - 10/87\n\n77.91.124.207 - 1/87\n\n77.91.124.242 - 1/87\n\n193.201.9.43 - 1/87\n\n193.201.9.44 - 0/86\n\n193.201.9.67 - 11/87\n\n193.201.9.241 - 2/87\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-19 - Analysis of Amadey Bot Infrastructure Using Shodan.pdf"
    ],
    "report_names": [
        "2023-05-19 - Analysis of Amadey Bot Infrastructure Using Shodan.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1685930783,
    "ts_updated_at": 1743041127,
    "ts_creation_date": 1685883044,
    "ts_modification_date": 1685883044,
    "files": {
        "pdf": "https://archive.orkl.eu/92056bb42285b0e2d83fa430ec4240d54a6e230c.pdf",
        "text": "https://archive.orkl.eu/92056bb42285b0e2d83fa430ec4240d54a6e230c.txt",
        "img": "https://archive.orkl.eu/92056bb42285b0e2d83fa430ec4240d54a6e230c.jpg"
    }
}