{
    "id": "f97afee7-3367-4287-86d2-2841e021b87e",
    "created_at": "2023-01-12T15:02:27.375413Z",
    "updated_at": "2025-03-27T02:09:29.520509Z",
    "deleted_at": null,
    "sha1_hash": "9025ba26d8893c44831f6d47bd941b7d00f66cf7",
    "title": "2022-08-09 - AiTM phishing attack targeting enterprise users of Gmail",
    "authors": "",
    "file_creation_date": "2022-08-18T03:58:12Z",
    "file_modification_date": "2022-08-18T03:58:12Z",
    "file_size": 1650560,
    "plain_text": "# AiTM phishing attack targeting enterprise users of Gmail\n\n**[zscaler.com/blogs/security-research/aitm-phishing-attack-targeting-enterprise-users-gmail](https://www.zscaler.com/blogs/security-research/aitm-phishing-attack-targeting-enterprise-users-gmail)**\n\n## Summary\n\n[This blog is a follow-up to our recent publication which described the details of a large-scale](https://www.zscaler.com/blogs/security-research/large-scale-aitm-attack-targeting-enterprise-users-microsoft-email-services)\nphishing campaign targeting enterprise users of Microsoft email services.\n\nBeginning in mid-July 2022, ThreatLabz started observing instances of adversary-in-themiddle (AiTM) phishing attacks targeted towards enterprise users of Gmail. Upon further\nanalysis of the attack chain, we identified multiple similarities between this campaign and\nthe previous AiTM phishing campaign targeting users of Microsoft email services.\n\nG Suite is the business version of Gmail, and is widely used in enterprises. This campaign\nspecifically targeted chief executives and other senior members of various organizations\nwhich use G Suite.\n\n[As we have already covered the technical details of AiTM techniques in our previous blog,](https://www.zscaler.com/blogs/security-research/large-scale-aitm-attack-targeting-enterprise-users-microsoft-email-services)\nwe won't describe them again here. However, it is important to note that AiTM phishing kits\ncan be used to target various websites and bypass multi-factor authentication. By using\nphishlets crafted to target a specific legitimate website, attackers can quickly re-use the\nAiTM phishing technique against a new target website.\n\nIn this blog, we present the indicators of overlap between the two campaigns (Microsoft and\nGmail), and discuss how we reached the conclusion that both these phishing campaigns\nwere run by the same threat actor.\n\n\n-----\n\nThese campaigns used similar tactics, techniques and procedures (TTPs). There was also\nan overlap of infrastructure, and we even identified several cases in which the threat actor\nswitched from Microsoft AiTM phishing to Gmail phishing using the same infrastructure.\n\nInterestingly, the Gmail AiTM phishing campaign had a much lower volume of targets\ncompared to the Microsoft AiTM phishing attack.\n\n## Key Points\n\nBeginning in July 2022, the same threat actor that used AiTM phishing kits to target\nenterprise users of Microsoft email services began targeting enterprise users of G\n**Suite.**\n\nThe attack is capable of bypassing multi-factor authentication (MFA) protection of\nGmail.\n\nThese phishing emails were sent to chief executives and other senior members of the\ntargeted organizations in the US. In some cases, the emails were also sent to the\nexecutive assistants of the CEOs and CFOs.\n\nThe compromised emails of chief executives were used to conduct further phishing\nattacks by the threat actor.\n\nMultiple compromised domains were used as an intermediate URL redirector to land\nthe user on the final phishing page.\n\nA similar client-side fingerprinting script was used for evasion by the threat actor as\nobserved in the previous campaign.\n\nThe same redirector scripts used in the Microsoft phishing campaign were updated to\ntarget G Suite enterprise users.\n\n## Attack chain\n\nFigure 1 below depicts the attack chain at a high level. The attack begins with the user\nreceiving an email containing a malicious link. This link leverages multiple levels of\nredirection and abuses Open Redirect pages to land the user on the final attacker\n\n-----\n\ncontrolled Gmail phishing domain. However, before the actual phishing page is presented to\nthe user, the server does a fingerprinting check on the client in order to make sure that a\nreal user is browsing to the site and not an automated analysis system.\n\nEach component of the attack chain is explained in more detail in the corresponding\nsections later.\n\n_Figure 1: A high-level attack chain of the phishing process_\n\n## Distribution mechanism\n\nThe attack vector used in this campaign was emails with the malicious link embedded in\nthem. These emails were specifically sent to chief executives and senior members of the\ntargeted organization.\n\nThe phishing emails impersonated Google and pretended to be password-expiry reminder\nemails prompting the user to click a link in order to \"Extend their access.\"\n\nFigure 2 shows an example of one such phishing email.\n\n\n-----\n\n_Figure 2: G Suite phishing email_\n\n## URL redirection\n\nThe redirection happens in multiple stages which we describe below.\n\n## Stage 1\n\nThere were two categories of Stage 1 redirect links observed in the Gmail phishing\ncampaign.\n\n**Variant #1 [Open Redirect abuse]**\n\nThis variant abused Open Redirect pages of Google Ads and Snapchat, similar to what we\ndescribed in our research on Microsoft AiTM phishing campaign.\n\nFigure 3 depicts two instances where the same Gmail phishing URL was delivered using a\nSnapchat redirect in one case, and the Google Ads redirect in another.\n\n\n-----\n\n_Figure 3: Redirect using Open Redirect pages_\n\n**Variant #2**\n\nThis variant used compromised sites which stored an encoded version of the Stage 2\nredirector and the victim’s email address in the URL. Figure 4 depicts the format of this\nvariant.\n\n_Figure 4: Second variant of the Stage 1 URL used to redirect users to Stage 2_\n\n\n-----\n\n## Stage 2 (Intermediate redirector)\n\nThe intermediate redirector is a JavaScript hosted on compromised domains. Figure 5\nshows an example of the redirect script. The variable \"redirectURL\" in the script specifies\nthe final phishing landing page.\n\n_Figure 5: Stage 2 intermediate URL redirector_\n\nWe observed that the threat actor updated this redirectURL variable regularly to ensure it\npoints to the latest phishing page. This allows the threat actor to quickly update their\ncampaign to keep up with URL detections added by security vendors. We regularly\nmonitored these redirector scripts to identify new phishing pages proactively and added\ndetection.\n\nWe identified compromised domains hosting URL redirect scripts which were updated to\npoint to the new G suite phishing URLs.\n\nFigure 6 shows a side-by-side comparison of this case. In this example, \"loftds[.]com\" is the\nattacker-controlled domain hosting the redirector script. As can be seen on the left-hand\nside, on July 11th 2022, the redirector script pointed to a URL used in Microsoft AiTM\nphishing attack. On the right-hand side, we can see that on July 16th 2022, the same script\nwas updated to point to a URL used in the G suite AiTM phishing attack.\n\n\n-----\n\n_Figure 6: Same redirector page used in Microsoft AiTM and G suite/Gmail AiTM phishing_\n\nThis was a strong indicator which helped us correlate the two campaigns to the same threat\nactor.\n\n## Fingerprinting-based evasion\n\nThe main phishing page used client-side JavaScript-based fingerprinting to detect the\npresence of automated URL analysis systems. The fingerprint information collected from\nthe device will be sent to the server using websocket. We explained the technical details of\n[this fingerprinting method in our previous blog here.](https://www.zscaler.com/blogs/security-research/large-scale-aitm-attack-targeting-enterprise-users-microsoft-email-services)\n\nOnce all the stages of URL redirection and the client fingerprinting checks are passed, the\nuser lands on the final Gmail phishing page as shown in Figure 7.\n\n\n-----\n\n_Figure 7: Final Gmail phishing page_\n\nFigure 8 below shows that the AiTM phishing kit is able to successfully relay and intercept\nthe multi-factor authentication process used by Gmail / G suite.\n\n_Figure 8: Multi-factor authentication (MFA) process of Gmail intercepted by AiTM phishing_\n_kit_\n\n\n-----\n\n## Zscaler’s detection status\n\nZscaler’s multilayered cloud security platform detects indicators at various levels, as seen\nhere:\n\n[HTML.Phish.Gmail](https://threatlibrary.zscaler.com/?keyword=HTML.Phish.Gmail)\n\n## Conclusion\n\nIn this blog we described how the threat actor is leveraging AiTM proxy-based phishing kits\nto target multiple email providers' users in enterprises. It is important to understand that\nsuch attacks are not limited to only Microsoft and Gmail enterprise users. An attacker can\nbypass multi-factor authentication protection on many different services using this method.\n\nBusiness email compromise (BEC) continues to be one of the top threats which\norganizations need to protect against. As described in this blog, the threat actor is\nconstantly registering new domains and targeting more online services often used in\nenterprises.\n\nEven though security features such as multi-factor authentication (MFA) add an extra layer\nof security, they should not be considered as a silver bullet to protect against phishing\nattacks. With the use of advanced phishing kits (AiTM) and clever evasion techniques,\nthreat actors can bypass both traditional as well as advanced security solutions.\n\nAs an extra precaution, users should not open attachments or click on links in emails sent\nfrom untrusted or unknown sources. As a best practice, in general, users should verify the\nURL in the address bar of the browser before entering any credentials.\n\nThe Zscaler ThreatLabz team will continue to monitor this active campaign, as well as\nothers, to help keep our customers safe.\n\n## Indicators of Compromise\n\n**Phishing domains**\n\n*.angalosos[.]xyz\n\n*.mdks[.]xyz\n\n*.7brits[.]xyz\n\n*.fekir5[.]xyz\n\n\n-----\n\n.bantersplid[.]xyz\n*.absmg[.]xyz\n\n*.wultimacho[.]xyz\n\n*.gsuiteworkstation[.]com\n\n*.thyxyzjgdrwafzy[.]xyz\n\n*.7dmjmg20p8[.]xyz\n\n*.appfolders[.]xyz\n\n*.4765445b-32c6-4-83e6-1d93765276[.]co\n\n*.aucapitalsci[.]com\n\n*.eaganins.click\n\n*.disturbedmidiagroup.click\n\n**Intermediate URL redirectors**\n\n**Note: These are compromised websites**\n\n*.southernlivingsavannah[.]com\n*.sunnyislesdental[.]com\n\n*.horticulturatanaka[.]com.br\n\nripple-hirodai[.]com\n\npathopowerreport[.]de\n\npagliaispizzakv[.]com\n\n*.loftds[.]com\n\n*.sabtsaeen[.]ir\n\n*.jarrydrenton[.]com\n\n*.alphamediaam[.]ir\n\n*.hcapinfo[.]com\n\n*.gamea[.]ir\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-09 - AiTM phishing attack targeting enterprise users of Gmail.pdf"
    ],
    "report_names": [
        "2022-08-09 - AiTM phishing attack targeting enterprise users of Gmail.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535747,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1660795092,
    "ts_modification_date": 1660795092,
    "files": {
        "pdf": "https://archive.orkl.eu/9025ba26d8893c44831f6d47bd941b7d00f66cf7.pdf",
        "text": "https://archive.orkl.eu/9025ba26d8893c44831f6d47bd941b7d00f66cf7.txt",
        "img": "https://archive.orkl.eu/9025ba26d8893c44831f6d47bd941b7d00f66cf7.jpg"
    }
}