{
    "id": "f97cc4d5-9dfb-41bb-936d-b0688f9e1c65",
    "created_at": "2023-01-12T15:07:19.030622Z",
    "updated_at": "2025-03-27T02:13:47.886355Z",
    "deleted_at": null,
    "sha1_hash": "52cb7d507598c04a27ceffb1365ca5e25d61bad4",
    "title": "2021-04-07 - Ransom Mafia - Analysis of the World's First Ransomware Cartel",
    "authors": "",
    "file_creation_date": "2022-05-27T23:20:09Z",
    "file_modification_date": "2022-05-27T23:20:09Z",
    "file_size": 3241901,
    "plain_text": "# Ransom Mafia - Analysis of the World's First Ransomware Cartel\n\n**[analyst1.com/blog/ransom-mafia-analysis-of-the-worlds-first-ransomware-cartel](https://analyst1.com/blog/ransom-mafia-analysis-of-the-worlds-first-ransomware-cartel)**\n\nJon DiMaggio\n\nApril 7, 2021\n\nBy Jon DiMaggio\n\n\n-----\n\nAnalyst1 spent time digging through criminal marketplaces where Cartel gangs have a\npresence to research and analyze the criminal entities within the alleged Cartel. We explored\nthe malware and tools the groups use, tracked their bitcoin transactions, and studied relevant\nreports from other researchers in the field alongside select media outlets. Our research\nidentified several key findings which are further detailed in our white paper “Ransom Mafia:\nAnalysis of the World’s First Ransom Cartel” such as:\n\n1. Analyst1 observed Cartel affiliated gangs distributing/posting victim data across leak\n\nwebsites belonging to other gangs within the Cartel. In other words, one gang\nbreached and stole data from a victim and passed it to another gang to post publicly\nand negotiate with the victim.\n2. Analyst1 observed multiple gangs within the Cartel coordinating via Cartel leak\n\nwebsites, including sharing tactics, command and control infrastructure, and\nsharing/posting victim data.\n3. Attackers are moving towards automating their attacks. Multiple gangs have added\n\nautomated capabilities into their ransom payloads, allowing them to spread and infect\ntheir victims without human interaction.\n4. Ransom demands continue to increase. Collectively, gangs in the Cartel generated\n\nhundreds of millions of dollars from ransomware and data extortion operations.\n5. Several Cartel gangs offer Ransomware as a Service (RaaS), hiring hackers to execute\n\nattacks while providing them with malware, infrastructure, and ransom negotiation\nservices.\n\n\n-----\n\n6. Attackers are becoming bolder – they are now conducting PR interviews with reporters,\n\nissuing press releases, and leveraging social media ads and call centers to harass and\npressure victims into paying.\n7. Attackers are reinvesting profits made from ransom operations to advance both tactics\n\nand malware to increase their success and revenue. Malware is updated regularly,\nadding new sophisticated features.\n8. One gang, Wizard Spider, developed unique malware geared towards espionage.\n\nAnalyst1 could not validate how Wizard Spider uses it in attacks. It's existence alone is\ntroubling. We found no other gang in the Cartel that uses or develops espionage\nmalware.\n\n**Cartel Overview**\n\nFour ransomware gangs currently exist within the Cartel: Twisted Spider, Viking Spider,2 3\nWizard Spider, and the Lockbit Gang as seen in Figure 1 below.3 4\n\n\n-----\n\nDiagram, timeline Description automatically generated\n\n\n_Figure 1: Cartel Breakdown_\n\n_Note: The SunCrypt gang is no longer active, but they previously claimed allegiance to the_\n_Cartel and have since retired._\n\nThe gangs who make up the Cartel originate from eastern Europe and primarily speak\nRussian, based on posts made to underground criminal forums. Interestingly, all of the gangs\nbuild checks and balances into their ransomware to ensure that the payload does not\nexecute on Russian victims. Here, the malware checks if the system language matches a\ndialect spoken in the Commonwealth of Independent States (CIS), which formerly made up\nthe Soviet Union. Advanced attackers will often even purposely place false flags into their\noperations to lead investigators astray. However, the Cartel gangs do little to hide the fact\nthey speak Russian, and they go out of their way not to target victims within affiliated\nRussian territories.\n\n\n-----\n\n## Twisted Spider\n\nDuring our research into Twisted Spider operations, Analyst1 identified the following key\nfindings associated with the Twisted Spider gang:\n\nTwisted Spider conducted separate operations using Maze ransomware from May\n2019 - November 2020, and they began transitioning to Egregor ransomware from\nSeptember 2020 to present-day. Each campaign utilized its own malware and\ninfrastructure, primarily separate from one another.\nTwisted Spider created online personas for each campaign, one using Maze and the\nother Egregor ransomware. The operators who make up the gang use these personas\nto talk to both the media and security researchers. During media interviews, they\ndiscuss their operations and relationships with other ransomware gangs.5, 6\nSince its inception, the group has utilized Egregor and Maze ransomware to extort at\nleast $75 million from private sector companies, local governments, and hospitals. We\nbelieve this figure to be much more significant, but we can only assess the publicly\nacknowledged ransom payments. Many victims never publicly report when they pay a\nransom.\nTwisted Spider uses a key (string/password) required for the Egregor payload to\nexecute; this makes analysis difficult.\nThe gang uses the open-source tool RClone in conjunction with public infrastructure\n(FTP servers, Dropbox, etc.) to copy and exfiltrate victim data.7\nThe gang claims to have created a cartel with other well-known ransomware gangs.\nHowever they would later attempt to rescind this claim upon retiring their Maze\noperations and commencing the attacks using the Egregor payload. However, the\nevidence we discuss in the Cartel Assessment section of this report supports the\ntheory that Twisted Spider and other gangs do work together. Both their retirement and\nbacktracking on the Cartel affiliation after months of promoting it was likely an attempt\nto throw off researchers and law enforcement.\n\n\n## Viking Spider\n\nViking Spider first began ransom operations in December 2019. The gang uses ransomware\nknown as Ragnar Locker to compromise and extort organizations. Below are key findings\nidentified while researching Viking Spider activity.\n\nViking Spider is the first ransomware attacker to install their own virtual machine (VM)\ninto victim environments to evade detection; they also use it as a launch point to\nexecute the attack.8\nThe gang is the first to use Facebook ads to pressure victims into paying the ransom 9\n\n\n-----\n\nViking Spider outsources call centers in India to contact victims asking them to pay the\nransom or risk data exposure. 9\nViking Spider uses MSP software to deliver malware and hacktools as well as provide\nremote access into victim environments.10\nViking Spider is one of the few gangs who conduct DDoS attacks in addition to ransom\nattacks to pressure victims to pay. A different cartel gang first used this tactic, but\nViking Spider quickly adopted it.\n\n\n## Wizard Spider\n\nWizard Spider is the most experienced attacker within the Cartel. The gang began ransom\noperations in August 2018, and they are connected to other criminal operations dating back\nto as early as 2016. Analyst1 identified these key findings during our research into Wizard\nSpider:\n\nWizard Spider has conducted ransom operations previously using Gogalocker and\nMegaCortex ransomware variants (both of which are now retired), and they currently\nperform attacks with Ryuk and Conti Ransomware.\nThe gang works in multiple teams, conducting simultaneous operations with different\nransom payloads. Additionally, they have more malware and hacktools than any other\ngang associated with the Cartel.\nWizard Spider developed unique malware geared towards espionage known as Sidoh\nmalware. Analyst1 could not validate how Wizard Spider uses Sidoh in attacks;\nhowever, its existence alone is troubling. We found no other gang in the Cartel which\nuses or develops espionage malware.11\nConti Ransomware uses 32 CPU threads at once to defeat defenses and encrypt data\n– much faster than any other variant.\nAs of February 2021, Ryuk Ransomware includes a new Wake-on-LAN capability,\nwhich allows it to automatically discover and spread to victim systems in the target\nenvironment.12\n\n\n## The Lockbit Gang\n\nThe Lockbit Gang first came onto the enterprise ransomware scene in September 2020.\nMuch like the other gangs discussed so far, Lockbit brings its own unique tactics to the\nransomware game. Analyst1 found the following findings while researching the Lockbit\nGang:\n\nThe Lockbit Gang was the first to automate attacks and remains the most efficient\nattacker associated with the Cartel.\n\n\n-----\n\nLockbit ransomware uses a self-propagation technique. Upon execution, it issues an\nARP request to identify devices within the environment and connects using the SMB\nprotocol to spread.13 Once connected to a live host, it executes a PowerShell\ncommand that connects to attacker C&C infrastructure and downloads the ransom\npayload (often disguised as an image file).14\nAt least once, the attacker overwrote the Master Boot Record (MBR) requiring a\npassword to boot. The Lockbit Gang achieved this through the use of the open-source\ntool BCDedit. BCDedit is a command-line tool that can edit the boot configuration in MS\nWindows operating systems.15\n\nThe Lockbit Gang conducts interviews about their attacks with news media.\n\n## The SunCrypt Gang\n\nThe SunCrypt gang began conducting ransomware attacks in October 2019. Analyst1\nresearched the attacks and progression of SunCrypt operations up to present day and found\nthe following key findings:\n\n\nSunCrypt is the first gang to introduce denial of service attacks as an extortion tactic\nused in conjunction with enterprise ransomware attacks.\nThe SunCrypt Gang claimed affiliation with both Twisted Spider and the Cartel. Twisted\nSpider disputed both claims in an interview with Bleeping Computer.16\nSunCrypt ransomware uses the Cha Cha 20 stream cipher found in both Twisted\nSpider’s Maze and Egregor ransomware payloads.\nThe SunCrypt Gang's ransomware communicated with two C&C IP addresses which\nTwisted Spider previously used by in their Maze ransomware operations. These\nfindings are significant, since Twisted Spider disputes the SunCrypt Gang’s Cartel\naffiliation claim.\nOperations ceased in October 2020, but transfers from bitcoin wallets funded by\nvictims continue until November 2020.\n\n## Cartel Assessment\n\nIn November 2020, Twisted Spider – the gang who began the Cartel – announced they were\nshutting down their operations. In a further twist, they also claimed the Cartel never existed!\nIn their last press release, Twisted Spider stated the Cartel was only real in journalists'\n[minds17. Based on the events detailed in our white paper and the specific ties between](https://analyst1.com/whitepaper/ransom-mafia-analysis-of-the-worlds-first-ransomware-cartel)\ngangs within the Cartel (outlined next), Twisted Spider's claims are untrue.\n\n\n-----\n\nThe initial claim the gang was retiring was misleading. The tactics used in the attacks overlap\nin infrastructure, and the technical similarities between Egregor and Maze ransomware made\nfor strong attribution. Clearly, Twisted Spider was behind both operations. The second claim\nstating the Cartel never existed was not as clear-cut.\n\nTwisted Spider, Viking Spider, Wizard Spider, the Lockbit gang, and the SunCrypt gang\nclaimed they were a ransomware Cartel. Why would all of these criminal gangs speak out\npublicly, stating they had joined together? To further assess, Analyst1 looked to the evidence\nto make our own assessment.\n\nThe first tie we found provided evidence that the groups are working together and sharing\nresources to extort victims. Several gangs compromised and stole victim data, which they\npassed on to Twisted Spider. Twisted Spider then posted the victim's data and attempted to\nnegotiate a ransom on their data leak site. This type of collaboration and sharing would not\noccur unless all three criminal elements had a trusted relationship with one another. Figure 2\nbelow is a visualization detailing several ties, which we discuss next.\n\n\n-----\n\nDiagram Description automatically generated\n\n\n_Figure 2:Cartel Ties A & B_\n\n## Tie A: Shared Victim Data & leak sites\n\nIn May 2020, Viking Spider compromised MJ Brunner of brunnerworks.com. After the\ncompromise, Viking Spider posted Brunner's data to their leak site, ragnerleaks[.]top. A few\nweeks later in June 2020, Twisted Spider posted Brunner data on Viking Spider’s behalf\nalong with threatening messages to their data leak site, mazenews[.]top. Not long after, a\nsimilar situation took place. This time, the Lockbit Gang breached and attempted to extort a\ntarget: the Smith Group. At the time however, the Lockbit Gang did not have a data leak site.\nIn a continued effort to share Cartel resources, Twisted Spider posted the stolen data to their\n\n\n-----\n\nsite, mazenews[.]top, on behalf of the Lockbit gang. Furthermore, Twisted Spider referenced\nboth the Cartel and each member gang who originally stole the data on both occasions.\nFigure 3 shows the posts below:\n\n\nGraphical user interface, text Description automatically generated\n\n\n_Figure 3: Twisted Spiders data leak site, Mazenews[.]top displaying data stolen by Viking_\n_spider (Ragnar) and Lockbit gang.2, 3_\n\n## Tie B: Shared Infrastructure\n\nWe mentioned previously that the SunCrypt Gang told Bleeping Computer in August 2020\nthat they joined the Cartel, which Twisted Spider disputed. Yet, beginning in October 2020 in\ntheir early operations, Twisted Spider used two IP addresses, 91.218.114[.]30, 31 for\ncommand-and-control infrastructure.29, 30 Ten months later, the SunCrypt Gang used the\nsame IP addresses for command-and-control to deliver ransomware in their attacks.\nGranted, the tie would be stronger if the IP used in ransom operations took place during the\nsame time frame. However, Twisted Spider used the 91.218.114.3X range for attacks over at\nleast six months. The extended use and address range indicates that this was persistent\n\n\n-----\n\ninfrastructure that Twisted Spider frequently used and controlled themselves. It is unlikely\nthat the SunCrypt Gang would have access to the infrastructure if they did not have a trusted\nrelationship with Twisted Spider. Table 1 below details the evidence supporting Tie B.\n\n**Other Ties:**\n\nSeveral other circumstantial and technical ties exist as well. These are weaker ties, and you\nshould not use them for attribution on their own. Collectively, however, they are worth\ndiscussing:\n\nMaze and Egregor ransomware (Twisted Spider) and SunCrypt ransomware (SunCrypt\nGang) use the Cha Cha stream cypher to encrypt data.\nAll of the gangs build checks and balances into their ransomware to ensure the\npayload does not execute on Russian victims.\nGangs in the Cartel share and adapt each other's tactics:\n\nDouble extortion technique (data theft and data encryption)\nDDoS in conjunction with data theft and data encryption\nUse of VM within victim environments to execute attacks and avoid detection\nUse of data leak websites to name and shame\nAdditionally, each gang discussed has claimed affiliation to the Cartel. Some of the\ngangs publicly made these claims to reporters, while others posted on leak sites and\nsocial media.\n\nAnalyst1 assesses that the Cartel is not an authentic entity, but instead a collective of\ncriminal gangs who, at times, work together in ransom operations. There needs to be more\nthan cooperation, resource, and tactic sharing between gangs for their partnership to qualify\nas a true Cartel, though. Profit-sharing is the primary element missing in the coalition of\nransomware attackers discussed. Cartels are dangerous due to the large financial resources\nthat profit-sharing provides.\n\nAnalyst1 researched all known bitcoin wallets and their associated transactions associated\nwith the gangs discussed. We followed the money trail and observed examples of victims\npaying a gang and gangs paying their affiliates, but we did not find any evidence that the\ngangs share profits with other gangs in the Cartel.\n\nWe believe the gangs created the Cartel facade to appear larger, stronger more powerful to\nfurther intimidate victims into paying ransom demands. The illusion and public claims made\nabout the Cartel achieved the desired effect; however, it also brought global attention from\n\n\n-----\n\nlaw enforcement and government entities. We believe this prompted Twisted Spider to lie\nabout retiring, and this explains why they attempted to retract their Cartel affiliation. For the\nsame reasons, Twisted Spider stopped communicating publicly, and they no longer use\nsocial media or press releases to voice their demands.\n\nMoving forward, Analyst1 believes these ransomware gangs will continue to work with one\nanother. The working relationship, however, will likely continue to be done behind the scenes\nand not on a public level. Groups will continue to share tactics and resources, making them\nfar more dangerous than if they were operating independently. Both ransomware and\nmalware used to gain initial compromise will increase in their levels of sophistication and\ncapability. Specifically, Analyst1 believes ransomware gangs will focus development efforts\nto automate attacks. The new capabilities gangs are introducing into their ransomware\ndemonstrate that automation is essential. Analyst1 believes this trend will continue making\nransomware operations more efficient and dangerous. As automation capabilities increase,\nthe use of affiliate hackers will decrease. This means ransomware gangs do not have to\nshare profits with affiliates, thus increasing the revenue derived from each attack. With the\ndecrease in the timeframe it takes to execute each attack, Analyst1 believes the overall\nvolume of attacks will grow, raising the number of victims extorted.\n\n## Endnotes\n\n1. Infosecurity Magazine. \"Police Reportedly Arrest Egregor Ransomware Members\"\nAccessed February 16,2021 https://www.infosecurity-magazine.com/news/police-arrestegregor-ransomware/\n\n2. CrowdStrike. “Ransomware + Data Leak Extortion: Origins and Adversaries, Pt. 1,”\nSeptember 24, 2020. https://www.crowdstrike.com/blog/double-trouble-ransomware-dataleak-extortion-part-1/.\n\n3. CrowdStrike. \"Double Trouble: Ransomware with Data Leak Extortion, Part 2” Accessed\nMarch 3, 2021. https://www.crowdstrike.com/blog/double-trouble-ransomware-data-leakextortion-part-2/\n\n4. BleepingComputer. \"Ransomware gangs team up to form extortion cartel.\"\nhttps://www.bleepingcomputer.com/news/security/ransomware-gangs-team-up-to-formextortion-cartel/\n\n5. BleepingComputer. “Canon Publicly Confirms August Ransomware Attack, Data Theft.”\nAccessed March 24, 2021. https://www.bleepingcomputer.com/news/security/canon-publiclyconfirms-august-ransomware-attack-data-theft/.\n\n\n-----\n\n6. BleepingComputer. SunCrypt Ransomware Sheds Light on the Maze Ransomware\nCartel.” Accessed March 24, 2021.\nhttps://www.bleepingcomputer.com/news/security/suncrypt-ransomware-sheds-light-on-themaze-ransomware-cartel/.\n\n7. SentinelLabs. “Egregor RaaS Continues the Chaos with Cobalt Strike and Rclone,”\nNovember 25, 2020. https://labs.sentinelone.com/egregor-raas-continues-the-chaos-withcobalt-strike-and-rclone/.\n\n8. “Ragnar Locker Ransomware Deploys Virtual Machine to Dodge Security.” Sophos News\n(blog), May 21, 2020. https://news.sophos.com/en-us/2020/05/21/ragnar-locker-ransomwaredeploys-virtual-machine-to-dodge-security/.\n\n9. “Ransomware Group Turns to Facebook Ads — Krebs on Security.” Accessed March 24,\n[2021. https://krebsonsecurity.com/2020/11/ransomware-group-turns-to-facebook-ads/.](https://krebsonsecurity.com/2020/11/ransomware-group-turns-to-facebook-ads/)\n\n10. BleepingComputer. “Ragnar Locker Ransomware Targets MSP Enterprise Support\nTools.” Accessed March 24, 2021. https://www.bleepingcomputer.com/news/security/ragnarlocker-ransomware-targets-msp-enterprise-support-tools/.\n\n11. “2020 Global Threat Report.” Cybersecurity Report. Crowdstrike, 2020.\nhttps://go.crowdstrike.com/rs/281-OBQ266/images/Report2020CrowdStrikeGlobalThreatReport.pdf.\n\n12. BleepingComputer. \"Ryuk ransomware now self-spreads to other Windows LAN\ndevices.\" https://www.bleepingcomputer.com/news/security/ryuk-ransomware-now-selfspreads-to-other-windows-lan-devices/\n\n13. “LockBit Ransomware Analysis: Rapid Detonation Using a Single Compromised\nCredential.” Accessed March 26, 2021. https://www.darktrace.com/en/blog/lock-bitransomware-analysis-rapid-detonation-using-a-single-compromised-credential.\n\n14. Gallagher, Sean. “LockBit Uses Automated Attack Tools to Identify Tasty Targets.”\nSophos News (blog), October 21, 2020. https://news.sophos.com/en-us/2020/10/21/lockbitattackers-uses-automated-attack-tools-to-identify-tasty-targets/.\n\n15. The DFIR Report. “Lockbit Ransomware, Why You No Spread?,” June 10 2020.\n[https://thedfirreport.com/2020/06/10/lockbit-ransomware-why-you-no-spread/.](https://thedfirreport.com/2020/06/10/lockbit-ransomware-why-you-no-spread/)\n\n16. BleepingComputer. “SunCrypt Ransomware Sheds Light on the Maze Ransomware\nCartel.” Accessed March 26, 2021.\nhttps://www.bleepingcomputer.com/news/security/suncrypt-ransomware-sheds-light-on-themaze-ransomware-cartel/.\n\n\n-----\n\n17. BleepingComputer. Maze ransomware shuts down operations, denies creating cartel.\nAccessed March 19, 2021. https://www.bleepingcomputer.com/news/security/mazeransomware-shuts-down-operations-denies-creating-cartel/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-07 - Ransom Mafia - Analysis of the World's First Ransomware Cartel.pdf"
    ],
    "report_names": [
        "2021-04-07 - Ransom Mafia - Analysis of the World's First Ransomware Cartel.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1df26eff-cd77-48dc-9425-95a4ec34bebe",
            "created_at": "2022-10-25T16:07:24.24501Z",
            "updated_at": "2025-03-27T02:02:10.149551Z",
            "deleted_at": null,
            "main_name": "SunCrypt Gang",
            "aliases": [],
            "source_name": "ETDA:SunCrypt Gang",
            "tools": [
                "SunCrypt",
                "WARPRISM"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6f37e16f-64b2-4b9c-b5b4-08d0884660eb",
            "created_at": "2022-10-25T16:07:24.380872Z",
            "updated_at": "2025-03-27T02:02:10.201203Z",
            "deleted_at": null,
            "main_name": "Viking Spider",
            "aliases": [],
            "source_name": "ETDA:Viking Spider",
            "tools": [
                "Ragnar Locker",
                "RagnarLocker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e9f85280-337c-4321-b872-0919f8ef64a6",
            "created_at": "2022-10-25T16:07:24.261761Z",
            "updated_at": "2025-03-27T02:02:10.153781Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Gold Village",
                "Maze Team",
                "TA2101",
                "Twisted Spider"
            ],
            "source_name": "ETDA:TA2101",
            "tools": [
                "7-Zip",
                "Agentemis",
                "BokBot",
                "Buran",
                "ChaCha",
                "Cobalt Strike",
                "CobaltStrike",
                "Egregor",
                "IceID",
                "IcedID",
                "Mimikatz",
                "PsExec",
                "SharpHound",
                "VegaLocker",
                "WinSCP",
                "cobeacon",
                "nmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0fc739cf-0b82-48bf-9f7d-398a200b59b5",
            "created_at": "2022-10-25T16:07:23.797925Z",
            "updated_at": "2025-03-27T02:02:09.983353Z",
            "deleted_at": null,
            "main_name": "LockBit Gang",
            "aliases": [
                "Bitwise Spider",
                "Operation Cronos"
            ],
            "source_name": "ETDA:LockBit Gang",
            "tools": [
                "3AM",
                "ABCD Ransomware",
                "CrackMapExec",
                "EmPyre",
                "EmpireProject",
                "LockBit",
                "LockBit Black",
                "Mimikatz",
                "PowerShell Empire",
                "PsExec",
                "Syrphid"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b4ec06e5-60c9-4796-9f85-129c77d1652b",
            "created_at": "2023-01-06T13:46:39.21956Z",
            "updated_at": "2025-03-27T02:00:03.023828Z",
            "deleted_at": null,
            "main_name": "VIKING SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:VIKING SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536039,
    "ts_updated_at": 1743041627,
    "ts_creation_date": 1653693609,
    "ts_modification_date": 1653693609,
    "files": {
        "pdf": "https://archive.orkl.eu/52cb7d507598c04a27ceffb1365ca5e25d61bad4.pdf",
        "text": "https://archive.orkl.eu/52cb7d507598c04a27ceffb1365ca5e25d61bad4.txt",
        "img": "https://archive.orkl.eu/52cb7d507598c04a27ceffb1365ca5e25d61bad4.jpg"
    }
}