{
    "id": "f9915600-e3c4-49f2-b928-83e0ddc25afa",
    "created_at": "2023-01-12T15:01:56.553331Z",
    "updated_at": "2025-03-27T02:05:22.67829Z",
    "deleted_at": null,
    "sha1_hash": "1d9a90e9cb40b5d1f11c2a3f160ec915911ca698",
    "title": "2020-07-22 - MATA- Multi-platform targeted malware framework",
    "authors": "",
    "file_creation_date": "2022-05-28T02:04:48Z",
    "file_modification_date": "2022-05-28T02:04:48Z",
    "file_size": 1271774,
    "plain_text": "# MATA: Multi-platform targeted malware framework\n\n**[securelist.com/mata-multi-platform-targeted-malware-framework/97746/](https://securelist.com/mata-multi-platform-targeted-malware-framework/97746/)**\n\nAuthors\n\nGReAT\n\nAs the IT and OT environment becomes more complex, adversaries are quick to adapt their\nattack strategy. For example, as users’ work environments diversify, adversaries are busy\nacquiring the TTPs to infiltrate systems. Recently, we reported to our Threat Intelligence\nPortal customers a similar malware framework that internally we called MATA. The MATA\nmalware framework possesses several components, such as loader, orchestrator and\nplugins. This comprehensive framework is able to target Windows, Linux and macOS\noperating systems.\n\nThe first artefacts we found relating to MATA were used around April 2018. After that, the\nactor behind this advanced malware framework used it aggressively to infiltrate corporate\nentities around the world. We identified several victims from our telemetry and figured out the\npurpose of this malware framework.\n\n\n-----\n\n## Windows version of MATA\n\nThe Windows version of MATA consists of several components. According to our telemetry,\nthe actor used a loader malware to load the encrypted next-stage payload. We’re not sure\nthat the loaded payload is the orchestrator malware, but almost all victims have the loader\nand orchestrator on the same machine.\n\n**_Component of the Windows version of MATA_**\n\n### Loader\n\nThis loader takes a hardcoded hex-string, converts it to binary and AES-decrypts it in order\nto obtain the path to the payload file. Each loader has a hard-coded path to load the\nencrypted payload. The payload file is then AES-decrypted and loaded.\n\nFrom the loader malware found on one of the compromised victims, we discovered that the\nparent process which executes the loader malware is the\n“C:\\Windows\\System32\\wbem\\WmiPrvSE.exe” process. The WmiPrvSE.exe process is\n“WMI Provider Host process”, and it usually means the actor has executed this loader\nmalware from a remote host to move laterally. Therefore, we assess that the actor used this\nloader to compromise additional hosts in the same network.\n\n### Orchestrator and plugins\n\nWe discovered the orchestrator malware in the lsass.exe process on victims’ machines. This\norchestrator malware loads encrypted configuration data from a registry key and decrypts it\nwith the AES algorithm. Unless the registry value exists, the malware uses hard-coded\n\n\n-----\n\nconfiguration data. The following is a configuration value example from one orchestrator\nmalware sample:\n\n**Victim ID** Random 24-bit number\n\n**Internal version number** 3.1.1 (0x030101)\n\n**Timeout** 20 minutes\n\n**C2 addresses** 108.170.31[.]81:443\n192.210.239[.]122:443\n\n111.90.146[.]105:443\n\n**Disk path or URL of plugin (up to 15) to be loaded on start** Not used in this malware\n\nThe orchestrator can load 15 plugins at the same time. There are three ways to load them:\n\nDownload the plugin from the specified HTTP or HTTPS server\nLoad the AES-encrypted plugin file from a specified disk path\nDownload the plugin file from the current MataNet connection\n\nThe malware authors call their infrastructure MataNet. For covert communication, they\nemploy TLS1.2 connections with the help of the “openssl-1.1.0f” open source library, which is\nstatically linked inside this module. Additionally, the traffic between MataNet nodes is\nencrypted with a random RC4 session key. MataNet implements both client and server\nmode. In server mode the certificate file “c_2910.cls” and the private key file “k_3872.cls” are\nloaded for TLS encryption. However, this mode is never used.\n\nThe MataNet client establishes periodic connections with its C2. Every message has a 12byte-long header, where the first DWORD is the message ID and the rest is the auxiliary\ndata, as described in the table below:\n\n\n**Message**\n**ID**\n\n\n**Description**\n\n\n0x400 Complete the current MataNet session and delay the next session until the\nnumber of logical drives is changed or a new active user session is started.\n\n0x500 Delete configuration registry key and stop MATA execution until next reboot.\n\n0x601 Send configuration data to C2.\n\n0x602 Download and set new configuration data.\n\n\n-----\n\n0x700 Send the C2 the infected host basic information such as victim ID, internal\nversion number, Windows version, computer name, user name, IP address\nand MAC address.\n\n0x701 Send the C2 the configuration settings such as victim ID, internal version\nnumber and session timeout.\n\nThe main functionality of the orchestrator is loading each plugin file and executing them in\nmemory. Each DLL file type plugin provides an interface for the orchestrator and provides\nrich functionality that can control infected machines.\n\n**Plugin name** **Description**\n\nMATA_Plug_Cmd.dll Run “cmd.exe /c” or “powershell.exe” with the specified\nparameters, and receive the output of the command\nexecution.\n\nMATA_Plug_Process.dll Manipulate process (listing process, killing process,\ncreating process, creating process with logged-on user\nsession ID).\n\nMATA_Plug_TestConnect.dll Check TCP connection with given IP:port or IP range.\nPing given host or IP range.\n\nMATA_Plug_WebProxy.dll Create a HTTP proxy server. The server listens for\nincoming TCP connections on the specified port,\nprocessing CONNECT requests from clients to the HTTP\nserver and forwarding all traffic between client and server.\n\nMATA_Plug_File.dll Manipulate files (write received data to given file, send\ngiven file after LZNT1 compression, compress given folder\nto %TEMP%\\~DESKTOP[8random hex].ZIP and send,\nwipe given file, search file, list file and folder, timestomping\nfile).\n\nMATA_Plug_Load.dll Inject DLL file into the given process using PID and process\nname, or inject XORed DLL file into given process,\noptionally call export function with arguments.\n\nMATA_Plug_P2PReverse.dll Connect between MataNet server on one side and an\narbitrary TCP server on the other, then forward traffic\nbetween them. IPs and ports for both sides are specified on\nthe call to this interface.\n\nThere is an interesting string inside the MATA_Plug_WebProxy plugin – “Proxy-agent: matt_dot-net” – which is a reference to Matt McKnight’s_ [open source project. There are some](https://www.codeproject.com/Articles/93301/Implementing-a-Multithreaded-HTTP-HTTPS-Debugging)\ndifferences though. Matt’s project is written in C# rather than C++. The MATA proxy is\nnoticeably simpler, as there is no cache and no SSL support, for instance. It’s possible that\n\n\n-----\n\nMATAs authors found and used the source code of an early version of Matt s proxy server. It\nlooks like the malware author rewrote the code from C# to C++ but left this footprint\nunchanged.\n\n**_Proxy-agent of MATA_Plug_WebProxy.dll plugin_**\n\n## Non-Windows version of MATA\n\nThe MATA framework targets not only the Windows system but also Linux and macOS\nsystems.\n\n### Linux version\n\nDuring our research, we also found a package containing different MATA files together with a\nset of hacking tools. In this case, the package was found on a legitimate distribution site,\nwhich might indicate that this is the way the malware was distributed. It included a Windows\nMATA orchestrator, a Linux tool for listing folders, scripts for exploiting Atlassian Confluence\n[Server (CVE-2019-3396), a legitimate socat tool and a Linux version of the MATA](http://www.dest-unreach.org/socat)\norchestrator bundled together with a set of plugins. China-based security vendor Netlab also\n[published a highly detailed blog on this malware.](https://blog.netlab.360.com/dacls-the-dual-platform-rat-en/)\n\nThe module is designed to run as a daemon. Upon launch, the module checks if it is already\nrunning by reading the PID from “/var/run/init.pid” and checks if the “/proc/%pid%/cmdline”\nfile content is equal to “/flash/bin/mountd”. Note that “/flash/bin/mountd” is an unusual path\nfor standard Linux desktop or server installations. This path suggests that MATA’s Linux\ntargets are diskless network devices such as routers, firewalls or IoT devices based on\nx86_64. The module can be run with the “/pro” switch to skip the “init.pid” check. The AESencrypted configuration is stored in the “$HOME/.memcache” file. The behavior of this\nmodule is the same as the Windows MATA orchestrator previously described. The plugin\nnames of Linux MATA and the corresponding Windows plugins are:\n\n**Linux plugin** **Corresponding Windows plugin**\n\n/bin/bash MATA_Plug_Cmd\n\nplugin_file MATA_Plug_File\n\nplugin_process MATA_Plug_Process\n\nplugin_test MATA_Plug_TestConnect\n\n\n-----\n\nplugin_reverse_p2p MATA_Plug_P2PReverse\n\nNote that the Linux version of MATA has a logsend plugin. This plugin implements an\ninteresting new feature, a “scan” command that tries to establish a TCP connection on ports\n8291 (used for administration of MikroTik RouterOS devices) and 8292 (“Bloomberg\nProfessional” software) and random IP addresses excluding addresses belonging to private\nnetworks. Any successful connection is logged and sent to the C2. These logs might be used\nby attackers for target selection.\n\n### macOS version\n\nWe discovered another MATA malware target for macOS uploaded to VirusTotal on April 8,\n2020. The malicious Apple Disk Image file is a Trojanized macOS application based on an\n[open-source two-factor authentication application named MinaOTP.](https://github.com/MinaOTP/MinaOTP-MAC)\n\n**_Trojanized macOS application_**\n\nThe Trojanized main TinkaOTP module is responsible for moving the malicious Mach-O file\nto the Library folder and executing it using the following command:\n\ncp TinkaOTP.app/Contents/Resources/Base.lproj/SubMenu.nib ~/Library/.mina > /dev/null\n2>&1 && chmod +x ~/Library/.mina > /dev/null 2>&1 && ~/Library/.mina > /dev/null 2>&1\n\nUpon launch, this malicious Mach-o file loads the initial configuration file from\n“/Library/Caches/com.apple.appstotore.db”.\n\nLike another strain running on a different platform, the macOS MATA malware also runs on a\nplugin basis. Its plugin list is almost identical to the Linux version, except that it also contains\na plugin named “plugin_socks”. The “plugin_socks” plugin is similar to “plugin_reverse_p2p”\nand is responsible for configuring proxy servers.\n\n\n-----\n\n## Victims\n\nBased on our telemetry, we have been able to identify several victims who were infected by\nthe MATA framework. The infection is not restricted to a specific territory. Victims were\nrecorded in Poland, Germany, Turkey, Korea, Japan and India. Moreover, the actor\ncompromised systems in various industries, including a software development company, an\ne-commerce company and an internet service provider.\n\nWe assess that MATA was used by an APT actor, and from one victim we identified one of\ntheir intentions. After deploying MATA malware and its plugins, the actor attempted to find\nthe victim’s databases and execute several database queries to acquire customer lists.\nWe’re not sure if they completed the exfiltration of the customer database, but it’s certain that\ncustomer databases from victims are one of their interests. In addition, MATA was used to\ndistribute VHD ransomware to one victim, something that will be described in detail in an\nupcoming blog post.\n\n**_Victims of MATA_**\n\n## Attribution\n\nWe assess that the MATA framework is linked to the Lazarus APT group. The MATA\norchestrator uses two unique filenames, c_2910.cls and k_3872.cls, which have only\npreviously been seen in several Manuscrypt variants, including the samples\n[(0137f688436c468d43b3e50878ec1a1f) mentioned in the US-CERT publication.](https://www.us-cert.gov/sites/default/files/publications/MAR-10135536-B_WHITE.PDF)\n\n\n-----\n\n**_Unique file name_**\n\nMoreover, MATA uses global configuration data including a randomly generated session ID,\ndate-based version information, a sleep interval and multiple C2s and C2 server addresses.\nWe’ve seen that one of the Manuscrypt variants (ab09f6a249ca88d1a036eee7a02cdd16)\nshares a similar configuration structure with the MATA framework. This old Manuscrypt\nvariant is an active backdoor that has similar configuration data such as session ID, sleep\ninterval, number of C2 addresses, infected date, and C2 addresses. They are not identical,\nbut they have a similar structure.\n\n**_Manuscrypt configuration structure_**\n\n## Conclusion\n\nThe MATA framework is significant in that it is able to target multiple platforms: Windows,\nLinux and macOS. In addition, the actor behind this advanced malware framework utilized it\nfor a type of cybercrime attack that steals customer databases and distributes ransomware.\nWe evaluate that this malware is going to evolve, so we will be monitoring its activity in order\nto protect our customers.\n\nFor more information please contact: intelreports@kaspersky.com\n\n## Indicators of compromise\n\n### File Hashes (malicious documents, Trojans, emails, decoys)\n\n**Windows Loader**\n\n\n-----\n\nf364b46d8aafff67271d350b8271505a\n85dcea03016df4880cebee9a70de0c02\n1060702fe4e670eda8c0433c5966feee\n7b068dfbea310962361abf4723332b3a\n8e665562b9e187585a3f32923cc1f889\n6cd06403f36ad20a3492060c9dc14d80\n71d8b4c4411f7ffa89919a3251e6e5cb\na7bda9b5c579254114fab05ec751918c\ne58cfbc6e0602681ff1841afadad4cc6\n7e4e49d74b59cc9cc1471e33e50475d3\na93d1d5c2cb9c728fda3a5beaf0a0ffc\n455997E42E20C8256A494FA5556F7333\n7ead1fbba01a76467d63c4a216cf2902\n7d80175ea344b1c849ead7ca5a82ac94\nbf2765175d6fce7069cdb164603bd7dc\nb5d85cfaece7da5ed20d8eb2c9fa477c\n6145fa69a6e42a0bf6a8f7c12005636b\n2b8ff2a971555390b37f75cb07ae84bd\n1e175231206cd7f80de4f6d86399c079\n65632998063ff116417b04b65fdebdfb\nab2a98d3564c6bf656b8347681ecc2be\ne3dee2d65512b99a362a1dbf6726ba9c\nfea3a39f97c00a6c8a589ff48bcc5a8c\n2cd1f7f17153880fd80eba65b827d344\n582b9801698c0c1614dbbae73c409efb\na64b3278cc8f8b75e3c86b6a1faa6686\nca250f3c7a3098964a89d879333ac7c8\ned5458de272171feee479c355ab4a9f3\nf0e87707fd0462162e1aecb6b4a53a89\nf1ca9c730c8b5169fe095d385bac77e7\nf50a0cd229b7bf57fcbd67ccfa8a5147\n\n**Windows MATA**\n\nbea49839390e4f1eb3cb38d0fcaf897e  rdata.dat\n8910bdaaa6d3d40e9f60523d3a34f914  sdata.dat\n6a066cf853fe51e3398ef773d016a4a8\n228998f29864603fd4966cadd0be77fc\nda50a7a05abffb806f4a60c461521f41\nec05817e19039c2f6cc2c021e2ea0016\n\n**Registry path**\n\n\n-----\n\nHKLM\\Software\\Microsoft\\KxtNet\nHKLM\\Software\\Microsoft\\HlqNet\nHKLM\\Software\\mthjk\n\n**Linux MATA**\n\n859e7e9a11b37d355955f85b9a305fec  mdata.dat\n80c0efb9e129f7f9b05a783df6959812  ldata.dat, mdata.dat\nd2f94e178c254669fb9656d5513356d2  mdata.dat\n\n**Linux log collector**\n\n982bf527b9fe16205fea606d1beed7fa  hdata.dat\n\n**Open-source Linux SoCat**\n\ne883bf5fd22eb6237eb84d80bbcf2ac9  sdata.dat\n\n**Script for exploiting Atlassian Confluence Server**\n\na99b7ef095f44cf35453465c64f0c70c  check.vm, r.vm\n199b4c116ac14964e9646b2f27595156  r.vm\n\n**macOS MATA**\n\n81f8f0526740b55fe484c42126cd8396  TinkaOTP.dmg\nf05437d510287448325bac98a1378de1  SubMenu.nib\n\n### C2 address\n\n104.232.71.7:443\n\n107.172.197.175:443\n\n108.170.31.81:443\n\n111.90.146.105:443\n\n111.90.148.132:443\n\n172.81.132.41:443\n\n172.93.184.62:443\n\n172.93.201.219:443\n\n185.62.58.207:443\n\n192.210.239.122:443\n\n198.180.198.6:443\n\n209.90.234.34:443\n\n216.244.71.233:443\n\n23.227.199.53:443\n\n23.227.199.69:443\n\n\n-----\n\n23.254.119.12:443\n67.43.239.146:443\n68.168.123.86:443\n\n[Apple MacOS](https://securelist.com/tag/apple-macos/)\n[APT](https://securelist.com/tag/apt/)\n[Cybercrime](https://securelist.com/tag/cybercrime/)\n[Lazarus](https://securelist.com/tag/lazarus/)\n[Linux](https://securelist.com/tag/linux/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n\nAuthors\n\nGReAT\n\nMATA: Multi-platform targeted malware framework\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-22 - MATA- Multi-platform targeted malware framework.pdf"
    ],
    "report_names": [
        "2020-07-22 - MATA- Multi-platform targeted malware framework.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535716,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1653703488,
    "ts_modification_date": 1653703488,
    "files": {
        "pdf": "https://archive.orkl.eu/1d9a90e9cb40b5d1f11c2a3f160ec915911ca698.pdf",
        "text": "https://archive.orkl.eu/1d9a90e9cb40b5d1f11c2a3f160ec915911ca698.txt",
        "img": "https://archive.orkl.eu/1d9a90e9cb40b5d1f11c2a3f160ec915911ca698.jpg"
    }
}