{
    "id": "f9934812-e6be-42a4-b58e-a6226326f273",
    "created_at": "2023-01-12T15:08:02.480277Z",
    "updated_at": "2025-03-27T02:11:47.756353Z",
    "deleted_at": null,
    "sha1_hash": "26ddffd5381fcd4e2ed7dde65c2a7a2fb2c6ffa7",
    "title": "2017-05-19 - How did the WannaCry ransomworm spread-",
    "authors": "",
    "file_creation_date": "2022-05-28T15:51:00Z",
    "file_modification_date": "2022-05-28T15:51:00Z",
    "file_size": 668330,
    "plain_text": "# How did the WannaCry ransomworm spread?\n\n**[blog.malwarebytes.com/cybercrime/2017/05/how-did-wannacry-ransomworm-spread/](https://blog.malwarebytes.com/cybercrime/2017/05/how-did-wannacry-ransomworm-spread/)**\n\nAdam McNeil May 19, 2017\n\nSecurity researchers have had a busy week since the WannaCry ransomware outbreak that\nwreaked havoc on computers worldwide. News of the infection and the subsequent viral\nimages showing everything from large display terminals to kiosks being affected created\npandemonium in ways that haven’t been seen since possibly the MyDoom worm circa 2004.\n\nNews organizations and other publications were inundating security companies for\ninformation to provide to the general public – and some were all too happy to oblige.\nInformation quickly spread that a malicious spam campaign had been responsible for\n[circulating the malware. This claim will usually be a safe bet, as ransomware is often spread](https://www.malwarebytes.com/ransomware)\nvia malicious spam campaigns. Admittedly, we also first thought the campaign may have\nbeen spread by spam and subsequently spent the entire weekend pouring through emails\nwithin the Malwarebytes Email Telemetry system searching for the culprit. But like many\nothers, our traps came up empty.\n\nClaims of WannaCry being distributed via email may have been an easy mistake to make.\nNot only was the malware outbreak occurring on a Friday afternoon, but around the same\ntime a new ransomware campaign was being heavily distributed via malicious email and the\npopular Necurs botnet. We [recently wrote about the Jaff ransomware family and the spam](https://blog.malwarebytes.com/cybercrime/2017/05/new-jaff-ransomware-via-necurs-asks-for-2-btc/)\ncampaign that was delivering it.\n\n\n-----\n\nSome may have seen the rash of news occurring on their feeds, an uptick in ransomwarethemed document malware in their honeypots, and then jumped to conclusions as a way to\nbe first with the news.\n\nBut here at Malwarebytes we try not to do that. And now after a thorough review of the\ncollected information, on behalf of the entire Malwarebytes Threat Intelligence team, we feel\nconfident in saying those speculations were incorrect.\n\nIndeed, the ‘ransomworm’ that took the world by storm was not distributed via an email\nmalspam campaign. Rather, our research shows this nasty worm was spread via an\noperation that hunts down vulnerable public facing SMB ports and then uses the alleged\nNSA-leaked EternalBlue exploit to get on the network and then the (also NSA alleged)\nDoublePulsar exploit to establish persistence and allow for the installation of the WannaCry\nRansomware.\n\nWe will present information to support this claim by analyzing the available packet captures,\nbinary files, and content from within the information contained in The Shadow Brokers dump,\nand correlating what we know thus far regarding the malware infection vector.\n\n## Here’s what we know\n\n**EternalBlue**\n\nEternalBlue is an SMB exploit affecting various Windows operating systems from XP to\nWindows 7 and various flavors of Windows Server 2003 & 2008. The exploit technique is\nknown as [heap spraying and is used to inject shellcode into vulnerable systems allowing for](https://blog.malwarebytes.com/glossary/heap-spray/)\nthe exploitation of the system. The code is capable of targeting vulnerable machine by IP\naddress and attempting exploitation via SMB port 445. The EternalBlue code is closely tied\nwith the DoublePulsar backdoor and even checks for the existence of the malware during the\ninstallation routine.\n\nEternalBlue checks for DoublePulsar\n\n\n-----\n\nEternalBlue strings\n\nBits of information obtained by reviewing the EternalBlue-2.2.0.exe file help demonstrate the\nexpected behavior of the software. The screenshot above shows that the malware:\n\nSends an SMB Echo request to the targeted machine\nSets up the exploit for the target architecture\nPerforms SMB fingerprinting\nAttempts exploit\nIf successful exploitation occurs, WIN\nPings the backdoor to get an SMB reply\nAnd if the backdoor is not installed, it’s game on!\n\nThe ability of this code to beacon out to other potential SMB targets allows for propagation of\nthe malicious code to other vulnerable machines on connected networks. This is what made\nthe WannaCry ransomware so dangerous. The ability to spread and self-propagate causes\nwidespread infection without any user interaction.\n\n**DoublePulsar**\n\n\n-----\n\nDoublePulsar is the backdoor malware that EternalBlue checks to determine the existence\nand they are closely tied together.\n\nThis particular malware uses an APC (Asynchronous Procedure Call) to inject a DLL into the\nuser mode process of lsass.exe. Once injected, exploit shellcode is installed to help maintain\npersistence on the target machine. After verifying a successful installation, the backdoor\ncode can be removed from the system.\n\nDoublePulsar Parameters\n\nThe purpose of the DoublePulsar malware is to establish a connection allowing the attacker\nto exfiltrate information and/or install additional malware (such as WannaCry) to the system.\nThese connections allow an attacker to establish a Ring 0 level connection via SMB (TCP\nport 445) and or RDP (TCP port 3389) protocols.\n\nDoublePulsar Ring0 Connections\n\n## Network analysis\n\n[Taking a look at the wannacry.pcap file shared to VirusTotal by @benkow_ helps us attribute](https://virustotal.com/en/file/884a837145bd098edcd04ec700068501a6643c3b71e0c2cd3bf5cde9a0a9395b/analysis/)\nthe previously discussed code as the infection vector via the initial calls of the attack cycle.\n\nA high-level view of a compromised machine in Argentina (186.61.18.6) that attacked the\nhoneypot:\n\n\n-----\n\nThe widely publicized kill-switch domain is present in the pcap file. As was reported, the\n[malware made a DNS request to this site. Until @MalwareTech inadvertently shut down the](https://twitter.com/MalwareTechBlog/)\ncampaign by registering the domain, the malware would use this as a mechanism to\ndetermine if it should run.\n\nDNS lookup to Sinkhole\n\nThe SMB traffic is also clearly visible in the capture. These SMB requests are checking for\nvulnerable machines using the exploit code above.\n\nSMB Requests\n\nThe exploit sends an SMB ‘trans2 SESSION_SETUP’ request to the infected machine.\n[According to SANS, this is short for Transaction 2 Subcommand Extension and is a function](https://isc.sans.edu/forums/diary/Detecting+SMB+Covert+Channel+Double+Pulsar/22312/)\nof the exploit. This request can determine if a system is already compromised and will issue\ndifferent response codes to the attacker indicating ‘normal’ or ‘infected’ machines.\n\nDiving into the .pcap a bit more, we can indeed see this SMB Trans2 command and the\nsubsequent response code of 81 which indicates an infected system. If the attacker receives\nthis code in response, then the SMB exploits can be used as a means to covertly exfiltrate\ndata or install software such as WannaCry.\n\n\n-----\n\nTrans2 Multiplex ID\n\n## Putting it all together\n\nThe information we have gathered by studying the DoublePulsar backdoor capabilities allows\nus to link this SMB exploit to the EternalBlue SMB exploit. It’s really not hard to do so as both\n[were patched as part of the MS17-017 Security Bulletin prior to this event, and as previously](https://docs.microsoft.com/en-us/security-updates/SecurityBulletins/2017/ms17-017)\nmentioned, were both released in the well-publicized ShadowBrokers-NSA dumps.\n\nWithout otherwise definitive proof of the infection vector via user-provided captures or logs,\nand based on the user reports stating that machines were infected when employees arrived\nfor work, we’re left to conclude that the attackers initiated an operation to hunt down\nvulnerable public facing SMB ports, and once located, using the newly available SMB\nexploits to deploy malware and propagate to other vulnerable machines within connected\nnetworks.\n\nDeveloping a well-crafted campaign to identify just as little as a few thousand vulnerable\nmachines would allow for the widespread distribution of this malware on the scale and speed\nthat we saw with this particular ransomware variant.\n\n## So what did we learn?\n\nDon’t jump to conclusions. Malware analysis is difficult and it can take some time to\ndetermine attribution to a specific group, and/or to assess the functionality of a particular\ncampaign – especially late on a Friday (which BTW, can all you hackers quit making\nreleases on Fridays!!). First, comes stopping the attack, second comes analyzing the attack.\nRemember, patience is a virtue.\n\nUpdate, update, UPDATE! Microsoft released patches for these exploits prior to their\nweaponization. Granted, patches weren’t available for all Operating Systems, but the patch\nwas available for the vast majority of machines. This event even forced Microsoft to release\n\n\n-----\n\na patch for the long-ago EOL Windows XP – which gets back to the first thing that was said.\nUPDATE! Why are there still machines on XP!? These machines are vulnerable (beyond this\nattack) to the ransomware functionality of this attack and they need to be updated.\n\nDisable unnecessary protocols. SMB is used to transfer files between computers. The setting\nis enabled on many machines but is not needed by the majority. Disable SMB and other\ncommunications protocols if not in use.\n\nNetwork Segmentation is also a valuable suggestion as such precautions can prevent such\noutbreaks from spreading to other systems and networks, thus reducing exposure of\nimportant systems.\n\nAnd finally, [don’t horde exploits. Microsoft president Brad Smith used this event to call out](https://www.usatoday.com/story/tech/news/2017/05/14/ransomware-wanna-cry-microsoft-brad-smith-cyber-weapon-geneva-convention-nsa/101690214/)\nthe ‘nations of the world’ to not stockpile flaws in computer code that could be used to craft\ndigital weapons.\n\nThat reminds me of an article I wrote a few years ago (and which was substantially cut for\nlength) about Hacking Team and the government sanctioned use of exploits.\n\n[Hack Me: A Geopolitical Analysis of the Government Use of Surveillance Software](https://www.infosecurity-magazine.com/opinions/hack-me-a-geopolitical-analysis/)\n\nI guess things haven’t changed…\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-05-19 - How did the WannaCry ransomworm spread-.pdf"
    ],
    "report_names": [
        "2017-05-19 - How did the WannaCry ransomworm spread-.pdf"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536082,
    "ts_updated_at": 1743041507,
    "ts_creation_date": 1653753060,
    "ts_modification_date": 1653753060,
    "files": {
        "pdf": "https://archive.orkl.eu/26ddffd5381fcd4e2ed7dde65c2a7a2fb2c6ffa7.pdf",
        "text": "https://archive.orkl.eu/26ddffd5381fcd4e2ed7dde65c2a7a2fb2c6ffa7.txt",
        "img": "https://archive.orkl.eu/26ddffd5381fcd4e2ed7dde65c2a7a2fb2c6ffa7.jpg"
    }
}