{
    "id": "f9bc0d3b-d7b1-408b-8fd0-82abea3e8d28",
    "created_at": "2022-10-25T16:48:24.964899Z",
    "updated_at": "2025-03-27T02:16:03.240433Z",
    "deleted_at": null,
    "sha1_hash": "97a52c09444fff77e5b7dc8e1cc3606bed224ace",
    "title": "APT Group Sends Spear Phishing Emails to Indian Government Officials",
    "authors": "FireEye",
    "file_creation_date": "2016-06-11T00:04:20Z",
    "file_modification_date": "2016-06-11T00:04:20Z",
    "file_size": 810465,
    "plain_text": "# G oup Se ds Spea s g a s o d a Gove e Officials\n\nJune 03, 2016 | by Yin Hong Chang, Sudeep Singh | Targeted Attack\n\n**Introduction**\nOn May 18, 2016, FireEye Labs observed a suspected Pakistan-based APT group sending spear phishing emails to Indian government officials.\nThis threat actor has been active for several years and conducting suspected intelligence collection operations against South Asian political and\nmilitary targets.\n\nThis group frequently uses a toolset that consists of a downloader and modular framework that uses plugins to enhance functionality, ranging\nfrom keystroke logging to targeting USB devices. We initially reported on this threat group and their UPDATESEE malware in our FireEye\nIntelligence Center in February 2016. Proofpoint also discussed the threat actors, whom they call Transparent Tribe, in a March blog post.\n\nIn this latest incident, the group registered a fake news domain, timesofindiaa[.]in, on May 18, 2016, and then used it to send spear phishing\nemails to Indian government officials on the same day. The emails referenced the Indian Governments 7th Central Pay Commission (CPC).\nThese Commissions periodically review the pay structure for Indian government and military personnel, a topic that would be of interest to\ngovernment employees.\n\n**Malware Delivery Method**\nIn all emails sent to these government officials, the actor used the same attachment: a malicious Microsoft Word document that exploited the\nCVE-2012-0158 vulnerability to drop a malicious payload.\n\nIn previous incidents involving this threat actor, we observed them using malicious documents hosted on websites about the Indian Army, instead\nof sending these documents directly as an email attachment.\n\nThe email (Figure 1) pretends to be from an employee working at Times of India (TOI) and requests the recipient to open the attachment\nassociated with the 7th Pay Commission. Only one of the recipient email addresses was publicly listed on a website, suggesting that the actor\nharvested the other non-public addressees through other means.\n\n**Figure 1: Contents of the Email**\n\nA review of the email header data from the spear phishing messages showed that the threat actors sent the emails using the same infrastructure\nthey have used in the past.\n\n**Exploit Analysis**\nDespite being an older vulnerability, many threat actors continue to leverage CVE-2012-0158 to exploit Microsoft Word. This exploit file made\nuse of the same shellcode that we have observed this actor use across a number of spear phishing incidents.\n\n\n-----\n\n**Figure 2: Exploit Shellcode used to Locate and Decode Payload**\n\nThe shellcode (Figure 2) searches for and decodes the executable payload contained in memory between the beginning and ending file markers\n0xBABABABA and 0xBBBBBBBB, respectively. After decoding is complete, the shellcode proceeds to save the executable payload into\n%temp%\\svchost.exe and calls WinExec to execute the payload. After the payload is launched, the shellcode runs the following commands to\nprevent Microsoft Word from showing a recovery dialog:\n\nLastly, the shellcode overwrites the malicious file with a decoy document related to the Indian defense forces pay scale / matrix (Figure 3),\ndisplays it to the user and terminates the exploited instance of Microsoft Word.\n\n\n-----\n\n**Figure 3: Decoy Document related to 7th Pay Commission**\n\nThe decoy document's metadata (Figure 4) suggests that it was created fairly recently by the user Bhopal.\n\n**Figure 4: Metadata of the Document**\n\nThe payload is a backdoor that we call the Breach Remote Administration Tool (BreachRAT) written in C++. We had not previously observed\nthis payload used by these threat actors. The malware name is derived from the hardcoded PDB path found in the RAT: C:\\Work\\Breach Remote\nAdministration Tool\\Release\\Client.pdb. This RAT communicates with 5.189.145.248, a command and control (C2) IP address that this group\nhas used previously with other malware, including DarkComet and NJRAT.\n\nThe following is a brief summary of the activities performed by the dropped payload:\n\n1. Decrypts resource 1337 using a hard-coded 14-byte key \"MjEh92jHaZZOl3\". The encryption/decryption routine (refer to Figure 5) can be\nsummarized as follows:\n\n\n-----\n\n**Figure 5: Encryption/ Decryption Function**\n\nGenerate an array of integers from 0x00 to 0xff\nScrambles the state of the table using the given key\nEncrypts or decrypts a string using the scrambled table from (b).\nA python script, which can be used for decrypting this resource, is provided in the appendix below.\n\n2. The decrypted resource contains the C2 servers IP address as well as the mutex name.\n\n3. If the mutex does not exist and a Windows Startup Registry key with name System Update does not exist, the malware performs its\ninitialization routine by:\n\nCopying itself to the path %PROGRAMDATA%\\svchost.exe\nSets the Windows Startup Registry key with the name System Update which points to the above dropped payload.\n\n4. The malware proceeds to connect to the C2 server at 5.189.145.248 at regular intervals through the use of TCP over port 10500. Once a\nsuccessful connection is made, the malware tries to fetch a response from the server through its custom protocol.\n\n5. Once data is received, the malware skips over the received bytes until the start byte 0x99 is found in the server response. The start byte is\nfollowed by a DWORD representing the size of the following data string.\n\n6. The data string is encrypted with the above-mentioned encryption scheme with the hard-coded key AjN28AcMaNX.\n\n7. The data string can contain various commands sent by the C2 server. These commands and their string arguments are expected to be in\nUnicode. The following commands are accepted by the malware:\n\n\n-----\n\n**Conclusion**\nAs with previous spear-phishing attacks seen conducted by this group, topics related to Indian Government and Military Affairs are still being\nused as the lure theme in these attacks and we observed that this group is still actively expanding their toolkit. It comes as no surprise that cyber\nattacks against the Indian government continue, given the historically tense relations in the region.\n\n**Appendix**\n\n**Encryption / Decryption algorithm translated into Python**\n\n\n-----\n\nThis entry was posted on Fri Jun 03 01:30:00 EDT 2016 and filed under APT, Latest Blog Posts, Spear Phishing, Sudeep Singh, Targeted Attack and Yin Hong Chang.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/s0yj8qsfhkf81hpyrtdmhpv3lrmd5p5n"
    ],
    "report_names": [
        "FireEye_IndianGovSpearPhish(06-03-2016)"
    ],
    "threat_actors": [
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041763,
    "ts_creation_date": 1465603460,
    "ts_modification_date": 1465603460,
    "files": {
        "pdf": "https://archive.orkl.eu/97a52c09444fff77e5b7dc8e1cc3606bed224ace.pdf",
        "text": "https://archive.orkl.eu/97a52c09444fff77e5b7dc8e1cc3606bed224ace.txt",
        "img": "https://archive.orkl.eu/97a52c09444fff77e5b7dc8e1cc3606bed224ace.jpg"
    }
}