{
    "id": "f9e41a30-2718-48f8-9817-70d502d97c6a",
    "created_at": "2023-03-02T02:06:11.608341Z",
    "updated_at": "2025-03-27T02:17:15.035133Z",
    "deleted_at": null,
    "sha1_hash": "5af93af18d82bd2525635dc8a5d29126e05207ee",
    "title": "Iron Tiger's SysUpdate Reappears, Adds Linux Targeting",
    "authors": "Trendmicro",
    "file_creation_date": "2023-03-01T14:14:12Z",
    "file_modification_date": "2023-03-01T14:14:12Z",
    "file_size": 454243,
    "plain_text": "# Iron Tiger’s SysUpdate Reappears, Adds Linux Targeting\n\n**[trendmicro.com/en_us/research/23/c/iron-tiger-sysupdate-adds-linux-targeting.html](https://www.trendmicro.com/en_us/research/23/c/iron-tiger-sysupdate-adds-linux-targeting.html)**\n\nMarch 1, 2023\n\nAPT & Targeted Attacks\n\nWe detail the update that advanced persistent threat (APT) group Iron Tiger made on the\ncustom malware family SysUpdate. In this version, we also found components that enable\nthe malware to compromise Linux systems.\n\nBy: Daniel Lunghi\nMarch 01, 2023\nRead time: 11 min (3060 words)\n\nIron Tiger is an advanced persistent threat (APT) group that has been focused primarily on\ncyberespionage for more than a decade. In 2022, we noticed that they updated SysUpdate,\none of their custom malware families, to include new features and add malware infection\nsupport for the Linux platform.\n\nWe found the oldest sample of this updated version in July 2022. At the time, we attributed\nthe sample to Iron Tiger but had not yet identified the final payload. It was only after finding\nmultiple similar payloads in late October 2022 that we looked further and found similarities\nwith the SysUpdate malware family that had also been updated in 2021. As with the previous\nversion, Iron Tiger had made the loading logic complex, probably in an attempt to evade\nsecurity solutions.\n\nThis new version has similar features to the 2021 version, except that the C++ run-time type\ninformation (RTTI) classes we previously observed in 2021 had been removed, and that the\ncode structure was changed to use the ASIO C++ asynchronous library. Both changes make\nreverse engineering the samples longer. We strongly advise organizations and users in the\ntargeted industries to reinforce their security measures to defend their systems and stored\ninformation from this ongoing campaign.\n\nCampaign development timeline\n\nThese are the key dates for understanding the chronology of Iron Tiger’s operations:\n\nApr. 2, 2022: Registration of the domain name linked to our oldest Windows sample of\nSysUpdate\nMay 11, 2022: The command and control (C&C) infrastructure was set up.\nJune 8, 2022: While this could have been tampered with, observed compilation date of\nour oldest Windows sample.\nJuly 20, 2022: Oldest Windows sample gets uploaded to Virus Total\nOct. 24, 2022: Oldest Linux sample gets uploaded to Virus Total\n\n\n-----\n\nWe observed that the attacker registered the oldest domain name one month before starting\nthe C&C configuration then waited one more month before compiling the malicious sample\nlinked to that domain name. We think the gap between the two updates allows the attackers\nto plan their operations accordingly.\n\nLoading process\n\nWe observed the loading process entailing the following steps:\n\nThe attacker runs rc.exe, a legitimate “Microsoft Resource Compiler” signed file, which\n[is vulnerable to a DLL side-loading vulnerability, and loads a file named rc.dll.](https://attack.mitre.org/techniques/T1574/002/)\nThe malicious rc.dll loads a file named rc.bin in memory.\n[The rc.bin file is a Shikata Ga Nai encoded shellcode that decompresses and loads the](https://www.mandiant.com/resources/blog/shikata-ga-nai-encoder-still-going-strong)\nfirst stage in memory. Depending on the number of command line parameters,\ndifferent actions are performed:\n\nZero or two parameters: “Installs” the malware in the system, and calls Stage 1\nagain via process hollowing with four parameters\nOne parameter: Same as previous action but without the “installation”\nFour parameters: Creates a memory section with the DES-encrypted malware\nconfiguration and a second Shikata Ga Nai shellcode decompressing and loading\nStage 2. It then runs Stage 2 via process hollowing.\n\nThe “installation” step is considered simple wherein the malware moves the files to a\nhardcoded folder. Depending on the privileges of the process, the malware either creates a\nregistry key or a service that launches the moved executable rc.exe with one parameter. This\nensures that the malware will be launched during the next reboot, skipping the installation\npart.\n\n\n-----\n\nFigure 1. Updated SysUpdate loading process routine\n\nWe saw different legitimate executables being used, sideloading different DLL names, and\nmultiple binary files names being loaded by those DLLs. We identified the executables and\nsideloaded files as follows:\n\n**Legitimate** **Loaded binary**\n**application name** **Certificate signer** **Side-loaded DLL name** **file name**\n\nINISafeWebSSO.exe Initech inicore_v2.3.30.dll inicore_v2.3.30.bin\n\nrc.exe Microsoft rcdll.dll rcdll.bin\n\ndlpumgr32.exe DESlock DLPPREM32.dll sv.bin\n\nGDFInstall.exe UBISOFT GameuxInstallHelper.DLL sysconfig.bin\nENTERTAINMENT\n\nroute-null.exe Wazuh libwazuhshared.dll wazuhext.bin\n\nroute-null.exe Wazuh libwazuhshared.dll agent-config.bin\n\nwazuh-agent.exe Wazuh libwinpthread-1.dll wazuhext.bin\n\nTable 1. SysUpdate’s seemingly legitimate executables and their respective sideloaded files\n\n|Legitimate application name|Certificate signer|Side-loaded DLL name|Loaded binary file name|\n|---|---|---|---|\n|INISafeWebSSO.exe|Initech|inicore_v2.3.30.dll|inicore_v2.3.30.bin|\n|rc.exe|Microsoft|rcdll.dll|rcdll.bin|\n|dlpumgr32.exe|DESlock|DLPPREM32.dll|sv.bin|\n|GDFInstall.exe|UBISOFT ENTERTAINMENT|GameuxInstallHelper.DLL|sysconfig.bin|\n|route-null.exe|Wazuh|libwazuhshared.dll|wazuhext.bin|\n|route-null.exe|Wazuh|libwazuhshared.dll|agent-config.bin|\n|wazuh-agent.exe|Wazuh|libwinpthread-1.dll|wazuhext.bin|\n\n\n-----\n\nWe want to highlight that this is the first time we observed a threat actor abusing a\nsideloading vulnerability in a Wazuh signed executable. Wazuh is a free and open source\nsecurity platform, and we could confirm that one of the victims was using the legitimate\nWazuh platform. It is highly likely that Iron Tiger specifically looked for this vulnerability to\nappear legitimate in the victim’s environment. We have notified the affected victim of this\nintrusion but received no feedback.\n\nMalware features\n\nLooking at the features, several of the functions found in the latest update are similar to the\nprevious SysUpdate version:\n\nService manager (lists, starts, stops, and deletes services)\nScreenshot grab\nProcess manager (browses and terminates processes)\nDrive information retrieval\nFile manager (finds, deletes, renames, uploads, downloads a file, and browses a\ndirectory)\nCommand execution\n\nIron Tiger also added a feature that had not been seen before in this malware family: C&C\ncommunication through DNS TXT requests. While DNS is not supposed to be a\ncommunication protocol, the attacker abuses this protocol to send and receive information.\n\nFigure 2. C&C communication with DNS TXT records\n\nFirst, the malware retrieves the configured DNS servers by calling the GetNetworkParams\nAPI function and parsing the DnsServerList linked list. If this method fails, the malware uses\nthe DNS server operated by Google at IP address 8.8.8.8.\n\nFor the first request, the malware generates a random number of 32 bits and appends 0x2191\nto it. This results in six bytes — four for the random number, two for 0x2191 — and encodes\nthe result further with Base32 algorithm using the alphabet\n“abcdefghijklmnopqrstuvwxyz012345”. Looking at Figure 2, the contacted domain name is\nafter \"TXT\"; only the first four letters change as the rest of the encoded series is always the\nsame. This is because the random number changes every time, but the end is the same\n“0x2191” result. This explains why the first DNS request always ends with “reeaaaaaa.<c&c\ndomain>”. If the C&C reply matches the format expected by the malware, it launches\nmultiple threads that handle further commands and sends information about the infected\nmachine.\n\n\n-----\n\nInterestingly, the code related to this DNS C&C communication is only present in samples\nthat use it, meaning that the builder is modular and that there might be samples in the wild\nwith unreported features. We continue monitoring this group and malware family for\nupdates on possible variations of C&C communication protocols being abused.\n\nIn all versions, the malware retrieves information on the infected machine and sends it to the\nC&C encrypted with DES. Collected machine information includes the following:\n\nRandomly generated GUID\nHostname\nDomain name\nUsername\nUser privileges\nProcessor architecture\nCurrent process ID\nOperating system version\nCurrent file path\nLocal IP address and port used to send the network packet\n\nThe configuration is encrypted with a hardcoded DES key and is a few bytes long following\nthe structure enumerated below:\n\n|Field content|Length (in bytes)|Comment|Example|\n|---|---|---|---|\n|Header|4|We only found one value|0x00000001|\n|GUID|38|Follows the Microsoft format|{89D0E853-FA08- 4f94-A5FE- A90E6869E074}|\n|Size of the C&C section|4||0x00000018|\n|Size of the next C&C domain name and port|4||0x00000014|\n|C&C type|1|0x01 = regular C&C 0x05 = DNS tunneling 0x00 = regular C&C|0x01|\n|C&C domain name|Variable||dev.gitlabs.me|\n|Port number|4||0x00000050|\n\n\n-----\n\n|Size of next section|4|Next section contains all the hardcoded names (folder, files, registry values)|0x00000034|\n|---|---|---|---|\n|Name of the hardcoded directory where files are copied|Variable|The folder is located either in %|gtdcfp|\n|Name of the executable vulnerable to side loading|Variable||TextInputHost.exe|\n|Name of the malicious side-loaded DLL|Variable||rc.dll|\n|Name of the binary file containing the encoded Stage 1|Variable||rc.bin|\n|Name of the service or registry key value used for persistence|Variable||gtdcfp|\n\n\nTable 2. Configuration structure\n\nWe noted that Stage 2 does not embed the configuration file, which is copied in memory by\nthe previous stage. We only saw one case where there was only one stage being decrypted in\nmemory and the configuration was hardcoded.\n\nInterestingly, all the samples of this “new” version had a domain name as its C&C. In the\nprevious version of SysUpdate, the group used hardcoded IP addresses as C&C. It is possible\nthat this change is a consequence of the new DNS TXT records’ communication feature as it\nrequires a domain name.\n\nSysUpdate samples for Linux\n\nWhile investigating SysUpdate’s infrastructure, we found some ELF files linked to some C&C\nservers. We analyzed them and concluded that the files were a SysUpdate version made for\nthe Linux platform. The ELF samples were also written in C++, made use of the Asio library,\nshared common network encryption keys, and had many similar features. For example, the\nfile handling functions are almost the same. It is possible that the developer made use of the\nAsio library because of its portability across multiple platforms.\n\nSome parameters can be passed to the binary (note that “Boolean” refers to Boolean data that\nis sent to the C&C):\n\n**Parameter** **Effect**\n\n\n-----\n\n|-launch|Sets persistence, zeroes boolean, and exits|\n|---|---|\n|-run|Zeroes boolean and continues|\n|-x|Daemonize the process, zeroes boolean, and continues|\n|-i|Daemonize the process, zeroes boolean, sets persistence, and continues|\n|-f <guid>|Sets the GUID to <guid> and continues|\n\n\nTable 3. Parameters passed to the binary as observed from Linux SysUpdate samples\n\nThe persistence is ensured by copying a script similarly named as the current filename to the\n_/usr/lib/systemd/system/ directory, and creating a symlink to this file in the_\n_/etc/ystem/system/multi-user.target.wants/ directory. Thus, this method only works if the_\ncurrent process has root privileges. The content of the script is:\n\n[Unit]\n\nDescription=xxx\n\n[Service]\n\nType=forking\n\nExecStart=<path to current file> -x\n\nExecStop=/usr/bin/id\n\n[Install]\n\nWantedBy=multi-user.target\n\nAfter running the code dependent on the parameters, if the operator has not chosen a GUID\nwith the “-f” parameter, the malware generates a random GUID and writes it to a file\nsimilarly named as the current file, with a “d” appended to it. Then, the malware retrieves\ninformation on the compromised computer and sends it to the C&C.\n\nThe following information is sent to the C&C, encrypted with a hardcoded key and DES CBC\nalgorithm:\n\nGUID\nHost name\nUsername\nLocal IP address and port used to send the request\nCurrent PID\nKernel version and machine architecture\nCurrent file path\nBoolean (0 if it was launched with exactly one parameter, 1 otherwise)\n\n\n-----\n\nFor the DNS C&C communication version, the malware retrieves the configured DNS server\nby reading the content of the /etc/resolv.conf file, or uses the DNS server operated by Google\nat IP address 8.8.8.8.\n\nIn 2022, we already [noticed that this threat actor was interested in platforms other than](https://www.trendmicro.com/en_us/research/22/h/irontiger-compromises-chat-app-Mimi-targets-windows-mac-linux-users.html)\n[Windows, with the rshell malware family running on Linux and Mac OS. For these reasons,](https://www.trendmicro.com/en_us/research/22/h/irontiger-compromises-chat-app-Mimi-targets-windows-mac-linux-users.html#:~:text=Malware%20analysis-,rshell,-The%20rshell%20executable)\nwe would not be surprised to see SysUpdate samples for the Mac OS platform in the future.\nInterestingly, most of the Linux samples we found used the new DNS tunneling feature we\ndetailed in Figure 2, while only one of the Windows’ samples used it.\n\nCertificate compromise\n\nAnother interesting part of this campaign is the fact that some of the malicious files are\nsigned with a certificate with the following signer: “Permyakov Ivan Yurievich IP”. Looking\n[for that name in search engines brings results from the official VMProtect website. The email](https://vmpsoft.com/)\naddress linked to the Authenticode certificate also links to that domain name. VMProtect is a\ncommercial software intended to make analysis of code extremely difficult by implementing a\n[custom virtual machine with non-standard architecture. The software has been used by](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cyber-attacks/winnti-group-resurfaces-with-portreuse-backdoor-now-engages-in-illicit-cryptocurrency-mining)\n[multiple APT and cybercrime groups in the past to obfuscate their malware.](https://www.trendmicro.com/en_us/research/21/j/purplefox-adds-new-backdoor-that-uses-websockets.html)\n\nWhen searching on malware repositories for other files signed by the same certificate, we\nfind multiple files named “VMProtectDemo.exe”, “VMProtect.exe”, or “VMProtect_Con.exe”,\nwhich suggests that an official demo version of VMProtect is also signed by this certificate. It\nappears that the threat actor managed to retrieve the private key allowing him to sign\nmalicious code. As of this writing, the certificate is now revoked.\n\nUsing stolen certificates to sign malicious code is a common practice for this threat actor, as\n[we already highlighted in 2015 and in all our recent investigations. Interestingly, the threat](https://www.erai.com/CustomUploads/ca/wp/2015_12_wp_operation_iron_tiger.pdf)\nactor not only signed some of its malicious executables with the stolen certificate, but also\nused VMProtect to obfuscate one of them.\n\nIn late January 2023, a Redline stealer sample (detected by Trend Micro as\nTrojanSpy.Win32.REDLINE.YXDA1Z, SHA256:\ne24b29a1df287fe947018c33590a0b443d6967944b281b70fba7ea6556d00109) signed by the\nsame certificate was uploaded. We do not believe that the stealer is linked to Iron Tiger,\nconsidering that the network infrastructure is different, and previous reports document the\nmalware’s goals to be centered on committing cybercrime than data theft. This could mean\nother users managed to extract the same private key from the VMProtect demo version, or it\nwas sold in the underground to different groups, Iron Tiger among them.\n\nInfection vector\n\n\n-----\n\nWe did not find an infection vector. However, we noticed that one of the executables packed\nwith VMProtect and signed with the stolen certificate was named\n“youdu_client_211.9.194.exe”. [Youdu is the name of a Chinese instant messaging application](https://youdu.im/)\naimed for use of enterprise customers. Its website mentions multiple customers in many\nindustries, some of them in critical sectors such as government, energy, healthcare, or\nbanking. But they also have other customers in industries such as gaming, IT, media,\nconstruction, and retail, apparently all located inside China.\n\nThe properties of the malicious file also match the usual Youdu version numbering. However,\nthe legitimate files are signed with a “Xinda.im” certificate instead of the stolen VMProtect\ncertificate.\n\nFigure 3. Comparing the properties of the malicious file (left), and properties of the legitimate Youdu\n\ninstaller (right)\n\nAs seen in the product name identified in the malicious file’s properties, we searched for\npossible products named “i Talk” but did not find any that could be related to this\ninvestigation. However, we found traces of files from the legitimate Youdu chat application\nsigned by Xinda.im being copied to folders named “i Talk” on one victim’s computer. This\nsuggests that some chat application named “i Talk” might be repackaging components from\nthe official Youdu client along with malicious executables. It appears that a chat application\nwas used as a lure to entice the victim into opening the malicious file. This would be\nconsistent with the tactics, techniques, and procedures (TTPs) of two previous Iron Tiger\ncampaigns from 2020 and 2021: a documented [compromise of a chat application widely used](https://www.welivesecurity.com/2020/12/10/luckymouse-ta428-compromise-able-desktop/)\n[by the Mongolian government, and a supply chain attack on Mimi chat, a chat application](https://www.trendmicro.com/en_us/research/22/h/irontiger-compromises-chat-app-Mimi-targets-windows-mac-linux-users.html)\nused in parts of South East Asia.\n\nPost-exploitation tools\n\nWe found a custom Chrome password and cookie grabber that appeared unfamiliar, and it\nwas compiled and uploaded in September 2022. The file was also signed with the VMProtect\ncertificate but it was not obfuscated. In general, the features were simple; the malware\n\n\n-----\n\ndecrypts the saved passwords to a file named passwords.txt, and the cookies to a file named\n“cookies.txt”.\n\nAnalyzing its details, the malware first parses the “Local State” file to retrieve the AES key\nused to encrypt the cookies and passwords. It then copies the “Login Data” file to a\ntemporary file “chromedb_tmp”, issues an SQL query to extract the URL, login, and\npassword fields from the file, and then decrypts them and appends the result to the\n“passwords.txt” file.\n\nIt proceeds to copy the “Cookies” file to a temporary file “chromedb_tmp”, extracts multiple\nfields from it using an SQL query, and then decrypts the content before copying the result to\nthe “cookies.txt” file. Some specific cookies related to Google domain names are ignored,\nprobably because they are mostly related to specific Google features or tracking that are\nconsidered useless by the threat actor.\n\nWe found two other samples from this stealer: One compilation date indicated an executable\nbuilt in November 2020, and the other one in December 2021, although those dates could be\ntampered with. We found those samples were uploaded on November 2021 and August 2022,\nmeaning this stealer existed since at least late 2021.\n\nTargeting\n\nWe identified one gambling company in the Philippines as compromised by this campaign.\nInterestingly, the threat actor registered a domain name similar to the company name and\nused it as a C&C. This was not surprising as we have noticed this threat actor targeting this\n[industry since 2019 during our Operation DRBControl investigation, and](https://documents.trendmicro.com/assets/white_papers/wp-uncovering-DRBcontrol.pdf) [later in 2021 with](https://www.trendmicro.com/en_no/research/21/d/iron-tiger-apt-updates-toolkit-with-evolved-sysupdate-malware-va.html)\nan update of SysUpdate. We also attempted to notify the company of this incident through all\ntheir listed channels but have received no feedback.\n\nAs stated in the “Infection Vector” section, we noticed the Youdu chat application was\nprobably used as a lure. It is worth mentioning that the customers mentioned in the Youdu\nofficial website are all located inside China, which could be an indicator of the threat actor’s\ninterest in targets related to this country.\n\nConclusion\n\nThis investigation confirms that Iron Tiger regularly updates its tools to add new features\nand probably to ease their portability to other platforms, verifying the interest we found from\nthis threat actor for Linux or Mac OS. It also corroborates this threat actor’s interest in the\n[gambling industry and the South East Asia region, as we previously noted in 2020 and 2021.](https://documents.trendmicro.com/assets/white_papers/wp-uncovering-DRBcontrol.pdf)\n\nThis campaign also substantiates the regular usage of chat applications as infection vectors\nfrom Iron Tiger. We expect to find further updates of these tools in the future to\naccommodate other platforms and apps.\n\n\n-----\n\nAs an additional warning, we want to highlight that the targeting can be wider than the\n[samples and targeting we have already observed. In 2022, we discussed a campaign targeting](https://www.trendmicro.com/en_us/research/22/h/irontiger-compromises-chat-app-Mimi-targets-windows-mac-linux-users.html)\nTaiwan and the Philippines that made use of HyperBro samples (detected by Trend Micro as\nBackdoor.Win32.HYPERBRO.ENC) signed with a stolen Cheetah certificate. The BfV, a\n[German governmental entity, published a report in January 2022 mentioning attacks against](https://www.verfassungsschutz.de/SharedDocs/publikationen/DE/cyberabwehr/2022-01-bfv-cyber-brief.pdf?__blob=publicationFile&v=10)\nGerman companies with HyperBro samples that were also signed with the same certificate.\nIn October 2022, Intrinsec [reported an incident in a French company also using HyperBro](https://www.intrinsec.com/apt27-analysis/)\n[samples matching the structure we described in our 2021 investigation. This shows the threat](https://www.trendmicro.com/en_no/research/21/d/iron-tiger-apt-updates-toolkit-with-evolved-sysupdate-malware-va.html)\nactor is likely to reuse the tools mentioned here in future campaigns that might target\ndifferent regions or industries in the short and long term. Considering the active campaign\nand regular developments made on this malware family, organizations are advised to\nenhance and broaden their current and established security measures, and heighten overall\nvigilance for possible infection vectors that can be abused by this threat group.\n\nIndicators of Compromise (IOCs)\n\n[Download the full list of indicators here.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/23/c/iron-tiger-sysupdate-reappears-adds-linux-targeting/IOCs-iron-tiger-sysupdate-reappears-adds-linux-targeting.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/oyd0m0chatq9m025mjs21umb3xivhw3s"
    ],
    "report_names": [
        "Trendmicro_IronTigers-SysUpdate-Adds-Linux-Targeting(03-01-2023)"
    ],
    "threat_actors": [
        {
            "id": "a4aca3ca-9e04-42d1-b037-f7fb3fbab0b1",
            "created_at": "2023-01-06T13:46:39.042499Z",
            "updated_at": "2025-03-27T02:00:02.984002Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Colourful Panda",
                "BRONZE DUDLEY"
            ],
            "source_name": "MISPGALAXY:TA428",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f3b19931-3751-4ece-a235-15b397951dc2",
            "created_at": "2022-10-25T16:07:23.889537Z",
            "updated_at": "2025-03-27T02:02:10.015565Z",
            "deleted_at": null,
            "main_name": "Nazar",
            "aliases": [
                "SIG37"
            ],
            "source_name": "ETDA:Nazar",
            "tools": [
                "Distribute.exe",
                "EYService",
                "GpUpdates.exe",
                "Microolap Packet Sniffer",
                "TCPDUMP for Windows"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c416260c-7ff6-4a74-a5ba-a15f40d3543f",
            "created_at": "2024-05-01T02:03:07.939268Z",
            "updated_at": "2025-03-27T02:05:17.25652Z",
            "deleted_at": null,
            "main_name": "BRONZE DUDLEY",
            "aliases": [
                "Temp.Hex ",
                "Vicious Panda ",
                "TA428 "
            ],
            "source_name": "Secureworks:BRONZE DUDLEY",
            "tools": [
                "PoisonIvy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e254cf33-e7f5-407b-a8a1-1a856a9f1c71",
            "created_at": "2025-01-21T02:00:03.599871Z",
            "updated_at": "2025-03-27T02:00:03.480307Z",
            "deleted_at": null,
            "main_name": "Operation DRBControl",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation DRBControl",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6d2910b0-9fea-46a2-84e6-a043b1e023e4",
            "created_at": "2022-10-25T16:07:23.946958Z",
            "updated_at": "2025-03-27T02:02:10.044112Z",
            "deleted_at": null,
            "main_name": "Operation DRBControl",
            "aliases": [],
            "source_name": "ETDA:Operation DRBControl",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1677722771,
    "ts_updated_at": 1743041835,
    "ts_creation_date": 1677680052,
    "ts_modification_date": 1677680052,
    "files": {
        "pdf": "https://archive.orkl.eu/5af93af18d82bd2525635dc8a5d29126e05207ee.pdf",
        "text": "https://archive.orkl.eu/5af93af18d82bd2525635dc8a5d29126e05207ee.txt",
        "img": "https://archive.orkl.eu/5af93af18d82bd2525635dc8a5d29126e05207ee.jpg"
    }
}