{
    "id": "f9f887d1-e4fd-4576-b7b5-34e779f22032",
    "created_at": "2023-01-12T15:01:37.347075Z",
    "updated_at": "2025-03-27T02:05:57.207868Z",
    "deleted_at": null,
    "sha1_hash": "72847f0caf732b00e812d2d0426ccbfbb42f45e1",
    "title": "2022-07-01 - AstraLocker 2.0 ransomware isn’t going to give you your files back",
    "authors": "",
    "file_creation_date": "2022-07-18T18:05:14Z",
    "file_modification_date": "2022-07-18T18:05:14Z",
    "file_size": 180990,
    "plain_text": "# AstraLocker 2.0 ransomware isn’t going to give you your files back\n\n**[blog.malwarebytes.com/ransomware/2022/07/astralocker-2-0-ransomware-isnt-going-to-give-you-your-files-back/](https://blog.malwarebytes.com/ransomware/2022/07/astralocker-2-0-ransomware-isnt-going-to-give-you-your-files-back/)**\n\nChristopher Boyd July 1, 2022\n\nReversing Labs reports that the latest verison of AstraLocker ransomware is engaged in a a\n[so-called “smash and grab” ransomware operation.](https://blog.reversinglabs.com/blog/smash-and-grab-astralocker-2-pushes-ransomware-direct-from-office-docs)\n\nSmash and grab is all about maxing out profit in the fastest time. It works on the assumption\nby malware authors that security software or victims will find the malware quickly, so it’s\nbetter to get right to the end-game as quickly as possible. Adware bundles in the early 2000s\ncapitalised on this approach, with revenue paid for dozens of adverts popping on desktops in\nas short a time as possible.\n\nThat smash and grab spirit lives on.\n\nIn a ransomware attack, criminals typically break into a victim’s network via a trojan that has\nalready infected a computer, by exploiting a software vulnerability on an Internet-facing\nserver, or with [stolen Remote Desktop Protocol (RDP) credentials. They then make their way](https://blog.malwarebytes.com/explained/2022/03/blunting-rdp-brute-force-attacks-with-rate-limiting/)\nsilently to devices and servers where important data is stored. Anything of value is stolen\nand sent outside of the network. When the attacker is good and ready, ransomware is\ndeployed, encrypting the files on the machines and rendering them useless. From here,\n\n\n-----\n\n[double or even triple threat extortion (blackmail and the threat of data leakage) is deployed.](https://blog.malwarebytes.com/ransomware/2022/02/cisa-ransomware-report-warns-triple-threat-attacks-still-on-the-prowl/)\nThis careful approach, which can sometimes take weeks, allows attackers to stop\norganisations dead in their tracks and demand multi-million dollar ransoms.\n\nIt is so successful that almost all major ransomware families are used in this way.\n\nBut AstraLocker is not a major ransomware family, and it doesn’t do this. (These two things\nmay be connected.)\n\n## Click to run\n\nIn the attacks observed by Reversing Labs, AstraLocker just arrives and encrypts.\n\nIt starts life as a rogue Word document attachmed to an email. The payload lurking in the\n[document is an embedded OLE object. Triggering the ransomware requires the victim to](https://en.wikipedia.org/wiki/Object_Linking_and_Embedding)\ndouble click the icon within the document, which comes with a security warning. As\n[researchers note, this isn’t as slick a process as the recent Follina vulnerability (which](https://blog.malwarebytes.com/exploits-and-vulnerabilities/2022/05/microsoft-office-zero-day-follina-its-not-a-bug-its-a-feature-its-a-bug/)\nrequires no user interaction), or even misusing macros (which some user interaction).\n\nIn its rush to encrypt, AstraLocker still manages to do some standard ransomware things: It\ntries to disable security programs; it also stops applications running that might prevent\nencryption from taking place; and it avoids virtual machines, which might indicate it’s being\nrun by researchers in a lab.\n\nThe sense of this being a rushed job doesn’t stop there.\n\n## Reaffirming (and then breaking) the circle of trust\n\nWhen decryption doesn’t happen, either because of a poor quality decryptor, or because no\n[decryption process actually exists, the ransomware author’s so-called circle of trust is](https://blog.malwarebytes.com/ransomware/2022/04/onyx-ransomware-destroys-files-and-also-the-criminal-circle-of-trust/)\nbroken. Too many decryption misfires is bad for business. After all, why would victims pay up\nif there’s no chance of file recovery?\n\nIt’s interesting, then, that the following text is in AstraLocker 2.0’s ransom note:\n\n**What guarantees?**\n\nI value my reputation. If I do not do my work and liabilities, nobody will pay me. This is\nnot in my interests. All my decryption software is perfectly tested and will decrypt your\ndata.\n\nSo far, so good…you would think. Unfortunately, there’s a sting in the tail.\n\nThe cost of their decryption software is “about $50 USD”, payable via Monero or Bitcoin.\nThere is some question as to who the author of this version of AstraLocker is, as the email\naddresses tied to the original campaign have been replaced. Unfortunately, this is where the\n\n\n-----\n\ncircle of trust falls apart.\n\nYou can certainly pay the ransom with no problem whatsoever. That side of things, the\nmaking money side, works perfectly. The getting your files back side of things? Not so much.\nThe new contact email address mentioned above is only partially included.\n\nThere is currently no way to ask the ransomware author for the decryption tool. Unless some\nsort of update is forthcoming, this is the quickest way you’ll ever lose both your files and $50.\n\nWhether this is by accident or design, the circle of trust here is more of a downward curve.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-01 - AstraLocker 2.0 ransomware isn’t going to give you your files back.pdf"
    ],
    "report_names": [
        "2022-07-01 - AstraLocker 2.0 ransomware isn’t going to give you your files back.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535697,
    "ts_updated_at": 1743041157,
    "ts_creation_date": 1658167514,
    "ts_modification_date": 1658167514,
    "files": {
        "pdf": "https://archive.orkl.eu/72847f0caf732b00e812d2d0426ccbfbb42f45e1.pdf",
        "text": "https://archive.orkl.eu/72847f0caf732b00e812d2d0426ccbfbb42f45e1.txt",
        "img": "https://archive.orkl.eu/72847f0caf732b00e812d2d0426ccbfbb42f45e1.jpg"
    }
}