{
    "id": "fa04819f-3738-4fad-93d2-465f0f3b4f82",
    "created_at": "2023-01-12T15:04:55.893208Z",
    "updated_at": "2025-03-27T02:10:49.319774Z",
    "deleted_at": null,
    "sha1_hash": "4036e48beaa15669c79c13973f28dec6860e7fc5",
    "title": "2020-05-20 - The Gocgle Malicious Campaign",
    "authors": "",
    "file_creation_date": "2022-05-28T17:59:47Z",
    "file_modification_date": "2022-05-28T17:59:47Z",
    "file_size": 897300,
    "plain_text": "# Related Articles\n\n**reflectiz.com/the-gocgle-web-skimming-campaign/**\n\n## The Gocgle Malicious Campaign\n\n[Magecart](https://www.reflectiz.com/blog/category/magecart/)\nMay 20, 2020 Reading time: 6 mins\n\n\nMay 20, 2020\n\n\n-----\n\n**Can You Spot the Difference Between Gocgle and the Real Thing? Read our special report about**\n**Gocgle malicious campaign.**\n\n**A new web skimming campaign, starting from the end of 2019, is impersonating**\n**Google web products in order to collect sensitive information from users on**\n**eCommerce websites.**\n\n**During the last few weeks, our research team has been investigating a new web-**\n**skimming type campaign targeting e-commerce websites. The campaign deliberately**\n**collected users’ personal information, including credit-card numbers, from the**\n**checkout pages and other sections.**\n\n**Hundreds of Websites are Already Infected**\n\nAccording to our findings, this campaign commenced late 2019 and, until the time of our\nresearch, was still active, infecting hundreds of websites. The initial signs of this campaign\nwere the registration of several malicious domains. This process continued until the end of\nMarch, indicating that the attackers intended to remain undetected while exploiting their new\ntargets.\n\nThe attackers used three techniques to obfuscate their campaign and avoid detection:\nGoogle impersonating, base64 encoding technique and switching referrers, all described in\nthis article.\n\nAs in identical web-skimming attacks, the offenders’ payload was injected after they had\ndetected a vulnerability that allowed them to upload the malicious code into the eCommerce\nwebsite. From there on, the code is loaded, either on checkout pages or even throughout the\nentire website, in order to extract users’ sensitive data.\n\nIn recent years we have witnessed a significant increase in these types of attacks. The\nreason for this is “rooted” on the client-side. For hackers, it is an easy and convenient target\nthat is difficult to detect by conventional security tools. If we compare the effort of reaching\nthe user client-side versus hacking to internal databases, which are more secure and\nsubjected to stringent requirements such as PCI standards, we can understand why the\nclient-side is, in many cases, the easy and only way for hackers to penetrate.\n\n**G-Analytics Family Group**\n\nThe malicious files were impersonating Google analytics or Google Tag Manager which are\ncommon in approximately 80% of all eCommerce websites worldwide. Based on the intricacy\nof the Gocgle campaign, this is likely not the first campaign executed by these offenders.\n[This is a common phenomenon within different hacking groups. Research done by Group-IB,](https://www.group-ib.com/blog/g-analytics)\nnoticed the use of similar domain structures all the way back in the beginning of 2016.\n\n\n-----\n\nFrom examining the related domains, our research team found evidence indicating that the\n“Gocgle group” is linked to other campaigns executed during the last few years.\n\nThese related campaigns, all hosted in Russia, are connected to a wide network of known\ncampaigns, which will be discussed in a future paper, as some of the related domains are\nalso connected to other groups of malicious files, targeting windows endpoint, outside the\nrealm of classical website security.\n\nThe Gocgle campaign execution methodology proves once again the inability of\ndiscontinuous or dedicated security measures to track such attacks as they occur. In fact, in\nearly 2020 our team spotted dozens of websites that were infected by this particular\ncampaign. Each of these online retailers, has already been notified.\n\n**Leave No Trace**\n\n**To avoid detection the Gocgle attackers have been using three main evasion**\n**techniques, as described here.**\n\n**Obfuscate the malicious code inside Google-Analytics**\n\nThe first method is hiding their malicious code inside a legitimate and common third-party\napplication. Google-Analytics (GA) is probably one of the most used third-party applications\nworldwide. In fact, four out of five ecommerce websites use it, usually throughout the entire\nwebsite. That was a very convenient target for the attackers, since part of the goals of GA\nare to monitor user actions and inputs and report the information to external Google\ndomains Impersonating such actions was imperative to remain undetected\n\n\n-----\n\nAs part of the Gocgle campaign, all the malicious remote domains used an almost identical\ntext or wording for each Google web product name like gocgle-analytics.net the offenders\nused, but there are plenty of other examples, such as gocgle-analytic.com or tag managers\nlike gocgletagmanager.com. The obvious goal is to confuse the security teams by using a\nsimple text deception to avoid detection.\n\nThe attackers were sophisticated enough not to omit the actual role of google-analytics,\nsimply because they didn’t want to raise suspicion if GA stopped working. Reflecting to\nmalicious file analysis, the attackers “hooked” Google analytics. Once the malicious code is\nuploaded to the website, it is actively aggregating sensitive inputs entered by the users. It\nthen sends the collected inputs to the malicious domain, while keeping the regular googleanalytics code unchanged and reporting to Google servers.\n\n**Base64 encoding technique**\n\nThe second technique obfuscates the malicious URL by using a base64 encoding. At first\nsight, automatic scanning tools, and even some security analysts, might miss the “innocent”\ngoogle-analytics script. The regular google-analytics snippet that is used in many websites\nincludes a regular common request. As seen below, the attackers have added a single line of\ncode to the website code, using the base64 hiding technique, to minimize the odds of being\ndetected and “successfully” conducting their attack.\n\n\n-----\n\nIn this case, the attackers actually encoded their malicious domain using Base64 encoding\nand replaced it as described above.\n\n_Google VS. Gocgle_\nAttackers use this technique mainly to avoid detection by manual code overview and static\ncode analysis. In order to detect such occurrences, there is a clear need to use behavioral\nsecurity controls that are designed for such purposes. In this case, once the page is being\nloaded, the request source is changed to the malicious domain, that can easily be detected\nby a dynamic analysis tool.\n\n**Switching between Good and Evil using referrer**\n\nThe third and probably the most interesting technique, is the delivery of the malicious\npayload, only with referrer. The loaded code from the remote server is actually determined,\nbased on the user referrer. This technique allowed the hackers to avoid detection by security\ntools, which are scanning browsing pages mostly without user history.\n\nFor less savvy technical users, referrer is used to tell the web-page where the user came\nfrom and what was the last page visited. This is often used by markers and digital teams to\nunderstand the user journey and to enhance user experience. In this case, the attacker\ntested the referrer in order to understand if the browsing user really came from the\neCommerce website as a consumer or not. If a user goes directly to that page, it raises\nsuspicion. If the user doesn’t have the proper referrer, the server will return the regular\ngoogle-analytics script.\n\n\n-----\n\n_Reflectiz CTO, Ysrael Gurt, who led the research team stated: This is a very smart and easy_\n_way to bypass and confuse many security research-teams and tools. When we are_\n_sandboxing websites, it’s hard to create a full user-journey every time you want to test a_\n_specific page. This technique can easily give a real headache and be obfuscated for tools_\n_that are unable to simulate user-journey, or at least remember to fuzz their referrer header._\n_Sending the file to Virustotal, like many do, will return valid non-malicious results.”_\n\n**Who is Behind the Gocgle Campaign?**\n\nAs a reminder, Magecart today is a well-known name in the Cybersecurity community. Most\nweb security professionals and security analysts are, or should, already be familiar with this\ncybercrime gang. But actually, Magecart is not a single hacking group, it is rather an\nattacking methodology focused on injecting maliciously crafted code into checkout pages.\nThe goal is to extract sensitive user data, such as credit card numbers. A few months ago,\nour team published an article about a new attack, dubbed “Pipka”. It introduced a new\nevasion technique, presenting an active arms race in which attackers keep creating new\nways of conduct to avoid detection.\n\n**Bottom Line**\n\nAll of the aforementioned hacking techniques are aimed at reducing the detection rates of\nstatic code review tools, manual testing and detailed website analysis. Within the minified\nworld of javascript, the ability to hide your malicious code inside the website is endless,\ncreating a cat and mouse situation. Dynamic analysis and actively running the website,\nsolves this problem, regardless of where and how the code is hiding. This includes,\nmonitoring all browser actions as well as the “undetectable” ones.\n\n_According to Idan Cohen, CEO of Reflectiz: “It’s actually quite simple. Attackers can do all_\n_the tricks they want to hide their malicious code but they will always need to use the user_\n_browser to execute it. If you control the browser, they are just asking you to conduct_\n_malicious actions. In that case, we recommend saying NO!”_\n\n**Indicators of compromise (IoC)**\n```\nIP:\n5.188.9.61  5.188.9.33\n5.188.9.40  194.180.224.112\nDomains:\ngocgle-analytics.net  googlo-analytics.com  gocgletagmanager.com\ngooglc-analytics.com  gocgle-analytics.cm  analytic.is\ngocgletagmanager.cm  gocgle-analytics.com  wqdtf54y6eu7i87t.ga\n\n```\n\n-----\n\n**Learn more about web-skimming, Magecart attackers and their hacking methodology**\n\n[Magecart Expending Beyond “Regular” eCommerce](https://www.reflectiz.com/magecart-hacking-groups-how-they-are-expanding-their-limits-beyond-the-regular-e-commerce-websites/)\n[Pipka Attack](https://www.reflectiz.com/pipka-a-new-breed-of-anti-forensic-malicious-javascript/)\n\nAll rights reserved 2022 © Reflectiz\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-20 - The Gocgle Malicious Campaign.pdf"
    ],
    "report_names": [
        "2020-05-20 - The Gocgle Malicious Campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535895,
    "ts_updated_at": 1743041449,
    "ts_creation_date": 1653760787,
    "ts_modification_date": 1653760787,
    "files": {
        "pdf": "https://archive.orkl.eu/4036e48beaa15669c79c13973f28dec6860e7fc5.pdf",
        "text": "https://archive.orkl.eu/4036e48beaa15669c79c13973f28dec6860e7fc5.txt",
        "img": "https://archive.orkl.eu/4036e48beaa15669c79c13973f28dec6860e7fc5.jpg"
    }
}