{
    "id": "fa1e8694-4f66-4e9c-a58f-93fb87e975b5",
    "created_at": "2023-01-12T15:08:48.734169Z",
    "updated_at": "2025-03-27T02:16:34.757273Z",
    "deleted_at": null,
    "sha1_hash": "7c1dc35b6b8f3b28e340cb813c5ba3526336a653",
    "title": "2021-03-10 - Remediating Networks Affected by the SolarWinds and Active Directory-M365 Compromise",
    "authors": "",
    "file_creation_date": "2022-05-27T22:50:36Z",
    "file_modification_date": "2022-05-27T22:50:36Z",
    "file_size": 184325,
    "plain_text": "# Remediating Networks Affected by the SolarWinds and Active Directory/M365 Compromise\n\n**us-cert.cisa.gov/remediating-apt-compromised-networks**\n\n**Updates:**\n\n**May 14, 2021: The Cybersecurity and Infrastructure Security Agency (CISA) has**\n_updated this page based on public release of detailed eviction guidance for this activity:_\n_AR21-134A: Eviction Guidance for Networks Affected by the SolarWinds and Active_\n_Directory/M365 Compromise and_ _Supplemental Direction Version 4 to Emergency_\n_Directive 21-01: Mitigate SolarWinds Orion Code Compromise._\n**May 7, 2021:** _CISA Fact Sheet: Russian SVR Activities Related to SolarWinds_\n_Compromise lists advisories on the SVR malicious activity._\n**April 15, 2021:** _[Statement from the White House provides U.S. Government attribution](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/15/fact-sheet-imposing-costs-for-harmful-foreign-activities-by-the-russian-government/)_\n_of this activity to the SVR._\n\nSince December 2020, CISA has been responding to a significant cybersecurity incident\naffecting networks of multiple U.S. government agencies, critical infrastructure entities, and\nprivate sector organizations, in which advanced persistent threat (APT) actors—identified on\nApril 15, 2020, as the Russian Foreign Intelligence Service (SVR) actors—gained long-term\naccess to organizations’ enterprise networks and moved laterally to Microsoft cloud systems,\ni.e., Azure Active Directory (AD) and Microsoft 365 (M365) environments. The SVR actors\nused privileged access to collect and exfiltrate sensitive data and created backdoors to\nenable their return.\n\n**_Note: although the guidance on this webpage is tailored to federal departments and_**\n_agencies, CISA encourages critical infrastructure and private sector organizations to review_\n_and apply it, as appropriate. For more information on CISA’s response to this activity, refer to_\n_[cisa.gov/supply-chain-compromise.](https://cisa.gov/supply-chain-compromise)_\n\n## Russian SVR APT Actor Activity\n\n### Russian SVR APT Actor Activity\n\nThe SVR actors added malicious code to certain versions of the SolarWinds Orion platform\nand leveraged it for initial access to select enterprise networks. Through incident response,\nCISA determined that, in other instances, the SVR actors obtained initial access by\npassword guessing, password spraying, and exploiting inappropriately secured\nadministrative credentials via remote services.\n\n\n-----\n\nIn some instances, once inside the network, the SVR actors bypassed multi-factor\nauthentication (MFA) and moved laterally to Microsoft cloud systems by compromising\nfederated identity solutions. SVR actors:\n\nStole the Active Directory Federation Service (ADFS) token-signing certificate to forge\nSecurity Assertion Markup Language (SAML) tokens. This technique—referred to as\n“Golden SAML”—enabled SVR actors to bypass the federated resource provider's MFA\nand password requirements and thereby move laterally to M365 environments.\nModified or added trusted domains in Azure AD. This technique enabled SVR actors to\nadd new federated identity providers (iDPs) and thereby move laterally to Azure AD\nenvironments. (See FireEye White Paper: Remediation and Hardening Strategies for\nMicrosoft 365 to Defend Against UNC2452.)\n\nAfter gaining access to cloud environments, the SVR actors established persistence\nmechanisms for Application Programming Interface (API)-based access and collected and\nexfiltrated data.\n\nThe SVR actors have demonstrated sophisticated defense evasion skills. They:\n\nHid their command and control (C2) communications with extensive obfuscation,\nHid their activity among legitimate user traffic, and\nEstablished difficult-to-detect persistence mechanisms (e.g., in API).\n\nNote: for more information on this activity, including tactics, techniques, and procedures\n(TTPs), refer to CISA Alerts and joint publications:\n\n[Joint NCSC-CISA-FBI-NSA CSA: Further TTPs associated with SVR cyber actors](https://www.ncsc.gov.uk/news/joint-advisory-further-ttps-associated-with-svr-cyber-actors)\nAA21-116A Joint FBI-DHS-CISA Cybersecurity Advisory: SVR Cyber Operations:\nTrends and Best Practices for Network Defenders\nJoint NSA-CISA-FBI Cybersecurity Advisory: Russian SVR Targets U.S. and Allied\nNetworks\nAA21-008A: Detecting Post-Compromise Threat Activity in Microsoft Cloud\nEnvironments\nAA20-352A: Advanced Persistent Threat Compromise of Government Agencies,\nCritical Infrastructure, and Private Sector Organizations\n\n## Risk/Impact Assessment\n\n### Risk/Impact Assessment\n\nOrganizations that used affected versions of SolarWinds Orion should conduct a risk\nassessment, if they have not already done so, to determine if their network was\ncompromised, and if applicable, the severity of compromise. As defined in CISA Activity Alert\n\n\n-----\n\nAA20-352A:Advanced Persistent Threat Compromise of Government Agencies, Critical\nInfrastructure, and Private Sector Organizations, networks with SolarWinds Orion products\nwill fall into one of three categories.\n\n**Category 1 includes agency networks that do not have the identified malicious binary**\ncode on their network and can forensically confirm that the binary was never present\non their systems. This includes networks that do not, and never did, use the affected\nversions of SolarWinds Orion products.\n**Category 2 includes agency networks where the presence of the malicious binary has**\nbeen identified—with or without beaconing to `avsvmcloud[.]com .`\n**Category 3 includes agency networks that used affected versions of SolarWinds Orion**\nand have evidence of follow-on threat actor activity, such as binary beaconing to\n```\n   avsvmcloud[.]com and secondary C2 activity to a separate domain or IP address\n\n```\n(typically but not exclusively returned in `avsvmcloud[.]com Canonical Name record`\n\n[CNAME] responses).\n\n**Note: As described above, CISA is aware of other initial access vectors. Organizations**\nshould not assume they are not compromised by this actor solely because they have never\nused affected versions of SolarWinds Orion. Those organizations should investigate to\nconfirm they have not observed related threat actor TTPs.\n\n**Resources**\n\nCISA Activity Alert AA20-352A: Advanced Persistent Threat Compromise of\nGovernment Agencies, Critical Infrastructure, and Private Sector Organizations\n[CISA Emergency Directive (ED) 21-01: Mitigate SolarWinds Orion Code Compromise](https://cyber.dhs.gov/ed/21-01/)\n\n## Remediating Malicious Activity: Category 1 and 2 Organizations\n\n### Remediating Malicious Activity: Category 1 and 2 Organizations\n\nAlthough unaffected by this incident, Category 1 organizations should work to maintain\n[strong network posture and resilience. Refer to https://www.cisa.gov/cybersecurity and](https://www.cisa.gov/cybersecurity)\n[https://us-cert.cisa.gov/resources/federal for assistance. CISA recommends Category 1](https://us-cert.cisa.gov/resources/federal)\norganizations:\n\nMaintain up-to-date antivirus signatures and engines. See Protecting Against Malicious\nCode.\nEnsure systems have the latest security updates. See Understanding Patches and\nSoftware Updates.\nEnforce a strong password policy. [See Choosing and Protecting Passwords.](https://www.us-cert.gov/ncas/tips/ST04-002)\nExercise caution when opening email attachments, even if the attachment is expected\n[and the sender appears to be known. See Using Caution with Email Attachments.](https://www.us-cert.gov/ncas/tips/ST04-010)\n[Sign up to receive CISA’s alerts on security topics and threats.](https://public.govdelivery.com/accounts/USDHSUSCERT/subscriber/new)\n\n\n-----\n\nSign up for CISAs free vulnerability scanning and testing services to help organizations\nsecure internet-facing systems from weak configuration and known vulnerabilities.\n[Email vulnerability@cisa.dhs.gov to sign up. See](http://10.10.0.46/mailto:vulnerability@cisa.dhs.gov) https://www.cisa.gov/cyber-resourcehub for more information about vulnerability scanning and other CISA cybersecurity\nassessment services.\n\n**Category 2 organizations should continue enhanced monitoring for any possible follow-on**\nadversary activity. Refer to resources below for more information.\n\n**Resources:**\n\nCISA Activity Alert AA20-352A: Advanced Persistent Threat Compromise of\nGovernment Agencies, Critical Infrastructure, and Private Sector Organizations\nCISA Activity Alert AA21-008A: Detecting Post-Compromise Threat Activity in Microsoft\nCloud Environments\n[CISA Emergency Directive (ED) 21-01: Mitigate SolarWinds Orion Code Compromise](https://cyber.dhs.gov/ed/21-01/)\n\nAccording to ED 21-01 and associated supplemental guidance, all federal agencies that ran\naffected versions of SolarWinds Orion must “conduct system memory, host storage, network,\nand cloud forensic analysis,” “hunt for indicators of compromise (IOCs) or other evidence of\nthreat actor activity, such as secondary actions on objectives (AOO),” and “[i]dentify and\nremove all threat actor-controlled accounts and identified persistence mechanisms.”\n\n## Remediating Malicious Activity: Category 3 Organizations\n\n### Remediating Malicious Activity: Category 3 Organizations\n\nRemediation plans for dealing with malicious compromises are necessarily unique to every\norganization, and success requires careful consideration. To assist affected organizations in\ncrafting eviction plans, CISA has released AR21-134A: Eviction Guidance for Networks\nAffected by the SolarWinds and Active Directory/M365 Compromise, which provides in-depth\nsteps and resources for eviction. The guidance has three phases:\n\n**Phase 1: Pre-Eviction. Actions to detect and identify APT activity and prepare the**\nnetwork for eviction.\n**Phase 2: Eviction. Actions to remove the APT actor from on-premises and cloud**\nenvironments. This phase includes rebuilding devices and systems.\n**Phase 3: Post-Eviction. Actions to ensure eviction was successful and the network**\nhas good cyber posture.\n\n**In accordance with** **[ED-21-01: Supplemental Direction Version 4, agencies which had](https://cyber.dhs.gov/ed/21-01/#supplemental-direction-v4)**\n**or have affected versions of SolarWinds Orion and have evidence of follow-on threat**\n**actor activity must execute and complete applicable eviction steps by July 16, 2021.**\n\n\n-----\n\nCompleting all the steps provided in the eviction guidance is necessary to fully accomplish\neviction.\n\nThe eviction will be resource-intensive and highly complex, requiring the enterprise network\nto be disconnected from the internet for 3–5 days; however, failure to perform a\ncomprehensive and thorough remediation will expose enterprise networks and cloud\nenvironments to substantial risk of long-term undetected APT activity, including email\nmonitoring, data collection, and exfiltration. CISA recommends organization leadership read\nthe CISA Insights, Remediating Networks Affected by the SolarWinds and Active\nDirectory/M365 Compromise: Risk Decisions for Leaders, for more information.\n\n## Resources: CISA, Federal Government, and International Partner Publications\n\n### Resources: CISA, Federal Government, and International Partner Publications\n\n**Note: the following publications focus on the SolarWinds Orion Compromise and**\n**Related Activity**\n\n_Table 1: CISA, Federal Government, SLTT, and International Partners Publications_\n\n**Publication Date** **Title**\n\n**_SolarWinds Orion_**\n**_Compromise and_**\n**_Related Activity_**\n\n5/14/2021 Analysis Report AR21-134A: Eviction Guidance for Networks\n[Affected by the SolarWinds and Active Directory/M365](https://us-cert.cisa.gov/ncas/analysis-reports/ar21-134a)\nCompromise\n\n5/14/2021 CISA Emergency Directive 21-01: Mitigate SolarWinds Orion Code\nCompromise and Supplemental Direction\n\n**_Note: initial publication of ED 21-01 was 12/13/2021; latest update_**\n_to supplemental direction (version 4) was 5/14/2021._\n\n5/7/2021 Fact Sheet: Russian SVR Activities Related to SolarWinds\nCompromise\n\n5/7/2021 Joint NCSC-CISA-FBI-NSA Cybersecurity Advisory: Further TTPs\nAssociated with SVR Cyber Actors\n\n5/7/2021 Current Activity: Joint NCSC-CISA-FBI-NSA Cybersecurity\nAdvisory on Russian SVR Activity\n\n\n-----\n\n**Publication Date** **Title**\n\n4/26/2021 FBI-DHS-CISA Joint Cybersecurity Advisory AA21-116A: Russian\n[Foreign Intelligence Service (SVR) Cyber Operations: Trends and](https://us-cert.cisa.gov/ncas/alerts/aa21-116a)\nBest Practices for Network Defenders\n\n4/26/2021 CISA Current Activity: FBI-DHS-CISA Joint Advisory on Russian\nForeign Intelligence Service Cyber Operations\n\n4/15/2021 CISA Malware Analysis Report: MAR-10327841-1.v1 –\nSUNSHUTTLE\n\n4/15/2021 CISA Current Activity: CISA and CNMF Analysis of SolarWindsrelated Malware\n\n4/15/2021 NSA-CISA-FBI Joint Cybersecurity Advisory: Russian SVR Targets\nU.S. and Allied Networks\n\n4/15/2021 CISA Current Activity: NSA-CISA-FBI Joint Advisory on Russian\nSVR Targeting U.S. and Allied Networks\n\n4/8/2021 CISA Current Activity: Using Aviary to Analyze Post-Compromise\nThreat Activity in M365 Environments\n\n3/18/2021 CISA Alert AA21-077A: Detecting Post-Compromise Threat Activity\nUsing the CHIRP IOC Detection Tool\n\n3/18/2021 CISA Current Activity: Using CHIRP to Detect Post-Compromise\nThreat Activity in On-Premises Environments\n\n3/9/2021 CISA Insights: SolarWinds and Active Directory/M365\nCompromise: Risk Decisions for Leaders\n\n3/9/2021 CISA Current Activity: Guidance on Remediating Networks\n[Affected by the SolarWinds and Active Directory/M365](https://us-cert.cisa.gov/ncas/current-activity/2021/03/09/guidance-remediating-networks-affected-solarwinds-and-active)\nCompromise\n\n2/8/2021 CISA Malware Analysis Report: MAR-10318845-1.v1 SUNBURST\n\n2/8/2021 CISA Malware Analysis Report: MAR-10320115-1.v1 TEARDROP\n\n2/8/2021 CISA Activity Alert AA20-352A: APT Compromise of Government\nAgencies, Critical Infrastructure, and Private Sector Organizations\n\n**_Note: initial publication of Alert was 12/17/2020; latest update was_**\n_4/15/2021._\n\n1/8/2021 CISA Alert AA21-008A: Detecting Post- Compromise Threat\nActivity in Microsoft Cloud Environments\n\n\n-----\n\n**Publication Date** **Title**\n\n1/8/2021 CISA Current Activity: CISA Releases New Alert on Post[Compromise Threat Activity in Microsoft Cloud Environments and](https://us-cert.cisa.gov/ncas/current-activity/2021/01/08/cisa-releases-new-alert-post-compromise-threat-activity-microsoft)\nTools to Help Detect This Activity\n\n1/6/2021 CISA Current Activity: CISA Updates Emergency Directive 21-01\n[Supplemental Guidance and Activity Alert on SolarWinds Orion](https://us-cert.cisa.gov/ncas/current-activity/2021/01/06/cisa-updates-emergency-directive-21-01-supplemental-guidance-and)\nCompromise\n\n1/5/2021 [CISA/FBI/NSA/ODNI Joint Statement](https://www.cisa.gov/news/2021/01/05/joint-statement-federal-bureau-investigation-fbi-cybersecurity-and-infrastructure)\n\n12/30/2020 Canadian Centre for Cyber Security Alert: Recommendations for\nSolarWinds Supply-Chain Compromise - Update 1\n\n12/29/2020 Australian Cyber Security Centre Alert: Potential SolarWinds Orion\ncompromise\n\n12/26/2020 CERT/CC: Vulnerability Note VU#843464: SolarWinds Orion API\nauthentication bypass allows remote command execution\n\n12/24/2020 CISA Current Activity: CISA Releases Free Detection Tool for\nAzure/M365 Environment\n\n12/24/2020 Canadian Centre for Cyber Security Alert: Recommendations for\nSolarWinds Supply-Chain Compromise\n\n12/23/2020 [CISA: Supply Chain Compromise webpage](https://www.cisa.gov/supply-chain-compromise)\n\n12/23/2020 CISA Current Activity: CISA Releases CISA Insights and Creates\nWebpage on Ongoing APT Cyber Activity\n\n12/23/2020 CISA Insight: What Every Leader Needs to Know About the\nOngoing APT Cyber Activity\n\n12/22/2020 MS-ISAC: The SolarWinds Cyber-Attack: What SLTTs Need to\nKnow Note: latest update was 12/22/2020.\n\n12/21/2020 [UK NCSC statement on the SolarWinds compromise](https://www.ncsc.gov.uk/news/ncsc-statement-on-solarwinds-compromise)\n\n12/19/2020 CISA Current Activity: CISA Updates Alert and Releases\n[Supplemental Guidance on Emergency Directive for SolarWinds](https://us-cert.cisa.gov/ncas/current-activity/2020/12/19/cisa-updates-alert-and-releases-supplemental-guidance-emergency)\nOrion Compromise\n\n12/17/2020 CISA Current Activity: NSA Releases Cybersecurity Advisory on\nDetecting Abuse of Authentication Mechanisms\n\n12/17/2020 NSA Cybersecurity Advisory: Detecting Abuse of Authentication\nMechanisms\n\n\n-----\n\n**Publication Date** **Title**\n\n12/17/2020 Canadian Centre for Cyber Security Alert: Advanced Persistent\nThreat Compromises (CISA)\n\n12/16/2020 [CISA/FBI/ODNI Joint Statement](https://www.cisa.gov/news/2020/12/16/joint-statement-federal-bureau-investigation-fbi-cybersecurity-and-infrastructure)\n\n12/15/2020 UK National Cyber Security Centre: Dealing with the SolarWinds\nOrion compromise\n\n12/14/2020 Australian Cyber Security Centre Alert: Potential SolarWinds Orion\ncompromise\n\n12/13/2020 [CISA Current Activity: Active Exploitation of SolarWinds Software](https://us-cert.cisa.gov/ncas/current-activity/2020/12/13/active-exploitation-solarwinds-software)\n\n**_General_**\n**_Cybersecurity_**\n**_Information_**\n\n5/19/2019 [NCSC: Security Architecture Anti-Patterns](https://www.ncsc.gov.uk/whitepaper/security-architecture-anti-patterns)\n\n_Table 2: Industry Publications_\n\n**Publication Date** **Title**\n\n**_SolarWinds Orion_**\n**_Compromise and_**\n**_Related Activity_**\n\n3/4/2021 MITRE's Center for Threat-Informed Defense Public Resources\n(GitHub): Solorigate Note: latest update was 3/4/2021.\n\n1/12/2021 Cisco Event Response: SolarWinds Orion Platform Software\nAttack Note: latest update was 1/12/2021.\n\n12/31/2020 [Microsoft: Internal Solorigate Investigation Update](https://msrc-blog.microsoft.com/2020/12/31/microsoft-internal-solorigate-investigation-update/)\n\n12/21/2020 [Microsoft: Solorigate Research Center](https://aka.ms/solorigate)\n\n12/21/2020 Microsoft: Understanding “Solorigate”’s Identity IOCs - for\nIdentity Vendors and their customers\n\n12/18/2020 MITRE (Medium): Identifying UNC2452-Related Techniques for\nATT&CK\n\n12/17/2020 Microsoft: Latest Threat Intelligence (15 December 2020) FireEye and SolarWinds Events\n\n\n-----\n\n**Publication Date** **Title**\n\n12/15/2020 CrowdStrike: The Imperative to Secure Identities: Key\nTakeaways from Recent High- Profile Breaches\n\n12/14/2020 Volexity: Dark Halo Leverages SolarWinds Compromise to\nBreach Organizations\n\n12/14/2020 Symantec: Sunburst: Supply Chain Attack Targets SolarWinds\nUsers\n\n12/14/2020 [Cisco Talos: FireEye Breach Detection Guidance](https://blog.talosintelligence.com/2020/12/fireeye-breach-guidance.html)\n\n12/14/2020 [Cisco Talos Threat Advisory: SolarWinds supply chain attack](https://blog.talosintelligence.com/2020/12/solarwinds-supplychain-coverage.html%20)\n\n12/14/2020 [Cisco Talos: SolarWinds Orion Platform Supply Chain Attack](https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-solarwinds-supply-chain-attack)\n\n12/13/2020 FireEye: Global Intrusion Campaign Leverages Software\nSupply Chain Compromise\n\n12/13/2020 FireEye: Highly Evasive Attacker Leverages SolarWinds\n[Supply Chain to Compromise Multiple Global Victims with](https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html)\nSUNBURST Backdoor\n\n12/13/2020 Microsoft: Important steps for customers to protect themselves\nfrom recent nation- state cyberattacks\n\n12/13/2020 Microsoft: Customer Guidance on Recent Nation-State Cyber\nAttacks\n\n12/8/2020 [FireEye: Unauthorized Access of FireEye Red Team Tools](https://www.fireeye.com/blog/threat-research/2020/12/unauthorized-access-of-fireeye-red-team-tools.html)\n\n**_Malware Analysis_**\n\n1/20/2021 Microsoft: Deep dive into the Solorigate second- stage\nactivation: From SUNBURST to TEARDROP and Raindrop\n\n1/18/2021 Symantec: Raindrop: New Malware Discovered in SolarWinds\nInvestigation\n\n1/11/2021 [CrowdStrike: SUNSPOT: An Implant in the Build Process](https://www.crowdstrike.com/blog/sunspot-malware-technical-analysis/)\n\n12/24/2020 [FireEye: SUNBURST Additional Technical Details](https://www.fireeye.com/blog/threat-research/2020/12/sunburst-additional-technical-details.html)\n\n12/22/2020 CheckPoint Research: SUNBURST, TEARDROP and the\nNetSec New Normal\n\n12/18/2020 Microsoft: Analyzing Solorigate, the compromised DLL file that\n[started a sophisticated cyberattack, and how Microsoft](https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/)\nDefender helps protect customers\n\n\n-----\n\n**Publication Date** **Title**\n\n12/17/2020 [McAfee: Additional Analysis into the SUNBURST Backdoor](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/additional-analysis-into-the-sunburst-backdoor/%20)\n\n12/17/2020 [Palo Alto Networks: SUPERNOVA: A Novel .NET Webshell](https://unit42.paloaltonetworks.com/solarstorm-supernova/)\n\n**_Incident Response,_**\n**_Remediation, and_**\n**_Hardening_**\n\n1/19/2021 FireEye: Remediation and Hardening Strategies for Microsoft\n365 to Defend Against UNC2452\n\n12/28/2020 Microsoft: Using Microsoft 365 Defender to protect against\nSolorigate\n\n12/22/2020 [Microsoft: Protecting Microsoft 365 from on-premises attacks](https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/protect-m365-from-on-premises-attacks)\n\n12/22/2020 Microsoft: Azure Active Directory Workbook to Assess\nSolorigate Risk\n\n12/21/2020 Microsoft: Advice for incident responders on recovery from\nsystemic identity compromises\n\n12/21/2020 FireEye (GitHub): FireEye Mandiant SunBurst\nCountermeasures\n\n12/16/2020 Microsoft: SolarWinds Post-Compromise Hunting with Azure\nSentinel\n\n10/28/2020 [Trimarc: Securing Microsoft Azure AD Connect](https://www.hub.trimarcsecurity.com/post/securing-microsoft-azure-ad-connect)\n\n8/9/2018 [Microsoft: AD Forest Recovery - Resetting the krbtgt Password](https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/manage/ad-forest-recovery-resetting-the-krbtgt-password)\n\n2/18/2016 CrowdStrike: Investigating PowerShell: Command and Script\nLogging\n\n4/8/2015 FireEye: Windows Management Instrumentation (WMI)\nOffense, Defense, and Forensics\n\n**_Technical and_**\n**_Investigation_**\n**_Information from_**\n**_SolarWinds_**\n\n2/24/2021 [FAQ: Security Advisory Note: latest update was 2/24/2021.](https://www.solarwinds.com/securityadvisory/faq)\n\n1/19/2021 [CISA/CERT Upgrading Your Environment Note: latest update](https://www.solarwinds.com/sa-overview/upgrading-your-environment)\n_was 1/19/2021._\n\n\n-----\n\n**Publication Date** **Title**\n\n1/11/2021 [New Findings from Our Investigation of SUNBURST](https://orangematter.solarwinds.com/2021/01/11/new-findings-from-our-investigation-of-sunburst/)\n\n12/17/2020 [SolarWinds Security Advisory](https://www.solarwinds.com/securityadvisory)\n\nN/A [Secure Configuration for the Orion Platform](https://documentation.solarwinds.com/en/Success_Center/orionplatform/content/core-secure-configuration.htm)\n\n**_Detection Tools_**\n\nN/A [CISA: CHIRP](https://github.com/cisagov/CHIRP)\n\nN/A [CISA: Sparrow](https://github.com/cisagov/Sparrow)\n\nN/A CrowdStrike:\n\n[CrowdStrike Reporting Tool for Azure (CRT)](https://www.crowdstrike.com/blog/CrowdStrike-launches-free-tool-to-identify-and-help-mitigate-risks-in-azure-active-directory/)\n[CrowdStrike CRT Github page](https://github.com/CrowdStrike/CRT)\n\nN/A [FireEye Mandiant: Azure AD Investigator](https://github.com/fireeye/Mandiant-Azure-AD-Investigator)\n\nN/A Microsoft:\n\nMicrosoft open sources CodeQL queries used to hunt for\nSolorigate activity\n[Solorigate CodeQL queries](https://aka.ms/Solorigate-CodeQL-Queries)\n\n**_Note: The information you have accessed or received is being provided “as is” for_**\n_informational purposes only. DHS and CISA do not endorse any commercial product or_\n_service, including any subjects of analysis. Any reference to specific commercial products,_\n_processes, or services by service mark, trademark, manufacturer, or otherwise, does not_\n_constitute or imply their endorsement, recommendation, or favoring by DHS or CISA._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-10 - Remediating Networks Affected by the SolarWinds and Active Directory-M365 Compromise.pdf"
    ],
    "report_names": [
        "2021-03-10 - Remediating Networks Affected by the SolarWinds and Active Directory-M365 Compromise.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "80edca9f-dcd6-491e-92f3-87ad1f575631",
            "created_at": "2023-10-14T02:03:14.694988Z",
            "updated_at": "2025-03-27T02:02:10.270247Z",
            "deleted_at": null,
            "main_name": "NetSec",
            "aliases": [
                "NetSec",
                "Operation Data Breach",
                "ScarFace_TheOne",
                "USDoD"
            ],
            "source_name": "ETDA:NetSec",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536128,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653691836,
    "ts_modification_date": 1653691836,
    "files": {
        "pdf": "https://archive.orkl.eu/7c1dc35b6b8f3b28e340cb813c5ba3526336a653.pdf",
        "text": "https://archive.orkl.eu/7c1dc35b6b8f3b28e340cb813c5ba3526336a653.txt",
        "img": "https://archive.orkl.eu/7c1dc35b6b8f3b28e340cb813c5ba3526336a653.jpg"
    }
}