{
    "id": "fa2aa501-d427-4fbc-a07c-2c78c37e4f96",
    "created_at": "2023-01-12T15:05:27.97753Z",
    "updated_at": "2025-03-27T02:09:29.183306Z",
    "deleted_at": null,
    "sha1_hash": "8a879a86474f973888a51345b58de29ca8fb0f33",
    "title": "2022-03-09 - New Nokoyawa Ransomware Possibly Related to Hive",
    "authors": "",
    "file_creation_date": "2022-05-28T05:03:12Z",
    "file_modification_date": "2022-05-28T05:03:12Z",
    "file_size": 881991,
    "plain_text": "# New Nokoyawa Ransomware Possibly Related to Hive\n\n**[trendmicro.com/en_us/research/22/c/nokoyawa-ransomware-possibly-related-to-hive-.html](https://www.trendmicro.com/en_us/research/22/c/nokoyawa-ransomware-possibly-related-to-hive-.html)**\n\nRansomware\n\n\nMarch 9, 2022\n\n\nIn March 2022, we came across evidence that another, relatively unknown, ransomware known as Nokoyawa is likely connected\nwith Hive, as the two families share some striking similarities in their attack chain, from the tools used to the order in which they\nexecute various steps.\n\nBy: Don Ovid Ladores, Ian Kenefick, Earle Maui Earnshaw March 09, 2022 Read time: ( words)\n\n[Hive, which is one of the more notable ransomware families of 2021, made waves in the latter half of the year after breaching](https://www.trendmicro.com/vinfo/us/security/definition/ransomware)\nover 300 organizations in just four months — allowing the group to earn what could potentially be millions of US dollars in profit.\nIn March 2022, we came across evidence that another, relatively unknown, ransomware known as Nokoyawa is likely connected\nwith Hive, as the two families share some striking similarities in their attack chain, from the tools used to the order in which they\nexecute various steps. Currently, the majority of Nokoyawa’s targets are located in South America, primarily in Argentina.\n\n## Attack chain similarities and differences\n\n[Some of the indicators we’ve observed being shared by both Nokoyawa and Hive include the use of Cobalt Strike as part of the](https://www.trendmicro.com/en_us/research/21/g/tracking_cobalt_strike_a_vision_one_investigation.html)\n[arrival phase of the attack, as well as the use of legitimate, but commonly abused, tools such as the anti-rootkit scanners GMER](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/locked-loaded-and-in-the-wrong-hands-legitimate-tools-weaponized-for-ransomware-in-2021)\nand PC Hunter for defense evasion. Other steps, such as information gathering and lateral deployment, are also similar.\n\nThe operators of the Hive ransomware are known to use other tools — such as NirSoft and MalXMR miner — to enhance their\nattack capabilities depending on the victim environment. Based on our analysis, Nokoyawa also does the same thing based on\nits victims. We’ve observed the ransomware leverage other tools such as. Mimikatz, Z0Miner, and Boxter\n\nWe also found evidence based on one of the IP addresses used by Nokoyawa that the two ransomware families share the same\ninfrastructure.\n\nAlthough we are not certain how Nokoyawa is delivered to its victims, given the similarities with Hive, it’s likely that it uses similar\nmethods such as phishing emails for arrival.\n\n**Indicator** **Hive** **Nokoyawa**\n\nCobalt Strike (arrival) Yes Yes\n\n\nCoroxy malware (deployment of\nPowerShell commands and scripts)\n\n\nOther researchers have flagged this malware as being related to\nHive, though we have not confirmed this ourselves\n\n\nYes\n\n\nGMER (defense evasion) Yes Yes\n\n\nPC Hunter (info gathering and defense\nevasion)\n\n\nYes Yes\n\n\nPowerShell Scripts (info gathering) Yes Yes\n\n\nPsExec (lateral deployment of\nRansomware)\n\n\nYes Yes\n\n\nFilename for Ransom Payload (xxx.exe) Yes Yes\n\nTable 1. Similarities in the attack chain of Hive and Nokoyawa\n\nTaking each individual step into account, the similarities might not seem as apparent — for example, Cobalt Strike is a very\npopular post exploitation tool that has been used by other ransomware gangs — but when taking the whole picture into account,\nit’s clear to see that the two ransomware families are connected.\n\nDespite their similarities, the two ransomware families still have a few differences. For example, the majority of the Hive\nransomware variants that we have observed were packed using UPX, while the Nokoyawa sample we analyzed did not use any\npacker for the binary sample, leaving strings from the file bare and easy to analyze.\n\n\n-----\n\nContent added to Folio\n\nFigure 1. A Hive variant packed\n\nusing UPX compared to the Nokoyawa sample we analyzed\nAnother difference is in the compiler — Hive’s binary was compiled using GoLang script, while Nokoyawa uses another\nlanguage to compile its binary, again making it easier to disassemble and analyze.\n\n\n-----\n\nFigure 2. Comparing the compilers of\n\nHive (top) and Nokoyawa (bottom)\nThe third difference is in the encryption routine. Hive generates a random key to be used for the encryption process based on\nRTLGenRandom API, which will be initially saved in memory. This key is then used through what seems to be a custom\nencryption implementation to encrypt the files. The key is then also encrypted using RSA via GoLang’s implementation of RSA\nencryption, which it accomplishes using a list of public keys embedded in the binary and the saved as <random>.key.\n<extension> on the encrypted drive. Finally, the generated key will be wiped from memory so that the encrypted key will be the\nonly copy of the key used for decryption.\n\nIn contrast, Nokoyawa ransomware generates a random key to be used for the encryption process using the\nBCryptGenRandom API. Each value is created for each file. It uses a hardcoded nonce for the encryption, “lvcelcve” and Salsa\nto encrypt the files, which is generated for every file. Then, it will encrypt the key using ECDH key pair.\n\nWhat the information gathered implies is that the Hive ransomware’s operators have likely begun using another ransomware\n[family — perhaps as a new Ransomware-as-a-Service (RaaS) operation. It’s also possible that they are using the same infection](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-as-a-service-enabler-of-widespread-attacks)\nchain as before, but with a different ransomware payload.\n\nNote that we have not found any evidence that Nokoyawa has been using the double extortion technique — where the\nransomware operator threatens to release critical information on a leak site in addition to encoding files — unlike Hive, which has\nbeen found to be integrating it in its attacks.\n\n## Defending against ransomware attacks\n\nRansomware is one of the most destructive malware types in the wild today due to its ability to compromise and leak critical\ndata. Therefore, organizations should ensure that their information is as safe as possible from ransomware attacks. These\nsecurity recommendations can help maximize their security implementation with relatively little costs:\n\nEnabling multifactor authentication can prevent malicious actors from compromising user accounts as part of their\ninfiltration process.\nUsers should be wary of opening unverified emails. Embedded links should never be clicked and attached files should\nnever be opened without the proper precautions and verification as these can kickstart the ransomware installation\nprocess.\n[Organizations should always adhere to the 3-2-1 rule: Create three backup copies on two different file formats, with one of](https://www.trendmicro.com/vinfo/ph/security/news/virtualization-and-cloud/best-practices-backing-up-data#:~:text=If%20a%20company%20needs%20to,formats%20(rule%20%232).)\nthe backups in a separate location.\nPatching and updating software and other systems at the soonest possible time can minimize the chance of a successful\nvulnerability exploitation that can lead down the road to a ransomware infection.\nOrganizations can better protect themselves from ransomware attacks if they implement multilayered security setups that\ncombine elements such as the automated detection of files and other indicators with constant monitoring for the presence\nof weaponized legitimate tools in their IT environment.\n\n\n-----\n\nCorrelating two different attacks, such as the one we ve done in this blog entry with Hive and Nokoyawa, are made much easier\n[with multilayered detection and response solutions such as Trend Micro Vision One™, which is a purpose-built threat defense](https://www.trendmicro.com/en_ph/business/products/detection-response.html)\nplatform that provides added value and new benefits beyond extended detection and response (XDR) solutions. This technology\nprovides powerful XDR capabilities that collect and automatically correlate data across multiple security layers — email,\nendpoints, servers, cloud workloads, and networks — to prevent attacks via automated protection while also ensuring that no\nsignificant incidents go unnoticed.\n\n## Indicators of Compromise\n\n URLs\n\nhxxp://185.150.117[.]186:80/asdfgsdhsdfgsdfg (Cobalt Strike download)\n\n## SHA256\n\n**Malware** **SHA256** **Detection**\n\n\nExploit\nAgent\n\nCoroxy\nDropper\n\n\na70729b3241154d81f2fff506e5434be0a0c381354a84317958327970a125507 Trojan.Win64.NEKTO.YACCAT\n\n2ef9a4f7d054b570ea6d6ae704602b57e27dee15f47c53decb16f1ed0d949187 Trojan.Win32.COROXY.SMYXBC3A\n\n\nCoroxy c170717a69847bb7b050832c55fcd2a214e9180c8cde5f86088bd4e5266e2fd9 Backdoor.Win64.COROXY.YACCAT\n\nDataSpy a290ce75c6c6b37af077b72dc9c2c347a2eede4fafa6551387fa8469539409c7 TrojanSpy.PS1.DATASPY.B\n\nNokoyawa e097cde0f76df948f039584045acfa6bd7ef863141560815d12c3c6e6452dce4 Ransom.Win64.NOKO.YACBL\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-09 - New Nokoyawa Ransomware Possibly Related to Hive.pdf"
    ],
    "report_names": [
        "2022-03-09 - New Nokoyawa Ransomware Possibly Related to Hive.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535927,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653714192,
    "ts_modification_date": 1653714192,
    "files": {
        "pdf": "https://archive.orkl.eu/8a879a86474f973888a51345b58de29ca8fb0f33.pdf",
        "text": "https://archive.orkl.eu/8a879a86474f973888a51345b58de29ca8fb0f33.txt",
        "img": "https://archive.orkl.eu/8a879a86474f973888a51345b58de29ca8fb0f33.jpg"
    }
}