{
    "id": "fa394e26-198f-40f2-ae0b-3238824e678c",
    "created_at": "2023-01-12T15:05:32.681775Z",
    "updated_at": "2025-03-27T02:05:58.107903Z",
    "deleted_at": null,
    "sha1_hash": "76e446fdb0a03df5f957b29a9eaaed798f6ce6d9",
    "title": "2018-06-20 - Meet MyloBot – A New Highly Sophisticated Never-Seen-Before Botnet That’s Out In The Wild",
    "authors": "",
    "file_creation_date": "2022-05-28T02:17:01Z",
    "file_modification_date": "2022-05-28T02:17:01Z",
    "file_size": 316752,
    "plain_text": "# Meet MyloBot - A New Highly Sophisticated Never-Seen- Before Botnet That's Out In The Wild\n\n**[deepinstinct.com/2018/06/20/meet-mylobot-a-new-highly-sophisticated-never-seen-before-botnet-thats-out-in-the-wild/](https://www.deepinstinct.com/2018/06/20/meet-mylobot-a-new-highly-sophisticated-never-seen-before-botnet-thats-out-in-the-wild/)**\n\nJune 20, 2018\n\n## 100% Prevention Score in the 2022 MITRE ATT&CK Evaluation for\n Enterprise\n\n[Learn more](https://www.deepinstinct.com/news/deep-instinct-shows-100-percent-score-in-mitre-evaluations)\n\nJune 20, 2018 | [Dalya Guttman](https://www.deepinstinct.com/author/dalya-guttman)\n\nOver the past few years, we have seen various ways of spreading malicious code, one main\ninfrastructure of spreading malware being the dark web.\n\nLately, we have noticed a highly complicated botnet (number of internet-connected devices,\nwhere the owner can control them using command and control servers), which was detected\nand prevented in one of our client’s live environment and devices - by our deep learning\ncybersecurity solution. This botnet presents three different layers of evasion techniques,\nincluding usage of command and control servers to download the final payload. the\ncombination and complexity of these techniques were never seen in the wild before.\n\n\n-----\n\nBotnets can theoretically perform anything – depending on the payload. The payload can\nvary from DDoS attacks, steal data, and even installation ransomware which can cause\ntremendous damage.\n\n**What it does**\n\nThis highly sophisticated botnet incorporates different malicious techniques:\n\nAnti VM techniques\nAnti-sandbox techniques\nAnti-debugging techniques\nWrapping internal parts with an encrypted resource file\nCode injection\nProcess hollowing - a technique where an attacker creates a new process in a\nsuspended state, and replaces its image with the one that is to be hidden\n[Reflective EXE - executing EXE files directly from memory, without having them on](https://www.blackhat.com/docs/us-16/materials/us-16-Nipravsky-Certificate-Bypass-Hiding-And-Executing-Malware-From-A-Digitally-Signed-Executable-wp.pdf)\n[disk. This kind of reflection is not very common and was first published by Deep Instinct](https://www.blackhat.com/docs/us-16/materials/us-16-Nipravsky-Certificate-Bypass-Hiding-And-Executing-Malware-From-A-Digitally-Signed-Executable-wp.pdf)\nin Blackhat USA 2016\nIt also has a delaying mechanism of 14 days before accessing its command and\ncontrol servers.\n\nThe fact that everything takes place in memory (while executing the main business logic of\nthe botnet in an external process using code injection) makes it even harder to detect and\ntrace.\n\nWhen we traced the command and control server we revealed that it was used by other\nmalware campaigns as well which originated from the dark web.\n\nThe dark web plays a critical part in the spread of malware: Its rather simple accessibility of\nservices and knowledge has made it easy for any attacker to gain much more abilities in\nminimum effort. The first example for this, is the shared knowledge in forums: in the dark\nweb, attackers trade methods and techniques in underground forums, thus exposing\nknowledge to additional malware developers.\n\nAnother example, which has increased in the past couple of years, is the amount of malware\nfor sale on dark web markets. By using the dark web, anyone today can access an online\nmarket and purchase a malware. Prices vary, from simple malware that costs several dollars\nto malware sold at hundreds of dollars as “fully undetectable”. Other than the malware itself,\nmalware developers can purchase services that assist in the infection process. An attacker\ncan purchase access to exploit kits, buy traffic of tens of thousands of users to a web page,\nor even buy a full ransomware-as-a-service for his own use.\n\n**Malware vs. Malware**\n\n\n-----\n\nPart of this malware process is terminating and deleting instances of other malware. It\nchecks for known folders that malware “lives” in (“Application Data” folder), and if a certain\nfile is running – it immediately terminates it and deletes its file. It even aims for specific\nfolders of other botnets such as DorkBot.\n\nWe estimate this rare and unique behavior is because of money purposes within the Dark\nweb. Attackers compete against each other to have as many “zombie computers” as\npossible in order to increase their value when proposing services to other attackers,\nespecially when it comes to spreading infrastructures. The more computers – the more\nmoney an attacker can make. This is something we’re seeing here as well.\n\n**Comparing current running process on the list to a file located in %APPDATA%**\n**(“LoadOrd.exe” in this case)**\n\n**In case there is a match, terminate the process and delete it**\n\n\n-----\n\n**The Expected Damage**\n\nOnce installed, the botnet shuts down Windows Defender and Windows Update while\nblocking additional ports on the Firewall. It also shuts down and deletes any EXE file running\nfrom %APPDATA% folder, which can cause loss of data. The main functionality of the botnet\nenables an attacker to take complete control of the user’s system - it behaves as a gate to\ndownload additional payloads from the command and control servers. The expected damage\nhere depends on the payload the attacker decides to distribute. It can vary from downloading\nand executing ransomware and banking trojans, among others. This can result in loss of\ntremendous amount of data, the need to shut down computers for recovery purposes, which\ncan lead to disasters in enterprises. The fact that the botnet behaves as a gate for additional\npayloads, puts the enterprise in risk for leak of sensitive data as well, following the risk of\nkeyloggers / banking trojans installations.\n\n\n-----\n\nAlthough this kind of complexity in the malware s structure is extremely rare, Deep Instinct\ndetected and prevented it on a client’s production environment. Once again, this is a true\ntestament for the superiority of deep learning based solutions in the cybersecurity warfare.\n\nFor a full detailed analysis of Mylobot, download our free research paper on botnets>>\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-06-20 - Meet MyloBot – A New Highly Sophisticated Never-Seen-Before Botnet That’s Out In The Wild.pdf"
    ],
    "report_names": [
        "2018-06-20 - Meet MyloBot – A New Highly Sophisticated Never-Seen-Before Botnet That’s Out In The Wild.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535932,
    "ts_updated_at": 1743041158,
    "ts_creation_date": 1653704221,
    "ts_modification_date": 1653704221,
    "files": {
        "pdf": "https://archive.orkl.eu/76e446fdb0a03df5f957b29a9eaaed798f6ce6d9.pdf",
        "text": "https://archive.orkl.eu/76e446fdb0a03df5f957b29a9eaaed798f6ce6d9.txt",
        "img": "https://archive.orkl.eu/76e446fdb0a03df5f957b29a9eaaed798f6ce6d9.jpg"
    }
}