{
    "id": "fa6ec323-994b-4d79-92fd-f80dab44646f",
    "created_at": "2023-01-12T15:10:23.836036Z",
    "updated_at": "2025-03-27T02:05:49.136219Z",
    "deleted_at": null,
    "sha1_hash": "708ff28dc6e63ab7c0af0ac38b4faebbbc18bdd1",
    "title": "2021-10-07 - Ransomware in the CIS",
    "authors": "",
    "file_creation_date": "2022-05-28T19:36:33Z",
    "file_modification_date": "2022-05-28T19:36:33Z",
    "file_size": 3953944,
    "plain_text": "# Ransomware in the CIS\n\n**securelist.com/cis-ransomware/104452/**\n\nAuthors\n\nFedor Sinitsyn\n\n[Yanis Zinchenko](https://securelist.com/author/yaniszinchenko/)\n\n## Introduction\n\nThese days, when speaking of cyberthreats, most people have in mind ransomware,\nspecifically cryptomalware. In 2020–2021, with the outbreak of the pandemic and the\nemergence of several major cybercriminal groups (Maze, REvil, Conti, DarkSide, Avaddon),\nan entire [criminal ecosystem took shape, leading to a mounting worldwide wave of attacks](https://securelist.com/ransomware-world-in-2021/102169/)\non large organizations with pockets deep enough to pay a ransom in the hundreds of\nthousands, even millions, of US dollars.\n\n\n-----\n\nThis year, after a series of high-profile ransomware incidents, such as the attacks on Colonial\nPipeline (the operator of the largest fuel pipeline in the US), JBS and Kaseya, and the\nheightened scrutiny from the US and other authorities that followed, the ransomware market\nhas undergone some major changes: some groups have shut up shop, others have\nrebranded.\n\nMost of the groups you might read about in the news today tend to operate outside the\nCommonwealth of Independent States (CIS). That said, companies in this region still cannot\nrelax, since they are the target of dozens of lesser-known groups.\n\nThis roundup spotlights the ransomware Trojan families that most actively attacked\nbusinesses in the CIS in H1 2021, and their technical characteristics.\n\n## Statistics\n\n_Number of business users in the CIS who encountered ransomware, January–July 2021_\n_[(download)](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2021/10/06141854/01-en-cis-ransomware.png)_\n\n_Unique business users whose devices were attacked by ransomware Trojans as a_\n_percentage of all unique users of Kaspersky products in the country, January–July 2021_\n_[(download)](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2021/10/06141924/02-en-cis-ransomware.png)_\n\n## Ransomware families at a glance\n\nBigBobRoss/TheDMR\n\nThis ransomware became active at the back end of 2018 and remains current. According to\n[our data, its main vector of distribution is cracking RDP passwords.](https://encyclopedia.kaspersky.com/glossary/brute-force/?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanation)\n\nWhen launched, BigBobRoss shows the operator technical information, including the key for\nsubsequent file decryption. The malware also sends a message with this information via\nTelegram.\n\n\n-----\n\n**_Technical file created by BigBobRoss_**\n\nAfter encryption, the contents of the folders look as follows: the cybercriminals’ e-mail\naddress and the victim’s ID are added to the beginning of each file, followed by the original\nname and extension, and then the extension added by the ransomware.\n\n**_Encrypted files and a note from the attackers_**\n\nAdditionally, a note with the attackers’ details is added to each folder.\n\n\n-----\n\n**_Note left by the ransomware_**\n\nFor encryption, the program uses the AES symmetric algorithm with a 128-bit key in ECB\nmode (simple substitution mode) from the CryptoPP cryptographic library.\n\nThe PDB retains information about the name of the project. The developer may be Russianspeaking, but it is impossible to say for sure, since the name could just be an attempt to\nmuddy the waters.\n\n**_PDB info of the executable file_**\n\nCrysis/Dharma\n\nCrysis is an old piece of cryptomalware known since 2016. It is known to be deactivated and\nthen revived. Currently, it is still active. The Trojan’s code has remained unchanged for\n[several years, and today it is distributed through a Ransomware-as-a-Service (RaaS) affiliate](https://encyclopedia.kaspersky.com/glossary/ransomware-as-a-service-raas/?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanation)\n\n\n-----\n\nprogram.\n\nCrysis is written in C/C ++ and compiled in MS Visual Studio. The malware encrypts files\nusing the AES-256 algorithm in CBC mode. Upon launch, the Trojan generates a 256-bit\nAES key that is encrypted using the RSA-1024 algorithm, with the attacker’s public key\ncontained in the Trojan’s body.\n\nEach file is encrypted using the aforementioned AES key, as well as the freshly generated\n128-bit initialization vector (IV). Besides the encrypted content, the encrypted file stores the\nIV, the RSA-encrypted AES key, and auxiliary information, including the attacker’s label (a\nstring value), the SHA1 hash of the used RSA public key, the original file name, the\nencryption type (the part of the file to be encrypted is chosen differently for small and large\nfiles) and the checksum.\n\n**_Crysis ransom note_**\n\n\n-----\n\nThe typical Crysis attack vector is unauthorized RDP access. The attacker cracks the\ncredentials (through a dictionary/brute-force attack or ready lists bought from other\ncybercriminals), connects remotely to the victim’s computer, and runs the Trojan manually.\n\nPhobos/Eking\n\nThis ransomware has been around since 2017. At the conceptual level (code structure,\napproaches used by the developers), Phobos is similar to Crysis in many ways. This\nsuggests that either the Trojans share the same developer, or the authors of Phobos are\nfamiliar with how Crysis works. However, we found no direct borrowing of code; in other\nwords, these are different families of Trojans assembled from different sources.\n\nLike most modern ransomware, Phobos is distributed through a RaaS affiliate program. The\nmain vector of infection is unauthorized RDP access.\n\nPhobos is written in C/C++ and compiled in MS Visual Studio. It uses the AES-256-CBC\nalgorithm to encrypt the victim’s files, while the AES key is encrypted using the RSA-1024\npublic key contained in the body of the malware.\n\n**_Phobos ransom note_**\n\nCryakl/CryLock\n\n\n-----\n\nCryakl is probably the oldest ransomware featured in this post. The first version was\ndetected back in April 2014. However, it seems that in modern versions of this Trojan, not a\nsingle line of code is left over from that time. Cryakl has been rewritten many times, and\nchanges are introduced with each new version, often significant ones.\n\nIt is distributed through an affiliate program. Currently, its most common attack vector is via\nRDP. For the attacker’s convenience, the Trojan supports a graphical interface. The operator\nconfigures the necessary settings manually in the program window.\n\n**_Cryakl settings window_**\n\nCryakl is written in Delphi. The modern version of Cryakl uses a custom symmetric cipher to\nencrypt the victim’s files, and the RSA algorithm to encrypt the key.\n\nAn interesting feature of the current versions of Cryakl, not seen in other ransomware, is\nadvanced processing of archive file formats.\n\nArchives can be large, and encrypting them in their entirety takes a long time. And if only an\narbitrary piece of a file is encrypted, it is possible to recover some of the content without\ndecryption.\n\n\n-----\n\nCryakl features specialized procedures for handling the ZIP, 7z, TAR, CAB and RAR (old\nversions and RAR5) formats. It parses each of these formats and encrypts only the critical\nparts of the archive, delivering high performance and preventing data recovery without\ndecryption.\n\n**_Part of the procedure for analyzing the ZIP format_**\n\n\n-----\n\n**_Cryakl ransom note_**\n\nCryptConsole\n\nCryptConsole was first spotted in January 2017 and is still encountered today. It is written in\nC# and uses .NET libraries for encryption. The main vector of distribution is cracking RDP\npasswords.\n\n**_CryptConsole note_**\n\n\n-----\n\nFor encryption, two key and IV pairs are generated. These are written to a text file, along\nwith a size parameter that reflects how much of the user’s file is to be encrypted, and placed\non the desktop. The name of this text file is a 40-character string that matches the user’s\nunique identifier (Personal ID in the note). It is assumed that the malware operator, having\ngained access via RDP, runs the ransomware and saves this file for themselves, then deletes\nit from the victim’s device. It may prove possible to recover the file, but there is no guarantee.\nInterestingly, the size of the encrypted part of the file (the size parameter) is a random value\nin the range [5485760, 10485760].\n\n**_File with keys left by the ransomware_**\n\nThe encryption scheme is also curious. As mentioned above, the ransomware generates two\nrandom pairs: key+IV and key2+IV2. The file size is then compared to the previously\ngenerated random size value. If the file is greater than size, only the part of the file that is\nless than or equal to this value is encrypted, before which a buffer with size bytes of random\ndata is written to the file.\n\n**_Generating the key/IV pairs, ID, and size_**\n\nEncryption is performed using the symmetric AES algorithm. First, a size bytes chunk of the\nfile is encrypted using key and IV, then the encrypted buffer is reversed and encrypted again,\nthis time using key2 and IV2. This is how the dual encryption scheme works.\n\n\n-----\n\n**_Dual encryption scheme for small files_**\n\nLarge files, as mentioned before, are first filled with size bytes of arbitrary data. Only after\nthat is the encrypted data appended.\n\n**_Dual encryption scheme with arbitrary data writing_**\n\nFonix/XINOF\n\nFonix ransomware appeared in the summer of 2020. In January 2021, its creators\nannounced the closure of the project and even published the master key, which we used to\n[build a decryptor for victims of this Trojan.](https://www.kaspersky.com/blog/fonix-decryptor/38646/)\n\nHowever, that was not the end of the Fonix story. A few months later (in June 2021), we\ndetected attacks by a new version of Fonix, which doesn’t use the old master key.\n\nThis version of Fonix mimics the Crysis and Phobos Trojans, using the same extensions and\nnaming scheme for encrypted files.\n\nIf the files affected by earlier versions of Fonix had names like picture.jpg.Email=\n\n[actor@mail.tld]ID=[B49D8EF5].XINOF, now they are indistinguishable from the names of\nthe files encrypted by Crysis (picture.jpg.id-523E8573.[actor@mail.tld].harma) or Phobos\n(picture.jpg.ID-70AB2875.[actor@mail.tld].eking).\n\n\n-----\n\nThe path to the project s PDB file, preserved in the Trojan sample, likewise speaks of\ndeliberate masking: the line “DharmaVersion” points unambiguously to the Dharma family\n(an alternative name for the Crysis ransomware).\n\n**_PDB path_**\n\nFonix is written in C++ using the CryptoPP library and compiled into a 64-bit executable file\nin MS Visual Studio. It is distributed using the RaaS scheme, with the main method of\ndelivery to the victim’s system being via spam with a malicious attachment.\n\nAfter each infection, the ransomware sends a notification to its operator via Telegram, which,\n[incidentally, is nothing new and was first seen several years ago.](https://securelist.com/the-first-cryptor-to-exploit-telegram/76558/)\n\n**_Sending a notification in Telegram_**\n\nUpon infecting the host, Fonix also checks the victim’s geolocation by IP and, if launched in\nIran, ceases its activity without encryption.\n\n\n-----\n\n**_Country check in Fonix_**\n\nTo encrypt user files, it uses the ChaCha or Salsa algorithms (depending on the file size).\nThe ChaCha/Salsa keys are encrypted by RSA with a session public key generated when\nthe Trojan is launched. The session private key is encrypted by RSA using the public master\nkey contained in the body of the malware.\n\nEarly versions of Fonix had their own design of ransom notes.\n\n\n-----\n\n**_Fonix ransom note (early version)_**\n\nIn modern samples, meanwhile, we see the look of some versions of Crysis’ and Phobos’\nransom notes being copied.\n\n\n-----\n\n**_Fonix ransom note (modern version)_**\n\nLimbozar/VoidCrypt\n\nThis ransomware appeared in mid-2019. Some versions of it are also known as Limbo,\nLegion, Odveta and Ouroboros. Limbozar is distributed through an affiliate program (RaaS).\nCurrently, the main vector of distribution is unauthorized RDP access. Limbozar is written in\nC++, compiled in MS Visual Studio and uses the CryptoPP library to implement\ncryptographic functions.\n\nThe cryptographic scheme has changed several times throughout the family’s history. When\nlaunched, modern versions of Limbozar generate an RSA-2048 session key pair, followed by\na 256-bit key and a 96-bit initialization vector for the AES algorithm in GCM mode. The\nprivate RSA session key is encrypted with the AES algorithm and saved locally. Next, the\nkey+IV pair for AES is encrypted with one of the several public RSA master keys contained\nin the Trojan’s body, and is also saved to the local drive.\n\nAfter this preparatory phase, Limbozar searches for the victim’s files and encrypts them with\nthe AES-GCM algorithm, generating for each file a unique key+IV pair, which, in turn, it\nencrypts with the RSA session public key.\n\nAfter encryption, the malware leaves the cybercriminals’ demands in the Decrypt-info.txt\nfiles.\n\n\n-----\n\n**_Limbozar ransom note_**\n\nUpon full encryption, Limbozar also sends a notification about the new victim to its C&C\nserver using a POST request. To implement network communication, the SFML library\n(libsfml-network) is used.\n\n\n-----\n\n**_Notification about a new Limbozar infection_**\n\nThanos/Hakbit\n\nThanos became active in late April 2020, although information about it first appeared in\nJanuary when it was presented as RaaS on a hacker forum. The ransomware is written in\nC#. According to our information, its main vector of distribution is cracking RDP passwords.\n\n\n-----\n\n**_Desktop wallpaper of an infected machine displaying a ransom note_**\n\nSince the distribution model is RaaS, the ransomware is distributed through a builder,\nenabling the customization of the Trojan itself and a decryptor for it.\n\nThere are many different settings in the builder: both basic (extension of encrypted files,\nname and content of ransom note, payment address) and more advanced (code obfuscation,\nself-delete, disabling Windows Defender, bypassing the Antimalware Scan Interface (AMSI),\nunlocking files occupied by other processes, protecting the ransomware process, preventing\nsleep, execution delay, fast encryption mode for large files, setting extensions of the files to\nbe encrypted, selecting a victim notification method). The leaked constructor can be found\nonline. Most likely, it was uploaded by the operator who bought it. For protection, it features a\nbuilt-in HWID check, suggesting it was assembled for the specific device of the operator.\n\nThe decryptor can decrypt files using the user ID, which is an RSA-encrypted key for a\nsymmetric encryption algorithm (different versions have different symmetric algorithms).\n\n\n-----\n\n**_Decryptor for Thanos_**\n\nThe ransomware can employ a range of encryption schemes. In various samples of the\nransomware, we came across the following:\n\nOne key for all files; Salsa20 encryption\nDifferent keys for all files; Salsa20 encryption\nOne key for all files passed through PBKDF2 function; AES-256 CBC encryption\nOne key for all files passed through PBKDF2 function (1000 iterations for small files\nand 50,000 iterations for large (>15 MB) files), then AES-256 CBC encryption\n\nAn illustration of one of the encryption schemes (static key + PBKDF2 + AES-256 CBC) and\nthe code obfuscation method are given below. The obfuscation is rather weak, which makes\nit possible to recover the original code.\n\n**_One of the blocks of code used for encryption_**\n\nThe ransom note does not differ much. As usual, the purpose is to leave contact details and\nintimidate the user.\n\n\n-----\n\n**_Thanos ransom note_**\n\nThanos implements a rather flexible attack scheme, allowing the operator to independently\nselect the ransomware’s features and generate it to suit their specific needs.\n\nXMRLocker\n\nXMRLocker was first noticed in early August 2020. It is written in C# and uses .NET libraries\nfor encryption.\n\nEncryption is performed using a generated password of random length of 65–101 characters.\nA fixed alphabet, which includes English upper- and lower-case letters plus some special\ncharacters, is used to generate the password.\n\n\n-----\n\n**_Password generation in XMRLocker_**\n\nEncryption uses the AES algorithm with a key length of 256 bits in CFB mode and with\nPKCS7 padding. The pre-generated password is passed through the PBKDF2 function with\n50,000 iterations, and the result is converted to a key and IV for further encryption. PBKDF2\nuses a 32-byte random salt, which gets written to the beginning of each file. A single key is\ngenerated for all files. It is saved in a text file named HWID, which is sent to the C&C server\nhosted on Tor network and then deleted.\n\n**_Encryption function_**\n\nAfter encryption, the machine is shut down. Upon next startup, the user is greeted with a\nmocking description of what has happened and the cybercriminals’ details.\n\n\n-----\n\n**_Message after startup_**\n\nThe ransomware note, as usual, contains contact details and an ID. The only surprising\nelement is the words “files encrypted with Base-64 algorithm,” since this is not an encryption\nalgorithm and is not used at all by this ransomware.\n\n**_Note left by the ransomware_**\n\n## Takeaways\n\nBoth well-known and relatively new business-oriented ransomware is present in the CIS.\nMany of these threats are actively developing, and some, since being discovered, have been\nshut down only to reappear on the market. Cybercriminals use various encryption\ntechniques, some of them quite curious, such as dual encryption in CryptConsole and\narchive processing in Cryakl.\n\nAlthough there are different vectors of malware distribution, most of the current crop of\nransomware threats targeting businesses in the CIS penetrate the victim’s network via RDP.\nTo counter this, it is important to create strong passwords for domain accounts and change\n\n\n-----\n\nthem regularly. It is also advised to block RDP access from the internet and use a VPN to\nconnect to the corporate network instead.\n\n## IoC\n\nFonix:\n\n[78c2e00d02a4ebd7924b91d70172cb18](https://opentip.kaspersky.com/78c2e00d02a4ebd7924b91d70172cb18/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[4a02e768265eb3dc9fdafa8ece81b468](https://opentip.kaspersky.com/4a02e768265eb3dc9fdafa8ece81b468/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[36339f59f433e35a9f52928bc90d6892](https://opentip.kaspersky.com/36339f59f433e35a9f52928bc90d6892/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nCryakl:\n\n[23755a33694adc76023dd0b7607bc03d](https://opentip.kaspersky.com/23755a33694adc76023dd0b7607bc03d/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nCrysis:\n\n[8e156f89489cfb4094a0e662b64a2fb8](https://opentip.kaspersky.com/8e156f89489cfb4094a0e662b64a2fb8/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nLimbozar:\n\n[91332f289d3e577b57d878b55c5cf18a](https://opentip.kaspersky.com/91332f289d3e577b57d878b55c5cf18a/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nPhobos:\n\n[1fd2cad966f90f5a434c80aa9c2e987b](https://opentip.kaspersky.com/1fd2cad966f90f5a434c80aa9c2e987b/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nCryptConsole:\n\n[94291aaa1134e8f404778adc46cb4700](https://opentip.kaspersky.com/94291aaa1134e8f404778adc46cb4700/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nBigBobRoss:\n\n[8080443b933790f6d26935da7460671c](https://opentip.kaspersky.com/8080443b933790f6d26935da7460671c/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nXMRLocker:\n\n[f0959600e81b2fbdcb7bb43948466bf8](https://opentip.kaspersky.com/f0959600e81b2fbdcb7bb43948466bf8/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nThanos:\n\n[177b612600f7e9c2be2dbda96718ffc4](https://opentip.kaspersky.com/177b612600f7e9c2be2dbda96718ffc4/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[d5128657902961b2b02447b84ff6345f](https://opentip.kaspersky.com/d5128657902961b2b02447b84ff6345f/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[4096e6730b117ae60dc3e5d4fd31acda](https://opentip.kaspersky.com/4096e6730b117ae60dc3e5d4fd31acda/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[Encryption](https://securelist.com/tag/encryption/)\n[Malware](https://securelist.com/tag/malware/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Ransomware](https://securelist.com/tag/ransomware/)\n[RDP](https://securelist.com/tag/rdp/)\n\nAuthors\n\n\n-----\n\nFedor Sinitsyn\n\n[Yanis Zinchenko](https://securelist.com/author/yaniszinchenko/)\n\nRansomware in the CIS\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-07 - Ransomware in the CIS.pdf"
    ],
    "report_names": [
        "2021-10-07 - Ransomware in the CIS.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536223,
    "ts_updated_at": 1743041149,
    "ts_creation_date": 1653766593,
    "ts_modification_date": 1653766593,
    "files": {
        "pdf": "https://archive.orkl.eu/708ff28dc6e63ab7c0af0ac38b4faebbbc18bdd1.pdf",
        "text": "https://archive.orkl.eu/708ff28dc6e63ab7c0af0ac38b4faebbbc18bdd1.txt",
        "img": "https://archive.orkl.eu/708ff28dc6e63ab7c0af0ac38b4faebbbc18bdd1.jpg"
    }
}