{
    "id": "fa873283-31f2-4fb4-89d8-b76b99af84e4",
    "created_at": "2023-04-05T02:09:29.231501Z",
    "updated_at": "2025-03-27T02:17:22.911264Z",
    "deleted_at": null,
    "sha1_hash": "bfbe27da1cd540c9724bbec7b18ce717dcb4521e",
    "title": "2023-03-30 - 3CX Supply Chain Compromise Leads to ICONIC Incident",
    "authors": "",
    "file_creation_date": "2023-04-03T08:59:34Z",
    "file_modification_date": "2023-04-03T08:59:34Z",
    "file_size": 1352335,
    "plain_text": "# 3CX Supply Chain Compromise Leads to ICONIC Incident\n\n**[volexity.com/blog/2023/03/30/3cx-supply-chain-compromise-leads-to-iconic-incident/](https://www.volexity.com/blog/2023/03/30/3cx-supply-chain-compromise-leads-to-iconic-incident/)**\n\nMarch 30, 2023\n\nby Ankur Saini, Callum Roxan, Charlie Gardner, Paul Rascagneres, Steven Adair, Thomas Lancaster\n\n_[Update: Following additional analysis of shellcode used in ICONIC, in conjunction with other observations from_\n_the wider security community, Volexity now attributes the activity described in this post to the Lazarus threat_\n_actor. Specifically, in addition to other claims of similarity, the shellcode sequence {E8 00 00 00 00 59 49 89 C8_\n_[48 81 C1 58 06 00 00} appears to have been only used in the ICONIC loader and the APPLEJEUS malware,](https://twitter.com/dez_/status/1641459372478935040)_\n_which is known to be linked to Lazarus. The original post has been left as written.]_\n\nOn Wednesday, March 29, 2023, Volexity became aware of a supply chain compromise by a suspected North\nKorean threat actor, which Volexity tracks as UTA0040 . Endpoints with the 3CX Desktop application installed*\nreceived a malicious update of this software that was signed by 3CX and downloaded from their servers. This\nwas part of the default automatic update process and would result in information-stealing malware being\ninstalled on the victim’s host. It is possible that additional malicious activity may have taken place if the threat\nactor deemed the endpoint to be of sufficient interest.\n\n3CX is a phone system company and claims to have more than 600,000 customers and 12 million users,\n[including world-renowned brands. They have posted an update on their website acknowledging the compromise,](https://www.3cx.com/blog/news/desktopapp-security-alert/)\nthough it should be noted the information in this post should not be deemed conclusive or entirely accurate\nbased on Volexity’s analysis.\n\nIn a public post [on Reddit, CrowdStrike identified signed 3CX installation files as being malicious and reported](https://www.reddit.com/r/crowdstrike/comments/125r3uu/20230329_situational_awareness_crowdstrike/)\nthat customers were seeing malicious activity emanating from the “3CXDesktopApp”. Volexity further identified\npublic forum postings on 3CX’s [own website that stated various endpoint detection and response (EDR) and](https://www.3cx.com/community/threads/threat-alerts-from-sentinelone-for-desktop-update-initiated-from-desktop-client.119806/)\n\n\n-----\n\nantivirus (AV) vendors began flagging malicious activity from updates as early as March 22, 2023. Volexity s\nanalysis suggests the malicious activity likely began much earlier.\n\nVolexity was able to obtain multiple malicious installers for Windows and macOS directly from 3CX download\nservers. Analysis of installers from both platforms allowed Volexity to identify several new indicators of\ncompromise and gain further insight into how the malware functions.\n\nThis post details what Volexity discovered from its analysis of the malicious installers and the additional files it\ndownloads. Highlights of the findings include the following:\n\nBoth the macOS and Windows installers for 3CX are affected.\nBased on data recovered from GitHub, infrastructure used by the Windows variant was activated on\nDecember 7, 2022.\nDomains and web infrastructure used in the attacks were registered as early as November 2022.\nA reconnaissance payload was deployed far and wide to Windows users.\nThe same functionality to download a payload was identified in the macOS sample, although Volexity could\nnot confirm the final payload as the C2 was unresponsive at the time of analysis.\n\nAny endpoint impacted by this malicious update should be isolated and investigated for further signs of\ncompromise. Organizations should assess the potentially impacted information on these endpoints and look to\ncycle secrets to reduce the risk of additional future compromise.\n\n## ICONIC Analysis\n\n### Stage #1: Supply Chain Attacks - ICONIC\n\nVolexity’s analysis began with one of the installers tagged as malicious in public discourse:\n\n**Name(s)** 3CXDesktopApp-18.12.416.msi\n\n**Size** 97.8MB (102555648 Bytes)\n\n**File Type** Windows Installer\n\n**MD5** 0eeb1c0133eb4d571178b2d9d14ce3e9\n\n**SHA1** bfecb8ce89a312d2ef4afc64a63847ae11c6f69e\n\n**SHA256** 59e1edf4d82fae4978e97512b0331b7eb21dd4b838b850ba46794d9c7a2c0983\n\nThe installer contains a malicious version of ffmpeg.dll, an open-source video player library:\n\n**Name(s)** ffmpeg.dll\n\n**Size** 2.7MB (2814976 Bytes)\n\n**File Type** Win32 DLL\n\n**MD5** 74bc2d0b6680faa1a5a76b27e5479cbc\n\n**SHA1** bf939c9c261d27ee7bb92325cc588624fca75429\n\n**SHA256** 7986bbaee8940da11ce089383521ab420c443ab7b15ed42aed91fd31ce833896\n\nThe library is loaded by 3CXDesktopApp.exe, and it is used to decode and inject a payload into memory:\n\n\n-----\n\n**Name(s)** N/A\n\n**Size** 288.0KB (294912 Bytes)\n\n**File Type** application/x-dosexec\n\n**MD5** 11bc82a9bd8297bd0823bce5d6202082\n\n**SHA1** 894e7d4ffd764bb458809c7f0643694b036ead30\n\n**SHA256** f79c3b0adb6ec7bcc8bc9ae955a1571aaed6755a28c8b17b1d7595ee86840952\n\nThe purpose of this malware, which Volexity will refer to as “ICONIC”, is as follows:\n\nDownload various files that contain additional code, with names such as icon[0-15].ico, hosted at\n_https://github[.]com/IconStorages/images/. (Note: the GitHub repository has since been taken down.)_\nParse these files to identify a “$” character followed by a base64-encoded string appended to the end of\nthe ICO files.\nDecrypt the base64 string using the AES-GCM encryption algorithm. All values required to decrypt AESGCM are derived from a complex function that third-party researchers have indicated is based on a publicly\navailable gist.\nOnce the string is decoded, it contains the URLs with which the DLL will then communicate to receive a\nnext-stage payload.\nThe next-stage payload is a JSON object that is then parsed and must further be decrypted (with the same\nAES-GCM decryption function). The next stage is expected to be a 64-bit PE that is reflectively loaded\nthrough a shellcode loader stored at the head of the file.\n\n[A script is provided with this post on GitHub that can be used to decrypt the base64 blobs appended to the ICO](https://github.com/volexity/threat-intel/blob/main/2023/2023-03-30%203CX/attachments/decrypt_ico.py)\nfiles. Volexity was able to clone the GitHub project, and through the commit history, was also able to retrieve files\nthat had previously been deleted. The table below provides details of each file and the decoded URL from each\none. Note that there are duplicate filenames due to deletions, and in some cases the files were identical.\n\n**Active Files**\n\n**Filename** **Hash (SHA1)** **Decoded URL**\n\nicon0.ico 9c943baad621654cc0a0495262b6175276a0a9fb https://www.3cx[.]com/blog/event-trainings/\n\nicon1.ico 96910a3dbc194a7bf9a452afe8a35eceb904b6e4 https://msstorageazure[.]com/window\n\nicon2.ico ffccc3a29d1582989430e9b6c6d2bff1e3a3bb14 https://officestoragebox[.]com/api/session\n\nicon3.ico 89827af650640c7042077be64dc643230d1f7482 https://visualstudiofactory[.]com/workload\n\nicon4.ico b5de30a83084d6f27d902b96dd12e15c77d1f90b https://azuredeploystore[.]com/cloud/services\n\nicon5.ico 3992dbe9e0b23e0d4ca487faffeb004bcfe9ecc8 https://msstorageboxes[.]com/office\n\nicon6.ico caa77bcd0a1a6629ba1f3ce8d1fc5451d83d0352 https://officeaddons[.]com/technologies\n\nicon7.ico 57a9f3d5d1592a0769886493f566930d8f32a0fc https://sourceslabs[.]com/downloads\n\nicon8.ico f533bea1c0558f73f6a3930343c16945fb75b20f https://zacharryblogs[.]com/feed\n\nicon9.ico 31d775ab577f3cc88991d90e9ae58501dbe1f0da https://pbxcloudeservices[.]com/phonesystem\n\nicon10.ico 0d890267ec8d6d2aaf43eaca727c1fbba6acd16e https://akamaitechcloudservices[.]com/v2/storage\n\n\n-----\n\nicon11.ico 0d890267ec8d6d2aaf43eaca727c1fbba6acd16e https://akamaitechcloudservices[.]com/v2/storage\n\nicon12.ico b1dee3ebcffad01a51ff31ff495fef1d40fdfaa0 https://azureonlinestorage[.]com/azure/storage\n\nicon13.ico 64ab912d0af35c01355430d85dd4181f25e88838 https://msedgepackageinfo[.]com/microsoft-edge\n\nicon14.ico 8377fb40c76aa3ba3efae3d284fa51aa7748e010 https://glcloudservice[.]com/v1/console\n\nicon15.ico 11ae67704ea0b930b2cc966e6d07f8b898f1a7d2 https://pbxsources[.]com/exchange\n\n**Deleted Files**\n\n**Filename** **Hash (SHA1)** **Decoded URL**\n\nicon1.ico ad37112b302c5193e60f6f6f49f4df668f5d3eb9 https://msedgeupdate[.]net/Windows\n\nicon2.ico ad37112b302c5193e60f6f6f49f4df668f5d3eb9 https://msedgeupdate[.]net/Windows\n\nicon10.ico 3a2138cd38ff2cef246f122a97d3c8f85ab6fc94 https://pbxphonenetwork[.]com/voip\n\nicon0.ico 3df119f322c5182bdbea4ab364eec8a0e23d888b https://msstorageazure[.]com/window\n\nicon1.ico 9c943baad621654cc0a0495262b6175276a0a9fb https://www.3cx[.]com/blog/event-trainings/\n\nicon0.ico 9c943baad621654cc0a0495262b6175276a0a9fb https://www.3cx[.]com/blog/event-trainings/\n\nA summary of the created, last modified, and domain registration times for each of these files is provided as an\nattachment to this post [here.](https://github.com/volexity/threat-intel/blob/main/2023/2023-03-30%203CX/attachments/github_summary.csv)\n\nVolexity believes the www.3cx[.]com entries were used for testing because, at the time of analysis, these URLs\nwould not return a payload that could be parsed by the malware. Volexity was not able to retrieve payloads from\nthe msedgeupdate[.]net or pbxphonenetwork[.]com domains, while the remainder of the URLs all provided the\nsame valid second-stage payload.\n\nThe first commit to the GitHub page containing an ICO file with an encrypted 3cx[.]com URL was added on\nDecember 7, 2022, which suggests that the attacker had potentially initiated their own testing of the backdoor at\nthis time.\n\n### Stage #2: ICONIC Stealer\n\nOnce a URL is decoded from an ICO file, a specially formatted request is made to download a second-stage\npayload. The format of the request is below:\n```\naccept: */*\naccept-language: en-US,en;q=0.9\naccept-encoding: gzip, deflate, br\ncontent-type: text/plain\ncookie: __tutma={MachineGuid}\n\n```\nThe MachineGuid is derived from the system’s registry via SOFTWARE\\Microsoft\\ Cryptography.\n\nVolexity’s analysis determined that the “cookie” header is the crucial component to retrieving the second-stage\npayload. If this value is not sent, no payload is returned to the user; the C2 responds with a 204 (No Content)\nstatus code instead. Volexity also determined that the second-stage payload servers are forwarding requests\nupstream to central infrastructure. This assertion is based on the fact that any given MachineGuid sent in the\ncookie header will only work once, even when used with different C2s.\n\n\n-----\n\nBelow is a snippet of what the returned JSON looks like:\n```\n{\"url\":\"\",\"description\":\"\",\"meta\":\"vyoAAL4D<snip>\"}\n\n```\nEach of the live servers returned identical responses, consisting of shellcode followed by a 64-bit DLL, which\nVolexity refers to as “ICONICSTEALER”. The DLL was compiled on March 16, 2023, and is designed to collect\ninformation about the system and browser using an embedded copy of the SQLite3 library. Details of the DLL\nare given below:\n\n**Name(s)** N/A\n\n**Size** 1.1MB (1182208 Bytes)\n\n**File Type** application/x-dosexec\n\n**MD5** 7faea2b01796b80d180399040bb69835\n\n**SHA1** 3b3e778b647371262120a523eb873c20bb82beaf\n\n**SHA256** 8ab3a5eaaf8c296080fadf56b265194681d7da5da7c02562953a4cb60e147423\n\nThe DLL retrieves the hostname, domain name, and OS version. Then, it will retrieve the browser history (title\nand URL) of the following browsers:\n\nBrave\nChrome\nEdge\nFirefox\n\nIt limits the output to the first 500 entries, and it passes this data back to the ICONIC malware that then POSTs\nthe data back to the C2. It is likely that the attacker then serves a further payload to victims of interest. Volexity\nhas not been able to retrieve a further payload at this time.\n\n## macOS ICONIC Analysis\n\nThe macOS installer for 3CX was also compromised. The following table shows the details of this installer:\n\n**Name(s)** 3CXDesktopApp-18.12.416.dmg|3CXDesktopApp-latest.dmg\n\n**Size** 164.2MB (172150545 Bytes)\n\n**File Type** Macintosh Disk Image\n\n**MD5** d5101c3b86d973a848ab7ed79cd11e5a\n\n**SHA1** 3dc840d32ce86cebf657b17cef62814646ba8e98\n\n**SHA256** e6bbc33815b9f20b0cf832d7401dd893fbc467c800728b5891336706da0dbcec\n\nThe backdoor component is libffmpeg.dylib located in /Contents/Frameworks/Electron\n_Framework.framework/Versions/A/Libraries. It is worth noting that this is the equivalent of the same library that_\nwas abused in the Windows binary.\n\n**Name(s)** libffmpeg.dylib\n\n**Size** 4.7MB (4979136 Bytes)\n\n\n-----\n\n**File Type** Mach-O\n\n**MD5** 660ea9b8205fbd2da59fefd26ae5115c\n\n**SHA1** 769383fc65d1386dd141c960c9970114547da0c2\n\n**SHA256** a64fa9f1c76457ecc58402142a8728ce34ccba378c17318b3340083eeb7acc67\n\nThe macOS version does not use GitHub to retrieve its C2 server. Instead, a list of C2 servers is stored in the file\nencoded with a single byte XOR key, 0x7A. Below is a list of the URLs it will attempt to contact. Note that the\ndomains largely overlap with the Windows sample, but the URIs are different.\n\nmsstorageazure[.]com/analysis\nofficestoragebox[.]com/api/biosync\nvisualstudiofactory[.]com/groupcore\nazuredeploystore[.]com/cloud/images\nmsstorageboxes[.]com/xbox\nofficeaddons[.]com/quality\nsourceslabs[.]com/status\nzacharryblogs[.]com/xmlquery\npbxcloudeservices[.]com/network\npbxphonenetwork[.]com/phone\nakamaitechcloudservices[.]com/v2/fileapi\nazureonlinestorage[.]com/google/storage\nmsedgepackageinfo[.]com/ms-webview\nglcloudservice[.]com/v1/status\npbxsources[.]com/queue\nwww.3cx[.]com/blog/event-trainings/\n\nIt is interesting to note that IDA Pro is confused by the main malicious function used in the macOS malware. The\ndecompiled pseudocode hides most of the features. This means analysts relying on this view may miss the\nmalicious functionality. Figure 1 shows the pseudocode of the function in IDA Pro. Figure 2 shows the same\nfunction with Ghidra, with more than 800 lines of pseudocode.\n\n\n-----\n\n_Figure 1. IDA Pro Pseudo Code_\n\n\n-----\n\n-----\n\n_Figure 2. Ghidra pseudo code (totaling more than 800 lines)_\n\nThe malware randomly picks one of the servers from the list to retrieve the next stage. As with the Windows\nversion of the malware, a specially formatted cookie must be included in the web request to retrieve a further\npayload:\n```\n3cx_auth_id=%s;3cx_auth_token_content=%s;__tutma=true\n\n```\nThe user-agent is also hardcoded and may be used by the attacker to filter valid requests:\n```\nMozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/108.0.5359.128\nSafari/537.36\n\n```\nVolexity was not able to retrieve the next stage from the C2 servers, as the upstream C2 infrastructure had\nstopped responding by the time it made requests.\n\n## Infrastructure & Attribution\n\nIn terms of attacker infrastructure, the domains used in these attacks are hosted on shared infrastructure and\nappear to simply proxy requests to an unknown upstream C2. Domains were registered with several providers,\nincluding NameCheap, Public Domain Registry, and NameSilo. Some of the domains were not registered using\nWHOIS protection, and each was registered using a unique email address. The following emails were observed\nin WHOIS records for related domains:\n\n[[email protected][.]me](https://www.volexity.com/cdn-cgi/l/email-protection)\n\n[[email protected][.]com](https://www.volexity.com/cdn-cgi/l/email-protection)\njackiewcaudill@gmail[.]com\n\n[[email protected][.]me](https://www.volexity.com/cdn-cgi/l/email-protection)\nharoldjmarable@gmail[.]com\n\nIn terms of attribution, [the original CrowdStrike post suggests the incident is related to LABYRINTH CHOLLIMA,](https://www.crowdstrike.com/blog/crowdstrike-detects-and-prevents-active-intrusion-campaign-targeting-3cxdesktopapp-customers/)\nwhich is related to the public Lazarus moniker (although Volexity does not have visibility of exactly which parts of\nLazarus this maps to). Volexity cannot currently map the disclosed activity to any threat actor, so it will be\ntracked under UTA0040.\n\n## Conclusion & Mitigations\n\nVolexity’s analysis concludes that both the Windows and macOS installers for the 3CX desktop application had\nmalicious code inserted into them before being provided to customers. This suggests that 3CX was itself\ncompromised by the threat actor for a period of time prior to the infection, allowing the attacker to develop an\nunderstanding, access, and malicious code for the development-update process of the company.\n\nThe end result for victims of this campaign was that information-stealing malware was installed on endpoints that\ninstalled this update, and for selected victims, an additional arbitrary payload may also have been delivered.\n\nSupply chain attacks are relatively rare due to the high level of technical and operational capability required for\nsuccess. However, organizations with a large customer base, such as 3CX, are attractive targets due to the\nbroad level of access these attacks can grant threat actors.\n\n\n-----\n\nVolexity assesses that it is likely UTA0040 is a nation state backed threat actor based on the level of capabilities\nutilized in this campaign, combined with a perceived intent to gather information from victims for further targeted\n[compromise. Crimeware-based threat groups who have historically conducted supply chain attacks typically](https://securityintelligence.com/posts/revil-ransomware-kaseya-supply-chain-attack/)\npush ransomware payloads immediately with their access, rather than try to conduct reconnaissance to filter\nvictims of their true payload. While Volexity cannot attribute this cluster to any known group at this time,\nCrowdStrike has attributed this activity to LABYRINTH CHOLLIMA, a North Korean group.\n\nSupply chain attacks are complex issues for defenders to defend against. This instance highlights how large\ncode bases can be backdoored with minor additions to existing code and remain undetected by the software\nprovider and the end user. However, information in the public domain highlights the value of endpoint and\nnetwork detection capabilities, which provided valuable identification of anomalous behavior that may have\nprevented further impact for end users.\n\nThe infrastructure registration and public artifacts (notably the GitHub page) suggests that the attacker had\naccess to the software provider at least as early December 2022, and perhaps as early as November 2022. It is\nnot clear when the first malicious update described in this post was downloaded by victims of this campaign, but\nthe public discussions around detections suggest this could be as early as March 22, 2023. This does not rule\nout other potentially malicious activities having occurred before this time related to this software.\n\nTo detect and investigate these attacks such as these, Volexity recommends the following:\n\n[Use the YARA rules provided here to detect related activity.](https://github.com/volexity/threat-intel/blob/main/2023/2023-03-30%203CX/indicators/rules.yar)\n[Use the provided Suricata rules here to detect related activity. It should be noted that these requests take](https://github.com/volexity/threat-intel/blob/main/2023/2023-03-30%203CX/indicators/suri.rules)\nplace over HTTPs, meaning they are only effective if this traffic is being decrypted prior to matching.\n[Block the IOCs provided here.](https://github.com/volexity/threat-intel/blob/main/2023/2023-03-30%203CX/indicators/iocs.csv)\n\n## Appendix A – Third-Party Reporting\n\nThere is a great deal of third-party reporting on this subject covering various aspects of the campaign. A list of\nresources is provided below, note that this list was compiled on March 30, 2023, and inevitably more resources\nwill become available after publication.\n\n**Social Media Posts**\n\n**CrowdStrike**\n\n**Sophos**\n\n[https://news.sophos.com/en-us/2023/03/29/3cx-dll-sideloading-attack/](https://news.sophos.com/en-us/2023/03/29/3cx-dll-sideloading-attack/)\n\n**SentinelOne**\n\nhttps://www.sentinelone.com/blog/smoothoperator-ongoing-campaign-trojanizes-3cx-software-in-softwaresupply-chain-attack/\n\n**Symantec**\n\n[https://twitter.com/threatintel/status/1641339467398017024](https://twitter.com/threatintel/status/1641339467398017024)\n\n**3CX**\n\n[https://www.3cx.com/blog/news/desktopapp-security-alert/](https://www.3cx.com/blog/news/desktopapp-security-alert/)\n\n**Objective-See**\n\n\n-----\n\n[https://objective see.org/blog/blog_0x73.html](https://objective-see.org/blog/blog_0x73.html)\n\n**Bleeping Computer**\n\nhttps://www.bleepingcomputer.com/news/security/hackers-compromise-3cx-desktop-app-in-a-supply-chainattack/\n\n**Huntress**\n\n[https://www.huntress.com/blog/3cx-voip-software-compromise-supply-chain-threats](https://www.huntress.com/blog/3cx-voip-software-compromise-supply-chain-threats)\n\n_* Beginning in December 2022, Volexity began to use the following schema to refer to smaller unclassified_\n_clusters of threat activity not significant enough to warrant their own name: UTAXXXX. In this schema, “UTA”_\n_refers to “Unclassified Threat Actor”, and the numbers that follow are a unique identifier for that group of activity._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-30 - 3CX Supply Chain Compromise Leads to ICONIC Incident.pdf"
    ],
    "report_names": [
        "2023-03-30 - 3CX Supply Chain Compromise Leads to ICONIC Incident.pdf"
    ],
    "threat_actors": [
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1680660569,
    "ts_updated_at": 1743041842,
    "ts_creation_date": 1680512374,
    "ts_modification_date": 1680512374,
    "files": {
        "pdf": "https://archive.orkl.eu/bfbe27da1cd540c9724bbec7b18ce717dcb4521e.pdf",
        "text": "https://archive.orkl.eu/bfbe27da1cd540c9724bbec7b18ce717dcb4521e.txt",
        "img": "https://archive.orkl.eu/bfbe27da1cd540c9724bbec7b18ce717dcb4521e.jpg"
    }
}