{
    "id": "fab84462-553c-403f-a613-6d8bce2f5e77",
    "created_at": "2023-01-12T15:08:06.966215Z",
    "updated_at": "2025-03-27T02:05:49.138882Z",
    "deleted_at": null,
    "sha1_hash": "1b6b406b4c4b9aa860f5ca8bc4002f20902d78ea",
    "title": "2021-05-18 - DarkSide Ransomware has Netted Over $90 million in Bitcoin",
    "authors": "",
    "file_creation_date": "2022-05-28T18:24:02Z",
    "file_modification_date": "2022-05-28T18:24:02Z",
    "file_size": 1494151,
    "plain_text": "# DarkSide Ransomware has Netted Over $90 million in Bitcoin\n\n**[elliptic.co/blog/darkside-ransomware-has-netted-over-90-million-in-bitcoin](https://www.elliptic.co/blog/darkside-ransomware-has-netted-over-90-million-in-bitcoin)**\n\n\n-----\n\n**Dr. Tom Robinson**\n\nElliptic's Co-founder and Chief Scientist discusses cryptocurrency forensics, investigations, compliance,\nand sanctions.\n\n[Elliptic was first to identify the Bitcoin wallet used by the DarkSide ransomware group to](https://www.elliptic.co/blog/elliptic-follows-bitcoin-ransoms-paid-by-darkside-ransomware-victims)\nreceive a 75 Bitcoin ransom payment from Colonial Pipeline.\n\nColonial was the victim of a ransomware attack on May 7, 2021, which led to a voluntary\nshutdown of the main pipeline supplying 45% of fuel to the East Coast of the United States.\nThe attack was described as the worst cyberattack to date on U.S. critical infrastructure.\n\nIn this new report we expand our original analysis to examine all of the wallets used by\nDarkSide to receive Bitcoin ransoms from victims over the past nine months.\n\nThis relies on Elliptic’s sophisticated blockchain analysis platform, combined with open\nsource intelligence gathered by our team of analysts. To our knowledge, this analysis\nincludes all payments made to DarkSide, however further transactions may yet be\nuncovered, and the figures here should be considered a lower bound.\n\n**Over $90 million extracted from 47 victims**\n\nIn total, just over $90 million in Bitcoin ransom payments were made to DarkSide, originating\n[from 47 distinct wallets. According to DarkTracer, 99 organisations have been infected with](https://twitter.com/darktracer_int/status/1394189875096657921)\nthe DarkSide malware - suggesting that approximately 47% of victims paid a ransom, and\nthat the average payment was $1.9 million.\n\nThe chart below shows the total value and number of ransom payments made to DarkSide\n[over the past nine months. May was set to be a record month, until DarkSide reportedly shut](https://www.bleepingcomputer.com/news/security/darkside-ransomware-servers-reportedly-seized-operation-shuts-down/)\ndown its operations on May 13, and its Bitcoin wallet was emptied.\n\n\n-----\n\n**Sharing the spoils**\n\nDarkSide is an example of “Ransomware as a Service” (RaaS). In this operating model, the\nmalware is created by the ransomware developer, while the ransomware affiliate is\nresponsible for infecting the target computer system and negotiating the ransom payment\nwith the victim organisation. This new business model has revolutionised ransomware,\nopening it up to those who do not have the technical capability to create malware, but are\nwilling and able to infiltrate a target organisation.\n\nAny ransom payment made by a victim is then split between the affiliate and the developer.\n[In the case of DarkSide, the developer reportedly takes 25% for ransoms less than](https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html)\n$500,000, but this decreases to 10% for ransoms greater than $5 million. This split of the\nransom payment is very clear to see on the blockchain, with the different shares going to\nseparate Bitcoin wallets controlled by the affiliate and developer. In total, the DarkSide\ndeveloper has received bitcoins worth $15.5 million (17%), with the remaining $74.7 million\n(83%) going to the various affiliates.\n\n\n-----\n\nIn fact the affiliate’s share of both the Colonial Pipeline and Brenntag ransom payments were\nsent to the same Bitcoin wallet, suggesting that the same party was responsible for infecting\nboth of these businesses.\n\n**Following the money**\n\nUsing Elliptic’s blockchain analytics we can follow the ransom payments and see where the\nbitcoins are being spent or exchanged. What we find is that the majority of the funds are\nbeing sent to cryptoasset exchanges, where they can be swapped for other cryptoassets, or\nfiat currency.\n\nThe majority of cryptoasset exchanges comply with anti money laundering regulations. They\nverify their customers’ identity and report suspicious activity. They also use blockchain\nanalytics tools such as those offered by Elliptic, to check customer deposits for links to illicit\nactivity such as ransomware.\n\nHowever some jurisdictions do not enforce these regulations, and it is to exchanges in these\nlocations that much of the DarkSide ransomware proceeds are being sent. Regulated\ncryptoasset businesses should perform careful due diligence on the virtual asset service\nproviders (VASPs) that they transact with. [Elliptic Discovery provides risk profiles of all major](https://www.elliptic.co/solutions/vasp-tracking)\nglobal VASPs - enabling you to to take a risk-based approach to your crypto counterparties.\n\nLearn more about how Elliptic helps crypto businesses and financial institutions manage their\ncryptoasset risk.\n\n## Disclaimer\n\nThis blog is provided for general informational purposes only. By using the blog, you agree\nthat the information on this blog does not constitute legal, financial or any other form of\nprofessional advice. No relationship is created with you, nor any duty of care assumed to\n\n\n-----\n\nyou, when you use this blog. The blog is not a substitute for obtaining any legal, financial or\nany other form of professional advice from a suitably qualified and licensed advisor. The\ninformation on this blog may be changed without notice and is not guaranteed to be\ncomplete, accurate, correct or up-to-date.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-18 - DarkSide Ransomware has Netted Over $90 million in Bitcoin.pdf"
    ],
    "report_names": [
        "2021-05-18 - DarkSide Ransomware has Netted Over $90 million in Bitcoin.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536086,
    "ts_updated_at": 1743041149,
    "ts_creation_date": 1653762242,
    "ts_modification_date": 1653762242,
    "files": {
        "pdf": "https://archive.orkl.eu/1b6b406b4c4b9aa860f5ca8bc4002f20902d78ea.pdf",
        "text": "https://archive.orkl.eu/1b6b406b4c4b9aa860f5ca8bc4002f20902d78ea.txt",
        "img": "https://archive.orkl.eu/1b6b406b4c4b9aa860f5ca8bc4002f20902d78ea.jpg"
    }
}