{
    "id": "face15f1-61fa-4b31-b962-67d0ae9e2de8",
    "created_at": "2023-01-12T15:10:38.714924Z",
    "updated_at": "2025-03-27T02:12:41.349905Z",
    "deleted_at": null,
    "sha1_hash": "e2514c7b0cd05a881ddd6209fed0815cd7ff0576",
    "title": "2021-03-10 - Tactics, Techniques, and Procedures (TTPs) Used by HAFNIUM to Target Microsoft Exchange Servers",
    "authors": "",
    "file_creation_date": "2022-05-29T10:38:50Z",
    "file_modification_date": "2022-05-29T10:38:50Z",
    "file_size": 404363,
    "plain_text": "# Tactics, Techniques, and Procedures (TTPs) Used by HAFNIUM to Target Microsoft Exchange Servers\n\n**[picussecurity.com/resource/blog/ttps-hafnium-microsoft-exchange-servers](https://www.picussecurity.com/resource/blog/ttps-hafnium-microsoft-exchange-servers)**\n\n### Keep up to date with latest blog posts\n\nExecutive Summary\n\nMicrosoft released four out-of-band security updates on March 2, 2021 [1]. The usual reason for\nreleasing an out-of-band update is the appearance of active and widespread exploitation of a 0-day\nvulnerability. In this case, these updates address 0-day vulnerabilities affecting Microsoft Exchange\nServer products that allow threat actors to read sensitive information in emails, take control of the\ntarget server, collect and exfiltrate data from the compromised server, and move laterally to other\nsystems in the network.\n\nThe threat group that exploits Microsoft Exchange Server vulnerabilities is dubbed HAFNIUM by\nMicrosoft [2] and the attack campaign is named Operation Exchange Marauder by Volexity [3].\nAlthough the HAFNIUM threat group primarily targets defense, higher education, and health sectors\nin the United States, these zero-days affect unpatched Microsoft Exchange Servers worldwide. For\nexample, The European Banking Authority (EBA) has announced that it has been the subject of a\ncyber-attack against its Microsoft Exchange Servers [4]. As another example, an incident due to\nthese vulnerabilities is reported in Denmark [5].\n\n\n-----\n\nIn this article, we analyzed Tactics, Techniques, and Procedures (TTPs) utilized by the HAFNIUM\nthreat actor to understand their attack methods and the impact of this breach. We also give\nmitigation and detection suggestions and relevant IOCs for this cyber attack campaign.\n\nKey Findings\n\nTimeline: The attack campaign was detected first in January 2021 [3]. Microsoft released\nupdates on March 2, 2021, and Volexity and Microsoft published blog posts on the same day.\nThe European Banking Authority (EBA) announced the breach on March 7, 2021.\nPrevalence: The attack campaign has the potential to affect thousands of public and private\norganizations.\nAttack Lifecycle: Attack starts with reconnaissance of vulnerable Exchange servers and\nresumes with exploiting a vulnerability (CVE-2021-26855) to exploit other vulnerabilities (CVE2021-26857, CVE-2021-26858, CVE-2021-27065). Then, the adversary uploads web shells\nusing these vulnerabilities and executes malicious commands with uploaded web shells. In\nthe post-exploitation phase, the adversary collects and exfiltrates data, dumps credentials,\nand moves laterally.\nImpact: Threat actors read sensitive information in mailboxes of users, compromise the victim\nserver, dump local credentials, add user accounts, dump Active Directory database\n(NTDS.DIT), and move laterally to other systems in the network.\nExploitability: Exploits are available, and all of the vulnerabilities are being exploited by\nadversaries. Exploits can be run remotely and do not require authentication.\nPriority: Security teams must treat them with the highest priority.\nAffected Versions: Microsoft Exchange 2019, 2016, 2013, 2010\nMitigation: Microsoft Exchange Servers must be patched as soon as possible.\nInterim Mitigations: If you are unable to patch Exchange servers, implement IIS rewrite rules\nprovided by Microsoft and disable UM, ECP, VDir, and OAB VDir Services [6].\nDetection: Scan Exchange server logs and paths for released IOCs. You can use\n[Sigma/QRadar/Splunk/Arcsight detection rules released by Picus.](https://github.com/picussecurity/picuslabs/tree/master/Microsoft%20Exchange%20Vulnerabilities)\n\n## Vulnerabilities and Affected Exchange Servers\n\n The Exploited Zero-Day Vulnerabilities and Their Impacts\n\nCurrently, the following vulnerabilities are exploited by adversaries:\n\nCVE Impact Vulnerability Type CVSS 3.0\nBase Score\n\n\nCVE-202126855 [7]\n\nCVE-202126857 [8]\n\n\nGain access to mailboxes, read the full\ncontents.\n\nArbitrary code execution as SYSTEM\nuser, compromise the system\n\n\nSSRF (Server-Side\nRequest Forgery)\n\nInsecure\nDeserialization\n\n\n9.1 Critical\n\n7.8 High\n\n\n-----\n\nCVE-202126858 [9]\n\nCVE-202127065 [10]\n\n\nArbitrary code execution, compromise\nthe system\n\nArbitrary code execution, compromise\nthe system\n\n\nPost-Authentication\nArbitrary File Write\n\nPost-Authentication\nArbitrary File Write\n\n\n7.8 High\n\n7.8 High\n\n\nAlthough CVSS 3.0 score of the CVE-2021-26857, CVE-2021-26858, and CVE-2021-27065\nvulnerabilities is “7.8 High”, not “Critical”, when chained with the vulnerability CVE-2021-26855,\nthese vulnerabilities enable the attacker to compromise the target Exchange server.\n\n## Affected Microsoft Exchange Server Versions\n\n**Version** **Status** **Mitigation**\n\nExchange 2019 Affected (all CVEs) Immediately deploy the updates.\n\nExchange 2016 Affected (all CVEs) Immediately deploy the updates.\n\nExchange 2013 Affected (all CVEs) Immediately deploy the updates.\n\nExchange 2010 Affected (CVE-2021-26857) Immediately deploy the updates.\n\n\nExchange 2007 Unknown, stated as ”not believed to\nbe affected” by Microsoft [[1].](https://paperpile.com/c/ewnCG5/yFDb)\n\nExchange 2003 Unknown, stated as ”not believed to\nbe affected” by Microsoft [[1].](https://paperpile.com/c/ewnCG5/yFDb)\n\n\nUnsupported version by Microsoft.\nUpgrade to a supported version.\n\nUnsupported version by Microsoft.\nUpgrade to a supported version.\n\n\nExchange\nOnline / Office\n365\n\n\nNot Affected\n\n\n## Tactics, Techniques, and Procedures (TTPs) utilized by HAFNIUM\n\nHAFNIUM uses 11 of 14 tactics in the MITRE ATT&CK framework. You can create an adversary\nemulation plan using techniques and sub-techniques given below to validate your security controls\nagainst the HAFNIUM threat group. Picus Threat database includes an APT adversary emulation\nscenario for HAFNIUM along with 700+ other attack scenarios and 10000+ network and endpoint\nattack emulations. Some actions of the HAFNIUM adversary emulation scenario in Picus is shown\nbelow.\n\n\n-----\n\n## 1. Reconnaissance\n\nThe Reconnaissance tactic of the MITRE ATT&CK framework includes techniques involving\nadversaries to collect information actively and passively before compromising a victim [11].\nAttackers use this information to use in other phases of the attack lifecycle, such as Initial Access\nas used by HAFNIUM.\n\n1.1 MITRE ATT&CK T1592.002 Gather Victim Host Information: Software\n\nThe HAFNIUM threat actor determines whether an Exchange server is running on the machine, and\nif so, which version is running [1]. Adversaries collect information about installed software on a\nvictim machine, which may be used for targeting [12].\n\n## 2. Resource Development\n\nThe Resource Development tactic includes techniques involving adversaries to create, purchase, or\ncompromise resources such as infrastructure, accounts, or capabilities [13]. They develop these\nresources before compromising the victim and leverage them to utilize in other phases, such as\nusing leased Virtual Private Servers to support Command and Control.\n\n2.1 MITRE ATT&CK T1583.003 Acquire Infrastructure: Virtual Private Server\n\nHAFNIUM uses leased Virtual Private Servers (VPSs) in the United States to operate its threat\ncampaign [1]. Adversaries rent VPSs to make it difficult to bind operations back to them physically\n\n[14]. They are also enabled to swiftly provision, modify, and shut down their infrastructure through\nVPSs.\n\n\n-----\n\n2.2 MITRE ATT&CK T1588.002 Obtain Capabilities: Tool\n\nAdversaries obtain tools in cyberattacks to support their operations [15]. These tools can be free or\ncommercial, open or closed source. The HAFNIUM threat group uses the following tools to help its\npost-compromise behaviors.\n\nTool Description\n\nProcdump `Procdump is a command-line utility that is a part of the Microsoft`\nSysinternals suite. Although its primary purpose is monitoring an\napplication for CPU spikes and generating crash dumps to determine the\n[cause of the spike, it can be used to dump the memory of a process [16].](https://www.picussecurity.com/resource/blog/picus-10-critical-mitre-attck-techniques-t1003-credential-dumping?hsLang=en-gb)\n\nNishang `Nishang is a collection of scripts and payloads which using PowerShell`\nfor penetration testing and red teaming. It can be categorized as a\n[PowerShell post-exploitation framework [17]. Copy-VSS PowerShell script](https://www.picussecurity.com/resource/blog/picus-10-critical-mitre-attck-techniques-t1086-powershell?hsLang=en-gb)\n[of Nishang can be used to copy the SAM file and dump credentials [16].](https://www.picussecurity.com/resource/blog/picus-10-critical-mitre-attck-techniques-t1003-credential-dumping?hsLang=en-gb)\nAdvanced Persistent Threat (APT) groups are heavily using Nishang in\ntheir operations [17].\n\nPowerCat `PowerCat is an open-source PowerShell script that can read and write`\ndata across network connections like the famous Netcat tool [18].\n\nPsExec `PsExec is a legitimate Microsoft tool and a part of Windows Sysinternals`\nutilities [19]. PsExec can execute commands and binaries on remote\nsystems and download or upload a file over a network share. Attackers\n[like Nefilim and](https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks?hsLang=en-gb) [LockerGoga ransomware gangs utilize PsExec for lateral](https://www.picussecurity.com/resource/blog/locker-goga?hsLang=en-gb)\nmovement [20] [21].\n\nCovenant `Covenant is an open-source Command and Control (C2) framework`\nwritten in .NET [22].\n\nSIMPLESEESHARP `SIMPLESEESHARP is a simple ASPX web shell used by the HAFNIUM to`\nwrite additional files to disk, such as the SPORTSBALL web shell [3].\n\nSPORTSBALL `SPORTSBALL is a more extensive web shell used by HAFNIUM to upload`\nfiles or execute commands on the system [3].\n\nChina Chopper `China Chopper is a web shell that provides access back into the victim`\nsystem and is used by several threat groups [23].\n\nASPXSPY `ASPXSpy is a publicly available web shell used by several threat groups,`\nsuch as Threat Group 3390 [24].\n\n7-Zip HAFNIUM uses 7-Zip to compress data to be exfiltrated.\n\n\n-----\n\nWinrar HAFNIUM uses WinRar to compress data prior to exfiltration.\n\nExchange Snap-ins HAFNIUM uses Exchange PowerShell snap-ins to export data in\nmailboxes [2].\n\n## 3. Initial Access\n\nThe Initial Access tactic includes techniques used by attackers to gain an initial foothold within a\nnetwork, such as exploiting vulnerabilities on public-facing web servers [25].\n\n3.1 MITRE ATT&CK T1190 Exploit Public-Facing Application\n\nAdversaries exploit vulnerabilities in Internet-facing software, such as web servers, to gain access\nto the host [26]. HAFNIUM exploits CVE-2021-26855, CVE-2021-26857, CVE-2021-26858, and\nCVE-2021-27065 vulnerabilities in the Internet-facing and vulnerable Microsoft Exchange servers\nfor initial access [2] [3].\n\n## 4. Execution\n\n4.1 T1059.003 Command and Scripting Interpreter: Windows Command Shell\n\nWeb shells used by the HAFNIUM threat group, such as China Chopper [27], allow adversaries to\nexecute commands on the victim server using Windows Command Shell (cmd.exe), the primary\ncommand prompt on Windows systems.\n\n[Enroll in the free “MITRE ATT&CK Windows Command Shell” course in Purple Academy to](https://academy.picussecurity.com/course/windows-command-shell-course)\nlearn how adversaries operate Windows Command Shell in their attacks and red and blue\nteam exercises.\nRead [our blog post about the Windows Command Shell (Command Line Interface) technique.](https://www.picussecurity.com/resource/blog/picus-10-critical-mitre-attck-techniques-t1059-command-line-interface?hsLang=en-gb)\n\n## 5. Persistence\n\nThe Persistence tactic consists of techniques used by adversaries to maintain their foothold across\nsystem restarts, changed credentials, or patched vulnerabilities [28].\n\n5.1 MITRE ATT&CK T1505.003 Server Software Component: Web Shell\n\nAdversaries use web shells, web scripts placed on web servers, as backdoors to establish\npersistency on the target server [29]. HAFNIUM utilize the following web shells as mentioned in the\n“T1588.002 Obtain Capabilities: Tool” technique:\n\nSIMPLESEESHARP\nSPORTSBALL\nChina Chopper\nASPXSPY\n\n\n-----\n\n5.2 MITRE ATT&CK T1136.002 Create Account: Domain Account\n\nAdversaries, such as HAFNIUM, add new domain accounts and grant privileges to these accounts\nto maintain access in the future [3].\n\n## 6. Defense Evasion\n\nDefense evasion consists of techniques that are used by adversaries to avoid detection by security\ncontrols.\n\n6.1 T1036.005 Masquerading: Match Legitimate Name or Location\n\nAdversaries may masquerade names/locations of their artifacts as identical or similar\nnames/locations of legitimate files to evade monitoring and detection [30]. HAFNIUM masquerade\nnames of deployed web shells as identical or similar names of legitimate files, such as log.aspx,\nlogout.aspx, default.aspx, errorPage.aspx, and server.aspx. You can find the list of used web shell\nfilenames in the Indicators of Compromise (IoC) list at the end of this article.\n\n[Enroll in the free and practical “MITRE ATT&CK Masquerading” course in Purple Academy to](https://academy.picussecurity.com/course/masquerading)\nlearn all sub-techniques of this technique with red and blue team exercises:\nRead [our blog post about the Masquerading technique.](https://www.picussecurity.com/resource/blog/picus-10-critical-mitre-attck-techniques-t1036-masquerading?hsLang=en-gb)\n\n## 7. Credential Access\n\nThe Credential Access tactic includes techniques used by adversaries to steal account usernames\nand passwords.\n\n7.1 MITRE ATT&CK T1003.001 - OS Credential Dumping: LSASS Memory\n\nThere are many information sources targeted by attackers to dump credentials. As one of them,\nThe Local Security Authority Subsystem Service (LSASS) stores credentials of the logged-in users\nin memory to provide seamless access to network resources without re-entering their credentials\n\n[16]. Adversaries interact with the lsass.exe process and dump its memory to obtain credentials.\nSeveral methods and tools can be utilized to dump credentials in memory. The HAFNIUM threat\nactor uses Procdump to dump the LSASS process memory and gather credentials. An example\nProcDump command to dump credentials in this given below:\n\nC:\\temp>procdump.exe -accepteula -ma lsass.exe lsass.dmp\n\n7.2 T1003.003 OS Credential Dumping: NTDS\n\nHAFNIUM creates and steals copies of the NTDS.dit file using deployed web shells [3]. The\nNTDS.dit file is the Active Directory Domain Services (AD DS) database that contains AD data,\nincluding information about user objects, groups, and group membership. NTDS.dit database also\nincludes the password hashes for all users in the domain.\n\n\n-----\n\n[Enroll in the free MITRE ATT&CK OS Credential Dumping course in Purple Academy to](https://academy.picussecurity.com/course/credential-dumping)\nlearn 11 ways for credential dumping with practical red team exercises:\nRead [our blog post about the OS Credential Dumping technique.](https://www.picussecurity.com/resource/blog/picus-10-critical-mitre-attck-techniques-t1003-credential-dumping?hsLang=en-gb)\n\n## 8. Lateral Movement\n\nThe Lateral Movement tactic includes techniques that are used by adversaries to access and\ncontrol remote systems (lateral movement) on the target network [31].\n\n8.1 MITRE ATT&CK T1021.002 - Remote Services: SMB/Windows Admin Shares\n\nHafnium uses PsExec to move laterally through the target environment [3]. PsExec is a legitimate\nWindows SysInternals tool used by attackers to run commands on the remote system by leveraging\nnetwork shares or valid accounts [32].\n\n## 9. Collection\n\nThe Collection tactic consists of techniques used by adversaries to gather the information that is\nrelevant to their objectives.\n\n9.1 MITRE ATT&CK T1560.001 - Archive Collected Data: Archive via Utility\n\nAdversaries may use several utilities such as 7-Zip, WinRAR, and WinZip to compress or encrypt\ndata before exfiltration [33]. Among these utilities, HAFNIUM uses WinRar and 7-Zip to compress\ndata to be exfiltrated.\n\n9.2. MITRE ATT&CK T1114.002 - Email Collection: Remote Email Collection\n\nAdversaries may access external-facing Exchange services to access emails and collect sensitive\ninformation by leveraging valid accounts, access tokens, or remote exploits [34]. HAFNIUM adds\nand uses Exchange PowerShell snap-ins to export data in mailboxes [2].\n\n## 10. Command and Control\n\nThe Command and Control (C2) tactic consists of techniques used by adversaries to communicate\nwith compromised systems within a victim network [35].\n\n10.1 MITRE ATT&CK T1071.001 - Application Layer Protocol: Web Protocols\n\nThe HAFNIUM threat group communicates with deployed web shells using application-layer web\nprotocols (HTTP/HTTPS). Adversaries use these protocols for C2 to avoid detection and network\nfiltering [36].\n\n## 11. Exfiltration\n\n11.1 MITRE ATT&CK T1567.002 - Exfiltration Over Web Service: Exfiltration to Cloud Storage\n\n\n-----\n\nAdversaries may exfiltrate data to cloud storage that allows upload, modify and retrieve files.\nHAFNIUM exfiltrates collected data to cloud file sharing like MEGA.io [2].\n\nCountermeasures by Picus\n\nBuilt on technology alliances, Picus Mitigation Library delivers immediate value by providing\nmitigation insights in Network Security, Endpoint Detection and Response, and Security Information\nand Event Management categories. The Picus Threat Library includes most of the stolen tools in\nthis breach, and the Picus Mitigation Library contains actionable mitigation recommendations and\ndetection rules against them. Picus Labs’ Red Team and Blue Teams are working on the missing\ntools and adding them and their techniques to our libraries.\n\nSo this means, Picus users have already assessed their cyber defense against most of the stolen\nred team tools and their attack techniques. And, they fixed the identified gaps using actionable\nrecommendations provided by the Picus platform. We decided to share these actionable\nrecommendations with the community in this article to help defend against these tools.\n\n## Countermeasures with Open-source Sigma and Snort Rules\n\nPicus Labs Blue Team develops, tests, and verifies detection rules as SIGMA, a generic and open\nsignature format for SIEM products, based on threats developed by Picus Labs Red Team. Also,\nBlue Team simulates these threats against Snort IPS, an open-source Intrusion Prevention System,\nand then analyzes the results and maps with the right signatures.\n\nIn this section, you can find the SIGMA rules and Snort signatures to defend against TTPs used\nby HAFNIUM to target Microsoft Exchange Servers. The SIGMA rule names and Snort signature\ncategories are below as a list, but detailed information about these contents are published in Picus\nLabs’ Github repository:\n\n\n-----\n\nSIGMA Rules:\n\nProcess Dumping via Procdump\nRemote Command Execution via Powercat\nSuspicious ASPX File Creation\nSuspicious PowerShell Invoke Expression Usage\nTCP Connection Creating via PowerShell Script\nData Collection with 7z.exe via Commandline\n\nSnort Rules:\n\n**Signature Id** **SignatureName**\n\n1.2017260.10 ET WEB_SERVER WebShell Generic - ASP File Uploaded\n\n1.57241.4 SERVER-WEBAPP Microsoft Exchange Server server side request forgery\nattempt\n\n1.57242.4 SERVER-WEBAPP Microsoft Exchange Server server side request forgery\nattempt\n\n1.57244.4 SERVER-WEBAPP Microsoft Exchange Server server side request forgery\nattempt\n\n1.2017260.10 ET WEB_SERVER WebShell Generic - ASP File Uploaded\n\n1.2017260.10 ET WEB_SERVER WebShell Generic - ASP File Uploaded\n\n## Countermeasures with QRadar, Splunk, Carbon Black, and ArcSight\n\n\n-----\n\nPicus is working with SIEM and EDR vendors in a Technical Alliance Partnership program. Picus\nLabs Blue Team develops SIEM (IBM QRadar, Splunk, Micro Focus ArcSight) and EDR (VMware\nCarbon Black) specific detection rules based on the SIGMA rules defined in the chapter above.\nFollowing the development, they test and analyze the results on each vendor environment and\nfinalize the rules with the specific product’s query language.\n\nIn this section, you can find the IBM QRadar, Splunk, Micro Focus ArcSight, and VMware Carbon\nBlack rules to defend against the HAFNIUM threat group. You can find these rules in Picus Labs’\nGithub repository.\n\n## Vendor-Specific Prevention Signatures\n\nPicus is also working with network security vendors through its Technical Alliance Partnership (TAP)\nprogram. Picus Labs Blue Team simulates the threats developed by Picus Labs Red Team against\nTAP vendor environments and then analyzes the results and maps with the right signatures to\neliminate F/P issues.\n\nIn this section, you can find the vendor-specific network prevention signatures to defend against\nexploits and tools used by HAFNIUM to target Microsoft Exchange Servers. The vendor and\nproduct names are given in the below list, but detailed information about these signatures is\n[published in Picus Labs’ Github repository.](https://github.com/picussecurity/picuslabs/tree/master/Microsoft%20Exchange%20Vulnerabilities)\n\nCheck Point NGFW\nCisco Firepower\nF5 BigIP ASM\nForcepoint NGFW\nFortinet AV, IPS, WAF, WEB\nMcAfee NSP\nPalo Alto Networks NGFW\nSnort IPS\n\nIndicators of Compromise\n\nTargeted File Paths\n\nDuring authentication bypass, the threat actors send HTTP POST requests to image (.gif),\nJavaScript (.js), cascading style sheet (.css), and font (ttf, eot) files used by Outlook Web Access\n(OWA). The following table shows the list of known file paths targeted by the POST requests:\n\nFolder Files\n\n/owa/auth/Current/themes/resources/ lgnbotl.gif, lgnbotl.gif, logon.css, owafont_ja.css,\nowafont_ko.css, SegoeUI-SemiBold.eot, SegoeUISemiLight.ttf\n\n/ecp/ Default.flt, main.css, <single char>.js\n\n\n-----\n\n## User-agents\n\nAdversaries used the following “non-standard” user-agents in POST requests:\n\n**User-Agent**\n\nantSword/v2.1\n\nDuckDuckBot/1.0;+(+http://duckduckgo.com/duckduckbot.html)\n\nExchangeServicesClient/0.0.0.0\n\nfacebookexternalhit/1.1+(+http://www.facebook.com/externalhit_uatext.php)\n\nGooglebot/2.1+(+http://www.googlebot.com/bot.html)\n\nMozilla/5.0+(compatible;+Baiduspider/2.0;++http://www.baidu.com/search/spider.html)\n\nMozilla/5.0+(compatible;+Bingbot/2.0;++http://www.bing.com/bingbot.htm)\n\nMozilla/5.0+(compatible;+Googlebot/2.1;++http://www.google.com/bot.html\n\nMozilla/5.0+(compatible;+Konqueror/3.5;+Linux)+KHTML/3.5.5+(like+Gecko)+(ExabotThumbnails)\n\nMozilla/5.0+(compatible;+Yahoo!+Slurp;+http://help.yahoo.com/help/us/ysearch/slurp)\n\nMozilla/5.0+(compatible;+YandexBot/3.0;++http://yandex.com/bots)\n\nMozilla/5.0+(X11;+Linux+x86_64)+AppleWebKit/537.36+\n(KHTML,+like+Gecko)+Chrome/51.0.2704.103+Safari/537.36\n\npython-requests/2.19.1\n\npython-requests/2.25.1\n\n## Web Shells\n\nAdversaries upload web shells to the following paths. Bear in mind that there may be other web\nshells with different file names in these folders. So, search for any new or modified ASPX files in\nthese folders and their subfolders.\n\n\n-----\n\n**Folder** **Web Shell Files**\n\n\\<exchange_install_path>\\FrontEnd\\HttpProxy\\owa\\auth\\ 8Lw7tAhF9i1pJnRo.aspx, a.aspx,\nauthhead.aspx, bob.aspx,\ndefault.aspx, errorPage.aspx,\nerrorPages.aspx, fatal-erro.aspx,\nlog.aspx, logg.aspx, logout.aspx,\none.aspx, one1.aspx,\nOutlookZH.aspx, shel.aspx,\nshel2.aspx, shel90.aspx.\n\n\n\\\n<exchange_install_path>\\FrontEnd\\HttpProxy\\owa\\auth\\current\\\n\n\none1.aspx\n\n\n\\<exchange_install_path>\\FrontEnd\\HttpProxy\\OAB log.aspx\n\n\\inetpub\\wwwroot\\aspnet_client\\ aspnet_client.aspx,\naspnet_iisstart.aspx,\naspnet_pages.aspx,\naspnet_www.aspx, default1.aspx,\ndiscover.aspx, errorcheck.aspx,\nHttpProxy.aspx, iispage.aspx,\nOutlookEN.aspx, s.aspx,\nServer.aspx, session.aspx,\nshell.aspx, supp0rt.aspx,\nxclkmcfldfi948398430fdjkfdkj.aspx,\nxx.aspx\n\n\\inetpub\\wwwroot\\aspnet_client\\system_web\\ log.aspx\n\n\\<exchange_install_path>\\FrontEnd\\HttpProxy\\ecp\\auth\\ log.aspx\n\n## Command and Control IP Addresses\n\n**Connected IP Addresses**\n\n103.77.192.219\n\n104.140.114.110\n\n104.250.191.110\n\n108.61.246.56\n\n\n-----\n\n149.28.14.163\n\n157.230.221.198\n\n167.99.168.251\n\n185.250.151.72\n\n192.81.208.169\n\n203.160.69.66\n\n211.56.98.146\n\n5.254.43.18\n\n80.92.205.81\n\n## SHA256 Hashes of Web Shells\n\n**SHA256 Hashes**\n\n511df0e2df9bfa5521b588cc4bb5f8c5a321801b803394ebc493db1ef3c78fa1\n\nb75f163ca9b9240bf4b37ad92bc7556b40a17e27c2b8ed5c8991385fe07d17d0\n\n4edc7770464a14f54d17f36dc9d0fe854f68b346b27b35a6f5839adf1f13f8ea\n\n811157f9c7003ba8d17b45eb3cf09bef2cecd2701cedb675274949296a6a183d\n\n65149e036fff06026d80ac9ad4d156332822dc93142cf1a122b1841ec8de34b5\n\nb75f163ca9b9240bf4b37ad92bc7556b40a17e27c2b8ed5c8991385fe07d17d0\n\n097549cf7d0f76f0d99edf8b2d91c60977fd6a96e4b8c3c94b0b1733dc026d3e\n\n2b6f1ebb2208e93ade4a6424555d6a8341fd6d9f60c25e44afe11008f5c1aad1\n\n\n-----\n\n65149e036fff06026d80ac9ad4d156332822dc93142cf1a122b1841ec8de34b5\n\n511df0e2df9bfa5521b588cc4bb5f8c5a321801b803394ebc493db1ef3c78fa1\n\n4edc7770464a14f54d17f36dc9d0fe854f68b346b27b35a6f5839adf1f13f8ea\n\n811157f9c7003ba8d17b45eb3cf09bef2cecd2701cedb675274949296a6a183d\n\n1631a90eb5395c4e19c7dbcbf611bbe6444ff312eb7937e286e4637cb9e72944\n\nReferences:\n\n[1] MSRC Team, “Multiple Security Updates Released for Exchange Server – updated March 8,\n2021.” https://msrc-blog.microsoft.com/2021/03/02/multiple-security-updates-released-for[exchange-server/.](http://paperpile.com/b/ewnCG5/yFDb)\n\n[2] Microsoft Threat Intelligence Center (MSTIC), Microsoft 365 Defender Threat Intelligence Team,\nand Microsoft 365 Security, “HAFNIUM targeting Exchange Servers with 0-day exploits,” 02-Mar[2021. https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/.](https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/)\n\n[3] “Operation Exchange Marauder: Active Exploitation of Multiple Zero-Day Microsoft Exchange\nVulnerabilities.” https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange[zero-day-vulnerabilities/.](http://paperpile.com/b/ewnCG5/zig1)\n\n[4] “Cyber-attack on the European Banking Authority - European Banking Authority,” 07-Mar-2021.\n[https://www.eba.europa.eu/cyber-attack-european-banking-authority.](https://www.eba.europa.eu/cyber-attack-european-banking-authority)\n\n[5] “Please leave an exploit after the beep.” https://www.dubex.dk/aktuelt/nyheder/please-leave-an[exploit-after-the-beep.](http://paperpile.com/b/ewnCG5/RBIg)\n\n[6] MSRC Team, “Microsoft Exchange Server Vulnerabilities Mitigations – updated March 6, 2021.”\nhttps://msrc-blog.microsoft.com/2021/03/05/microsoft-exchange-server-vulnerabilities-mitigations[march-2021/.](http://paperpile.com/b/ewnCG5/FoFA)\n\n[7] “Security Update Guide - Microsoft Security Response Center.”\n[https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-26855.](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-26855)\n\n[8] “Security Update Guide - Microsoft Security Response Center.”\n[https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-26857.](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-26857)\n\n[9] “Security Update Guide - Microsoft Security Response Center.”\n[https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-26858.](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-26858)\n\n[10] “Security Update Guide - Microsoft Security Response Center.”\n[https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-27065.](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-27065)\n\n\n-----\n\n[[11] Reconnaissance. https://attack.mitre.org/tactics/TA0043/.](https://attack.mitre.org/tactics/TA0043/)\n\n[12] [“Gather Victim Host Information: Software.” https://attack.mitre.org/techniques/T1592/002/.](http://paperpile.com/b/ewnCG5/lSPZ)\n\n[13] [“Resource Development.” https://attack.mitre.org/tactics/TA0042/.](http://paperpile.com/b/ewnCG5/8DFd)\n\n[14] [“Acquire Infrastructure: Virtual Private Server.”](http://paperpile.com/b/ewnCG5/XeBJ) [https://attack.mitre.org/techniques/T1583/003/.](https://attack.mitre.org/techniques/T1583/003/)\n\n[[15] “Obtain Capabilities: Tool.” https://attack.mitre.org/techniques/T1588/002/.](https://attack.mitre.org/techniques/T1588/002/)\n\n[16] [S. Özarslan, “MITRE ATT&CK T1003 Credential Dumping.”](http://paperpile.com/b/ewnCG5/Jeov)\nhttps://www.picussecurity.com/resource/blog/picus-10-critical-mitre-attck-techniques-t1003[credential-dumping.](http://paperpile.com/b/ewnCG5/Jeov)\n\n[17] [S. Özarslan, “MITRE ATT&CK T1086 PowerShell.”](http://paperpile.com/b/ewnCG5/UsHL)\nhttps://www.picussecurity.com/resource/blog/picus-10-critical-mitre-attck-techniques-t1086[powershell.](http://paperpile.com/b/ewnCG5/UsHL)\n\n[[18] besimorhino, “besimorhino/powercat.” https://github.com/besimorhino/powercat.](https://github.com/besimorhino/powercat)\n\n[19] markruss, “PsExec - Windows Sysinternals.” https://docs.microsoft.com/en[us/sysinternals/downloads/psexec.](http://paperpile.com/b/ewnCG5/oBfg)\n\n[20] S. Özarslan, “How to Beat Nefilim Ransomware Attacks.”\n[https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks.](https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks?hsLang=en-gb)\n\n[21] S. Özarslan, “The Ransomware Resurgence Led By LockerGoga.”\n[https://www.picussecurity.com/resource/blog/locker-goga.](https://www.picussecurity.com/resource/blog/locker-goga?hsLang=en-gb)\n\n[[22] cobbr, “cobbr/Covenant.” https://github.com/cobbr/Covenant.](https://github.com/cobbr/Covenant)\n\n[23] “China Chopper.” [https://attack.mitre.org/software/S0020/.](https://attack.mitre.org/software/S0020/)\n\n[24] SecureWorks Counter Threat Unit Threat Intelligence, “Threat Group-3390 Targets\nOrganizations for Cyberespionage.” https://www.secureworks.com/research/threat-group-3390[targets-organizations-for-cyberespionage.](http://paperpile.com/b/ewnCG5/USoG)\n\n[25] “Initial Access.” [https://attack.mitre.org/tactics/TA0001/.](https://attack.mitre.org/tactics/TA0001/)\n\n[[26] “Exploit Public-Facing Application.” https://attack.mitre.org/techniques/T1190/.](https://attack.mitre.org/techniques/T1190/)\n\n[27] “China Chopper.” [https://attack.mitre.org/software/S0020/.](https://attack.mitre.org/software/S0020/)\n\n[28] “Persistence.” [https://attack.mitre.org/tactics/TA0003/.](https://attack.mitre.org/tactics/TA0003/)\n\n[[29] “Server Software Component: Web Shell.” https://attack.mitre.org/techniques/T1505/003/.](https://attack.mitre.org/techniques/T1505/003/)\n\n[30] S. Özarslan, “MITRE ATT&CK T1036 Masquerading.”\nhttps://www.picussecurity.com/resource/blog/picus-10-critical-mitre-attck-techniques-t1036[masquerading.](http://paperpile.com/b/ewnCG5/yskT)\n\n\n-----\n\n[31] Lateral Movement. [https://attack.mitre.org/tactics/TA0008/.](https://attack.mitre.org/tactics/TA0008/)\n\n[32] “Remote Services: SMB/Windows Admin Shares.”\n[https://attack.mitre.org/techniques/T1021/002/.](https://attack.mitre.org/techniques/T1021/002/)\n\n[33] “Archive Collected Data: Archive via Utility.” [https://attack.mitre.org/techniques/T1560/001/.](https://attack.mitre.org/techniques/T1560/001/)\n\n[[34] “Email Collection: Remote Email Collection.” https://attack.mitre.org/techniques/T1114/002/.](https://attack.mitre.org/techniques/T1114/002/)\n\n[[35] “Command and Control.” https://attack.mitre.org/tactics/TA0011/.](https://attack.mitre.org/tactics/TA0011/)\n\n[[36] “Application Layer Protocol: Web Protocols.” https://attack.mitre.org/techniques/T1071/001/.](https://attack.mitre.org/techniques/T1071/001/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-10 - Tactics, Techniques, and Procedures (TTPs) Used by HAFNIUM to Target Microsoft Exchange Servers.pdf"
    ],
    "report_names": [
        "2021-03-10 - Tactics, Techniques, and Procedures (TTPs) Used by HAFNIUM to Target Microsoft Exchange Servers.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536238,
    "ts_updated_at": 1743041561,
    "ts_creation_date": 1653820730,
    "ts_modification_date": 1653820730,
    "files": {
        "pdf": "https://archive.orkl.eu/e2514c7b0cd05a881ddd6209fed0815cd7ff0576.pdf",
        "text": "https://archive.orkl.eu/e2514c7b0cd05a881ddd6209fed0815cd7ff0576.txt",
        "img": "https://archive.orkl.eu/e2514c7b0cd05a881ddd6209fed0815cd7ff0576.jpg"
    }
}