{
    "id": "fae2dc0e-7077-4db7-8627-21a03e4e48e8",
    "created_at": "2023-01-12T15:05:17.47148Z",
    "updated_at": "2025-03-27T02:05:54.241739Z",
    "deleted_at": null,
    "sha1_hash": "22bb139f896b475472860930ca2bb3a26b8d554a",
    "title": "2020-12-13 - Suspected Russian hackers spied on U.S. Treasury emails - sources",
    "authors": "",
    "file_creation_date": "2022-05-27T21:35:45Z",
    "file_modification_date": "2022-05-27T21:35:45Z",
    "file_size": 152405,
    "plain_text": "# Suspected Russian hackers spied on U.S. Treasury emails - sources\n\n**reuters.com/article/us-usa-cyber-treasury-exclsuive/suspected-russian-hackers-spied-on-u-s-treasury-emails-sources-**\nidUSKBN28N0PG\n\nChristopher Bing\n\n[Technology News](https://www.reuters.com/news/archive/technologyNews)\nUpdated\n\nBy [Christopher Bing](https://www.reuters.com/journalists/christopher-bing)\n\n5 Min Read\n\nWASHINGTON (Reuters) - Hackers believed to be working for Russia have been monitoring\ninternal email traffic at the U.S. Treasury and Commerce departments, according to people\nfamiliar with the matter, adding they feared the hacks uncovered so far may be the tip of the\niceberg.\n\nFILE PHOTO: A hooded man holds a laptop computer as cyber code is projected on him in\nthis illustration picture taken on May 13, 2017. REUTERS/Kacper Pempel/Illustration\n\n\n-----\n\nThe hack is so serious it led to a National Security Council meeting at the White House on\nSaturday, said one of the people familiar with the matter.\n\nU.S. officials have not said much publicly beyond the Commerce Department confirming\nthere was a breach at one of its agencies and that they asked the Cybersecurity and\nInfrastructure Security Agency and the FBI to investigate.\n\nNational Security Council spokesman John Ullyot added that they “are taking all necessary\nsteps to identify and remedy any possible issues related to this situation.”\n\nThe U.S. government has not publicly identified who might be behind the hacking, but three\nof the people familiar with the investigation said Russia is currently believed to be\nresponsible for the attack. Two of the people said that the breaches are connected to a broad\ncampaign that also involved the recently disclosed hack on FireEye, a major U.S.\ncybersecurity company with government and commercial contracts.\n\nIn a statement posted [here to Facebook, the Russian foreign ministry described the](https://www.facebook.com/RusEmbUSA/posts/1488755328001519)\nallegations as another unfounded attempt by the U.S. media to blame Russia for\ncyberattacks against U.S. agencies.\n\nThe cyber spies are believed to have gotten in by surreptitiously tampering with updates\nreleased by IT company SolarWinds, which serves government customers across the\nexecutive branch, the military, and the intelligence services, according to two people familiar\nwith the matter. The trick - often referred to as a “supply chain attack” - works by hiding\nmalicious code in the body of legitimate software updates provided to targets by third parties.\n\nIn a statement released late Sunday, the Austin, Texas-based company said that updates to\nits monitoring software released between March and June of this year may have been\nsubverted by what it described as a “highly-sophisticated, targeted and manual supply chain\nattack by a nation state.”\n\nThe company declined to offer any further detail, but the diversity of SolarWind’s customer\nbase has sparked concern within the U.S. intelligence community that other government\nagencies may be at risk, according to four people briefed on the matter.\n\nRelated Coverage\n\nSolarWinds says on its website that its customers include most of America’s Fortune 500\ncompanies, the top 10 U.S. telecommunications providers, all five branches of the U.S.\nmilitary, the State Department, the National Security Agency, and the Office of President of\nthe United States.\n\n‘HUGE CYBER ESPIONAGE CAMPAIGN’\n\n\n-----\n\nThe breach presents a major challenge to the incoming administration of President-elect Joe\nBiden as officials investigate what information was stolen and try to ascertain what it will be\nused for. It is not uncommon for large scale cyber investigations to take months or years to\ncomplete.\n\n“This is a much bigger story than one single agency,” said one of the people familiar with the\nmatter. “This is a huge cyber espionage campaign targeting the U.S. government and its\ninterests.”\n\nHackers broke into the NTIA’s office software, Microsoft’s Office 365. Staff emails at the\nagency were monitored by the hackers for months, sources said.\n\nA Microsoft spokesperson did not respond to a request for comment. Neither did a\nspokesman for the Treasury Department.\n\nThe hackers are “highly sophisticated” and have been able to trick the Microsoft platform’s\nauthentication controls, according to a person familiar with the incident, who spoke on\ncondition of anonymity because they were not allowed to speak to the press.\n\n“This is a nation state,” said a different person briefed on the matter.\n\nThe full scope of the breach is unclear. The investigation is still its early stages and involves\na range of federal agencies, including the FBI, according to three of the people familiar with\nthe matter.\n\nA spokesperson for the Cybersecurity and Infrastructure Security Agency said they have\nbeen “working closely with our agency partners regarding recently discovered activity on\ngovernment networks. CISA is providing technical assistance to affected entities as they\nwork to identify and mitigate any potential compromises.”\n\nThe FBI and U.S. National Security Agency did not respond to a request for comment.\n\nThere is some indication that the email compromise at NTIA dates back to this summer,\nalthough it was only recently discovered, according to a senior U.S. official.\n\nReporting by Christopher Bing, Jack Stubbs, Joseph Menn, and Raphael Satter; Editing by\nChris Sanders, Daniel Wallis and Diane Craft\n\nOur Standards: [The Thomson Reuters Trust Principles.](http://thomsonreuters.com/en/about-us/trust-principles.html)\n\nfor-phone-onlyfor-tablet-portrait-upfor-tablet-landscape-upfor-desktop-upfor-wide-desktop-up\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-13 - Suspected Russian hackers spied on U.S. Treasury emails - sources.pdf"
    ],
    "report_names": [
        "2020-12-13 - Suspected Russian hackers spied on U.S. Treasury emails - sources.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535917,
    "ts_updated_at": 1743041154,
    "ts_creation_date": 1653687345,
    "ts_modification_date": 1653687345,
    "files": {
        "pdf": "https://archive.orkl.eu/22bb139f896b475472860930ca2bb3a26b8d554a.pdf",
        "text": "https://archive.orkl.eu/22bb139f896b475472860930ca2bb3a26b8d554a.txt",
        "img": "https://archive.orkl.eu/22bb139f896b475472860930ca2bb3a26b8d554a.jpg"
    }
}