{
    "id": "faf5ce8a-5c29-4fbc-8ed6-8f7a6fd5b923",
    "created_at": "2023-01-12T15:00:30.097033Z",
    "updated_at": "2025-03-27T02:06:07.038651Z",
    "deleted_at": null,
    "sha1_hash": "fa0f8ceff5446a2bbb1bb51351be09f47b9e573f",
    "title": "2021-03-02 - When Viruses Mutate- Did SunCrypt Ransomware Evolve from QNAPCrypt-",
    "authors": "",
    "file_creation_date": "2022-05-28T03:49:31Z",
    "file_modification_date": "2022-05-28T03:49:31Z",
    "file_size": 3956718,
    "plain_text": "# When Viruses Mutate: Did SunCrypt Ransomware Evolve from QNAPCrypt?\n\n**[intezer.com/blog/malware-analysis/when-viruses-mutate-did-suncrypt-ransomware-evolve-from-qnapcrypt](https://www.intezer.com/blog/malware-analysis/when-viruses-mutate-did-suncrypt-ransomware-evolve-from-qnapcrypt)**\n\nMarch 2, 2021\n\nWritten by Joakim Kennedy - 2 March 2021\n\n### Get Free Account\n\nJoin Now\n\n### Top Blogs\n\n**[How to Write YARA Rules That Minimize False Positives](https://www.intezer.com/blog/threat-hunting/yara-rules-minimize-false-positives/)**\n\nGenerate Advanced YARA Rules Based on Code Reuse Incorporating YARA into daily\nsecurity operations can... [Read more](https://www.intezer.com/blog/threat-hunting/yara-rules-minimize-false-positives/)\n\n**[Top Cyber Threats to the Manufacturing Sector](https://www.intezer.com/blog/incident-response/cyber-threats-to-manufacturing-sector/)**\n\n\n-----\n\nManufacturers are building automated workflows for alert triage, incident response, and\nthreat hunting to meet... [Read more](https://www.intezer.com/blog/incident-response/cyber-threats-to-manufacturing-sector/)\n\n**[New Conversation Hijacking Campaign Delivering IcedID](https://www.intezer.com/blog/research/conversation-hijacking-campaign-delivering-icedid/)**\n\nThis post describes the technical analysis of a new campaign detected by Intezer’s\nresearch team,... [Read more](https://www.intezer.com/blog/research/conversation-hijacking-campaign-delivering-icedid/)\n\n**Dov Lerner from Cybersixgill contributed to this report**\n\n## Intro\n\nProgrammers frequently reuse code, as recycling something that is already written and\nfunctional is much more efficient than writing from scratch. Malware authors are no different;\nfunctions and modules from one malware can be reused in the next. Because of this, code\nreuse analysis can connect different malware to the same author.\n\nWhen performing code reuse analysis, it is important to ensure that the code is unique to\nthe specific developer and not common code that, for example, is part of an open-source\nlibrary since open-source code can be used by many and cannot be tied to a specific\nauthor. If this is handled correctly, code reuse is a very powerful method for attributing\nmalware to a specific malware author.\n\nThere is a constant churn of new actors and malware families. However, sometimes a\nseemingly new threat actor is just a “rebranding” or a new group formed by known actors.\nFor example, in May 2019, the GandCrab group announced that they were retiring from\ntheir ransomware activity. Not long after, [researchers connected a new ransomware called](https://www.secureworks.com/blog/revil-the-gandcrab-connection)\n[REvil (also known as Sodinokibi) to the then defunct GandCrab ransomware. REvil shared](https://analyze.intezer.com/families/098aa9b8-08e5-4b20-a83f-5e94e57f8fd7)\nunique code similarities with GandCrab. This suggested that when GandCrab was closing\ndown, the malware authors switched to develop a new ransomware using some of the code\nfrom GandCrab in a new collaboration with other threat actors.\n\nThis report uses both dark web research and malware analysis to investigate the\nconnection between the affiliate ransomware service known as SunCrypt and the\n[QNAPCrypt ransomware, the latter of which was used against QNAP and Synology devices](https://www.intezer.com/blog/linux/seizing-15-active-ransomware-campaigns-targeting-linux-file-storage-servers/)\nback in 2019. While the two ransomware are operated by distinct different threat actors on\nthe dark web, there are strong technical connections in code reuse and techniques, linking\nthe two ransomware to the same author. Just because a malware is a derivative of another\nmalware does not mean it will be deployed in exactly the same way. A new operator may\nuse different targets, tactics, techniques and procedures (TTPs), which can include new\nevasion techniques. Defenders must remain vigilant.\n\n## Technical Connection\n\n\n-----\n\nSunCrypt is a Ransomware as a Service (RaaS) that uses a closed affiliate program on the\ndark web. The history of this RaaS can be traced back to circa October 2019. In October\n[2019, a new ransomware was found in-the-wild (5657abdb9d99cd5aec433099f8d6f53d).](https://analyze.intezer.com/files/98b8924d3f49ed0279723d3311bbdafcc918f240390151ea65493e48d2803393)\n[The new ransomware was written in Go and targeted Windows machines. This version of](https://www.intezer.com/resource/year-of-the-gopher-2020-go-malware-round-up/)\n[SunCrypt was not reported in many attacks and it wasn’t until mid-2020 when a new version](https://id-ransomware.blogspot.com/2020/08/suncrypt-ransomware.html)\nof the ransomware written in C/C++ was discovered, that attacks started to increase. It is an\n[interesting shift of retooling from Go to C/C++ when other groups are instead retooling from](https://twitter.com/VK_Intel/status/1281677718376120328)\nC/C++ to Go.\n\nWhile the RaaS didn’t appear until October 2019, these ransomware share connections\n[with another ransomware, called QNAPCrypt (also known as eCh0raix), that was used to](https://www.intezer.com/blog/linux/seizing-15-active-ransomware-campaigns-targeting-linux-file-storage-servers/)\ntarget Network Attached Storage (NAS) devices back in July 2019. Both families share\nidentical code logic for the file encryption, which we can conclude with high certainty has\nbeen compiled from the same source code.\n\n## SunCrypt 2020 and SunCrypt 2019\n\nThe SunCrypt variant that was released in 2020 is written in C. Due to this, it does not have\nany shared code with the earlier version from 2019. The functionality of SunCrypt has been\n[well-documented and some of the behaviors are similar between the two variants. For](https://sapphirex00.medium.com/diving-into-the-sun-suncrypt-a-new-neighbour-in-the-ransomware-mafia-d89010c9df83)\nexample, both variants are designed to encrypt and steal data. This, together with the\nname, is not enough to link the two variants together. Instead, we have to look at other data\npoints.\n\nAfter the ransomware has stolen and encrypted the files on the infected machine, the user\nis presented with a ransom note. The ransom note for the 2020 variant is shown in Figure 1\nbelow. The note can be read in English, German, French, Spanish or Japanese. It has an\ninput box that when the user enters the unique ID, sends the user to a chat interface.\n\n\n-----\n\n**Figure 1: Ransom note pages for SunCrypt. Left is showing the original ransom note and**\nright is showing the current ransom note used. Both share the same typos and structure.\nThe current ransom note provides a link to the leak site while the original note does not.\n\nThe ransom note for the 2019 variant is very similar. It has essentially the same text. The\nbackground color is different. The major difference is that the 2019 version does not include\nthe text of leaking the stolen data if the ransom is not paid, as can be seen in Figure 1.\n\n## Connection to QNAPCrypt\n\nThe 2021 variant is potentially a beta release of the RaaS. The version included in the PDB\n[path is “0.1” as can be seen in Figure 2. The figure is showing a partial output of redress, a](https://go-re.tk/redress/)\ntool used to analyze Go binaries. As part of the output, we can see a file called “aes.go”\nwith two functions. Note that one of the functions has a typo in the name, “EncEAS” instead\nof “EncAES.” A similar file has been found being part of another malware family,\nQNAPCrypt. This typo was included in two samples of version 2 of QNAPCrypt\n[(8dd59345cc034317630b2ac2ee19b362 and](https://analyze.intezer.com/files/50470f94e7d65b50bf00d7416a9634d9e4141c5109a78f5769e4204906ab5f0b) [516291d10b370c7be3863335cf5d57eb). An](https://analyze.intezer.com/files/9d4bc803c256bd340664ce08c2bf68249f33419d7decd866f3ade78626c95422)\noutput generated by redress from one of the QNAPCrypt samples is shown in Figure 3.\nAfter searching both our data set of malware and a retro hunt on VirusTotal, only these\nthree samples have the two function names. From this, we can conclude that the typo is\nunique and potentially shared code between the two ransomware families.\n\n**Figure 2: Partial output of redress for SunCrypt 2019 variant. One of the functions has the**\ntypo EAS instead of AES.\n\n**Figure 3: Output from redress for a version of QNAPCrypt with the same typo.**\n\n\n-----\n\nA deeper analysis of the function confirms that they are derived from the same source. A\nflow graph of “EncFile” is shown in Figure 4 and a flow graph for “EncEAS” is shown in\nFigure 5.\n\n**Figure 4: Flow graphs for EncFile function. The flow is identical.**\n\nThe samples are compiled for different operating systems and architectures using different\nversions of the Go compiler which results in a slight difference in the generated assembly\ncode. The function opens a file handler to the file to be encrypted. It uses the “Stat” function\nprovided by Go’s standard library to determine the file size. Based on the size, the flow\nsplits into two different branches.\n\nFor SunCrypt, if the file is larger than 100 MB it goes down one branch while QNAPCrypt\nuses a cutoff of 10 MB. Files smaller than the cutoff size goes down to the second branch.\nIn the large file branch, the SunCrypt reads in the first 100 MB using the “ReadAtLeast”\nfunction that is part of the standard library “io” package. QNAPCrypt does the same but in\nthe first 10 MB instead.\n\nFor the smaller files, both families use the “ReadFile” function from the “io” package. The\nread-in data is passed to the “EncEAS” function that encrypts the data. The content is finally\nwritten to disk as a new file with an extension appended while the original file is removed.\nExcept for the size cutoff, the function logic in the two families is identical.\n\nThe “EncEAS” function encrypts the data using AES in Cipher Feedback (CFB) mode. A\ncomparison between the flow graphs is shown in Figure 5 below. As with the “EncFile”\nfunction, the “EncEAS” function has an identical logic and it can be confirmed that it was\ncompiled from a very similar source code.\n\n\n-----\n\n**Figure 5: Flow graph comparison between SunCrypt and QNAPCrypt’s “EncEAS” function.**\n\n## Other Similarities\n\nIn addition to the shared code between the two malware families for the functionality\nresponsible for the file encryption, the two families also have other similarities. The\nsimilarities on their own do not indicate a connection, but the collection of all of them does.\nThe presentation of them is to strengthen the connection indicated by the shared code.\nFigure 6 is showing functions in QNAPCrypt that share similarities with functions in\nSunCrypt.\n\n**Figure 6: Functions with similarities between QNAPCrypt and SunCrypt. File encryption**\nlogic is identical while the key generation and the encryption of the key is very similar. Both\nmalware use the locale of the machine and GeoIP to determine the location of the machine.\n\nBoth ransomware are designed to not run on some of the Commonwealth of Independent\nStates (CIS). QNAPCrypt will not perform any encryption of files if it believes it is running on\na Belarusian, Russian or Ukrainian machine. SunCrypt does the same, but also includes\nKyrgyzstan and Syria in the list.\n\n\n-----\n\nThe way the ransomware tries to determine this is very similar, both use two sources for this\ninformation. One of the sources is the locale of the machine. As QNAPCrypt is targeting\nLinux machines and SunCrypt targets Windows machines, the way of obtaining this\ninformation is different. The second source is via geolocation based on the external IP\naddress of the machine. Both ransomware reaches out to an external service to get this\ninformation, “ip-api.com” for SunCrypt and “ipapi.co” for QNAPCrypt. While the families use\ndifferent services, they both use the locale on the machine and the geoip information to\ndetermine if the machine is located in a disallowed country.\n\nAs discussed in the section covering the file encryption code, the files are encrypted with\nAES in CFB mode. Both ransomware generates a unique 32 characters “password.” The\nlogic for generating this code is very similar. A comparison of the logic is shown in Figure 7.\nThe characters in the password are randomly selected from a list of valid characters that\nincludes all the English upper and lower characters and the numbers 0 through 9. The list is\nidentical between the malware. The rand implementation provided the math package in the\nstandard library is used, which means the randomness is not cryptographic. The\nrandomness is seeded with the current time. The main difference is that SunCrypt resets\nthe seed every time the function responsible for generating the “password” is called, while\nQNAPCrypt sets the seed during the initialization. SunCrypt also uses the function to\ngenerate a victim identifier.\n\n**Figure 7: Generation of the encryption password. The function loops 32 times and uses**\n“rand.Intn” to pick a random character from the list of valid characters. When the loop is\ndone, the byte slice of characters is converted to a string.\nThe encryption password is encrypted with a public RSA key included in the binary. The\nlogic for this code is similar as can be seen in Figure 8. The code uses the\n“EncryptPKCS1v15” function that is part of the “crypto/rsa” package.\n\n\n-----\n\n**Figure 8: Encrypting of the password using the included public key in the binary.**\nBoth ransomware families have command and control (C2) infrastructure hosted as Tor\nhidden services. The first version of QNAPCrypt reached out to the C2 to fetch\ninformation for the ransom note, including the Bitcoin wallet used for the campaign.\nSunCrypt sends campaign information and uploads stolen files to the C2 server. To access\nthe hidden service, both families use a public available SocksV5 proxy. QNAPCrypt\nconnects directly to an IP address (192.99.206[.]61) while the proxy used by SunCrypt is\naccessed via the domain vie8hoos[.]xyz.\n\nThe file types encrypted by the ransomware are also similar. Both families have a list of file\nextensions that they use to determine if the file should be encrypted. In total, SunCrypt has\na list of 589 file extensions. If we compare the SunCrypt list to the list used by the first\nversion of QNAPCrypt we can see that SunCrypt’s list has added four new entries and\nremoved 19 entries. The lists are not sorted in any way so the extract lists appear exactly in\nthe same order as they appeared in the malware. The code snippet below shows the “diff”\nbetween the two lists.\n\n$ diff suncrypt_ext.lst qnap_ext_20190705.lst\n\n460d459\n\n< .mp4\n\n562, 564d560\n\n< .java\n\n< .swift\n\n< .go\n\n\n-----\n\n589a586, 604\n\n- .gcode\n\n- .ngc\n\n- .sldprt\n\n- .sldasm\n\n- .x_t\n\n- .step\n\n- .fits\n\n- .cat\n\n- .ctlg\n\n- .fit\n\n- .rsn\n\n- .eml\n\n- .vhdx\n\n- .cfg\n\n- .plist\n\n- .bckup\n\n- .far\n\n- .tbz\n\n- .abf\n\nIf we compare SunCrypt’s list to the list used by the second version of QNAPCrypt from\nAugust the same year, the overlap is even bigger. The “diff” output is shown in the snippet\nbelow. The difference is that SunCrypt has added three entries and removed two. This\nresults in a string similarity of 0.991 which is a strong similarity.\n\n$ diff suncrypt-files.lst qnap_ext_20190801.lst\n\n562, 564d561\n\n\n-----\n\n< .java\n\n< .swift\n\n< .go\n\n589a587, 588\n\n- .gcode\n\n- .ngc\n\n## Dark Web Activity\n\nNot long after the public reports on QNAPCrypt/eCh0raix, a new forum user named\neCh0raix became active and started promoting the ransomware. Later, a SunCrypt user\naccount promoted a new ransomware affiliate service. While both actors operated on\nthe same popular Russian-language dark web forum, this is where the similarities end.\n\n## eCh0raix\n\nThe actor behind eCh0raix first posted on August 31, 2019, announcing an affiliate program\nfor a ransomware targeting Linux, Figure 9. This includes a diagram showing how the\nprogram works.\n\n\n-----\n\n**Figure 9: Announcement post made by the eCh0raix actor on the dark web.**\nIn the post (Figure 10), eCh0raix cites research by threat researchers (from Anomali and\nTrend Micro), a marketing technique often used by RaaS providers in order to bolster\ncredibility.\n\n\n-----\n\n**Figure 10: The threat actor referring to public research on his ransomware.**\nFrom this initial post until June 20, 2020, the actor posted 27 new threads on the forum and\nanother 77 replies to existing threads. They were quite gregarious, jumping into threads and\nsharing expertise and advice. While the actor did not give any updates on eCh0raix\nransomware, all of the posts concluded with a signature that included the citation from the\nthreat researchers.\n\nThe actor’s catalogue of posts dealt with a broad variety of topics. On December 25, 2019,\neCh0raix offered a second service called DirBuster (Figure 11), for scanning domains,\nsubdomains, pages, and scripts, which appears to have been rebranded as Masscan a few\nmonths later:\n\n\n-----\n\n**Figure 11: Forum post by the threat actor announcing port scanning service called**\nMasscan.\nThe actor was also interested in virtualization, network access, and databases. They posted\na lengthy account of hacking a Magento site, sold SSH root access/web shell access to a\nCosta Rican ad network and to an American IT company, and a database dump from a\nCanadian cannabis store.\n\n[In his final post (Figure 12) on the forum, the actor was looking to purchase a Shodan](https://www.shodan.io/)\naccount from which to export IP addresses. Like every post before it, this post concluded\nwith the same announcement of eCh0raix ransomware that had been used ten months\nprior.\n\n\n-----\n\n**Figure 12: Final post by the threat actor.**\nSince this was posted on June 20, 2020, without any reason or indication the account has\nbeen inactive.\n\n## SunCrypt\n\nOn August 12, 2020, the actor behind SunCrypt posted on the same forum for the first time.\nIn a post titled [PARTNERSHIP PROGRAM] SunCrypt Ransomware (Figure 13), the actor\nposted characteristics of the ransomware and issued a call for five affiliates to spread the\nransomware. The actor noted that once the affiliate program was full, “we will go into private\nagain.”\n\n\n-----\n\n**Figure 13: Forum post announcing the SunCrypt partnership program.**\nThe actor posted 11 more times, all on this single thread and having to do with searching for\naffiliates or answering technical questions about the ransomware. On August 29, the actor\nannounced that the affiliate program was full. Then on September 3, they announced that a\nposition was vacated.\n\nOn September 19, an actor posted on the thread (Figure 14), “Even hospitals are scammed\nby these scum,” and cited a [Bleeping Computer article about a SunCrypt attack against](https://www.bleepingcomputer.com/news/security/university-hospital-new-jersey-hit-by-suncrypt-ransomware-data-leaked/)\nUniversity Hospital New Jersey (UHNJ).\n\n\n-----\n\n**Figure 14: Another threat actor posts in the SunCrypt thread about how the ransomware**\nhas been used in attacks against hospitals.\nSunCrypt wrote defensively (Figure 15), “how can I see you are the most honest here….\nMother Teresa” a stretched take on “Let he who is without attacking a hospital with\nransomware cast the first stone.”\n\nThe actor continued, blaming the hospital attack on a new affiliate, who was reportedly\npunished, since “we don’t do hospitals, government agencies, airports, and so on.”\n\n\n-----\n\n**Figure 15: The actor behind SunCrypt response to the hospital attack allegation.**\n\nLater that day, another actor posted a lengthy technical analysis of the ransomware. The\nSunCrypt actor angrily responded, “Tell me, why are you posting this here?” and requested\nthat the moderator erase the post (Figure 16).\n\n\n-----\n\n**Figure 16: The threat actor’s angry response to a technical analysis of the ransomware.**\nAs of the date of this publication, the actor has not posted again. It is unclear why.\n\nSunCrypt’s dedicated leak site (DLS) soon wound down. Starting on August 1, there were\n15 posts of data from targeted organizations. After September 19, there were only three\n[more over the next 10 days. Even though new samples of SunCrypt ransomware had](https://analyze.intezer.com/files/95ca9e284a085ce93f68c3d12e6c5f557a5049539e3379284a65de784e1bdeff)\nsurfaced in VirusTotal, it appears that SunCrypt’s public campaign on dark web forums and\nmanagement of a DLS went dark.\n\nIt is unclear why the forum thread went silent and why the DLS site suspended operations,\nbut the timing indicates that it was related to the hospital attack. SunCrypt’s operators may\nhave been afraid that unwanted notoriety would attract law enforcement actions or security\n\n\n-----\n\nresearchers, so they decided to keep a lower profile until the attention subsided.\n\nSuddenly, on February 16, SunCrypt’s DLS listed a new victim: PRP Diagnostic Imaging. It\nappears that SunCrypt has returned to the business of public ransomware breaches.\n\nIt is notable that PRP provides “an extensive range of diagnostic [medical] imaging\nservices,” such as MRIs, ultrasounds, and mammograms. Thus, while attacking a hospital\nmay have forced the actor to suspend operations for several months, SunCrypt has\nreturned and continues to target healthcare providers. These, despite the actor’s protest\nthat “we don’t do hospitals.”\n\n## Comparing the Actors\n\nDespite the code similarities between the two ransomwares, the actors behind them\nexhibited very different behaviors. The eCh0raix actor mentioned his ransomware in\npassing, but it was hardly their only focus. They launched other initiatives, shared advice,\nand participated in unrelated conversations in the forum.\n\nMeanwhile, the SunCrypt actor was solely focused on a single purpose: advertising the\nransomware in order to recruit affiliates. During his five weeks of activity, they were active in\none thread only. SunCrypt operated a DLS site, indicating a more sophisticated operation,\nwhile eCh0raix did not.\n\nConsidering these behavioral differences, it is our assessment that the eCh0raix and\nSunCrypt accounts are operated by different individuals/groups. Perhaps the eCh0raix\nactor, overwhelmed by their many initiatives, decided that they did not have the resources\nto operate it and sold it to an affiliate. Maybe they were approached by a stranger asking to\nprocure the source code. While we may never know the full story, it appears that the\neCh0raix ransomware was transferred to and upgraded by the SunCrypt operators.\n\n## Conclusion\n\nWith technical analysis, it is possible to link the currently active version of SunCrypt back to\nQNAPCrypt, a ransomware that was used to target NAS devices back in the Summer of\n2019. While the technical based evidence strongly provides a link between QNAPCrypt and\nthe earlier version of SunCrypt, it is clear that both ransomware are operated by different\nindividuals. Based on the available data, it is not possible to connect the activity between\nthe two actors on the forum. This suggests that when new malware services derived from\nolder services appear, they may not always be operated by the same people.\n\nWith this in mind, security officials should note that just because one malware family is an\niteration of another, it does not mean that the new family will be deployed in exactly the\nsame way. If a malware is exchanged, whether to an affiliate or over the dark web, then the\n\n\n-----\n\nnew operators may choose different procedures, attack vectors, and targets. They might\ninvest considerably in the new malware, adding features and evasion techniques.\nDefenders must remain vigilant.\n\nTrack [SunCrypt,](https://analyze.intezer.com/families/515df548-58e2-428a-a3ad-1e9b87a21794) [QNAPCrypt and other ransomware families in Intezer Analyze to get the](https://analyze.intezer.com/families/801be613-3bb4-44ea-bffa-8278fc20f47b)\nlatest samples detected by code reuse.\n\n**Joakim Kennedy**\nDr. Joakim Kennedy is a Security Researcher analyzing malware and tracking threat actors\non a daily basis. For the last few years, Joakim has been researching malware written in\nGo. To make the analysis easier he has written the Go Reverse Engineering Toolkit\n(github.com/goretk), an open-source toolkit for analysis of Go binaries.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-02 - When Viruses Mutate- Did SunCrypt Ransomware Evolve from QNAPCrypt-.pdf"
    ],
    "report_names": [
        "2021-03-02 - When Viruses Mutate- Did SunCrypt Ransomware Evolve from QNAPCrypt-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535630,
    "ts_updated_at": 1743041167,
    "ts_creation_date": 1653709771,
    "ts_modification_date": 1653709771,
    "files": {
        "pdf": "https://archive.orkl.eu/fa0f8ceff5446a2bbb1bb51351be09f47b9e573f.pdf",
        "text": "https://archive.orkl.eu/fa0f8ceff5446a2bbb1bb51351be09f47b9e573f.txt",
        "img": "https://archive.orkl.eu/fa0f8ceff5446a2bbb1bb51351be09f47b9e573f.jpg"
    }
}