{
    "id": "fb1a1a3a-4c25-4ca2-9aa6-3d2228a1991d",
    "created_at": "2023-01-12T15:08:48.799194Z",
    "updated_at": "2025-03-27T02:05:34.210536Z",
    "deleted_at": null,
    "sha1_hash": "08964a98a06160beac2575b59887763163ace4ed",
    "title": "2021-04-08 - Attackers Conducting Cryptojacking Operation Against U.S. Education Organizations",
    "authors": "",
    "file_creation_date": "2022-05-28T02:47:04Z",
    "file_modification_date": "2022-05-28T02:47:04Z",
    "file_size": 817601,
    "plain_text": "# Attackers Conducting Cryptojacking Operation Against U.S. Education Organizations\n\n**[unit42.paloaltonetworks.com/attackers-conducting-cryptojacking-u-s-education-organizations/](https://unit42.paloaltonetworks.com/attackers-conducting-cryptojacking-u-s-education-organizations/)**\n\nKen Hsu, Vaibhav Singhal, Zhibin Zhang April 8, 2021\n\nBy [Ken Hsu,](https://unit42.paloaltonetworks.com/author/ken-hsu/) [Vaibhav Singhal and](https://unit42.paloaltonetworks.com/author/vaibhav-singhal/) [Zhibin Zhang](https://unit42.paloaltonetworks.com/author/zhibin-zhang/)\n\nApril 8, 2021 at 12:29 PM\n\n[Category: Cloud,](https://unit42.paloaltonetworks.com/category/cloud/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [cryptojacking,](https://unit42.paloaltonetworks.com/tag/cryptojacking/) [Cryptominer](https://unit42.paloaltonetworks.com/tag/cryptominer/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/attackers-conducting-cryptojacking-u-s-education-organizations/)\n\n## Executive Summary\n\nIt’s no news that cryptojacking activity proliferates whenever the price of cryptocurrencies hits\nrecord highs. The monetary incentive has definitely incited many to ride the hype wave\n[illegally. As a matter of fact, Unit 42 researchers have observed several incidents where](https://unit42.paloaltonetworks.com/lucifer-new-cryptojacking-and-ddos-hybrid-malware/)\nattackers were attempting to deliver malicious cryptominers as the payload upon successful\nexploitation.\n\nRecently, Unit 42 researchers spotted a UPX-packed cpuminer being delivered in malicious\ntraffic. While the malicious traffic appears to be an exploit on first sight, there's also evidence\nof a backdoor in the malicious request suggesting a backdoor is running on the\n\n\n-----\n\ncompromised host. Upon receipt of the requested payload, the backdoor proceeds to\ndownload a cpuminer variant and carry out its cryptojacking operation.\n\nIn addition to a brief analysis and comparison of the backdoor command traffic from three\nincidents against education organizations in U.S. education organizations, this blog includes\na general examination of mini shell and cpuminer payloads downloaded by the backdoor\nwebshell.\n\nPalo Alto Networks Next-Generation Firewall customers with security subscriptions such as\n[Threat Prevention and](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention) [WildFire, are able to detect and protect against these cryptojacking](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n[activities. Palo Alto Networks AutoFocus customers are also protected.](https://www.paloaltonetworks.com/cortex/autofocus)\n\n## Incident One: A Backdoor in Disguise\n\nThe first incident happened on Feb. 16, 2021. While the malicious traffic shown in Figure 1\nmay seem like a trivial command injection vulnerability due to insufficient sanitization of the\np1 parameter’s value, there are a few outstanding characteristics in the HTTP request that,\nafter investigation, makes us believe this HTTP request is more likely a command for a\nwebshell backdoor.\n\nFigure 1. Cpuminer payload discovered on Feb. 16, 2021\nThe first suspicious characteristic is the wget payload in the p1 parameter. There are no\nother preceding characters, such as | or &, before the payload itself, which implies that the\napplication literally takes whatever is in the p1 parameter’s value and executes it as an OS\ncommand. While legitimate software rarely has this kind of behavior, it’s quite common in a\nbackdoor.\n\nThe next intriguing indication is the host, which is a domain owned by an education\norganization. Given this context, it’s quite unlikely that the sysadmin would use an application\nthat’s unheard of. The sysadmin can certainly build and run custom applications, but one\nwith obvious backdoor weakness seems quite improbable under normal circumstances. The\nfact that this backdoor is unavailable at the time of investigation indicates that it’s not meant\nto be hosted on that domain.\n\n\n-----\n\nThe last outstanding characteristic is the user agent string, WHR. While there s really no\nrestriction on the application and the corresponding user agent, it’s uncommon that a\nlegitimate application would expect unconventional user agent strings like WHR, as shown in\nFigure 1. Typically, all the exploit traffic tends to have normal user agent strings specifying\nthe browsers and associated versions. The backdoor and malware, on the other hand, tend\nto use custom user agent strings. Coincidently, the user agent WHR can be found in a\n[repository related to malware.](https://github.com/inc0d3/malware/blob/master/spam/wp-index-desofuscado.php)\n\n## Incident Two and Three: Comparison\n\nFigure 2 shows the second incident we observed on March 10, 2021, and figure 3 shows\nanother incident caught on March 15, 2021. The malicious request, in comparison to the\nincident one, exhibits several similarities. It's the same attack pattern delivering the same\ncpuminer payload against the same industry (education), suggesting it’s likely the same\nperpetrator behind the cryptojacking operation.\n\nFigure 2. Cpuminer payload discovered on March 10, 2021.\n\nFigure 3. Cpuminer payload discovered on March 15, 2021.\nDespite all the resemblances, there are still some differences worth noting.\n\nThe first major difference is the user agent string, Mozilla/5.0 (compatible; MSIE 9.0;\nWindows NT 6.1; WOW64; Trident/5.0). As mentioned above, a custom user agent can likely\nattract unnecessary attention. The act of using a common user agent string indicates that the\nperpetrator is attempting to blend in the malicious requests with the benign traffic and avoid\ndetection.\n\nThe second major difference is the presence of pass value, as opposed to the previous\nmalicious request shown in Figure 1. This is likely employed to limit the backdoor usage to\njust the legitimate operator instead of anyone with the knowledge of the backdoor.\n\n\n-----\n\nThe targeted victims are also different, even though they both are from the education sector.\nIncidents 1 and 2, as shown in Figures 1 and 2, targeted one education organization, while\nIncident 3, as shown in Figure 3, targeted another education organization. Aside from\nfocusing on the same industry, the reasoning for selected targets remains unclear at this\npoint.\n\nLast but not least is the wget payload. In addition to the same cpuminer payload, the\nbackdoor command instructed the backdoor to download a mini shell pretending to be a\n[legitimate wp-load.php file. Since the mini shell is not moved elsewhere, we speculate that](https://github.com/WordPress/WordPress/blob/master/wp-load.php)\nthe current directory of the mini shell, as well as the backdoor, is a web directory exposed to\nthe internet.\n\nThe ultimate goal of the attacker is to receive cryptocurrency at these wallet-specific\n[addresses: \"CMsX5dXBq8nLPa2fkC9KX1mQiUgErYj7ai\" and](https://explorer.cpuchain.org/address/CMsX5dXBq8nLPa2fkC9KX1mQiUgErYj7ai)\n[“sugar1q4aegj76eaeq9jwz3s5ct884grznwzx4wv7ah69”.](https://2explorer.sugarchain.org/address/sugar1q4aegj76eaeq9jwz3s5ct884grznwzx4wv7ah69)\n\nWith all these backdoor-like characteristics observed in the HTTP requests and features\n[resembling wso webshell, it’s evident that a backdoor command is being sent to a backdoor](https://github.com/Josexv1/wso-webshell/blob/master/wso_v_4.2.5.php)\nrunning on a compromised host.\n\n## Cpuminer Payload\n\nThe payload downloaded upon successful reception of the malicious request is an UPXpacked cpuminer. Just like any other malicious cryptominer, this sample will proceed to\nperform cryptojacking based on the given parameters. In Incident one, the cryptojacking fails\nbecause of a typo in the specified mining algorithm, cpupoer, as shown in Figure 4. Based\non the help banner in the sample, the perpetrator meant to use cpupower algorithm for\ncryptojacking.\n\nFigure 4. Cpuminer fails to run.\nIn Incident two and three, the perpetrator chose a different algorithm, YespowerSugar. Since\nit’s correctly spelled, the cpuminer payload will be executed by the backdoor upon successful\nreceipt of the command request.\n\n## Conclusion\n\nCryptojacking is always going to be around, and so are the network attacks that make\ncryptojacking possible.\n\n\n-----\n\nWhile the attack vector for this installed backdoor remains unclear, Palo Alto Networks NextGeneration Firewall customers are protected from these attacks with the following security\nsubscriptions:\n\n[Threat Prevention can block the exploits and C2 traffic with best practice configuration.](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention)\n[For tracking and protection purposes, the relevant coverage threat ID is 90402. Please](https://threatvault.paloaltonetworks.com/)\nupdate to the latest threat detection release.\n[WildFire can stop the malware with behavioral heuristics.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n[AutoFocus can be used for tracking the UPX-packed miner and its variants.](https://autofocus.paloaltonetworks.com/#/tag/Commodity.CoinMiner)\n\n**Indicators of Compromise**\n\n**Cpuminer (UPX packed)**\n\n1adffca6b8da4af1556b0e4ba219babdf979be25ad45431eb2e233fdee0a8952\n\n**Mini Matamu Webshell**\n\n770c34a2a7b0c58c861644caee402c02c091ea102820ad7df18a77f59a129682\n\n**Malware Hosting Site**\n\n185[.]213[.]209[.]151\n\n118[.]97[.]221[.]252\n\n34[.]237[.]228[.]194\n\n23[.]106[.]253[.]151\n\n**Mining Server URL**\n\n135[.]181[.]62[.]60:4555\n\n135[.]181[.]62[.]60:6238\n\nstratum+tcp://ca-tor01[.]miningrigrentals[.]com:50209\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-08 - Attackers Conducting Cryptojacking Operation Against U.S. Education Organizations.pdf"
    ],
    "report_names": [
        "2021-04-08 - Attackers Conducting Cryptojacking Operation Against U.S. Education Organizations.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536128,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653706024,
    "ts_modification_date": 1653706024,
    "files": {
        "pdf": "https://archive.orkl.eu/08964a98a06160beac2575b59887763163ace4ed.pdf",
        "text": "https://archive.orkl.eu/08964a98a06160beac2575b59887763163ace4ed.txt",
        "img": "https://archive.orkl.eu/08964a98a06160beac2575b59887763163ace4ed.jpg"
    }
}