{
    "id": "fb3dab9b-0718-4729-af32-1ee0ffe09719",
    "created_at": "2023-01-12T15:06:43.680934Z",
    "updated_at": "2025-03-27T02:05:52.548117Z",
    "deleted_at": null,
    "sha1_hash": "9589f40f7bf925bac26fc8c086ebf19ca3ac71bd",
    "title": "2021-01-25 - Affiliates vs Hunters- Fighting the DarkSide",
    "authors": "",
    "file_creation_date": "2022-05-28T15:21:29Z",
    "file_modification_date": "2022-05-28T15:21:29Z",
    "file_size": 610181,
    "plain_text": "# Affiliates vs Hunters: Fighting the DarkSide\n\n**[socprime.com/blog/affiliates-vs-hunters-fighting-the-darkside/](https://socprime.com/blog/affiliates-vs-hunters-fighting-the-darkside/)**\n\nEmanuele De Lucia\n\n## Introduction\n\nOn August 2020 a new type of malware, belonging to the Ransomware category, appeared\nin the cyber threat landscape. Threat actor responsible for its development called it\n“DarkSide” and, like others piece of malware of this type, is operated in Big Game Hunting\n(BGH) campaigns. Around more or less the same time, a DLS (Dedicated Leak Site) was\nmade available on the darkweb (behind the TOR network) in order to report the first victims.\n\n**On their DLS DarkSide operators claimed to be experienced in conducting cyber**\noperations, having previously used other, not better identified, ransomware variants. Indeed,\nsome characteristics of their first operations support the hypothesis that the group could be a\nformer affiliate of some other R-a-a-S (Ransomware as a Service) program that chosen to\nwrite their own ransomware likely to avoid sharing the profits of criminal activities with third\nparties.\n\n## Insights\n\n\n-----\n\n**DarkSide is a well-written malware family not much changed over the time if compared to**\nthe first versions analyzed on August / September 2020. Usually, the samples belonging to\nthis family present some features aimed at making the analysis more harder. For example,\nin a recent sample (sha256:\n17139a10fd226d01738fe9323918614aa913b2a50e1a516e95cced93fa151c61), at 0040182A\nwe find a sub aimed at dynamically resolving DLLs and API through LoadLibrary /\n**_GetProcAddress. sub_4016D5, sub_4013DA and sub_401AC3 are also involved in this_**\nprocess. The following screenshot shows a chunk of code extracted from the whole function\ndesigned for this purpose:\n\nThis can be a useful place to create a code based Yara rule aimed at potentially hunting\nfurther variants of the same malware family. After having selected several representative\nchunks we can obtain something similar to the following:\n\n_rule DarkSide_Ransomware_827333_39928 : CRIMEWARE {_\n_meta:_\n_author = “Emanuele De Lucia”_\n_description = “Detects possible variants of DarkSide ransomware”_\n_hash1 = “17139a10fd226d01738fe9323918614aa913b2a50e1a516e95cced93fa151c61”_\n_/*_\n_call 0x4016d5_\n_push esi_\n_call 0x408195_\n_mov ebx, eax_\n_push dword ptr [esi – 4]push esi_\n_call 0x4013da_\n\n\n-----\n\n_mov eax, dword ptr [esi – 4]lea esi, [esi + eax]mov ecx, 0x23_\n_*/_\n_strings:_\n_$ = { E8 [4] 56 E8 [4] 8B D8 FF 76 ?? 56 E8 [4] 8B 46 ?? 8D 34 06 B9 ?? ?? ?? ?? }_\n_condition:_\n_any of them_\n_}_\n\n**Darkside employs also techniques for privilege escalation and UAC (User Access Control)**\nbypass. The technique observed in this case is known as CMSTPLUA UAC Bypass and\nexploits the ShellExec function by CMSTPLUA COM interface {3E5FC7F9-9A51-4367**9063-A120244FBEC7}. This allow to start a process with elevated permissions, according to**\nthe following graph:\n\nPowershell is used in order to delete shadow copies preventing the recovery of previously\nbacked up files through them according to the following syntax:\n\n_powershell -ep bypass -c_\n_“(0..61)|%{$s+=[char][byte]_\n_(‘0x’+’4765742D576D694F626A6563742057696E33325F536861646F77_\n_636F7079207C20466F72456163682D4F626A656374207B245F2E44656C65746528293B7D20′_\n_.Substring(2*$_,2))};iex $s”_\n_Decoded:_\n_Get-WmiObject Win32_Shadowcopy | ForEach-Object {$_.Delete();}_\n\nA quick Sigma rule can be employed in order to hunt for similar systems-side behaviors.\n\n_title: Detects possible DarkSide infection through PowerShell cmdline used to delete Shadow_\n_copies_\n_status: stable_\n_description: Detects possible DarkSide infection through PowerShell cmdline used to delete_\n_Shadow copies_\n_author: Emanuele De Lucia_\n_references:_\n_– internal research_\n\n\n-----\n\n_tags:_\n_– attack.t1086_\n_– attack.t1064_\n_date: 2020/12/01_\n_logsource:_\n_category: process_creation_\n_product: windows_\n_detection:_\n_selection:_\n_Image|endswith:_\n_– ‘\\powershell.exe’_\n_CommandLine|contains|all:_\n_– ‘(0..61)|%%{$s+=[char][byte]’_\n_– ‘4765742D576D694F626A6563742057696E33325F536861646F77636F7079207C_\n\n_20466F72456163682D4F626A656374207B245F2E44656C65746528293B7D20′_\n_condition: selection_\n_level: high_\n\nBefore executing the main payload, the sample performs several other activities like\ninformation gathering (f.e. get Disks Info)\n\nand a comparison of system services with a predefined list to stop those ones that could\naffect the files encryption process\n\n\n-----\n\nThe following are the services malware looks for in the analyzed sample:\n\n_sql_\n_oracle_\n_ocssd_\n_dbsnmp_\n_synctime_\n_agntsvc_\n_isqlplussvc_\n_xfssvccon_\n_mydesktopservice_\n_ocautoupds_\n_encsvc_\n_firefox_\n_tbirdconfig_\n_mydesktopqos_\n_ocomm_\n_dbeng50_\n_sqbcoreservice_\n_excel_\n_infopath_\n_msaccess_\n_mspub_\n_onenote_\n\n\n-----\n\n_outlook_\n_powerpnt_\n_steam_\n_thebat_\n_thunderbird_\n_visio_\n_winword_\n_wordpad_\n_notepad_\n\nThese areas can likewise be considered in order to extract bad-known pieces of code:\n\n_rule DarkSide_Ransomware_827333_39929 : CRIMEWARE {_\n_meta:_\n_author = “Emanuele De Lucia”_\n_description = “Detects possible variants of DarkSide ransomware”_\n_hash = “17139a10fd226d01738fe9323918614aa913b2a50e1a516e95cced93fa151c61”_\n_/*_\n_push 0x10020_\n_push dword ptr [edi]push dword ptr [ebp – 4]call dword ptr [0xcf0e66]mov dword ptr [ebp – 8],_\n_eax_\n_cmp dword ptr [ebp – 8], 0_\n_je 0xce4d83_\n_push 0x1c_\n_lea eax, [ebp – 0x30]push eax_\n_call 0xce13da_\n_lea eax, [ebp – 0x30]push eax_\n_push 1_\n_push dword ptr [ebp – 8]call dword ptr [0xcf0e6a]push dword ptr [ebp – 8]call dword ptr_\n\n_[0xcf0e6e]*/_\n_strings:_\n_$ = {68 [4] FF 37 FF 75 ?? FF 15 [4] 89 45 ?? 83 7D [2] 74 ?? 6A ?? 8D 45 ?? 50 E8 [4] 8D_\n_45 ?? 50 6A ?? FF 75 ?? FF 15 [4] FF 75 ?? FF 15 ?? ?? ?? ??}_\n_condition:_\n_any of them_\n_}_\n\nAfter the encryption phase, Darkside is designed to communicate to its command and\ncontrol server in order to share details relating to the victim (victimID) as well as further\nparameters useful for recovering encrypted files and identifying the affiliate.\n\nMost probably these network capabilities have been added in order to support the R-a-a-S\nmodel. In the analyzed sample, the CnC (Command and Control) is attested over the domain\nname securebestapp20 com Detecting network activities potentially related to this threat\n\n\n-----\n\ncould therefore involve writing SNORT rules similar to the following:\n\n_alert udp $HOME_NET any -> any 53 (msg:”DNS request for blacklisted domain_\n_‘securebestapp20.com'”; content:”|0f|securebestapp20|03|com|00|”;nocase;_\n_reference:url,https://www.emanueledelucia.net/; sid:[SID HERE]; rev:1;)_\n\nThis domain name has been created on 16/09/2020 and, according to my visibility, at the\ntime of writing it has a history of two (2) A record associated. The interesting one is linked to\nthe IP 185.105.109.19. Could be interested to note that the pDNS count value for this\ndomain name from 21/09/2020 (day of first observed resolution to 185.105.109.19) to\n**05/01/2021 (day of last observed resolution to 185.105.109.19) is less than 180 and that**\nmost of them occurred from early November until today. This suggests a growth of the\nspread and obviously of the R-a-a-S business as well. In general, moreover, this number is\nalso consistent with the low overall volume of DarkSide campaigns observed at least until\nmid-November 2020. This is further confirmed by the payload-side global visibility I can\ndispose of for this malware family.\n\nFollowing are shown detection hits for DarkSide malfamily until the end of the year where it’s\npossible to observe a general increase in the detection rates towards December 2020.\n\n## Welcome to Darkside\n\nOn 11/10/2020 a user posted an announcement titled “[Affiliate Program] Darkside\n_Ransomware” on a Russian-speaking darkweb forum. The text contained in that post_\nofficially started the project’s affiliate program. Press articles has been used in order to\nadvertise the program itself as well as the skills of the group that are “aimed only at large\n_corporations” as originally posted by threat actor itself:_\n\n\n-----\n\nIn the affiliate program are not welcome, among others, English speaking personalities,\nemployees of the secret service, security researchers, the greedy (at least so I seem to\nunderstand) etc.etc.\n\nThere are, moreover, some rules to be respected, like avoiding to target entities within\ncountries belonging to the CIS (Содружество Независимых Государств), including\nGeorgia and Ukraine, or those operating in education, medicine, public and non-profit sector.\n\nAs you might imagine for any other job, there is a selection to go through in order to be\nincluded in the program. This includes an interview to check the candidate’s skills and\nexperiences, such having been affiliated with some other program previously. The group\noffers a Windows and Linux version of DarkSide ransomware plus an admin panel, a leak\nsite, and a CDN system for data storage.\n\n\n-----\n\n## So, do you have ESXi?\n\nAt the end of November 2020, a Linux variant of DarkSide ransomware was uploaded to a\n_well-known online malware repository. It had a detection rate, at the time of upload,_\npractically non-existent. Even at time of writing (Jan 2021) the detection rate is very low\n(2/63). It seems to have a quite different purpose respect to the Windows counterpart. While\nthe latter is born to encrypt all user files on a workstation (documents, images, PDFs and so\non…), the Linux version has been created to damage virtual machines on servers. Indeed,\nthe samples looks for extensions related to VMWare files like .vmdk, .vmem, .vswp and\ngeneric logs formats.\n\nThe ransom note is similar to the Windows one\n\nand the output of the executable, once launched, confirms the focus on ESXi environments\n\n\n-----\n\nas /vmfs/volumes/ is the default location of ESXi virtual machines. A strict Yara rule similar\nto the following can help in identifying Linux variants of DarkSide:\n\n_rule DarkSide_Ransomware_827333_39930 : CRIMEWARE {_\n_meta:_\n_author = “Emanuele De Lucia”_\n_description = “Detects possible variants of Linux DarkSide ransomware variants”_\n_hash1 = “da3bb9669fb983ad8d2ffc01aab9d56198bd9cedf2cc4387f19f4604a070a9b5”_\n_strings:_\n_$ = “vmdk,vmem,vswp,log” fullword ascii_\n_$ = “XChaCha20” fullword ascii_\n_$ = “Partial File Encryption Tool” fullword ascii_\n_$ = “main.log” fullword ascii_\n_condition:_\n_(uint16(0) == 0x457f and all of them)_\n_}_\n\nAlso for the Linux version, communications to the outside world take place through the same\ndomain name previously reported and a specially crafted URL for each victim. Through\nSigma it’s possible to write rules aimed at detecting DNS resolution requests to domain name\nwhere actually the command and control is attested:\n\n_title: Detects resolution requests to DarkSide Command and Control domain name_\n_status: stable_\n_description: Detects resolution requests to DarkSide Command and Control domain name_\n_references:_\n_– https://www.emanueledelucia.net/fighting-the-darkside-ransomware/_\n_author: Emanuele De Lucia_\n_date: 2020/12/01_\n_tags:_\n_– attack.t1071.001_\n_logsource:_\n_category: dns_\n_detection:_\n_selection:_\n_query:_\n\n\n-----\n\n_– securebestapp20.com_\n_condition: selection_\n_falsepositives:_\n_– internal research_\n_level: high_\n\n## Adversary Profile\n\nFrom mid-November 2020, following the affiliation program, it’s currently more difficult to\nassociate the exclusive use of DarkSide ransomware to a specific threat actor.\n\nHowever, some similarities with Revil suggest that its developer may be familiar with this\nsolution until speculating that it may be from a former Revil affiliate who, to have more control\nover the operations and not to divide the profits, launched his own project, further enhanced\nby an independent affiliate program. Regardless the specific actor behind the operations,\n**DarkSide can be delivered via several vectors usually after gathering information about the**\ntarget.\n\nAccording to my visibility, at least one threat actor who used DarkSide adopted the phishing\n[technique (T1566) in order to deliver a first-stage payload whose exploitation finally allowed](https://attack.mitre.org/techniques/T1566/)\nthe distribution of DarkSide variants within the victim environment. Other intrusion techniques\n[involve exploiting vulnerabilities in exposed applications (T1190) in order to get a first](https://attack.mitre.org/techniques/T1190/)\nfoothold from which to perform lateral movements.\n\n## Indicators of Compromise\n\n**Observable** **Description** **Value**\n\n\nsha256 payloaddelivery\n\nsha256 payloaddelivery\n\ndomain networkactivity\n\n\nda3bb9669fb983ad8d2ffc01aab9d56198bd9cedf2cc4387f19f46\n\n17139a10fd226d01738fe9323918614aa913b2a50e1a516e95c\n\nsecurebestapp20.com\n\n\n**Join SOC Prime's Detection as Code platform to improve visibility into threats most**\nrelevant to your business. To help you get started and drive immediate value, book a meeting\nnow with SOC Prime experts.\n\n[Join for Free](https://tdm.socprime.com/signup) Book a Meeting\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-25 - Affiliates vs Hunters- Fighting the DarkSide.pdf"
    ],
    "report_names": [
        "2021-01-25 - Affiliates vs Hunters- Fighting the DarkSide.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536003,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1653751289,
    "ts_modification_date": 1653751289,
    "files": {
        "pdf": "https://archive.orkl.eu/9589f40f7bf925bac26fc8c086ebf19ca3ac71bd.pdf",
        "text": "https://archive.orkl.eu/9589f40f7bf925bac26fc8c086ebf19ca3ac71bd.txt",
        "img": "https://archive.orkl.eu/9589f40f7bf925bac26fc8c086ebf19ca3ac71bd.jpg"
    }
}