{
    "id": "fb6e87cc-555d-429d-bb70-39b1579e2ac1",
    "created_at": "2023-01-12T15:02:09.912901Z",
    "updated_at": "2025-03-27T02:15:46.133075Z",
    "deleted_at": null,
    "sha1_hash": "accdb52d0ecc05baad66350f58fa71f22bd0349e",
    "title": "2014-04-17 - A quick analysis of the latest Shadow Brokers dump",
    "authors": "",
    "file_creation_date": "2022-05-28T04:55:00Z",
    "file_modification_date": "2022-05-28T04:55:00Z",
    "file_size": 3186378,
    "plain_text": "# A quick analysis of the latest Shadow Brokers dump\n\n**[labs.nettitude.com/blog/a-quick-analysis-of-the-latest-shadow-brokers-dump/](https://labs.nettitude.com/blog/a-quick-analysis-of-the-latest-shadow-brokers-dump/)**\n\nNettitude Labs April 17, 2017\n\nJust in time for Easter, the Shadow Brokers released the latest installment of an NSA data\ndump, which contained an almost overwhelming amount of content – including, amongst\nother things, a number of Windows exploits. We thought we’d run some quick analysis on\nvarious elements of said content.\n\n## Before we get started\n\nWe’re going to largely avoid the obvious elements of the dump because there’s already been\na lot of very helpful analysis of those elements. However, before we get to that, here’s what\nyou need to know:\n\nPatch! The majority of the high impact Microsoft vulnerabilities have recently been\naddressed in the MS17-010 patch.\nDisable SMBv1.\nRemove all Windows XP and 2003 machines from your network. These contain\nvulnerabilities that will not be patched.\n\n[The following table (raw data available at https://pastebin.com/5gkb6HLJ and courtesy of](https://pastebin.com/5gkb6HLJ)\n[@etlow) contains some of the more pertinent information.](https://twitter.com/etlow)\n\n\n-----\n\nShadow Brokers Exploit Table\n\nWe can also recommend the following script by Luke Jennings, which is designed to\n\nsweep a network to find Windows systems compromised with the dumps DOUBLEPULSAR\n[implant: https://github.com/countercept/doublepulsar-detection-script](https://github.com/countercept/doublepulsar-detection-script)\n\nWith that out of the way…\n\n## Metadata, or a lack of\n\nThroughout the Equation Group leak via the Shadow Brokers, there are a number of different\nlanguages being used. One interesting element is how it appears that there was originally a\npreference for Perl, that was then replaced with Python – we think that this mirrors how the\noffensive security industry has evolved, too.\n\nAs the age of the dump is pinned at some point in 2013, we would have expected to see a\nlittle bit of PowerShell; this was really starting to come into favor around that time. Now, this\npost isn’t about dropping a new l33t PowerShell technique gained from the dump, but rather\nlooking at what the capability was at the point in time. Staying with the timing of the dump for\na minute, we are reminded of the following series of Tweets from Edward Snowden back in\nAugust last year, when the ShadowBrokers [6] first dropped.\n\n\n-----\n\nWe know we run the risk of taking these out of context, and it is entirely possible that his\nmind has been changed since, however we find the following piece of information interesting.\nAccording to the time line from the Guardian [5], the first release of the material he took was\non the 5 June 2013. It’s probable that other dumps have since has contradicted this and theth\nview of when the hacker/s were kicked off has been able to be narrowed, but we am\nunaware of this (so please if you know different answers on a postcard).\nExamining of the tools makedmgd.exe, part of a toolkit DAMAGEDGOODS that is used\nwithin in a PowerShell delivery framework ZIPO we see the following. One of the first things\nthat we noticed is that yeah hmmm the build date is baked into the exe. Also some different\nimplants not within the dump are there “distantuncle” and “finkdiffernt”; some of the coders\ndefinitely have a certain sense of humor.\n\n\n-----\n\nUsing Sysinternals excellent sigcheck.exe [7] we could view the publisher, version and build\ndate in order to correlate. Yes, it is one of the many ways to list a binarys metadata, but\nsome of its other superb features are that, as the name implies, it will verify the signature if\nthe binary has been signed using Authenticode and it is also able to send the binary straight\nto VirusTotal and look at all files within a directory tree recursively. Running sigcheck,\nunsurprisingly we get the following information or, some would say, a lack of.\n\nAny trace of publisher or company which, to be fair, will be set in Visual Studio (or your\ntoolchain of choice have either been stripped or not set). The Link date is there, which\ncorrelates to the build date, which is also five weeks after Snowden’s material was first\ndropped. It is entirely possible to mess with and edit these dates, of course, before releasing\nthe dump. We do find it strange to go the level of stripping all other information but hard\ncoding a build date, particularly in a tool that will be released to a workstation. The directory\n\n\n-----\n\nstructure that this is in implies it may have been copied in rather than part of a release, as it\nwas new and may not have been sanitised properly (although there is a real danger of\nreading too much into it).\n\n## First steps into PowerShell\n\nAs stated above, we would have expected to see a reasonable amount of PowerShell\nconsidering the year, but actually there is very little. The only real example that we have\nfound is a tool called ZiPo which can be found within the dump at\n/Resources/Ops/Tools/ZiPo. It contains the following tools\n\ndecryptor_downloader.base\nmakedmgd.exe\nZIPO.py\nps_base.txt\npowershellify.py\n\nIn order to run this tool we call ZIPO.py, which first asks you to select a “project” directory\nthen presents a menu asking if we want to:\n\n1. Upload / Create Execute an Egg\n2. Upload/ Create PowerShell script\n3. Create Compressed script to be run manually\n\nNow Egg is a term that is used quite heavily throughout the dump and we’re not entirely sure\nwhat it means at this point in time. Pretty sure it is an Equation Group term.\n\n\n-----\n\nChoosing PowerShell script we are then asking for the location of it, what the IP address and\nport of the “redirector” which we assume is a proxy and then the local IP address and proxy.\nThis is so that the script can spin up a HTTPd listener to serve up the files that have been\ncreated.\n\nIn order to test, we created a very simple PowerShell script containing:\n```\n[System.Reflection.Assembly]::LoadWithPartialName(\"System.Windows.Forms\")\n[System.Windows.Forms.MessageBox]::Show(\"Hey mate, do you wanna run some\npowershell?\", \"you know you want too\", 'Ok')\n\n```\n\n-----\n\nIt has generated a public/private key pair, created an index.html & index.htm, provided us\nwith a script to run on the target and also started up a HTTPd so that we could download the\npayloads on the target. That’s not too bad for a couple of commands.\n\nLooking at the command to run its pretty standard PowerShell from the time, in fact we find it\nreally interesting there is absolutely no attempt at obfuscating anything here. They are\nencrypting the payload and building a chain to download/decrypt etc, but no effort is made at\nhiding what the command is doing or where it is obtaining the script from (of course we\nwould be very interested to see what they are doing now).\n\nSo what is contained within the two index files? Well, index.html is base64 PowerShell script,\nwhich is why it was executed as an encodedCommand; decoding you get the output below. It\nencrypts a known “questionable” password value using RSA, another WebClient is created\nwhich has the encrypted value set as a cookie. The index.html is then downloaded and\n\n\n-----\n\ndecrypted using the key, which is a SHA1 hash of the questionable value . The payload is\nthen executed and on the server the two files are then deleted. This is a lot of effort to hide\nthe final payload and once again absolutely no effort to obfuscate any of the script.\n\nThis is how it looks when it is run:\n\n\n-----\n\n## DAMAGEDGOODS\n\nThe next thing that we did was to just create a meterpreter payload; nothing special and\nwasn’t going to get to connect back, but we felt that AV should still be able to pick it up.\n\nRunning Zipo again, we selected the third option. It asks you for a payload DLL and also the\nordinal [8] that you want to fire. This is where DAMAGEDGOODS comes into play;\nmakedmged.exe is the exe that appears to do some kind of shellcode encoding. In this case\nit takes the encoded binary with a script called ps_base.txt, then compresses/base64\nencodes and then builds a decompression payload around it.\n\n\n-----\n\nThe script that is output at the end of this using the name you supplied is the\ndecode/decompression/execute mentioned above and is shown below.\n\nDecoding it you get the following, which is quite interesting; it’s a PowerShell script that\nallocates memory, writes the shellcode into it, creates a thread and then executes the\n\n\n-----\n\nshellcode, all in memory. The shellcode in this case is going to be the meterpreter DLL that\nwe originally used. Running it multiple times over the same DLL you get a different version.\nThere appears to be some kind of prologue in the shellcode that doesn’t change, but it is\npretty short, running the script multiple times and then diffing with Scooter Software’s\nexcellent Beyond Compare you find that the only section that has changed is the shellcode\nexcept for:\n\nThis series of bytes which appears to be some kind of prologue probably a decoder for the\nrest of the shellcode. What does it do, how does it work? Well that, we’re afraid, is for part 2\nas we’ve spent too much time away from the family already this easter ;o)\n```\n0x68,0xc0,0x1e,0x00,0x00,0xe8,0x00,0x00,0x00,0x00,0x58,0x83,0xc0,0x0b,0x50,0xff,0xd0,0\n\n```\n\n-----\n\n## This kinda looks familiar….\n\nNow the great irony in a dump like this is finding code that appears to have come from\nGitHub but doesn’t appear to have the same licence or any at all for that matter [1]. This\nscript is built from file called ps_base.txt. This is primarily used to dynamically build a type\nthat will eventually hold a function pointer to a native function. This is then used to store the\n\n\n-----\n\nfp s for native functions Win32 functions such as VirtualAlloc[2], GetProcessAddress[3] &\nGetModuleHandle[4] that can be used to perform some actions such as allocating memory\nand looking up the addresses of exports within DLL’s. Further are shown in this screen shot:\n\nNow the method to create the delegate’s used in the above code is:\n\nProgrammers (ourselves included) can be utter sticklers for formatting, so it is conspicuous\nthat there is such a big difference in formatting between the code in ps_base.txt vs\ndecryptor_downloader.base. It’s almost as if ps_base.txt has come from somewhere else.\n\n\n-----\n\nWell funnily enough it bears more than just a striking resemblance to some code from\nPowersploit[1]; screenshots from GitHub are below. Surprisingly not too much effort has\nbeen made to change the method names.\n\n\n-----\n\nAnd also…\n\n\n-----\n\nThe commit date for this code is…\n\nAnd as stated above we have a built date of July 2013; does this mean we will find\nStackOverflow answer code within the dump at some point?\n\nBut anyway back to makedmg.exe running it we get this list of other implants that are not in\nthis dump; obviously still a lot out there.\n\n\n-----\n\n## DOUBLEPULSAR\n\nFrom analysis we did on some implant configuration files, Darkpulsar appears to create a\nservice called ‘dapu’ It also seems that when it upgrades itself it drops the new file using the\nfollowing path: ‘c:\\windows\\system32\\sipauth32.tsp’.\nWe also had a look at tdip.sys driver.\n(sha256:\n\n\n-----\n\nA5EC4D102D802ADA7C5083AF53FD9D3C9B5AA83BE9DE58DBB4FAC7876FAF6D29)\nWe found same magic DWORDs as those mentioned by Kaspersky Labs in the following\nlink: [https://securelist.com/blog/incidents/75812/the-equation-giveaway/ which contains](https://securelist.com/blog/incidents/75812/the-equation-giveaway/)\ninformation from a previous ‘ShadowBrokers’ dump.\nThe following code snippet is taken from tdip.sys:\n```\ntext:000130A0         push  31h\n.text:000130A2         lea   eax, [ecx+4]\n.text:000130A5         movsd\n.text:000130A6         mov   dword ptr [ecx], 0B7E15163h <-------------.text:000130AC         pop   edx\n.text:000130AD\n.text:000130AD loc_130AD:               ; CODE XREF:\nsub_13084+38\n.text:000130AD         mov   esi, [eax-4]\n.text:000130B0         sub   esi, 61C88647h <-----------.text:000130B6         mov   [eax], esi\n.text:000130B8         add   eax, 4\n.text:000130BB         dec   edx\n.text:000130BC         jnz   short loc_130AD\n\n```\nThis driver was most probably used to capture network traffic and it also accepts IOCTLs\nfrom userland. There is probably a relation between this driver and\n“TrafficCapture_Target.dll” module that we found inside the recent ShadowBrokers dump,\nwhich we noticed that it is able to communicate with a kernel driver via IOCTLs.\n\n## Conclusion\n\nKeeping in mind that this is a subset of the techniques that the Equation Group had in 2013,\nwe still find it pretty interesting that just like the rest of the world they were starting to wake\nup to the potential of offensive PowerShell. The lack of any obfuscation i.e attempt to hide\nany of the decryption/download code was another surprise too considering how much “effort”\nhas gone into encrypting the payload over the network at that point. The source of some of\nthe code is intriguing, too.\n\nBut back to the initial thoughts, we probably can be sure that this code was from 2013. Is it\npossible that Ed’s assertion the “hacker squatting lost access in June” may be flawed and\nthey had access until at least the first couple of weeks in July. Assuming SB and no one else\nhas tampered with the metadata within DAMAGEDGOODS, then yes.\n\n[1] [https://github.com/PowerShellMafia/PowerSploit/blob/a233…](https://github.com/PowerShellMafia/PowerSploit/blob/a233d60908d5442214ac6f5726c89f4d0b41418d/CodeExecution/Invoke-DllInjection.ps1)\n\n[2] [https://msdn.microsoft.com/en-us/library/windows/desktop/aa366890(v=vs.85).aspx](https://msdn.microsoft.com/en-us/library/windows/desktop/aa366890(v=vs.85).aspx)\n\n[3] [https://msdn.microsoft.com/en-us/library/windows/desktop/ms683212(v=vs.85).aspx](https://msdn.microsoft.com/en-us/library/windows/desktop/ms683212(v=vs.85).aspx)\n\n[4] [https://msdn.microsoft.com/en-us/library/windows/desktop/ms683199(v=vs.85).aspx](https://msdn.microsoft.com/en-us/library/windows/desktop/ms683199(v=vs.85).aspx)\n\n[5] [https://www.theguardian.com/world/2013/jun/23/edward-snowden-nsa-files-timeline](https://www.theguardian.com/world/2013/jun/23/edward-snowden-nsa-files-timeline)\n\n[6] [https://twitter.com/snowden/status/765515087062982656?lang=en](https://twitter.com/snowden/status/765515087062982656?lang=en)\n\n\n-----\n\n[7] [https://technet.microsoft.com/en-gb/sysinternals/bb897441.aspx](https://technet.microsoft.com/en-gb/sysinternals/bb897441.aspx)\n\n[8] [https://msdn.microsoft.com/en-us/library/e7tsx612.aspx](https://msdn.microsoft.com/en-us/library/e7tsx612.aspx)\n\n[9] [https://www.scootersoftware.com/](https://www.scootersoftware.com/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-04-17 - A quick analysis of the latest Shadow Brokers dump.pdf"
    ],
    "report_names": [
        "2014-04-17 - A quick analysis of the latest Shadow Brokers dump.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535729,
    "ts_updated_at": 1743041746,
    "ts_creation_date": 1653713700,
    "ts_modification_date": 1653713700,
    "files": {
        "pdf": "https://archive.orkl.eu/accdb52d0ecc05baad66350f58fa71f22bd0349e.pdf",
        "text": "https://archive.orkl.eu/accdb52d0ecc05baad66350f58fa71f22bd0349e.txt",
        "img": "https://archive.orkl.eu/accdb52d0ecc05baad66350f58fa71f22bd0349e.jpg"
    }
}