{
    "id": "fb7bf68b-1fa9-453e-95f3-8c57c4c150b2",
    "created_at": "2023-01-12T15:09:03.602044Z",
    "updated_at": "2025-03-27T02:05:36.3142Z",
    "deleted_at": null,
    "sha1_hash": "0d645784094b3fa95fe67fc733110e5ae5bb4eab",
    "title": "2016-11-28 - NetWire RAT Steals Payment Card Data",
    "authors": "",
    "file_creation_date": "2022-05-28T21:53:24Z",
    "file_modification_date": "2022-05-28T21:53:24Z",
    "file_size": 265242,
    "plain_text": "# NetWire RAT Steals Payment Card Data\n\n**[secureworks.com/blog/netwire-rat-steals-payment-card-data](https://www.secureworks.com/blog/netwire-rat-steals-payment-card-data)**\n\nIncident Response Team\n\n_Threat actors used a remote access trojan with keylogging capabilities rather than traditional_\n_point-of-sale malware Monday, November 28, 2016 By: Incident Response Team_\n\n## During an incident response engagement in September 2016, SecureWorks® incident response analysts observed payment card data being collected by a generic remote access trojan (RAT) rather\n\n\n-----\n\n## than typical memory-scraping malware.\n\nIn many payment card data breaches, a point-of-sale (POS) system is infected with malware\nthat searches for specific processes in memory known to store card data in plain text. The\nmalware copies card data from the running processes, a technique known as memory\nscraping, to encoded files on disk. These files are then transmitted to a threat actor, often\nover commonly open ports 80 and 443 (HTTP and HTTPS). The threat actor sells the card\ndata or uses it for fraudulent purchases.\n\nIn the September 2016 incident, SecureWorks analysts observed card data being collected\nby the NetWire RAT instead of traditional POS malware. NetWire has a built-in keylogger that\ncan capture inputs from peripheral devices such as USB card readers. The attack\nmethodology is very similar to traditional POS malware. A threat actor sends a phishing\nemail with a malicious attachment to an employee working on a POS computer. If the\nemployee opens the attachment, malware to harvest card data is downloaded or installed.\nWithout proper security protections in place, these infections can remain undetected for\nmonths or years.\n\nKeyloggers expose more than just card data; credentials for online accounts and applications\nsuch as email, property management systems (PMS), and Internet browsers are at risk.\nOther sensitive information typed by the user, including Social Security numbers, phone\nnumbers, addresses, and birthdates, can also be compromised. Using a RAT with keylogging\ncapabilities, a threat actor could gather necessary information to commit identify theft and\nfurther compromise an organization’s network. The generic NetWire RAT variant used in this\nincident did not contain specific capabilities to target POS systems.\n\n### NetWire Details\n\nThe NetWire RAT variant observed by SecureWorks analysts has the file description\n“TeamViewer 10” (see Table 1); however, this binary is not associated with the legitimate\nTeamViewer application.\n\n\nFilename MD5 Hash Compile\nDate\n\n\nFile Version\n\n10.0.38475.0\n\n\nWindows\nFolder.exe\n\n\n378e72e9e4c7ba4ca\n\n7498a262c501a54\n\n\nMay 30,\n2016\n\n\nFile\nDescription\n\nTeamViewer\n10\n\n\n_Table 1. NetWire RAT binary details._\n\nUpon execution, the “Windows Folder.exe” file copies itself to C:\\Users\\\n_<username>\\AppData\\Roaming and creates a Windows shortcut (LNK) file in the victim’s_\n[Startup directory as a persistence mechanism. The Microsoft Autoruns for Windows tool](https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns)\n\n\n-----\n\nreveals the autostart mechanism that the NetWire RAT creates and uses (see Figure 1). This\npersistence mechanism ensures that NetWire launches automatically when the victim logs\ninto the system.\n\n_Figure 1. NetWire persistence mechanism. (Source: SecureWorks)_\n\nThe “Windows Folder.exe” executable spawns and injects code into the legitimate\nnotepad.exe Windows process (see Figure 2). Process injection helps the malware avoid\ndetection; however, review of active network connections show notepad.exe communicating\nto 185 . 35 . 138 . 227 over port 4588. The notepad.exe process should never have an active\nnetwork connection.\n\n_Figure 2. Child process created by the NetWire RAT. (Source: SecureWorks)_\n\nNetWire logs keystrokes and peripheral inputs into encoded files in the C:\\Users\\\n_<username>\\AppData\\Roaming\\Tobe directory. Encoded files observed by SecureWorks_\nanalysts have a nomenclature of DD-MM-YYYY. SecureWorks Counter Threat Unit™ (CTU)\nresearchers developed a decoder for these keylogger output files and discovered sensitive\ninformation such as track one and track two card data, as well as plain text credentials. The\nfiles also display the window title of the opened application, which reveals which application\nand website the sensitive information was entered. Figure 3 shows an example of a decoded\nkeylogger output.\n\n_Figure 3. Example of decoded keylogger output. (Source: SecureWorks)_\n\n### Conclusion\n\nPayment card data breaches can cause significant financial and reputational damages for an\norganization, and can lead to restrictions imposed by compliance bodies and loss of future\nbusiness. Prevention and detection is critical to ensure that threats to customer data are\nprevented or detected. Traditional antivirus software and other systems that rely on low-level\nindicators do not effectively detect and block common and pervasive malware. Organizations\n[should apply endpoint detection mechanisms that apply behavioral analysis and human](https://www.secureworks.com/capabilities/managed-security/endpoint-security/endpoint-threat-detection)\nintelligence to detect threat actor activity.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-11-28 - NetWire RAT Steals Payment Card Data.pdf"
    ],
    "report_names": [
        "2016-11-28 - NetWire RAT Steals Payment Card Data.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536143,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653774804,
    "ts_modification_date": 1653774804,
    "files": {
        "pdf": "https://archive.orkl.eu/0d645784094b3fa95fe67fc733110e5ae5bb4eab.pdf",
        "text": "https://archive.orkl.eu/0d645784094b3fa95fe67fc733110e5ae5bb4eab.txt",
        "img": "https://archive.orkl.eu/0d645784094b3fa95fe67fc733110e5ae5bb4eab.jpg"
    }
}