{
    "id": "fba6c256-5c56-4b41-bad2-97569d04fb17",
    "created_at": "2023-01-12T15:10:14.243915Z",
    "updated_at": "2025-03-27T02:05:22.357117Z",
    "deleted_at": null,
    "sha1_hash": "2f925b1aa2f98d8178c5b79c47da0e545c592107",
    "title": "2022-02-08 - PrivateLoader The first step in many malware schemes",
    "authors": "",
    "file_creation_date": "2022-05-25T12:20:14Z",
    "file_modification_date": "2022-05-25T12:20:14Z",
    "file_size": 877488,
    "plain_text": "# PrivateLoader: The first step in many malware schemes\n\n**intel471.com/blog/privateloader-malware**\n\nPay-per-install (PPI) malware services have been an integral part of the cybercrime ecosystem for a considerable amount of time. A\nmalware operator provides payment, malicious payloads and targeting information, and those responsible for running the service\noutsource the distribution and delivery. The accessibility and moderate costs allow malware operators to leverage these services as\nanother weapon for rapid, bulk and geo-targeted malware infections.\n\nBy understanding how these services proliferate, defenders can better recognize these campaigns and stop them from wreaking\nhavoc on their organization’s IT stack. This report focuses on the PrivateLoader modular downloader programmed in the C++\nprogramming language connected to an unidentified PPI service. PrivateLoader sits at the front of this operation and communicates\nwith its back-end infrastructure to retrieve URLs for the malicious payloads to “install” on the infected host. As is the case with\ndownloaders tied to PPI services, PrivateLoader communicates a variety of statistics such as which payloads were downloaded and\nlaunched successfully.\n\nDistribution campaigns generally rely on a network of search engine optimization (SEO) enhanced websites that lure unsuspecting\nvictims searching for warez aka pirated software to download and execute malware. A password-protected archive typically is\ndelivered that contains a setup file that embeds and executes multiple malicious payloads on the infected host such as GCleaner,\nPrivateLoader, Raccoon, Redline, Smokeloader and Vidar malware. We assess these campaigns started to incorporate\nPrivateLoader since at least May 2021.\n\nThis report investigates the PPI service behind it and methods operators employ to obtain “installs” and presents details about the\nmalware families the service delivers.\n\n## How PrivateLoader works\n\nThe service behind this PrivateLoader PPI campaign and its operators are unknown, as it was not possible to connect the\ndownloader to a specific underground PPI service at the time of this report. However, we observed PrivateLoader’s main command\nand control (C2) servers also host the administration panel, which is based on the AdminLTE 3 dashboard template. The image\nbelow shows the authentication page:\n\nImage 1: This image depicts the PrivateLoader authentication page.\n\nThe front-end script, which uses the Javascript library app.js, appears to expose functionalities offered to panel users. The table\nbelow describes interesting JavaScript functions in the script:\n\n**FUNCTION** **DESCRIPTION** **[ENDPOINT AND PARAMETERS](https://intel471.com/glossary#:~:text=E-,Endpoint,-A%20computing%20device)**\n\n\n-----\n\n**FUNCTION** **DESCRIPTION** **[ENDPOINT AND PARAMETERS](https://intel471.com/glossary#:~:text=E-,Endpoint,-A%20computing%20device)**\n\nAddNewUser Adds a new user with a specific role. /base/user_reg.php\n\nlogin: User login.\npassword: User password.\nrole: User role as an integer.\n\nsaveUser Modifies an existing user. **/base/user_reg.php**\n\n**user_id: User identifier.**\n**login: New user login.**\n**password: New user password.**\n**role: New user role as an integer.**\n**banned: Banned status as an integer.**\n\n\nAddNewLink Adds a loader link configuration to a payload to\ninstall.\n\nEditStatusLink Updates the status of a loader link\nconfiguration.\n\n\n**/base/link_add.php**\n\n**link_url: Download link to the payload to**\ninstall.\n**link_status: Link status as an integer.**\n**link_geo: Targeted** [geolocation as an](https://intel471.com/glossary#:~:text=G-,Geolocation,-The%20geographical%20location)\ninteger.\n**link_dmethod: Link distribution method**\nas an integer.\n\n**/base/link_edit.php**\n\n**link_id: Loader link identifier.**\n**link_status: New status as an integer.**\n\n\neditUrlLink Edits the URL for a loader link configuration. **/base/link_url_edit.php**\n\n**link_id: Loader link identifier.**\n**link_url: Updated download link.**\n\nremoveLink Removes a loader link configuration. **/base/link_del.php**\n\n**link_id: Loader link identifier.**\n\n\nEditGeoLink\n\nEditGeoLinkIdx\n\n\nUpdates the geolocation targeting for a loader\nlink configuration.\n\n\n**/base/link_edit_geo.php**\n\n**link_id: Loader link identifier.**\n**link_geo: New targeted geolocation as an**\ninteger.\n\n\nsaveLinkInformation Modifies an existing loader link configuration. **/base/link_edit_info.php**\n\n**link_id: Loader link identifier.**\n**link_url: Download link of the payload.**\n**link_status: Status as an integer.**\n**link_geo: Targeted geolocation as an**\ninteger.\n**link_ftype: Selected category identifier of**\nthe payload as an integer.\n**link_countries: Targeted countries as a**\nstring.\n**link_arguments: Arguments to pass to**\nthe payload as a string.\n**link_onlybytype: Integer that indicates to**\nrun the payload only if the category\nidentifier matches.\n**link_subgeo: Subgeolocation as a string.**\n**link_dmethod: Link distribution method**\nas an integer.\n\n\n-----\n\n**FUNCTION** **DESCRIPTION** **[ENDPOINT AND PARAMETERS](https://intel471.com/glossary#:~:text=E-,Endpoint,-A%20computing%20device)**\n\n\nAddNewExtension Adds a configuration to a browser extension to\ninstall.\n\neditUrlExtension Edits the URL for a browser extension\nconfiguration.\n\n\n**/base/extension_add.php**\n\n**extension_url: Download link to the**\nbrowser extension to install.\n**config_url: Download link to the**\nconfiguration of the browser extension.\n**ext_status: Extension status as an**\ninteger.\n**ext_geo: Targeted geolocation as an**\ninteger.\n\n**/base/extension_url_edit.php**\n\n**extension_id: Extension identifier.**\n**ext_url: New link to the extension.**\n**cfg_url: New link to the extension**\nconfiguration.\n\n\nremoveExtension Removes a browser extension configuration. **/base/extension_del.php**\n\n**ext_id: Extension identifier.**\n\n\nsaveExtensionInformation Modifies an existing browser extension\nconfiguration.\n\nLoadFileToEncrypt Encrypts a file. Possibly uses the byte\nsubstitution and XOR algorithm described in the\nMalware Report\n\nCalculateAllLinksLoads Returns the number of total and unique installed\npayloads for all link identifiers.\n\nCalculateCurrentLinksLoads Returns the number of total and unique installed\npayloads for a link identifier.\n\n## Delivering the PrivateLoader downloader\n\n\n**/base/extension_edit_info.php**\n\n**ext_id: Extension identifier.**\n**ext_url: Download link of the extension.**\n**cfg_url: Download link of the extension**\nconfiguration.\n**ext_status: Extension status as an**\ninteger.\n**ext_geo: Targeted geolocation as an**\ninteger.\n**ext_countries: Targeted countries as a**\nstring.\n\n**/base/file_crypt.php**\n\nMultipart form POST request with the file to\nencrypt.\n\n**/base/logger_counter.php**\n\n**ids: All link identifiers.**\n\n**/base/logger_counter.php**\n\n**ids: Single link identifier.**\n\n\nPrivateLoader is delivered through a network of websites that claim to provide “cracked” software, which is modified versions of\npopular legitimate applications that people commonly use. These websites are SEO optimized and usually appear at the top of\nsearch queries that contain keywords such as “crack” or “crack download,” preceded by the software name.\n\nFor example, a search for “Malwarebytes crack” returns the following websites as the fourth and fifth results:\n\n\n-----\n\nThis image depicts “Malwarebytes crack” search results.\n\nVisitors are lured into clicking a “Download Crack” or “Download Now” button to obtain an allegedly cracked version of the\nsoftware. The JavaScript for the download button is retrieved from a remote server.\n\nThis image depicts an option to allegedly download a cracked version of the software.\n\nAfter a few redirections, the final payload is served to the user as a password-protected compressed (.zip) archive. The screenshot\nbelow shows the actual download page:\n\nThis image depicts the download page.\n\nIn our example, the archive served was named “PASSWORD_IS_324325____Malwarebytes-Pr.zip.” It contained a Nullsoft\nScriptable Install System (NSIS) installer named “setup_x86_x64_install.exe,” which embeds and executes numerous malicious\npayloads such as GCleaner, PrivateLoader and Redline.\n\nResearchers from SophosLabs previously investigated this delivery network and tied some of its infrastructure to the InstallUSD\nPPI service.\n\n## Malware families dropped\n\nAutomated malware coverage and tracking for PrivateLoader started in early September 2021. We have since gathered sizable\namounts of data that helped us learn more about the service.\n\nThe following chart shows the number of unique hashes downloaded by PrivateLoader for each malware family our Malware\nIntelligence systems detected. The most popular families this PPI service distributed in descending order were Smokeloader,\nRedline and Vidar:\n\n\n-----\n\nThis chart shows the number of unique hashes downloaded by PrivateLoader for each malware family our Malware Intelligence systems\n\ndetected.\n\nEach PrivateLoader sample embeds a region code that is communicated to the C2 server and country of the bot. The chart below\ndepicts the number of unique hashes downloaded per region code in the duration of coverage. We believe the “WW” prefix in these\nregion codes stands for “worldwide,” since it was most commonly found in samples. On the panel side, we suspect this code\nrepresents the “link_geo” parameter described in the previous table.\n\nThis chart depicts the number of unique hashes downloaded per region code.\n\nHowever, we observe a different distribution when querying the number of unique hashes by bots’ country codes (see: chart below).\nThis is expected since popular worldwide region codes encapsulate multiple countries.\n\n\n-----\n\nThis chart depicts the number of unique hashes downloaded per country code.\n\n## Smokeloader\n\nOf the payloads we saw pushed by PrivateLoader, the most common was Smokeloader. The following chart shows the extracted\naffiliate IDs (or lack thereof) from all unique Smokeloader samples detected by our Malware Intelligence systems:\n\nThis chart shows the percentage of extracted affiliate IDs from all unique Smokeloader samples detected by our Malware Intelligence\n\nsystems.\n\nThe top 10 detected domains used to deliver Smokeloader included:\n\n**HOST NAME** **UNIQUE SAMPLES DOWNLOADED**\n\nprivacytoolz123foryou[.]top 321\n\nthreesmallhills[.]com 296\n\nprivacy-toolz-for-you-5000[.]top 264\n\nprivacytoolzforyou-7000[.]top 231\n\nprivacytoolzforyou-7000[.]com 212\n\nprivacytoolzforyou7000[.]top 200\n\nprivacytoolzforyou-6000[.]top 179\n\n\n-----\n\n**HOST NAME** **UNIQUE SAMPLES DOWNLOADED**\n\nprivacy-toolz-for-you-403[.]top 177\n\nprivacy-tools-for-you-777[.]com 150\n\nprivacytoolzforyou6000[.]top 136\n\nIt’s apparent the operators running the “Privacy tools” domains heavily rely on PrivateLoader to deliver Smokeloader. An inspection\nof active distribution URLs showed these domains host a website that claims to offer “Privacy Tools.” This website likely is spoofing\nthe real PrivacyTools[.]io website run by volunteers who advocate for data privacy.\n\nThis image depicts the landing page of one of the “Privacy tools” domains.\n\nThese websites host Smokeloader payloads as part of three categories named “pab1”, “pab2” and “pab3”. These are not necessarily\nlinked to the analogous “pub*” affiliate IDs, since we have seen some “pab2” payloads with the “555” affiliate ID. While tracking\nPrivateLoader, we only received links to download the “pab2” payloads from these websites. It is likely these operators use other\nmethods or PPI services to distribute the Smokeloader family.\n\nOn Oct. 22, 2021, a “pab2” Smokeloader sample downloaded by PrivateLoader from one of these websites delivered the Qbot\n[banking trojan. This is an unusual distribution method for Qbot and revealed the new botnet ID star01.](https://intel471.com/glossary#:~:text=B-,Banking%20Trojan,-Malicious%20software%20designed)\n\n## Banking trojans\n\nThere are other actors throughout the underground that leverage PrivateLoader for banking trojan distribution.\n\nOn Oct. 31, 2021, PrivateLoader bots connecting from European countries were instructed to download and execute the Kronos\nbanking trojan from the following URL:\n\nhxxp://2.56.59[.]42/EU/Yandex1500[.]exe\n\n[The downloaded sample also executed the Vidar information stealer. The download and execute commands for this sample stopped](https://intel471.com/glossary#:~:text=a%20computer%20intrusion.-,Information%20Stealer,-Malicious%20software%20designed)\nthe following day.\n\nOn Nov. 1, 2021, PrivateLoader bots downloaded Dridex samples tied to the 10444 botnet, and Danabot with the affiliate identifier\n40. The same day, bots also downloaded Trickbot samples with the group tags (gtags) lip*, tot* and top*. In all cases, the delivered\nsamples embedded other malware families such as other banking trojans, information stealers or ransomware.\n\n\n**OTHER**\n**DETECTED**\n**FAMILIES**\n\n\n**FIRST SEEN**\n**(UTC)**\n\nNanocore\nRAT\n\nSmokeloader\n\nRedline\n\n\n**LAST**\n**SEEN**\n**(UTC)**\n\n\n**SAMPLE HASH**\n\n\n**MALWARE**\n**FAMILIES**\n\n\n14e7cc2eadc7c9bac1930f37e25303212c8974674b21ed052a483727836a5e43 Trickbot:\ntop142\n\n\n-----\n\n**OTHER**\n**DETECTED**\n**FAMILIES**\n\n\n**FIRST SEEN**\n**(UTC)**\n\nTofsee\n\nRedline\n\nnjRAT\n\nSTOP Djvu\n\nRedline\n\nVidar\n\nRemcos\n\nTofsee\n\nRedline\n\nSmokeloader\n\nRedline\n\nRedline\n\nRedline\n\nQuasarRAT\n\nSmokeloader\n\nLockbit\n\nRedline\n\n\n**LAST**\n**SEEN**\n**(UTC)**\n\n\n**SAMPLE HASH**\n\n\n**MALWARE**\n**FAMILIES**\n\n\n4554dc95f99d6682595812b677fb131a7e7c51a71daf461a57a57a0d903bb3fa Trickbot:\ntot160\n\nTrickbot:\ntop141\n\nDridex:\n10444\n\n4ed7609cbb86ea0b7607b8a002e7f85b316903c3b6801240c9576aae8b3052ff Trickbot:\nlip143\n\nTrickbot:\ntop142\n\n5adbe8d0375d6531f1a523085f4df4151ad1bd7ae539692e2caa3d0d73301293 Trickbot:\nlip142\n\nDridex:\n10444\n\n6abbd89e6ab5e1b63c38a8f78271a97d19bafff4959ea9d5bd5da3b185eb61e6 Trickbot:\ntop141\n\n929a591331bdc1972357059d451a651d575166f676ea51daaeb358aa2a1064b7 Dridex:\n10444\n\naae0553b761e8bb3e58902a46cd98ee68310252734d1f8d9fd3b862aab8ed5c9 Trickbot:\nlip142\n\nbf7b5f72b2055cfc8da01bb48cf5ae8e45e523860e0b23a65b9f14dbdbb7f4ee Trickbot:\nlip141\n\nTrickbot:\ntop141\n\nTrickbot:\ntop142\n\nDridex:\n10444\n\nDanabot:\naffid 40\n\neef15f6416f756693cbfbfd8650ccb665771b54b4cc31cb09aeea0d13ec640cf Trickbot:\nlip141\n\nTrickbot:\nlip142\n\nTrickbot:\nlip143\n\nTrickbot:\ntop141\n\n\n-----\n\n**OTHER**\n**DETECTED**\n**FAMILIES**\n\n\n**FIRST SEEN**\n**(UTC)**\n\nRedline\n\nRedline\n\n\n**LAST**\n**SEEN**\n**(UTC)**\n\n\n**SAMPLE HASH**\n\n\n**MALWARE**\n**FAMILIES**\n\n\nf9246be51464e71ff6b37975cd44359e8576f2bf03cb4028e536d7cfde3508fc Trickbot:\nlip141\n\nTrickbot:\nlip142\n\nfcc49c9be5591f241ffd98db0752cb9e20a97e881969537fba5c513adbd72814 Trickbot:\nlip142\n\nDridex:\n10444\n\n\nThe sample with the hash 929a591331bdc1972357059d451a651d575166f676ea51daaeb358aa2a1064b7 that embedded both Dridex\nand Smokeloader was downloaded from the following URL:\n\n```\nhxxp://privacytoolzfor-you6000[.]top/downloads/toolspab2.exe\n\n```\n\nIn the previous subsection, we linked the “Privacy tools” websites to Smokeloader operators. It is unclear whether the operators\nbehind these websites operated the Dridex 10444 botnet or only acted as a link in the delivery chain. However, we can assume the\n“Privacy tools” website was used for distribution since the same Dridex botnet identifier and controllers were seen across different\nhashes and delivery URLs during this period.\n\nSeeing downloads for Danabot, Dridex, Kronos and Trickbot for the first time within the same time frame hardly can be regarded as\na coincidence. Moreover, these trojans often were bundled with each other. Therefore, we assess a single entity likely operating\nthese specific botnets was using the PrivateLoader PPI service at the time.\n\nOn Nov. 14, 2021, PrivateLoader bots started to download samples of the Danabot banking trojan with the affiliate ID 4 for a single\nday.\n\nBased on these short outbursts that lasted no more than a day, we suspect the banking trojan operators were experimenting with\nthis PPI service as another delivery mechanism for their malware.\n\n## Ransomware\n\nUnderground PPI services generally advise against deploying ransomware on target machines since it renders them unusable.\nHowever, cybercriminals have a reputation of not adhering to rules and deploy ransomware anyway.\n\nThe only time in which we detected ransomware samples downloaded by PrivateLoader was when it dropped banking trojans in\nearly November 2021. The table in the previous subsection showed downloads for the LockBit and STOP Djvu ransomware families.\n\nWhile analyzing payloads downloaded by PrivateLoader, we identified a new loader we dubbed Discoloader. Discoloader was\nwritten using the .NET framework and uses the Discord content delivery network (CDN) to host its payload. Although not directly\nfrom PrivateLoader, we observed samples of this family delivering Conti ransomware directly into infected hosts, which is an\nuncharacteristic delivery mechanism since this family typically only is deployed after total compromise of enterprise networks.\n\n## Conclusion\n\nPPI services have been a pillar of cybercrime for decades. Just like the wider population, criminals are going to flock to software\nthat provides them a wide array of options to easily achieve their goals. As we have detailed, criminals have used PrivateLoader to\nlaunch all kinds of schemes. By highlighting the versatility of this malware, we hope to give defenders the chance to develop unique\nstrategies in thwarting malware attacks empowered by PrivateLoader.\n\n## MITRE ATT&CK techniques\n\nThis report uses the MITRE Adversarial Tactics, Techniques and Common Knowledge (ATT&CK) framework.\n\n**TECHNIQUE TITLE** **ID** **USE**\n\n**Resource Development [TA0042]**\n\n\n-----\n\n**TECHNIQUE TITLE** **ID** **USE**\n\n\nStage Capabilities:\nUpload Malware\n\n**[Persistence [TA0003]](https://intel471.com/glossary#:~:text=of%20the%20system.-,Persistence,-Techniques%20adversaries%20use)**\n\nCreate or Modify\nSystem Process:\nWindows Service\n\nScheduled Task/Job:\nScheduled Task\n\n\nT1608.001 PrivateLoader often hosts malicious payloads on the Discord CDN.\n\nWe observed recent controllers downloading attachments from just the\n891006172130345095, 905701898806493199 and 896617596772839426 IDs.\n\nT1543.003 PrivateLoader can be persisted as a startup service and is installed with the following\nattributes:\n\nService name: PowerControl.\nService display name: \"Power monitoring service for your device.\"\nService start type: At system startup.\nService binary path: C:\\Program Files. (x86)\\PowerControl\\PowerControl_Svc.exe.\n\nT1053.005 The PrivateLoader service module always persists as a scheduled task that executes\nevery hour. It also can be persisted as a logon scheduled task when a Windows service is\nnot used.\n\n\nBrowser Extensions T1176 PrivateLoader can download and silently install malicious browser extensions on Google\nChrome and Microsoft Edge browsers.\n\n**[Privilege Escalation [TA0004]](https://intel471.com/glossary#:~:text=Privilege%20Escalation)**\n\n\nAbuse Elevation\nControl Mechanism:\nBypass User Account\nControl\n\n\nT1548.002 The PrivateLoader core module uses a Windows 10 user account control (UAC) bypass\ntechnique to elevate privileges. The bypass uses a widely documented technique involving\nthe ComputerDefaults.exe system executable (.exe) file, which has the auto-elevate option\nset.\n\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-08 - PrivateLoader The first step in many malware schemes.pdf"
    ],
    "report_names": [
        "2022-02-08 - PrivateLoader The first step in many malware schemes.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536214,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1653481214,
    "ts_modification_date": 1653481214,
    "files": {
        "pdf": "https://archive.orkl.eu/2f925b1aa2f98d8178c5b79c47da0e545c592107.pdf",
        "text": "https://archive.orkl.eu/2f925b1aa2f98d8178c5b79c47da0e545c592107.txt",
        "img": "https://archive.orkl.eu/2f925b1aa2f98d8178c5b79c47da0e545c592107.jpg"
    }
}