{
    "id": "fbc7d572-a1e1-48ad-ada6-3eb3141efaaf",
    "created_at": "2023-01-12T15:05:57.469711Z",
    "updated_at": "2025-03-27T02:05:52.864233Z",
    "deleted_at": null,
    "sha1_hash": "82f49b48dab03deb7d374c8bbfc98506abef60d6",
    "title": "2021-12-02 - Structured threat hunting- One way Microsoft Threat Experts prioritizes customer defense",
    "authors": "",
    "file_creation_date": "2022-05-28T00:31:00Z",
    "file_modification_date": "2022-05-28T00:31:00Z",
    "file_size": 544203,
    "plain_text": "# Structured threat hunting: One way Microsoft Threat Experts prioritizes customer defense\n\n**microsoft.com/security/blog/2021/12/02/structured-threat-hunting-one-way-microsoft-threat-experts-prioritizes-**\ncustomer-defense/\n\nDecember 2, 2021\n\n**_Update [5/9/2022]: In line with the recently announced expansion into a new service_**\n_[category called Microsoft Security Experts, we’re introducing the availability of Microsoft](https://www.microsoft.com/security/business/services)_\n_Defender Experts for Hunting for public preview. Defender Experts for Hunting is for_\n_customers who have a robust security operations center but want Microsoft to help them_\n_proactively hunt for threats across Microsoft Defender data, including endpoints, Office 365,_\n_cloud applications, and identity._\n\nToday’s threat landscape is incredibly fast-paced. New campaigns surface all the time, and\nthe amount of damage that they can cause is not always immediately apparent. Security\noperations centers (SOCs) must be equipped with the tools and insight to identify and\nresolve potentially high-impact threats before attackers set up persistence mechanisms,\nexfiltrate data, or deploy payloads such as ransomware.\n\nEvery day at Microsoft, threat hunters work alongside advanced systems to analyze billions\nof signals, looking for threats that might affect customers. Due to the sheer volume of data,\nwe’re meticulous about surfacing threats that customers need to be notified about as quickly\nand accurately as possible. This helps ensure that customers can respond to the most\ncritical threats in their environments through our products and services, such as Microsoft\nThreat Experts, a managed threat hunting service that provides expert-level monitoring and\n\n\n-----\n\n[analysis. With Microsoft Threat Experts, customers get Targeted Attack Notifications, which](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/microsoft-threat-experts?view=o365-worldwide#microsoft-threat-experts---targeted-attack-notification)\nare designed to identify the most important risks and provide technical information, as well as\nhunting and mitigation guidance. Customers can also consult with our analysts through\n[Experts on Demand.](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/configure-microsoft-threat-experts?view=o365-worldwide#subscribe-to-microsoft-threat-experts---experts-on-demand)\n\nMicrosoft Threat Experts allows organizations to collaborate with Microsoft analysts to\nbenefit from their expertise in tackling critical incidents. This collaborative relationship also\ngives Microsoft analysts the opportunity to gain invaluable insight into real-world threats, how\nattackers operate inside enterprise networks, and how security operations teams function.\nThis creates an environment conducive to mutual learning and innovation, which helps\nimprove our processes, protections, and services.\n\nOne way we support this close collaboration with customers is through a structured approach\nto threat hunting. Human analysts are augmented by AI in the search for potential threats to\nour customers. AI helps our human analysts tease out which events in our data require\ncloser examination. Humans drive the initial hunt, then validate the AI’s findings, and provide\ndeeper analysis and context for each potential threat. By combining what humans and AI are\neach individually good at, we’re able to process data at speed and scale. The process\nultimately decides which potential threats to address first.\n\nOur strategy is designed to evaluate impact and escalate potential threats for investigation,\nbased on how damaging the potential threat would be if it was found to be valid. Our strategy\nis also designed for speed: due to the highly time-sensitive nature of the threat response, our\nsecurity analysts need to be confident that the most dangerous potential threats are\nanalyzed first.\n\nThis process starts with Microsoft analysts formulating hypotheses to explain suspicious\nbehavior discovered within our data. If the hypotheses pass our initial quality checks, we\nperform an automated hunt for and collect observations that could ultimately confirm or deny\nour suspicions.\n\nOnce we’ve gathered more evidence, the observations are grouped into potential threats and\nrun through a variety of computations to evaluate the possible impact. One of the key figures\nwe use for evaluating potential threats is the amount of diversity we see across our\nobservations. A more diverse set of observations indicates that a potential threat is more\nlikely to have a broad impact.\n\n\n-----\n\n_Figure 1. Visual overview of the prioritization process._\n\nThe computations on the impact of the potential threat are then combined, to calculate a final\npriority score. The priority score is used to sort potential threats according to how likely they\nare to require urgent attention. Potential threats that are more likely to have a devastating\nimpact are given higher priority scores, so that they can be addressed more quickly.\n\nSeasoned threat experts investigate and analyze the potential threat once it is ready. If the\nthreat is found valid, our analysts conduct a deep-dive investigation, gathering the\ninformation our Microsoft Threat Experts customers need to keep themselves safe. They\ncollect technical details and develop security recommendations. Affected customers are\nimmediately notified with targeted attack notifications, containing detailed information on\nwhat the threat is, and what they can do to defend themselves. These steps are summarized\nin Figure 1.\n\nOur process uses automated hunting and AI to speed up the decision-making, while humans\ndefine the observables, adjust and tune the parameters, perform triage, and craft the\ntargeted attack notifications sent to affected customers. A deeper look at our process will\nshow how analysts work closely alongside automation to help protect customers.\n\n## Hunting for potential threats\n\nAs the first step in our process, threat hunters formulate a hypothesis around data related to\na potential threat, such as, “The attacker remotely executed code by exploiting a vulnerability\nin a system process.” After validating the soundness of the hypothesis by measuring the\nsignal-to noise ratio and using known data sets to ensure that the accuracy is within\nacceptable limits, the hypothesis is modeled in our hunting systems, which automatically\nperform data collection, correlation, and enrichment.\n\nThese automated systems collect observations through our telemetry, from multiple devices\nand often from different stages of an attack. Each observation represents a single instance of\na hypothesis – in our example, here is the system process, here is what the system process\n\n\n-----\n\ndid, and here are the arguments that were passed to it. Examining the observations\nassociated with the hypothesis helps analysts determine if that instance of the hypothesis is\nvalid.\n\nObservations are then grouped into potential threats that represent our best current\nunderstanding of a collection of observations. If these observations truly reflect malicious\nbehavior, the picture they paint is that of an attack on a customer’s computing infrastructure.\nLooking at data associated with these observations can help us understand which potential\nthreats may wreak the most havoc, and prioritize the investigation of more critical threats.\n\n## Developing priorities\n\nIf a potential threat is malicious, it is more likely to cause critical damage if it involves many\ndevices inside an organization and is associated with many distinct attack stages. A\nconfirmed threat that involves a single observation and is confined to an isolated machine is\nless likely to have the same level of impact.\n\nSimilarly, a potential threat is more likely to have more impact if it involves observations\nsupporting many different hunting hypotheses. If the potential threat is malicious, a greater\nvariety of hypotheses reflects a broad-ranging attack that hits many parts of the\norganization’s infrastructure in many different ways.\n\nTherefore, a potential threat with more diverse hypotheses is more likely to have a big impact\non our customers, and is prioritized for investigation by Microsoft Threat Experts.\n\n### Using diversity to prioritize potential threats\n\nHow can we measure the diversity of different aspects of a potential threat? Microsoft Threat\nExperts uses entropy, borrowed from information theory. Entropy measures how many bits\n(or yes/no questions) it would take, on average, to identify a random element of a set if we\nknow the elements of the set.\n\n\n-----\n\n_Figure 2. A visual representation of entropy, demonstrating how sets with many distinct_\n_elements have higher entropy than sets with fewer distinct elements._\n\nA set containing elements that are all alike has zero entropy. Meanwhile, a set with more\ndistinct elements, or the distinct elements in more equal proportions, will have higher entropy.\n\nWe use entropy to help decide which potential threats need swift attention, by calculating it\nfor several attributes that the observations in each potential threat might have. For example,\nwe calculate the entropy for the hypotheses associated with observations for each potential\nthreat. We also calculate the entropy for the MITRE techniques associated with the\nobservations in the potential threat.\n\nAfter the AI automatically calculates an entropy value for each of these categories, and\nvalues for other factors, such as the severity of the hypothesis for each of the observations\ninvolved, it combines these values together to create an overall priority score for the threat.\n\n### Calculating the final priority score\n\nSince our final score takes into consideration many different kinds of information about the\npotential threat, we need a way to combine these values. To do this, we convert each the\nresults of each calculation into a p-value.\n\n\n-----\n\nA p-value represents the percentage of potential threats we d expect to have a certain value\nor larger in that category. For example, if only 5% of the MITRE technique entropy values\nwere larger than the value from our calculation, then the p-value for our potential threat’s\nhypothesis entropy would be 0.05.\n\nWe do this same p-value conversion using other numbers we’ve generated from the same\npotential threat, some based on entropy and others not. We then [combine all of these p-](https://arxiv.org/abs/1707.06897)\nvalues into a final priority score.\n\n### Validating the potential threat\n\nThe final prioritization score is used to sort potential threats, so that the most critical potential\nthreats are analyzed the most quickly. When a potential threat is ready, a dedicated team of\nsecurity experts look over the results and perform deep analysis to determine the threat’s\nvalidity.\n\nThe analysts closely investigate suspicious activity related to the potential threat, using\ninformation from possibly-affected devices and networks. They search for unexpected events\non the device timeline, indicators of compromise, and other evidence that something\nmalicious may have occurred.\n\nIf the threat is validated and the activity is found to be malicious, our experts set to work to\ndetermine the full scope and protect customers. Related activity surrounding the validated\nthreat is tracked down, technical details about the systems affected are gathered, and the\nteam develops security recommendations to defend against the threat.\n\n## Microsoft Threat Experts: Helping defenders help themselves\n\nWhenever [we discover and validate a critical threat in the environment of a Microsoft Threat](https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/microsoft-threat-experts-case-studies-for-managed-threat-hunting/ba-p/358244)\nExperts customer, we immediately send out a targeted attack notification. These are special\nalerts that provide deep context about the threat, with details specific to each customer’s\nunique environment.\n\nTargeted attack notifications aim to help SOCs formulate a response before a critical attack\ncan wreak havoc on their network. They help highlight the most critical threats, and clearly\nidentify the ones that need aggressive handling. They also contain key technical details,\nwhich can assist SOCs in swiftly handling an ongoing threat. Customers receive a timeline of\nobserved events in their organization, as well as advanced hunting queries for surfacing\nthreat activities. These details can aid in understanding the attack flow and discovering the\nscope of the threat.\n\n### A case study in prioritization\n\n\n-----\n\nOur process can fill the gaps to realize the true scope of a potential threat. Recently, there\nwas a potential threat involving pre-ransomware activity detected by our machine learning.\nOutside of the context provided by Microsoft Threat Experts, it appeared as if this was just\nanother instance of a widespread Qakbot campaign. It did not initially appear that this threat\nwas any more dangerous than similar instances of the same campaign.\n\nHowever, the Microsoft Threat Experts prioritization process had pieced together the\nevidence to suggest that the threat could represent one of the most impactful attacks seen\nthat month. The potential threat was associated with a diverse collection of hunting\nhypotheses, as measured by entropy, and thus held a high priority for active investigation by\nMicrosoft Threat Experts. Since the process evaluated it to be very high priority, Microsoft\nThreat Experts quickly assessed the potential threat.\n\nThe potential threat was found not only to be valid, but to be every bit as dangerous as\nsuggested: although the techniques were largely typical of the ongoing Qakbot campaign,\nthere was an especially swift progression to reconnaissance and credential theft. In addition,\nbecause of the method the attacker used to launch the backdoor, the activity was detected\nand alerted on, but not fully remediated.\n\n_Figure 3. The flow of a more typical Qakbot infection. In this atypical case, human operators_\n_began late stage, hands-on-keyboard reconnaissance soon after initial entry._\n\nThis sort of progression was not normally associated with the flow of an initial entry\ncampaign, but with human operators attempting lateral movement. The attacker seemed to\nbe rushing to find out as much as they could, to deal out maximum damage. Furthermore,\nMicrosoft hunters had identified these same techniques being used in ransomware attacks,\nstrongly indicating that the operators might soon move to ransom the organization’s devices.\nQakbot has been known to facilitate ransomware-as-a-service (RaaS) activity. In the RaaS\n\n\n-----\n\nmodel, a RaaS operator works with affiliates and provides tools for launching ransomware\nattacks. The affiliates deploy ransomware payloads by purchasing access to networks with\nexisting malware infections like Qakbot.\n\nAnalysts at Microsoft Threat Experts immediately alerted the organization and provided\nadvice on how to deal with the validated threat. Security researchers and experts at\nMicrosoft Threat Intelligence Center (MSTIC) and Microsoft Detection and Response Team\n(DART) provided further help to prevent the attack from escalating. This aided the defenders\nat the targeted organization as they moved to remediate the threat. The collaboration\nbetween Microsoft and the targeted organization ultimately succeeded in stopping the attack.\nIn spite of the attackers achieving broad lateral movement across the organization and\nnearly achieving their objective, the organization was not ransomed and were able to\nrecover.\n\n### Empower your organization\n\n[In this example, and many others, notifications from Microsoft Threat Experts can be](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/microsoft-threat-experts)\ninvaluable to decreasing the damage threats pose to organizations. Thoroughly warned of\nthe threat at hand, organizations can take immediate action to remediate the threat using\ninformation from the notification, and perform further analysis with the suite of investigation\ntools available through Microsoft Defender for Endpoint.\n\n[Targeted attack notifications aren’t the only kind of assistance available through Microsoft](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/microsoft-threat-experts#microsoft-threat-experts---targeted-attack-notification)\nThreat Experts. Organizations can also send inquiries to our analysts, through purchasing\n[Experts on Demand. By consulting with analysts through Experts on Demand, customers](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/microsoft-threat-experts#microsoft-threat-experts---experts-on-demand)\ncan get more context on an alert, gain clarity on the root cause of an incident, or receive\npersonalized guidance on how to protect their organization.\n\nThrough Microsoft Threat Experts, SOCs are empowered to act quickly and decisively. Learn\n[how your organization can get expert level monitoring and analysis through Microsoft Threat](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/microsoft-threat-experts)\nExperts.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-02 - Structured threat hunting- One way Microsoft Threat Experts prioritizes customer defense.pdf"
    ],
    "report_names": [
        "2021-12-02 - Structured threat hunting- One way Microsoft Threat Experts prioritizes customer defense.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535957,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1653697860,
    "ts_modification_date": 1653697860,
    "files": {
        "pdf": "https://archive.orkl.eu/82f49b48dab03deb7d374c8bbfc98506abef60d6.pdf",
        "text": "https://archive.orkl.eu/82f49b48dab03deb7d374c8bbfc98506abef60d6.txt",
        "img": "https://archive.orkl.eu/82f49b48dab03deb7d374c8bbfc98506abef60d6.jpg"
    }
}