{
    "id": "fbffefe9-04d7-468c-9ff1-144d361a298e",
    "created_at": "2023-02-02T02:08:01.721412Z",
    "updated_at": "2025-03-27T02:06:15.811765Z",
    "deleted_at": null,
    "sha1_hash": "bc1e2e1187a66bc840871e32c653a0956f75e214",
    "title": "2022-12-29 - New CatB Ransomware Employs 2-Year Old DLL Hijacking Technique To Evade Detection",
    "authors": "",
    "file_creation_date": "2023-02-01T07:41:01Z",
    "file_modification_date": "2023-02-01T07:41:01Z",
    "file_size": 1843729,
    "plain_text": "# New CatB Ransomware Employs 2-Year Old DLL Hijacking Technique To Evade Detection\n\n**[minerva-labs.com/blog/new-catb-ransomware-employs-2-year-old-dll-hijacking-technique-to-evade-detection/](https://minerva-labs.com/blog/new-catb-ransomware-employs-2-year-old-dll-hijacking-technique-to-evade-detection/)**\n\nBlog\n\nNatalie Zargarov\n  | \n29.12.22\n  | \n4 Minutes Read\n[We recently discovered ransomware, which performs MSDTC service DLL Hijacking to](https://en.wikipedia.org/wiki/Microsoft_Distributed_Transaction_Coordinator#:~:text=The%20Microsoft%20Distributed%20Transaction%20Coordinator,message%20queues%2C%20and%20file%20systems.)\nsilently execute its payload. We have named this ransomware CatB, based on the contact\nemail that the ransomware group uses. The sample was first uploaded to VT on November\n23, 2022 and tagged by the VT community as a possible variant of the Pandora\nRansomware. The assumed connection to the Pandora Ransomware was due to some\nsimilarities between the CatB and Pandora ransom notes. However, the similarities pretty\nmuch end there. The CatB ransomware implements several anti-VM techniques to verify\nexecution on a “real machine”, followed by a malicious DLL drop and DLL hijacking to evade\ndetection.\n\nCatB ransomware contains two files, the dropper (version.dll), packed with UPX, and the\nransomware payload (oci.dll). The dropper handles anti-VM checks, dropping the\nransomware payload and executing it.\n\n### Anti-VM\n\n[CatB dropper implements three anti-VM/sandbox evasion techniques:](https://minerva-labs.com/blog/malware-evasion-techniques-sandbox-evasion/)\n\n**Processor core check – Real computers nowadays all have at least two processors,**\nso if the ransomware detects only one CPU core, that would be a strong indicator that it\nis currently residing on in a sandbox.The ransomware retrieves system information by\nGetSystemInfo API function and checks the number of processors. If there are less\nthan two processors, it exits and does not execute.\n\n_Figure 1 – Processor check_\n\n\n-----\n\n**Total Physical memory check – As opposed to virtual machines, real machines today**\nall have at least 2GB RAM, and usually have between 4GB and 32GB. The CatB\nRansomware detects VMs/sandboxes by checking physical memory size. This is done\nby retrieving the information about both the physical and virtual memory using the\nGlobalMemoryStatusEx API function. In our case, the ransomware checks and exits if\nthe machine has at less than 2GB of physical memory.\n\n_Figure 2 – Physical memory check_\n\n**Hard Drive size – Malware can check the machine hdd size and continue execution**\nleaning on that parameter. This can be done by using the DeviceIoControl Api function\nwith ‘0x70000’ passed as the dwIoControlCode parameter. CatB ransomware will\nexecute only in a machine with at least a 50GB hard drive.\n\n\n-----\n\n_Figure 3 – Hard Disk size check_\n\n### DLL Hijacking\n\nIf all anti-VM checks pass, the dropper will continue its execution and drop the ransomware\npayload (oci.dll) into the C:\\Windows\\System32 folder. Next, it looks for the MSDTC service\n(the Distributed Transaction Coordinator Windows service that is responsible for coordinating\ntransactions between databases (SQL Server) and web servers) and changes its\nconfigurations.\n\n_Figure 4 – MSDTC service_\n\nThe configurations changed are the name of the account under which the service should run,\nwhich is changed from Network Service to Local System, and the service start option, which\nis changed from Demand start to Auto start for persistency if a restart occurs.\n\n_Figure 5 – Service Configuration Changes_\n\n\n-----\n\nThe account under which the service runs was changed to grant admin rights to the service,\nas the Network Service account runs with user rights. The cChangeing of the start type will\ngrants the ransomware the ability to executeion every time the system restarts.\n\nThe dropper starts the service after changing its configuration. When this service starts, it\nattempts to load, by default, several DLLs from the System32 folder. This gives it the\nopportunity to plant an arbitrary DLL (in our case, oci.dll) into this folder in order to execute\nmalicious code.\n\nRansomware\n\nThe Malicious oci.dll file is loaded into the msdtc.exe process, after which the encryption\nprocess starts. CatB enumerates and encrypts specific hardcoded disks and folders:\n\n1. Disk D:\\\n2. Disk E:\\\n3. Disk F:\\\n4. Disk G:\\\n5. Disk H:\\\n6. Disk I:\\\n7. All files under C:\\Users and its sub-directories\n8.\n\n_Figure 6 – Hardcoded Disks_\n\n\n-----\n\nCatB avoids encrypting files with .msi, .exe, .dll, .sys, .iso extensions and the NTUSER.DAT\nfile. An interesting thing about the CatB ransomware is that the ransom note is added into\nthe beginning of every encrypted file and not as a separate file in every folder as most of the\nransomwares do. It also doesn’t change the file extensions. This might initially confuse users\nwho may not notice the encryption and the file will just appear to be corrupted as they would\nbe unable  to open it as its binary contents are broken. The ransom note itself looks very\nsimilarly built to Pandora and Crypt ransom notes, with some sections actually being\ncopy/pastes from them:\n\n_Figure 7 – Encrypted file_\n\nThere is no official ransom name in the note and no tor website URL. The only method\navailable to contact the ransomware operator is via email.\n\n### Prevention\n\nMinerva Armor’s [Ransomware Protection Platform easily prevents CatB ransomware by](https://minerva-labs.com/armor-platform/armor/)\nsimulating environmental data that the ransomware is actively trying to avoid.\n\nFor example when the ransomware queries for the number of processors, Minerva Armor\nleads it to believe that it is in an environment with only 1 CPU.\n\n_Figure 8 – Prevention_\n\n\n-----\n\n### Relevant MITRE ATT&CK:\n\n[T1027 – Obfuscated Files or Information](https://attack.mitre.org/techniques/T1027/)\n\n[T1036 – Masquerading](https://attack.mitre.org/techniques/T1036/)\n\n[T1497 – Virtualization/Sandbox Evasion](https://attack.mitre.org/techniques/T1497/)\n\n[T1082 – System Information Discovery](https://attack.mitre.org/techniques/T1082/)\n\n[T1518.001 – Software Discovery: Security Software Discovery](https://attack.mitre.org/techniques/T1518/001/)\n\n[T1486 – Data Encrypted for Impact](https://attack.mitre.org/techniques/T1486/)\n\n[T1574.001 – Hijack Execution Flow: DLL Search Order Hijacking](https://attack.mitre.org/techniques/T1574/001/)\n\nIOC’s\n\n1. Version.dll –\n\n3661ff2a050ad47fdc451aed18b88444646bb3eb6387b07f4e47d0306aac6642\n\n1. Oci.dll – 35a273df61f4506cdb286ecc40415efaa5797379b16d44c240e3ca44714f945b\n\n1. Bitcoin wallet address – bc1qakuel0s4nyge9rxjylsqdxnn9nvyhc2z6k27gz\n\n1. Email contact – catB9991@protonmail.com\n\nReferences\n\nhttps://pentestlab.blog/2020/03/04/persistence-dll-hijacking/\n\n## See the Minerva Armor Platform in Action!\n\nView a recorded demo or sign up for a one-on-one talk\n\n[Schedule A Demo](https://minerva-labs.com/contact-us/)\nManage Cookie Consent\n\nTo provide the best experiences, we use technologies like cookies to store and/or access\ndevice information. Consenting to these technologies will allow us to process data such as\nbrowsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may\nadversely affect certain features and functions.\n\n\n-----\n\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling\nthe use of a specific service explicitly requested by the subscriber or user, or for the sole\npurpose of carrying out the transmission of a communication over an electronic\ncommunications network.\n\nThe technical storage or access is necessary for the legitimate purpose of storing\npreferences that are not requested by the subscriber or user.\n\nThe technical storage or access that is used exclusively for statistical purposes.\nThe\ntechnical storage or access that is used exclusively for anonymous statistical purposes.\nWithout a subpoena, voluntary compliance on the part of your Internet Service Provider, or\nadditional records from a third party, information stored or retrieved for this purpose alone\ncannot usually be used to identify you.\n\nThe technical storage or access is required to create user profiles to send advertising, or to\ntrack the user on a website or across several websites for similar marketing purposes.\n\nView preferences\n{title} {title} {title}\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-29 - New CatB Ransomware Employs 2-Year Old DLL Hijacking Technique To Evade Detection.pdf"
    ],
    "report_names": [
        "2022-12-29 - New CatB Ransomware Employs 2-Year Old DLL Hijacking Technique To Evade Detection.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1675303681,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1675237261,
    "ts_modification_date": 1675237261,
    "files": {
        "pdf": "https://archive.orkl.eu/bc1e2e1187a66bc840871e32c653a0956f75e214.pdf",
        "text": "https://archive.orkl.eu/bc1e2e1187a66bc840871e32c653a0956f75e214.txt",
        "img": "https://archive.orkl.eu/bc1e2e1187a66bc840871e32c653a0956f75e214.jpg"
    }
}