{
    "id": "fc1ec9bc-b1f1-47a0-989b-073b60243b48",
    "created_at": "2023-01-12T15:05:42.279318Z",
    "updated_at": "2025-03-27T02:05:34.205039Z",
    "deleted_at": null,
    "sha1_hash": "228401ba01365967ba3c90dafe2952b6aceeb1f9",
    "title": "2021-12-20 - Detecting anomalous network traffic resulting from a successful Log4j attack",
    "authors": "",
    "file_creation_date": "2022-05-28T18:58:51Z",
    "file_modification_date": "2022-05-28T18:58:51Z",
    "file_size": 2627274,
    "plain_text": "# Detecting anomalous network traffic resulting from a successful Log4j attack\n\n**[ironnet.com/blog/detecting-anomalous-network-traffic-resulting-from-a-successful-log4j-attack](https://www.ironnet.com/blog/detecting-anomalous-network-traffic-resulting-from-a-successful-log4j-attack)**\n\n[Back to IronNet Blog](https://www.ironnet.com/blog)\n[Threat Research](https://www.ironnet.com/blog/tag/threat-research)\nBy Peter Rydzynski, Principal Threat Analyst; Michael Leardi, Threat Hunter; Brent Eskridge,\nPhD, Threat Intelligence Analyst\n\n\n-----\n\nDec 20, 2021\n\n[IronNet’s Network Detection and Response (NDR) platform, IronDefense, coupled with our](https://www.ironnet.com/products/irondefense)\ncybersecurity experts, prevented a potential disaster at a Defense Industrial Base (DIB)\ncustomer. We were able to successfully detect a threat actor involved in malicious activity\n[exploiting the Log4J vulnerability. We are still working closely with our partner to assist with](https://www.ironnet.com/blog/ironnet-security-notifications-related-to-log4j-vulnerability)\nremediation, however at this time we wanted to share our findings to keep the community at\nlarge better informed and improve our ability to collectively defend against these attacks.\n\nThis article details the process the attacker used to gain remote-code execution on a\ncustomer's server using JNDI/LDAP to exploit the Log4j vulnerability and use the victim\nserver as a foothold for further attacks. Of particular note is the fact that all three of the IoCs\nused in the attack have not yet been flagged as malicious on VirusTotal as of this writing.\nThe exploit traffic itself was not observed; however, the resulting outbound LDAP traffic\nresulting from the exploit was captured and detected by our sensors. The LDAP traffic led to\nthe execution of a base64 encoded payload, which in turn established a simple reverse TCP\nshell. The attacker attempted to move laterally through the network using this shell.\n\n## Attempt 1\n\nThe attacker began scanning the target network at 12:52 UTC on Dec 15, 2021. The initial\nattempts appear to have successfully triggered the JNDI/LDAP request, but failed to\nsuccessfully obtain remote code execution and remote control of the target. The attack\ninitiated a connection from the targeted server to a malicious LDAP redirector. The redirector\nis hosted at 107.181.187[.]184 and still responds on the standard LDAP port, 389, at the time\n\n\n-----\n\nthis was written. The LDAP redirector currently has no malicious detections listed on\n[VirusTotal, which makes it more challenging for legacy security systems to identify this as](https://www.virustotal.com/gui/ip-address/107.181.187.184)\nmalicious traffic.\n\nOddly enough, the LDAP communication included a ‘searchRequest’ packet sent by the\ntargeted server, which included a ‘baseObject’ parameter whose value was an external IP\naddress owned by the targeted organization. It is unclear if this was intended by the attacker,\nbut initial analysis indicates that the host associated with the IP address was not\ncompromised at that time.\n\n## Attempt 2\n\n\n-----\n\nThe second attempt to exploit the targeted server occurred at 14:00 UTC on Dec 15, 2021.\nThis attempt was different from the first in that the malicious LDAP server directly provided a\nJava class file as the response payload. Details regarding this type of attack can be found in\n[our previous article which describes the anatomy of an attempted Log4j exploit observed](https://www.ironnet.com/blog/anatomy-of-a-log4j-attack)\nagainst another partner's network. In this current attack, the Java class appears to have\nbeen a wrapper class that decodes a second Java class encoded as base64 within the class.\nThis second Java class also contained a third Java class encoded as base64. This third\nclass contained the following malicious functionality, which was implemented using\nJavaScript:\n\nIncident response activities are still underway, but initial analysis indicates that this class file\nfailed to execute and no remote access was achieved during this attempt.\n\n## Attempt 3\n\nThe third and final exploit attempt occurred at 10:43 UTC on Dec 16, 2021. In this attempt,\nthe threat actor passed the base64 data to execute as part of the JNDI string itself. As\nbefore, this triggered outbound LDAP requests to the 107.181.187[.]184 IP address. The\nbase64 string used was the following:\n\nDecoding the string results in the following command:\n\nThis one-line command is a rudimentary reverse TCP shell that calls out to the attacker\ncontrolled 34.102.54[.]152 IP address on port 443. This attempt successfully established\nremote code execution on the victim server. The reverse shell executed and established a\nconnection from the victim server to the malicious C2 server. The attacker immediately\nbegan using the shell to execute additional commands on the victim server. Notably, the shell\ndid not use TLS encryption. As a result, IronNet threat hunters were able to see the\ncommands the threat actor executed on the victim server, thus enabling rapid incident\nresponse. Unfortunately, the IP address of the malicious C2 server also has no detections on\n[VirusTotal at the time of writing, making it harder to detect the attack.](https://www.virustotal.com/gui/ip-address/34.102.54.152)\n\n\n-----\n\n### Initial Host Enumeration:\n\nThe threat actor's initial actions were fairly standard. The actor first attempted to ensure none\nof the subsequent commands were logged to the Bash history by using the command “unset\nHISTFILE”. Their next action was to query when users last logged into the system to\ndetermine if the server is actively used. This is a common step for attackers, as it gives them\na sense for the type of target they have compromised and how they should proceed in order\nto remain undetected.\n\nThe attacker then dumped the host’s arp table, giving them an indication of what other\nservers or endpoints the victim server can access. After gathering the victim server's network\ninterface configurations, the attacker was able to determine the server's position in the\nnetwork and learn it's Active Directory domain. The attacker then began resolving the domain\ncontroller addresses discovered using the previous commands.\n\nAt this point, the attacker attempted to load an additional payload onto the target. Their initial\nattempts used a domain name that failed to respond. They then resorted to using the\nfollowing IP address and port: 149.28.200[.]140:443. Although this traffic was over port 443\nthe threat actor used plain HTTP not TLS. This attempt was successful and the attacker was\nable to drop a second stage binary named \"pscan\" on the victim server in the /var/tmp\ndirectory. The payload appears to be a port scanner, which the attacker used to initiate a\nscan on port 445, which is associated with SMB, using the following Bash one-liner:\n\n\n-----\n\nThis command ran the pscan binary to scan all the various /24 subnets in the 10.10.0.0/16\naddress space. Listed below are the commands that are executed when the command is\nrun:\n\nThe attacker also initiated scans on port 7001 using the same Bash one-line loop presented\nabove. Both of these activities were incredibly anomalous for the infected host and were\ndetected by IronNet’s Lateral Movement Chains analytics. Once the attacker completed the\nscans, they began probing the servers that were open and responding on port 445. The\nsubsequent SMB activity was fairly standard and included attempts to connect to IPC$\nshares and create named pipes such as \\netlogon, \\samr, and \\lsass. These were most likely\nattempts by the attacker to determine if null authentication was permitted; a common\n[technique that is described here and](https://exploit.ph/active-directory-recon-1.html) [here.](https://sensepost.com/blog/2018/a-new-look-at-null-sessions-and-user-enumeration/)\n\nAll of the aforementioned SMB enumeration activity appears to have been unsuccessful.\nThis activity took place less than two hours after the successful exploitation of the victim\nserver. It was at this time that IronNet hunters contacted the affected partner. The targeted\norganization was able to rapidly quarantine the server to ensure no further lateral movement\nor C2 activity persisted. IronNet hunters and incident responders from the targeted\norganization are continuing to collaborate in their analysis of the attacker's actions to verify\nthat the attacker is no longer able to access the victim server and its network.\n\n## What Does This Mean?\n\n\n-----\n\nThis log4j attack highlights the benefit of network detection and response (NDR). The initial\nattacks were not observed by legacy security tools, but the subsequent traffic and SMB scan\nwere detected as abnormal using behavioral analytics in the partner network. The ability to\nrapidly detect and observe the malicious traffic enabled IronNet hunters to identify the attack\nand collaborate with the targeted organization to remediate the attack before the attacker\ncould expand their foothold. IronNet analysts are also using the data gathered during this\nattack to improve the collective defense for all our partners.\n\nAbout Ironnet\n\nFounded in 2014 by GEN (Ret.) Keith Alexander, IronNet, Inc. (NYSE: IRNT) is a global\ncybersecurity leader that is transforming how organizations secure their networks by\ndelivering the first-ever Collective Defense platform operating at scale. Employing a number\nof former NSA cybersecurity operators with offensive and defensive cyber experience,\nIronNet integrates deep tradecraft knowledge into its industry-leading products to solve the\nmost challenging cyber problems facing the world today.\n\n[Back to IronNet Blog](https://www.ironnet.com/blog)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-20 - Detecting anomalous network traffic resulting from a successful Log4j attack.pdf"
    ],
    "report_names": [
        "2021-12-20 - Detecting anomalous network traffic resulting from a successful Log4j attack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535942,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653764331,
    "ts_modification_date": 1653764331,
    "files": {
        "pdf": "https://archive.orkl.eu/228401ba01365967ba3c90dafe2952b6aceeb1f9.pdf",
        "text": "https://archive.orkl.eu/228401ba01365967ba3c90dafe2952b6aceeb1f9.txt",
        "img": "https://archive.orkl.eu/228401ba01365967ba3c90dafe2952b6aceeb1f9.jpg"
    }
}