{
    "id": "fc2774ac-2421-4815-a484-15e485b892e8",
    "created_at": "2023-01-12T15:01:48.042908Z",
    "updated_at": "2025-03-27T02:16:25.614503Z",
    "deleted_at": null,
    "sha1_hash": "6913ac9f05e735ce459135470841315810d86fb8",
    "title": "2020-12-03 - DeathStalker Hits the Americas & Europe With New PowerPepper Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T17:57:03Z",
    "file_modification_date": "2022-05-28T17:57:03Z",
    "file_size": 93816,
    "plain_text": "# Infamous Hacker-for-Hire Group DeathStalker Hits the Americas & Europe With New PowerPepper Malware\n\n**darkreading.com/vulnerabilities---threats/-infamous-hacker-for-hire-group-deathstalker-hits-the-americas-and-europe-**\nwith-new-powerpepper-malware/d/d-id/1339604\n\nDecember 3, 2020\n\nVulnerabilities/Threats\n4 MIN READ\n\nARTICLE\nInfamous Hacker-for-Hire Group DeathStalker Hits the Americas & Europe With New\nPowerPepper Malware\n\nDecember 03, 2020\n\n**Woburn, MA – December 3, 2020 –** [Kaspersky researchers have spotted new malware](https://usa.kaspersky.com/)\nactivity in the wild from [DeathStalker, the advanced persistent threat (APT) actor known for](https://securelist.com/deathstalker-mercenary-triumvirate/98177/)\noffering hacking-for-hire services targeting companies in the financial and legal sectors. The\ngroup was found using a new malware implant and delivery tactics involving a backdoor\nKaspersky has dubbed PowerPepper.\n\nThe backdoor is used to remotely take control of victim devices. It leverages DNS over\nHTTPS as a communication channel, in order to hide communications with the control server\nbehind legitimate-looking traffic. PowerPepper also uses several evasion techniques,\nincluding steganography, a method for disguising data.\n\n\n-----\n\nDeathStalker is a highly unusual APT actor. Active since at least 2012, the group conducts\nespionage campaigns against small and medium-sized businesses, particularly law firms and\nfinancial services organizations. Unlike other APT groups, it doesn’t appear to be politically\nmotivated or seek financial gain from the companies they target. Rather, they act as\nmercenaries, offering their hacking services for a price.\n\nKaspersky researchers have recently uncovered new malicious campaigns from\nDeathStalker. Like other malware strains associated with the group, PowerPepper is\ntypically spread via spearphishing emails with the malicious files delivered via the email body\nor within a malicious link. The group has exploited international events, carbon emission\nregulations, and even the pandemic to trick their victims into opening the malicious\ndocuments.\n\nThe main malicious payload is disguised using steganography, a process that allows\nattackers to hide data amid legitimate content. In the case of PowerPepper, the malicious\ncode is embedded in what appears to be regular pictures of ferns or peppers (hence the\nname) and is then extracted by a loader script. Once that happens, PowerPepper begins to\nexecute remote shell commands sent by DeathStalker operators, which are aimed at stealing\nsensitive business information. The malware can carry out any shell command on the\ntargeted system, including those for standard data reconnaissance, such as gathering the\ncomputer’s user and file information, browsing network file shares, and downloading\nadditional binaries or copy content to remote locations. The commands are obtained from the\ncontrol server though DNS over HTTPS communications, an effective way to disguise\nmalicious communications behind legitimate server name queries.\n\nThe use of steganography is just one of several obfuscation and evasion techniques\nemployed by the malware. The loader is disguised as a verification tool from identity services\nprovider GlobalSign. It uses custom obfuscation, and parts of the malicious delivery scripts\nare hidden in Word-embedded objects. Communications with the implant and servers are\nencrypted and, thanks to the use of trusted, signed scripts, antivirus software won’t\nnecessarily recognize the implant as malicious at startup.\n\nPowerPepper has been seen in attacks across Europe primarily, but also in the Americas\nand Asia. In previously described campaigns, DeathStalker mainly targeted law consultancy\nfirms and organizations that provide financial or cryptocurrency services.\n\n“PowerPepper once again proves that DeathStalker is a creative threat actor: one capable of\nconsistently developing new implants and toolchains in a short period of time,” said Pierre\nDelcher, security expert at Kaspersky. “PowerPepper is already the fourth malware strain\naffiliated with the actor, and we have discovered a potential fifth strain. Even though they are\nnot particularly sophisticated, DeathStalker’s malware has proven to be quite effective,\nperhaps because their primary targets are small and medium-sized organizations—\norganizations that tend to have less robust security programs. We expect DeathStalker to\nremain active, and we will continue to monitor its campaigns.”\n\n\n-----\n\nPowerPepper was part of the most recent GReAT Ideas: Powered by Croissant. Baguette\n_Edition. You can watch the recording, as well as other presentations on the latest threat_\n[developments by Kaspersky’s top-level experts here:](https://zoom.us/rec/play/MImVenaz6_nHG4Jpdhyq3BmexwiVL3suiS52oAsW0XsBqEwTTGj4taYdjtCXv_CyOqbBEZKkZjZqAMxv.u4Q7u3JP66pxO0l8?continueMode=true&_x_zm_rtaid=CXcKg3JKQRyeI1CnQ08Sdg.1607004042684.6325b10f8ffa39d05348854b4051ca26&_x_zm_rhtaid=585)\n\n[Read more about PowerPepper and its evasion techniques at Securelist.](https://securelist.com/what-did-deathstalker-hide-between-two-ferns/99616/)\n\n**To protect your organizations from attacks like PowerPepper, Kaspersky experts**\n**recommend:**\n\nProvide your SOC team with access to the latest threat intelligence (TI). The Kaspersky\nThreat Intelligence Portal is a single point of access for the company’s TI, providing\ncyberattack data and insights gathered by Kaspersky over more than 20 years.\nTo minimize the risk of infection through phishing emails, companies should educate\n[their employees with basic cybersecurity hygiene training to be wary of emails from](https://www.kaspersky.com/enterprise-security/security-awareness)\nunknown senders. If they receive such letters, they shouldn’t open attachments or click\nany links in them before making sure the letter is legitimate.\nTo protect medium-sized businesses from such advanced attacks, it’s better to use\nendpoint security solutions with EDR functionality. Kaspersky’s Integrated Endpoint\nSecurity solution detects an attack and provides a wide range of response actions\noptimized for IT and security teams of mid-sized companies.\n\n[Vulnerability Management](https://www.darkreading.com/vulnerability-management)\n\nKeep up with the latest cybersecurity threats, newly-discovered vulnerabilities, data breach\ninformation, and emerging trends. Delivered daily or weekly right to your email inbox.\n\n[Subscribe](https://www.darkreading.com/newsletter-signup/?_mc=dr_eoa)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-03 - DeathStalker Hits the Americas & Europe With New PowerPepper Malware.pdf"
    ],
    "report_names": [
        "2020-12-03 - DeathStalker Hits the Americas & Europe With New PowerPepper Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "f7aa6029-2b01-4eee-8fe6-287330e087c9",
            "created_at": "2022-10-25T16:07:23.536763Z",
            "updated_at": "2025-03-27T02:02:09.85219Z",
            "deleted_at": null,
            "main_name": "Deceptikons",
            "aliases": [
                "DeathStalker",
                "Deceptikons"
            ],
            "source_name": "ETDA:Deceptikons",
            "tools": [
                "EVILNUM",
                "Evilnum",
                "Janicab",
                "PowerPepper",
                "Powersing",
                "VileRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8ce861d7-7fbd-4d9c-a211-367c118bfdbd",
            "created_at": "2023-01-06T13:46:39.153487Z",
            "updated_at": "2025-03-27T02:00:03.009422Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "TA4563",
                "EvilNum",
                "Jointworm",
                "KNOCKOUT SPIDER",
                "DeathStalker"
            ],
            "source_name": "MISPGALAXY:Evilnum",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535708,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653760623,
    "ts_modification_date": 1653760623,
    "files": {
        "pdf": "https://archive.orkl.eu/6913ac9f05e735ce459135470841315810d86fb8.pdf",
        "text": "https://archive.orkl.eu/6913ac9f05e735ce459135470841315810d86fb8.txt",
        "img": "https://archive.orkl.eu/6913ac9f05e735ce459135470841315810d86fb8.jpg"
    }
}