{
    "id": "fc6c27c3-5aa8-4852-8f89-4e36f7f6f833",
    "created_at": "2023-01-12T15:08:54.785352Z",
    "updated_at": "2025-03-27T02:05:59.02303Z",
    "deleted_at": null,
    "sha1_hash": "26f9a78594a8f1cbfa2d2324967645a201e35093",
    "title": "2017-01-30 - EyePyramid- An Archaeological Journey",
    "authors": "",
    "file_creation_date": "2022-05-28T01:59:42Z",
    "file_modification_date": "2022-05-28T01:59:42Z",
    "file_size": 3280664,
    "plain_text": "# EyePyramid: An Archaeological Journey\n\n**blog.talosintel.com/2017/01/Eye-Pyramid.html**\n\n[This post authored by Mariano Graziano and](https://twitter.com/emd3l) [Paul Rascagneres](https://www.blogger.com/profile/10073079939160046441)\n\n## Summary\n\nThe last few days a malware sample named EyePyramid has received considerable\nattention, especially in Italy. The Italian police have arrested two suspects and also published\na [preliminary report of the investigation. This malware is notable due to the targeting of](http://www.agi.it/pictures/pdf/agi/agi/2017/01/10/132733992-5cec4d88-49a1-4a00-8a01-dde65baa5a68.pdf)\nItalian celebrities and politicians.\n\nWe conducted our analysis on one of the first public samples attributed to EyePyramid.\nSources in the security community have described this malware campaign as\nunsophisticated, and the malware samples involved as uninteresting. However Talos was\nintrigued to determine just how EyePyramid managed to stay hidden under-the-radar for\nyears.\n\n## Preliminary Analysis\n\nThe sample is written in .Net and it is heavily obfuscated. Although at first sight we can also\nextract some interesting strings which are useful for possible ClamAV or Yara signatures.\nThe author paid attention to hide the core functionalities by using either known .Net\nobfuscators or cryptography to hide crucial information such as URLs, email addresses and\ncredentials.\n\nGenerally speaking, reversing .Net applications is not a difficult task because it is possible to\ndecompile the binary. There are many tools do it such as ILSpy, dotPeek, etc. We first tried\n[decompiling the sample with ILSpy but the obfuscation was heavy and all over the place. As](http://ilspy.net/)\na result the ILSpy output was not very useful and we had problems identifying the entry point\nof the application. The sample cannot be debugged, and it does not run inside virtual\nmachines due to several and sometimes trivial (but effective) anti-debugging and anti-vm\nchecks.\n\n## Dissection\n\n\n-----\n\nTo effectively analyze EyePyramid we needed to defeat the obfuscation. We first tried to use\n[de4dot for the deobfuscation and it detected two different known obfuscators namely](http://de4dot.com/)\n'Dotfuscator' and and 'Skater .NET'. From this point on, we refer to a 'cleaner' version of the\nsample. Keep in mind, however, that the malware is still obfuscated and the decompiler still\nfails for some routines.\n\nThe sample starts with some initialization code for the license keys and the certificates.\nThen, there is some code to achieve persistence using the CurrentVersion\\Run and\nCurrentVersion\\RunOnce registry keys. Moreover, there are checks to ensure the malware\nhas Administrator privileges, and for the system uptime via a Windows Management\nInstrumentation (WMI) query to LastBootUpTime.\n\nRegarding the persistence, we can observe the operation in which the registry key is set\nbelow:\n\nThe next step is to check and 'fix' the security descriptors of many folders via 'cacls.exe'.\nSpecifically, this code is interested in the Windows Firewall and a long list of possible\nantivirus software (among them also 'ClamAV for Windows'). To find these programs the\nmalware looks in typical locations such as ProgramFiles, ProgramFiles (x86), etc. You can\nsee from the picture below 'cacls.exe' and part of the security products list:\n\n\n-----\n\nIn the next picture we can see how the malware creates an exception rule for itself, adding\nseveral new entries to the firewall policy ruleset:\n\nThe program also spawns threads and executes commands and executables (e.g., via\n\n\n-----\n\nProcessStart or InteractionShell functions). For instance, it creates a registry key named\n'default.reg' and it is added to the registry by directly invoking the regedit command.\nRegarding executables, we have instead 'ghk.exe' and 'stkr.exe' that are executed and other\nresources downloaded from the web.\n\nAnother interesting spawned thread is the one for checking the User Account Control (UAC)\nvia the registry key 'EnableLUA' and disabling it through the control panel. UAC is an\nadditional layer of security introduced by Microsoft from Windows Vista to notify the users\nabout changes in the computer. In case of this and other changes, the system needs a\nreboot so all the modifications are effective and this is the goal of the function containing the\n'shutdown' command. See below:\n\nIt is worth also a mention the programs added to 'DisallowRun', and here we noticed a\nparticular interest for Avast antivirus. This key contains a list of applications that cannot run\non the system.\n\nWhen programs are executed by the agent, often they are launched with a command line\nparameter ('-w'). Generally speaking, this sample really pays attention to disable all possible\nsecurity software and security checks. Additionally, it creates rules to make its execution\nsmoother whenever it is possible.\n\n## Encryption\n\nAs we already said the sample is still obfuscated and it massively adopts cryptography. As\nreported by other sources, the strings are encrypted with 3DES. Here we report how the key\nis generated and the overall structure for the encryption phase. The key is an array of 16\nbooleans at the beginning all set to false. The key is initialized in the the steps listed in the\ntable below. The result of every step is a boolean value (true/false).\n\n\n-----\n\n-----\n\n(*) These checks are more complex. Please refer to the decompiled version of the binary for a more exhaustive\ndescription.\n\nAs a consequence, the key is dependent on the environment in which the sample is run. This\nsample was configured to run in three different environments. In order to allow this, the\ndecryption function is called with three string arguments, which correspond to the same\nstring encrypted with three different keys (one for each possible environment). The function\nwill first try to decrypt the first string with the 16-bit based environment key, with the 14th and\n15th bytes set to false. If this decryption process does not return a valid string, it will try to\ndecrypt the second string with the same key, and finally, if this does not work either, it will try\nto decrypt the last string with the whole 16 bit key, including the last two checks.\n\nThe encryption is performed according to the pseudocode below:\n\narray = init_key()\n\nsarray = serializekey(array)\n\nkey = md5(sarray)\n\niv = sha256(sarray)\n\n3des(data, key, iv)\n\n\n-----\n\nwhere init_key() are the the checks from 0 to 13 or from 0 to 15. Given the low entropy of the\npossible keys, we could bruteforce the encryption keys for the three different running\nenvironments. In all the cases the decryption produced the same exact set of strings:\n\nThroughout the code, the checks are also used as anti-vm in combination with others.\n\nAmong the others, it is worth mentioning a check for the 'Totalsize' of the drive. If this is less\nthan 46.5 GB and the operating system is Windows XP, this is not a valid environment. This\nis a clever way to detect sandbox environments because generally they use a small hard\ndrive and an old version of the Windows operating system.\n\n## Network Behavior\n\nBy running the sample on a VM and sniffing the network traffic we noticed some requests to\nknown websites. At a first sight, this looks like a method to check if the connection is\navailable but in this case the goal is different as you can see below:\n\n\n-----\n\nThe code randomly picks one domain and contacts it. Then it checks the header for the field\n'Date'. This field is used to compute the difference the with current date and see if the delta is\nless than 60 min.\n\nAnother interesting point is related to the way in which the domains are rotated. This is not a\nreal a domain generation algorithm (DGA), because the domains are not generated on the\nfly. This is simply how the agent gets the required information. This works in the following\nway:\n\nswitch((DateAndTime.Now.Month - 1) % 3):\n\n0: geturl[0]\n\n1: geturl[1]\n\n2: geturl[2]\n\nwhere geturl looks like:\n\ngeturl:\n\nreturn new string{\n\nway_0(),\nway_1(),\nway_2()}\n\n\n-----\n\nIn this image you can observe the behavior described above. Interestingly, the same\napproach is used for URLs and other critical information such as email addresses,\npasswords etc. Throughout the code there are three different implementations to get a\ndifferent kind of information. We stress the point that the domains are not generated on the\nfly but are chosen among a list of candidates.\n\n## Exfiltration\n\nThe exfiltration is done mainly via email and partially via WebDAV and HTTP. Regarding\nemails, they are sent via SMTP protocol and the data is exfiltrated as attachment. The\nmessage is then uploaded to the IMAP server in a specific folder (\"inbox\" on the third\npicture).The protocol choice depends on a flag passed as a parameter to the function dealing\nwith the email messages. These attachments can be either encrypted or in clear. The\nencryption is once again based on 3DES. For instance, this is part of the code related to the\nSMTP protocol, the second image contains IMAP servers while the third picture contains\nIMAP code:\n\n\n-----\n\nWebDAV support is present in the code and it is used for uploading data and to fetch files.\nWe also decrypted WebDAV credentials used during this operation. The code invokes\ndifferent WebDav methods. In the picture below we can observe the code for 'SEARCH':\n\n\n-----\n\nThe sample interacts with Command and Control servers and can download additional files.\nThis C&C communication is authenticated with a username and password. After\nauthentication, the agent downloads the resource and writes it to the disk in encrypted form.\nNext, the file is read and decrypted, with the decryption key being used as the temporary\nfilename. Finally, the file is deleted.\n\nIt is also interesting how the sample retrieves the IP address of 'libero.it', a well-known italian\nwebportal:\n\nAs you can see from the snippets of code above, the IP address is extracted directly from the\ncookie. This IP is added to a list of possible IP addresses to use and it is also used to\ngenerated an index later to pick a value from an array.The purpose of obtaining this IP is not\ncompletely clear from analyzing the code. Unfortunately some of the functions involved do\nnot have any reference, so it appears as if they are never invoked.\n\n## Other Supports\n\nAdditionally in the code there is also support for Active Directory and LDAP. The code\nconcerning Active Directory lists the administrative members of the domains and it checks if\nthe current user is in this list. Another method adds the current user to the domain\nadministrators. Regarding LDAP, the code is not referenced by any function, and it is\nprobably used in more recent versions of this agent, however, logically it is similar to the\nActive Directory one.\n\n## Related Samples\n\nThere are other executables that appear to be executed, such as 'stkr.exe', but the analysis\nof that malware in beyond the scope of this post. For the reader interested in a further\nanalysis, the sha256 for 'stkr.exe' is:\n0af665d7d81871474039f08d96ba067d5a0bd5a95088009ea7344d23a27ca824.\n\n\n-----\n\nDuring our analysis we have isolated another sample which was not publically related to this\ncampaign. This sample and possibly one other are on 'malwr.com'. Unfortunately, at the time\nof publication malwr.com is down for maintenance and google did not cache either of the two\n[analyses. See:https://www.google.com/search?q=%22uaccheckbox%22](https://www.google.com/search?q%3D%2522uaccheckbox%2522)\n\n## Conclusion\n\nAlthough it is true the authors made some trivial mistakes, throughout this post we have\nobserved efforts to cover the vital information of this operation and an agent able to subvert\nthe entire operating system security. Additionally, this sample is not stealthy for all the\noperations it performs but it has been undetected for years and is reported to have exfiltrated\nvast amounts of data. In this post, Talos dissected some interesting parts of this agent and\nprovided detailed information on how it bypasses dynamic analysis environments and\ndisarms the operating system security.\n\nThe authors would like to thank the research community for sharing the hashes and\n'hackbunny' for the support and information sharing.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/support/security/amp-firepower-software-license/tsd-products-support-series-home.html)\nmalware used by these threat actors.\n\n[CWS orWSA web scanning prevents access to malicious websites and detects malware](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nused in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[The Network Security protection ofIPS andNGFW have up-to-date signatures to detect](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nmalicious network activity by threat actors.\n\n\n-----\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella prevents DNS resolution of the domains associated with malicious activity.](https://umbrella.cisco.com/)\n\n## References\n\nhttp://www.tribupress.it/_/wp-content/uploads/2017/01/ORDINANZA-DI-CUSTODIACAUTELARE-OCCHIONERO.pdf\n\n[https://securelist.com/blog/incidents/77098/the-eyepyramid-attacks/](https://securelist.com/blog/incidents/77098/the-eyepyramid-attacks/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-01-30 - EyePyramid- An Archaeological Journey.pdf"
    ],
    "report_names": [
        "2017-01-30 - EyePyramid- An Archaeological Journey.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536134,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653703182,
    "ts_modification_date": 1653703182,
    "files": {
        "pdf": "https://archive.orkl.eu/26f9a78594a8f1cbfa2d2324967645a201e35093.pdf",
        "text": "https://archive.orkl.eu/26f9a78594a8f1cbfa2d2324967645a201e35093.txt",
        "img": "https://archive.orkl.eu/26f9a78594a8f1cbfa2d2324967645a201e35093.jpg"
    }
}