{
    "id": "fcacd99c-06f1-4f31-b592-6128de46324a",
    "created_at": "2022-10-25T16:48:16.139828Z",
    "updated_at": "2025-03-27T02:14:02.713491Z",
    "deleted_at": null,
    "sha1_hash": "dc92b79b353eb0e47e71216f3fa1f0c6167e29e7",
    "title": "Etso Apt Attacks Analysis",
    "authors": "AhnLab",
    "file_creation_date": "2014-01-22T14:14:59Z",
    "file_modification_date": "2014-01-22T14:14:59Z",
    "file_size": 1958950,
    "plain_text": "**Threat Report**\n\n# ETSO APT Attacks Analysis\n\n### December 20, 2013\n\n\n-----\n\n## Content\n\n### Introduction ........................................................................................................................ 3\n\n Statistics of APTs by ETSO ............................................................................................... 5\n\n ETSO APT Activities .......................................................................................................... 8\n\n**1. Characteristics of the ETSO APT Attack ............................................................................................ 8**\n\n1.1. Penetrating the internal network using an external update server............................................... 8\n\n1.2. Using Pass the Pass, Pass the Hash technique to move within the network .............................. 9\n\n1.3. Attack Continues Exploiting Certificates ...................................................................................... 9\n\n1.4. Using Anti-Forensic Tactics .......................................................................................................... 9\n\n1.5. Attack Continues Even When Discovered ................................................................................. 10\n\n1.6. Attack Techniques Improve with the Passage of Time ............................................................... 10\n\n**2. ETSO APT Attack Techniques by Level ............................................................................................ 11**\n\n2.1. Initial Compromise ...................................................................................................................... 11\n\n2.2. Establishing a Foothold .............................................................................................................. 12\n\n2.3 Escalation of Privileges ............................................................................................................... 13\n\n2.4. Lateral Movement ...................................................................................................................... 14\n\n2.5 Maintain Network Presence ........................................................................................................ 14\n\n2.6. Compromised Data .................................................................................................................... 15\n\n### Tracing the ETSO Malicious Code .................................................................................. 16\n\n**1. ETSO Master ....................................................................................................................................... 16**\n\n**2. Network Traffic Analysis .................................................................................................................... 17**\n\n2.1. Characteristic of the Traffic ........................................................................................................ 17\n\n2.2. Traffic Encoding .......................................................................................................................... 17\n\n**3. Profile of the ETSO Creation Tool ..................................................................................................... 18**\n\n### Conclusions ..................................................................................................................... 23\n\n\n-----\n\n## Introduction\n\nThe ETSO APT Attack Analysis is based on analysis conducted by A-FIRST, the AhnLab digital forensic team.\nThis report provides a detailed nature of Advanced Persistent Threats which were led by “ETSO Hacking\nGroup” (referred to as ETSO, ETSO Attack or ETSO Hacking Group hereinafter) since 2010. Based on\nincidents at 12 companies, this report shows how the ETSO APT attacks progressed, which methods were\nused at each stage of the attacks and the results of the ETSO malware analysis.\n\nAhnLab named the malicious code, which has targeted a specific industry, as “ETSO” since March 3, 2011.\nThe statistics in this report are extracted from AhnLab Smart Defense, a cloud-based malware analysis\nsystem, known as ASD.\n\nAPT attacks by ETSO Attack Group began with the distribution of malware on July 18, 2011. Until now,\nETSO Attack Group has fiercely attacked multiple companies for various purposes such as stealing business\nknow-how of online game companies as well as for certificates and cyber money. ETSO Attack Group\ncommits attacks entirely for reasons of financial profit.\n\nIn the APT attacks against the companies in Korea, the ETSO Attack Group used encrypted communication\nbetween the master which generated the malware, monitored the system and managed the C2 agent, and\nthe agent which accessed the C2 server. The ETSO Attack Group penetrated the targeted network via the\nC2 agent and remained dormant for a long period of time without any abnormal behavior that would trigger a\nnetwork error or website compromise, thus making it difficult to detect the attacks.\n\n**Figure 1. Malware Toolkit of ETSO Group**\n\nAhnLab analyzed two malware toolkits of ETSO and confirmed they were the same or very similar to the\nmalware “Winnti,” named by Kaspersky Labs and the malware toolkit “TrendMicro Plug” named by\nTrendMicro.\n\n\n-----\n\nConsidering that the ETSO Attack Group used the email accounts of the security division of the target\ncompany to distribute more malicious emails through the employee accounts and reacted in real-time to\nsecurity responses and the business schedule of the target, it is assumed that there were Korean natives or\nmultilingual persons among the attack group.\n\nAs the ETSO APT attacks have progressed, the malicious codes used in the attacks have consistently\nimproved and become more sophisticated since 2011. The attacker has been very unpredictable or rather,\ncreative, and has not left any traces. This has made digital forensics as the only method applicable for\nextracting the appropriate data in unallocated areas in order to analyze and respond to the ETSO APT\nattacks.\n\n**Figure 2. ETSO Advanced Attack Timeline**\n\n\n-----\n\n## Statistics of APTs by ETSO\n\nThe C&Cs (Command & Control) attacked by ETSO were mainly located in South Korea, Hong Kong, China\nand the US, reaching a peak of 64.30% of all attack locations. The C&C servers which were used to attack\nKorean game companies came primarily through IPs from South Korea and Taiwan.\n\nNormally, there are specific game servers for specific countries. When the entire IPs were blocked from a\ncertain country, the attacker would use another country’s IPs and continue on with the attack.\n\n**Figure 3. ETSO Attack Group and C&C Server Information**\n\n**ETSO Attack Group C&C**\n\n**Country** **Country Name** **Counts** **Ratio**\n\nUnknown Unknown 14 25.0%\n\nKR Korea, Republic of 14 25.0%\n\nHK Hong Kong 10 17.9%\n\nCN China 6 10.7%\n\nUS United States 6 10.7%\n\nTW Taiwan 3 5.4%\n\nJP Japan 1 1.8%\n\nMY Malaysia 1 1.8%\n\nTR Turkey 1 1.8%\n\n**Table 1. Locations of C&C servers of the ETSO Attack Group**\n\n|ETSO Attack Group C&C Country Country Name Counts Ratio|Col2|Col3|Col4|\n|---|---|---|---|\n|Country||||\n|Unknown|Unknown|14|25.0%|\n|KR|Korea, Republic of|14|25.0%|\n|HK|Hong Kong|10|17.9%|\n|CN|China|6|10.7%|\n|US|United States|6|10.7%|\n|TW|Taiwan|3|5.4%|\n|JP|Japan|1|1.8%|\n|MY|Malaysia|1|1.8%|\n|TR|Turkey|1|1.8%|\n\n\n-----\n\nSouth Korea was the primary victim of the ETSO APT attacks with an infection rate of 85.6 percent. The\nnature of the attack was geared towards the internet game industry, of which South Korea has the most\nclients.\n\n**Figure 4. IPs of Countries Impacted by the ETSO Malicious Code**\n\n|ETSO impacted PCs by country Country Country Name Counts|Col2|Col3|Ratio|\n|---|---|---|---|\n|KR|Korea, Republic of|752|85.6%|\n|Unknown|Unknown|69|7.8%|\n|CN|China|17|1.9%|\n|US|United States|15|1.7%|\n|JP|Japan|11|1.3%|\n|ID|Indonesia|3|0.3%|\n|CA|Canada|2|0.2%|\n|DE|Germany|2|0.2%|\n|GB|United Kingdom|2|0.2%|\n|HK|Hong Kong|2|0.2%|\n|AU|Australia|1|0.1%|\n\n\n-----\n\n|MP|Northern Mariana Islands|1|0.1%|\n|---|---|---|---|\n|PL|Poland|1|0.1%|\n|VN|Vietnam|1|0.1%|\n\n\n**Table 2. Ratio of ETSO impacted IPs by country**\n\nBased on the analysis of malicious codes creator known as the master and the ETSO APT malicious codes,\nand using the first distributer of the malicious files IPs as the standard, it has been incontrovertibly\ndetermined that the majority of the IPs came from China.\n\n**Figure 5. The IPs of Countries which Created the ETSO Malicious Codes**\n\n|ETSO Attack Group C&C Country Country Name Counts|Col2|Col3|Ratio|\n|---|---|---|---|\n|CN|China|87|81.3%|\n|Unknown|Unknown|5|4.7%|\n|TW|Taiwan|5|4.7%|\n|US|United States|4|3.7%|\n|JP|Japan|3|2.8%|\n|CA|Canada|1|0.9%|\n|KH|Cambodia|1|0.9%|\n\n\n-----\n\n|KR|Korea, Republic of|1|0.9%|\n|---|---|---|---|\n\n\n**Table 3. IPs by Countries that Generated ETSO Malicious Codes**\n\n## ETSO APT Activities \n\n**1. Characteristics of the ETSO APT Attack**\n\n1.1. Penetrating the internal network using an external update server\n\nIn order to penetrate a company’s internal network, the ETSO Attack Group used an external update server.\nFirst, the group seized the update server of application program, which is most frequently used since these\ntypes of programs are not highly managed and easy to attack. The attacker then changed the update setting\nfile to be downloaded on to the user’s system. Finally, the module of the application program in the user’s\nsystem reads the modified setting file and downloads to execute the malicious codes from the server which\nwas built by the attacker.\n\nSince this type of attack is hard to detect, the attack was much more likely to succeed bringing about a\ncatastrophic result with a single attack since many users use the application update server. Moreover, the\nattacker who seizes the update server targets a specific IP bandwidth of the company rather than randomly\ndistributing malicious codes. The reason why the attacker opts for the former is because random distribution\nthat scatters malicious codes are more likely to be discovered and may be more easily detected by security\nproducts.\n\n**Figure 6. Malicious Codes Distributing Process Using the Update Server**\n\n\n-----\n\n1.2. Using Pass the Pass, Pass the Hash technique to move within the network\n\nOnce the malicious code penetrates the internal network, it will acquire various kinds of information using the\nuser account. The attacker obtains the ID, password, NTLM hash value from the registry and memory area\nand moves on laterally to another system. The attack process is as follows:\n\nUsing the user account information, the attacker creates an agreement with the network sharing system of\nthe target system and the malicious code is then copied. The work schedule is registered and the copied\nmalicious code is activated. This type of attack is called the Pass the Pass, Pass the Hash attack method.\nThe ETSO Attack Group used tools such as gsecdump, which was already disclosed before, WCE (Windows\nCredentials Editor), and mimikatz; or, alternatively, they may have used DLL (wceaux.dll, sekurlsa.dll), which\nwere inserted in the malicious code to attack the system.\n\nSuch attacks are possible because most systems within the company often use the same local administrator\nID and Password for the sake of convenience. Or within the Active Directory, it tends to use the same domain\nadministrator account to access multiple systems, leaving the domain admin ID, password and hash value in\nthe memory.\n\n**Figure 7. Moving within the Internal Network**\n\n1.3. Attack Continues Exploiting Certificates\n\nThe ETSO Attack Group signed the malicious codes using the certificate they obtained. The reason for\nstealing certificates lies in the fact that files that are not signed by a legitimate certificate will be detected by\nsecurity products. Therefore, besides attacking the updates for cyber money and personal information, the\nstealth quality of certificates was also one of the attack goals of the ETSO Group. This indicates the\ncharacteristic of the attack, which shows that the multiple attacks were made by a single group.\n\n1.4. Using Anti-Forensic Tactics\n\nIn order to hide oneself, the attacker used more than one anti-forensic tactic. The ETSO Attack Group copied\nthe batch file when copying the malicious codes via network sharing, and it was this batch file that proceeded\nwith anti-forensic techniques. The batch file used the malicious code and cl option from the work schedule\nfile (.job), and the wevtutil option to delete the event logs (Security, System and Application).\n\n\n-----\n\nThese types of anti-forensic tactics make forensic analysis difficult, hindering the effort to find the entrance of\nattack through back-tracing.\n\n**Figure 8. Batch File Proceeding with Anti-Forensic Tactic**\n\n1.5. Attack Continues Even When Discovered\n\nThe ETSO Attack Group attacks for monetary reasons. For example, the Group attacks cyber money\nupdates and personal information. Even if the attack is detected by security products, the attack continues\non with the purpose of interfering with the service and ultimately destroying the system. Once the DB is\naccessed by the attack, the malicious codes continue to be distributed, creating an overflow to keep a\nconnection with the C&C server, even when the system admin or analyzer finds the malicious codes and\ndeletes them. Thus, it is very difficult to block the attack if all of the attacks are not analyzed well and dealt\nwith all at once.\n\n1.6. Attack Techniques Improve with the Passage of Time\n\nTable 4 shows the footprints of the attacker and a summary of the response. The ETSO Attack Group is\nseen here to have improved its attack technique in various ways as time passes.\n\nAttack Methods 2011.01-03 2011.04-06 2011.07-09 2011.09-12 2012.01-03 2012.04-06 201207-09 2012.09-12 2013.01-03\nMalicious code deletes itself after execution O O O O O O O O\nSpreads malicious code on certain IP range O O O O\nUses a certification that was disclosed during the attack O O O O O O\nTheft certification was used for attacks\nO O O O O\nCertification Theft\n\nCross attacks using the disclosed certification O O O O O\nCustomer service information breached O O\nExploits target company's product update module O O\nSpreads malicious codes on random targets O\nAcquire ID/PW with key logging O O O O O O\nChanges naming rule O O O O O\nPass the Hash Attack O O O O O\nCommands using the batch file O O O O O\nMalicious code execution using the work scheduler O O O O O\nDistributes file by sharing network O O O O O\nWith Mimikatz tool, acquires account ID/PW O\nDeletes JOB file O O O O O\nAcquires CMD command using the login screen by sethc.exe exchange O\nUses SQLCMD.EXE O O O\nUses APT mail disguised as company email O O O O\nBootkit (MBR Alteration) O O O O\nDrops malicious code encoded in the trash O O O O\nUpdates game money (Stored Procedure change) O O O\nUses altered SQL Open Data Services DLL O O\nOperates game money DB trigger using email which has certain texts O O\nManipulates game money through chat messaging system O\nManipulates game money through web shell O\nCollects NTLM Hash using the Windows Credential Editor O O O\nGenerate malicious code file to be used in the system shut down event\nO O O\ndetection and on Reloading\n\nInstall back door on the overall system, and stay connected to the network\nO O O\neven if detected\n\nAlter the update file of the target company's product O\nUses 64bit malicious code O O\nUpdates game money (direct query) O\n\n**Table 4. ETSO APT Technique Changes over Time**\n\n|Attack Methods|2011.01-03|2011.04-06|2011.07-09|2011.09-12|2012.01-03|2012.04-06|201207-09|2012.09-12|2013.01-03|\n|---|---|---|---|---|---|---|---|---|---|\n|Malicious code deletes itself after execution|O||O|O|O|O|O|O|O|\n|Spreads malicious code on certain IP range|O|||O||O||O||\n|Uses a certification that was disclosed during the attack|O||O||O|O||O|O|\n|Theft certification was used for attacks Certification Theft|||O|O||O||O|O|\n|Cross attacks using the disclosed certification|||O|||O|O|O|O|\n|Customer service information breached|||O||O|||||\n|Exploits target company's product update module|||O|O||||||\n|Spreads malicious codes on random targets|||O|||||||\n|Acquire ID/PW with key logging|||O|O||O|O|O|O|\n|Changes naming rule|||O||O|O||O|O|\n|Pass the Hash Attack|||||O|O|O|O|O|\n|Commands using the batch file|||||O|O|O|O|O|\n|Malicious code execution using the work scheduler|||||O|O|O|O|O|\n|Distributes file by sharing network|||||O|O|O|O|O|\n|With Mimikatz tool, acquires account ID/PW|||||O|||||\n|Deletes JOB file|||||O|O|O|O|O|\n|Acquires CMD command using the login screen by sethc.exe exchange|||||O|||||\n|Uses SQLCMD.EXE|||||O||O||O|\n|Uses APT mail disguised as company email||||||O|O|O|O|\n|Bootkit (MBR Alteration)||||||O|O|O|O|\n|Drops malicious code encoded in the trash||||||O|O|O|O|\n|Updates game money (Stored Procedure change)||||||O|O||O|\n|Uses altered SQL Open Data Services DLL||||||O|||O|\n|Operates game money DB trigger using email which has certain texts||||||O|||O|\n|Manipulates game money through chat messaging system||||||O||||\n|Manipulates game money through web shell||||||O||||\n|Collects NTLM Hash using the Windows Credential Editor|||||||O|O|O|\n|Generate malicious code file to be used in the system shut down event detection and on Reloading|||||||O|O|O|\n|Install back door on the overall system, and stay connected to the network even if detected|||||||O|O|O|\n|Alter the update file of the target company's product||||||||O||\n|Uses 64bit malicious code||||||||O|O|\n|Updates game money (direct query)|||||||||O|\n\n\n-----\n\nIn early days, ETOS hacking group used random file names, algorithms, and path for installing malicious files.\nAs time passed, however, they changed the naming scheme to sound similar with normal file names or\nsystem rules making malicious codes detection difficult.\n\n**Characteristic** **Example file names**\n\nAPT email’s attachment names\n\n120201.xls[multiple spaces].exe, ad-plan.pptx[multiple spaces ].exe,\n\n  - By adding a number of empty spaces between the\n\nBuy.hwp [multiple spaces].exe and etc.\n\nextensions on the doc file, it makes it difficult to know that the\nfile is exe.\n\nUses a file name that can be easily confused with the product AcroRd32Update.exe, AsusSetup.exe, AtSuper(v.0.12).exe,\nupdate file name. ChromeSetup.exe, Gom_player_update.exe, GOMPLAYERSETUP.EXE\n\n  - Uses a file name related to Adobe, Nvidia and Symantec file Patch Update.exe, setup.exe, setup_x64.exe, setup_x86.exe, Update.cpl,\nnames or uses install, update, setup, patch names. update.dat, update.exe, hwpupdate.exe and etc.\n\nUses file names that are loaded by OS priority. tsvipsrv.dll, winmm.dll, msvidc32.dll, wiarpc.dll, TSMSISrv.dll 등\n\n6to4adv.dll, pciexii.dll, pciexij.dll, TVT.DLL, MWSCDS.dll, qwert8320.bat,\nFile names that only ETSO uses.\ndefault_.pif, wlrpc.dll, ntfs[3 random texcts].mof, ssk.log and etc.\n\nFile names that are specific for attacking company. dc1.exe, Dc2.dat, DK_GMR.exe, dk_winmm.dll, gameon.exe and etc.\n\nSUCHOST.EXE,sv1.exe, svc.exe, TSMSISrv.dll, TSVIPSrv.dll, usp.fx,\n\nUses name that appears similar with a normal file.\n\nusp10.dll, PROCEXP113.sys and etc.\n\nFile names related to the DB. opends60.dll, sql120.dll, sqlos.dll and etc.\n\n**Table 5. Characteristics of ETSO Malicious Files**\n\n**2. ETSO APT Attack Techniques by Level**\n\n2.1. Initial Compromise\n\nThis is the first stage where the attacker first tries to enter the company’s internal network. Many times, the\nETSO Attack Group targets the update server, which is the most frequently used application program in the\ncompany. The attacker will seize the server and change the settings so that the malicious codes are\ndownloaded on a specific target system. Another method is to disguise itself as an internal mail, enticing the\nuser to open and execute the file. In this case, the attacker disguises oneself as an employee from a security\ndivision, sending out email with a malicious hyper link. It has been found that the attack email is written in\nKorean, indicating that there are native Korean speakers in the ETSO Attack Group.\n\n|Characteristic|Example file names|\n|---|---|\n|APT email’s attachment names - By adding a number of empty spaces between the extensions on the doc file, it makes it difficult to know that the file is exe.|120201.xls[multiple spaces].exe, ad-plan.pptx[multiple spaces ].exe, Buy.hwp [multiple spaces].exe and etc.|\n|Uses a file name that can be easily confused with the product update file name. - Uses a file name related to Adobe, Nvidia and Symantec file names or uses install, update, setup, patch names.|AcroRd32Update.exe, AsusSetup.exe, AtSuper(v.0.12).exe, ChromeSetup.exe, Gom_player_update.exe, GOMPLAYERSETUP.EXE Patch Update.exe, setup.exe, setup_x64.exe, setup_x86.exe, Update.cpl, update.dat, update.exe, hwpupdate.exe and etc.|\n|Uses file names that are loaded by OS priority.|tsvipsrv.dll, winmm.dll, msvidc32.dll, wiarpc.dll, TSMSISrv.dll 등|\n|File names that only ETSO uses.|6to4adv.dll, pciexii.dll, pciexij.dll, TVT.DLL, MWSCDS.dll, qwert8320.bat, default_.pif, wlrpc.dll, ntfs[3 random texcts].mof, ssk.log and etc.|\n|File names that are specific for attacking company.|dc1.exe, Dc2.dat, DK_GMR.exe, dk_winmm.dll, gameon.exe and etc.|\n|Uses name that appears similar with a normal file.|SUCHOST.EXE ,sv1.exe, svc.exe, TSMSISrv.dll, TSVIPSrv.dll, usp.fx, usp10.dll, PROCEXP113.sys and etc.|\n|File names related to the DB.|opends60.dll, sql120.dll, sqlos.dll and etc.|\n\n\n-----\n\n**Figure 9. APT Mail Using the Documents Acquired from a Game Company**\n\n2.2. Establishing a Foothold\n\nThe attacker that succeeded in initial attack creates a backdoor to the system and prepares a path for\ncontinuous attack. In this case, the first attack is mainly made on the employee’s network regularly used for\ngeneral work. In the case of the ETSO Attack Group, the back door generation program made it possible for\nmany techniques to be executed with a variety of “back doors” to communicate with the C&C. The common\nfunctions of each of the back doors are as follows:\n\n- System Information and Control\n\n- Search option\n\n- File transfer to C&C server\n\n- Control of process and module\n\n- Service control\n\n- Registry control\n\n- Instant screen capture\n\n- Remote control\n\n- Command Shell\n\n- Proxy function (open port)\n\n- Keylogging\n\nIn addition to the above mentioned ways, in order to secure the additional attack route to the network, the\nETSO Group uploaded the back door on the internal file server that was openly shared within the company.\nThe uploaded back door was disguised as a generally used program such as a driver, Office or Chrome\ninstall file. Such disguised features induce users to install the file.\n\n\n-----\n\n**Figure 10. File Menu of ETSO Backdoor Generating Program**\n\n(Top: Infected PC file. Bottom: Master file information)\n\n2.3 Escalation of Privileges\n\nThe attacker who successfully installed the back door on the initial attack, then moved on to the target\nsystem. In order to progress, the attacker needed to access an account from a higher authority such as\ninformation from an administrator, including ID, password and NTLM Hash information, all available in the\nsystem registry and memory. In the case of the ETSO Group, they would use existing tools such as\ngsecdump, WCE(Windows Credential Editor), mimikatz or insert the DLL (wceaux.dll, sekuralsa.dll) in the\nmalicious code, dropping and calling the information. In addition, the attacker may use its key logging\nfunction from the backdoor to steal the ID/Password.\n\nFor the sake of convenience, the same IDs and Passwords are mainly used for all of the local system\nadministrators. Also, a domain administrator account is used to access more than one system in the active\ndirectory setting. In this case, the attacker can easily acquire the administrator’s ID/Password as well as the\nhash value.\n\n**Figure 11. Acquiring Domain Administrator’s NTLM Hash through WCE**\n\n\n-----\n\n2.4. Lateral Movement\n\nThe attacker who obtained the account information of privilege authority then created a back door to the\nsystem. In this case, if the acquired account was the domain administrator’s, then the attacker could install\nback doors on all of the corresponding parts of the domain as well as the domain and systems in trust\nrelations. The install process is as follows:\n\nThe attacker will use the acquired ID/Password or NTLM Hash value to create an agreement with the system\nnetwork to move to, and copy, the back door. The copied backdoor is then executed using the work\nscheduler, and it is operated using the system authority. The executed back door then broadcasts connection\nstatus with the C&C server using the proxy feature, and the attacker approaches the corresponding system\nbased on the broadcast information.\n\nThe attacker repeats the process until the target system is found, such as a DB. In most cases, the attacker\nwill search for an administrator’s system inside the network, approach the gateway server and finally enter\nthe server network. From then on, the attacker uses the same method and installs many back doors in the\nserver network.\n\n2.5 Maintain Network Presence\n\nThe attacker uses various Reloading Point techniques in order to maintain the connection between the\ninstalled back door and the C&C server. First, a Bootkit technique will be used to load the backdoor after\ntransforming the MBR. The characteristic of the bootkit is that the corresponding bootkit is encoded with\nXOR on the loading data inside the trash and it is saved. Another method is to use files such as wiarpc.dll,\ntsvipsrc.dll which are loaded automatically during booting. The malicious file such as the DDL is saved under\nfolder 32 and is used during the back door reloading. Registering the back door as a general service is also\none way it may be used.\n\nThe attacker uses various kinds of anti-forensic techniques in order to avoid being disconnected with the\nC&C server once the back door is discovered. The backdoor install file and batch file are copied by network\nsharing, and the batch file is executed with the work scheduler. The batch file executes the back door install\nfile and deletes the install file as well as the work schedule file (.job), and the cl of the wevtutil command is\nused to delete the event logs (security, system and application). Additionally, the registry key values are\ndeleted in order to erase traces of the back door execution into the service. With these anti-forensic\ntechniques, the attacker reduces the backdoor detection rate, avoiding the chances of being caught by back\ntracing.\n\nIn addition, a method of installing backdoor only in the memory area was applied, since this can avoid the\nthreat detection of security products. After installation, the backdoor erases all of the files and only exists in\nthe memory while waiting for the system to turn off. When the system is turned off, the files needed for back\ndoor reloading are generated and they are loaded during system booting. Then, the loaded back door\nerases all of the related files and stays only in the memory.\n\nEven though administrators and analysts detect back doors and delete them, the attacker will install even\nmore back doors on the system to maintain its connection with the C&C server.\n\n\n-----\n\n**Figure 12 Securing Connection with the Network Using the MBT Bootkit**\n\n2.6. Compromised Data\n\nThe attacker who approaches the DB server will proceed with various kinds of tasks depending on the attack\npurpose such as attacking the cyber money or stealing personal information. In the case of a cyber-money\nupdate, a query request is made on the DB using the features embedded on the back door and by\nSQLCMD.EXE. Or, the existing Stored Procedure is changed to update. When the Stored procedure\nregistered in the mail table is changed and the mail is received, the Stored Procedure is operated to update\nthe cyber money of a specific character. Also, the DDL which is used in the MS SQL DB which transforms the\nopends60.dll (SQL Open Data Services DLL), can be used to update the cyber money.\n\nIn case of information leakage, a DB for a customer information dump file is generated, compressed as BZIP\n(bz2) and exported out using FTP.\n\n**Figure 13. Cyber Money Update Using the Transformation of Stored Procedure**\n\n\n-----\n\n## Tracing the ETSO Malicious Code\n\n**1. ETSO Master**\n\n**Figure 14. ETSO Malicious Code Agent Master**\n\n**Figure 15. ETSO Agent Manager Menu**\n\n\n-----\n\nOn the top portion of the master, there are two main menus: agent list and agent master. The center area\nshows the directory of the agent lists which are connected, and the bottom portion shows variety of options\nrelated to the master.\n\n**2. Network Traffic Analysis**\n\n2.1. Characteristic of the Traffic\n\nIn the initial access, a request for connection is made from an infected remote PC to the master. If the ThreeWay Handshake is made between the two, the PC and master will be connected and the information of\ninfected PC will be delivered to the master.\n\n**Figure 16. Connected Traffic between Master and Agent**\n\nThen, after every 60 seconds, the Keep-Alive traffic will be created to check the connection between the\nmaster and the infected PC.\n\n**Figure 17. Keep-Alive Traffic between the Master and the Agent**\n\n2.2. Traffic Encoding\n\nIn the same OS environment, the same IP and Port were used during the test. It has been found that the\ntraffic is different in its delivery over the same command. After repeated tests, a pattern was found in the\ntraffic between the infected PC and the master. Thus, it is surmised that it was not completely encrypted but\nwas encoded by a certain level.\n\nIncluding the initial connection, the traffic encoding was also applied in the Keep-Alive traffic and in the all\ncommand transferred traffic. The Key logging and CMD command results were also not delivered in plain\ntext but in encryption.\n\n\n-----\n\n**Figure 18. Encoded Traffic**\n\n(When a service administration command is delivered in the same environment, different traffic patterns are\nfound.)\n\nCurrently, the communication between the ETSO malicious code master and the agent is being encrypted. It\nseems impossible to create a PCRE and REGEX pattern which can be blocked by IDPS and other network\nsecurity system. Regarding the newest version of ETSO, it is assumed that there must be a\ntelecommunicating module hiding within the network traffic.\n\n**3. Profile of the ETSO Creation Tool**\n\nThe question is thus raised regarding who actually made the ETSO Attack tool in the first place. An\ninvestigation was conducted to find the ESTO APT creator as the ETSO master’s traces were traced back in\nthe analysis.\n\nIn the ETSO master, you can see the http access on the lower menu of the malware toolkit; the Baidu URL\nvalues are seen. Baidu is the largest portal site in China. In the middle, you can see the string\n“DZKSJDADBDCDH-DOCADOCADOCBDDZJS”. The string appears when the IP is entered and information\nis changed, setting the initial value to be ”127.0.0.1”. At this time, the value\nDZKSJDADBDCDHDOCADOCADOCBDDZJS is set.\n\n**Figure19. Distinctive String in the ETSO Malware Toolkit**\n\nThrough a Google search of the ‘DZKSJDADBDCDHDOCADOCADOCBDDZJS’ string on the malware\ntoolkit, a link of ‘http://tieba.baidu.com/p/1103191865’ was found. There were reply messages titled TEST\n\n\n-----\n\nand all of the messages were submitted by a person with the ID “whg0001”. This value matches the one on\nthe ETSO malware toolkit.\n\nIt is assumed that the attacker designated a specific blog address when the ETSO APT malicious code agent\nwas activated in order to immediately determine whether the attack was successful or not. The attacker can\nknow the victim’s IP address after decrypting the encryption.\n\n**Figure 20. The Website ‘http://tieba.baidu.com/p/1103191865’**\n\nIt is assumed that the according blog content is related to the APT tool creation. Thus, a further investigation\nwas made on the person with the ID of whg0001.\n\nWhen the link of whg0001 is clicked, brief information on the person with the ID whg0001 appears. He is a\nmale who was born and still lives in Szechuan, Chengdu.\n\n\n-----\n\n**Figure 21. User ID whg0001 Information**\n\n\nBelow is the translation of the detail information:\n\nGender Male\n\nBirthdate Jan 1[,] 1991\n\nBasic Info\n\nPlace of Birth Szechuan, Chengdu, Chengyang Qu\n\nCurrent Address Szechuan, Chengdu, Chengyang Qu\n\nBody Figure Slim\n\nMarital Status Married\n\nNon-smoker, occasional drinker, likes to take\nHabit\nnaps during the day\n\nDetail Info\n\nPersonality Cheerful and calm personality\n\nHighest Education University\n\nMajor Computer Science/Network\n\n**Table 6. Information on User ID whg0001**\n\nOn his blog, whg001 wrote on Aug. 17, 2011, “I visited my home school a couple days ago. Looking back,\nthose were the happiest days.” It has also been found that the comment came from the free-board of Jipu\nHigh School. Thus, it has been determined that whg001 attended Jipu High School.\n\n**Figure 22. Content on whg0001’s Blog**\n\n|Basic Info|Gender|Male|\n|---|---|---|\n||Birthdate|Jan 1, 1991|\n||Place of Birth|Szechuan, Chengdu, Chengyang Qu|\n||Current Address|Szechuan, Chengdu, Chengyang Qu|\n|Detail Info|Body Figure|Slim|\n||Marital Status|Married|\n||Habit|Non-smoker, occasional drinker, likes to take naps during the day|\n||Personality|Cheerful and calm personality|\n||Highest Education|University|\n||Major|Computer Science/Network|\n\n\n-----\n\nAccording to the writings on the board and the content of whg0001’s blog, the name of the writer is Jiao\nXang Bo, who entered high school in 1994 in homeroom number 4. Also, he was looking for a classmate\nby leaving a message with his QQ ID. whg0001’s QQ ID is found to be (312016).\n\n\n### \n\n\n**Figure 23. whg0001’s Comments and QQ ID**\n\n\nAfter investigating the personal information of whg0001, further investigation was made of his online\nactivities. As a result, it has been found that he left comments on the attacker’s freeboard regarding the\ndesign of Trojan horse (Refer to Figure 27).\n\n**Figure 24. Comments whg0001 Left on the Attacker’s Freeboard.**\n\nUnfortunately, the attacker freeboard does not exist anymore. [Figure 24] translates as follows:\n\n_1. I have realized all of the packets’ MIMA (password/man in the middle attack) different when_\n_designing the Trojan horse._\n\n_2. To go around the vaccine detection, a transformation and other technologies were used to on the_\n_Trojan horse._\n\nTo find the document made by whg0001, the ID was used to search on Baidu. As a result, a document titled\n“VTCP Introduction and Entry(V11.X)” was discovered. To take a closer look at the document, a link\n(‘http://wenku.baidu.com/view/2005a703-bb68a98270fefa06?fr=prin’) was accessed (as of August,\nwww.cnasm.com, the address mentioned within the document, was no longer accessible).\n\n\n-----\n\n**Figure 25. whg001’s Document Found in the Search**\n\nUsing the QQ ID (312016) above, the result of the QQ main page was as follows:\n\n**Figure 26. whg0001 QQ Page**\n\nIn [Figure 26], the Chinese characters wu hua guo appear. The first letter of each synonym has been used as\nan ID. So far, the following information has been collected on the attacker who created the ETSO with ID of\nwhg0001 (refer to Table 7):\n\n\n-----\n\n|Basic Info|ID|whg0001|\n|---|---|---|\n||Gender|Male|\n||Name|叫张波 (Jiao Xang Bo)|\n||Birthdate|Jan 1, 1991 (Actual birth year is known to be 1978)|\n||Born in|四川-成都-青羊区 (Szechuan, Chengdu, Chengyang Qu)|\n||Current Address|四川-成都-青羊区 (Szechuan,Chengdu, Chengyang Qu)|\n|Detail Info|Body Figure|Light|\n||Marital Status|Married|\n||Habit|Non-smoker, occasional drinker, likes taking naps|\n||Personality|Calm, Cheerful|\n||Highest Ed|University|\n||Major|Computer Science/Network|\n||High School|齐福中学 (Jipu Mid/High School)|\n||High School Year|94, Class 4|\n||QQ ID|312016|\n\n\n**Table 7. Profile of Possible ETSO Creator Jiao Xang Bo**\n\n\n## Conclusions \n\n\n-----\n\nThe Chinese-originated APT Attack Group ETSO has been attacking South Korea since 2011. A-FIRST from\nAhnLab has done a forensics analysis using the ASDE (AhnLab Smart Defense Enterprise) network and on\nthe damaged company for years. According to the study, ETSO is different from other attackers in following\nways:\n\n- ETSO analyzes the update structure of a product popularly used in South Korea, in order to distribute\nmalicious codes through reliable products and ultimately, the company.\n\n- To continuously benefit monetarily and acquire extra information, the ETSO Group does not destroy the\ninfected system and the infrastructure.\n\n- By disclosing the digital certificate, additional damage is made on the target company because the\ncertificate can be used in other attacks for different purposes.\n\n- The attacker moves into the internal system by seizing the AD server of the company to attack, using the\npass the hash attack.\n\n- Regarding the malicious code file naming, a ‘DLL search order hijacking’ is used (for example: wiarpc.dll,\ntsvipsrc.dll).\n\n-Not only was the feature embedded on the back door used to attack the cyber money update, but a direct\nDB query through SQLCMD.EXE, Trigger through the transformation of Store Procedure registered in the\nemail table and opends60.dll(SQL Open Data Services DLL) transformation were all used in the MS SQL DB\nin the attack.\n\n\n-----\n\n**AhnLab, Inc.**\n2318-D Walsh Ave. Santa Clara, CA 95051 USA\nToll Free +1.800.511.AhnLab (1.800.511.2465)\n+1.877.551.2690\nwww.ahnalb.com\nEmail info@ahnlab.com\n© 2013 AhnLab, Inc. All rights reserved.\n\nDisclosure to or reproduction for others without the specific written authorization of AhnLab is prohibited\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/n4vji662ern1bii9hhahvglujeobqmk0",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2013/2013.12.20.ETSO/ETSO_APT_Attacks_Analysis.pdf"
    ],
    "report_names": [
        "ETSO_APT_Attacks_Analysis"
    ],
    "threat_actors": [
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041642,
    "ts_creation_date": 1390400099,
    "ts_modification_date": 1390400099,
    "files": {
        "pdf": "https://archive.orkl.eu/dc92b79b353eb0e47e71216f3fa1f0c6167e29e7.pdf",
        "text": "https://archive.orkl.eu/dc92b79b353eb0e47e71216f3fa1f0c6167e29e7.txt",
        "img": "https://archive.orkl.eu/dc92b79b353eb0e47e71216f3fa1f0c6167e29e7.jpg"
    }
}