{
    "id": "fd20bd8d-e892-47ab-b067-20f6baafb2f3",
    "created_at": "2023-01-12T15:05:36.181594Z",
    "updated_at": "2025-03-27T02:16:26.308986Z",
    "deleted_at": null,
    "sha1_hash": "2ff8e3425515608c5ba424c7cc6d220a3814d0b1",
    "title": "2018-03-21 - TrickBot Banking Trojan Adapts with New Module",
    "authors": "",
    "file_creation_date": "2022-05-27T23:14:25Z",
    "file_modification_date": "2022-05-27T23:14:25Z",
    "file_size": 1651994,
    "plain_text": "# TrickBot Banking Trojan Adapts with New Module\n\n**[webroot.com/blog/2018/03/21/trickbot-banking-trojan-adapts-new-module/](https://www.webroot.com/blog/2018/03/21/trickbot-banking-trojan-adapts-new-module/)**\n\nJason Davison March 21, 2018\n\nSince inception in late 2016, the TrickBot banking trojan has continually undergone updates\n[and changes in attempts to stay one step ahead of defenders and internet security providers.](https://www.webroot.com/us/en/home/products/isp)\nWhile TrickBot has not always been the stealthiest trojan, its authors have remained\nconsistent in the use of new distribution vectors and development of new features for their\nproduct. On March 15, 2018, Webroot observed a module (tabDll32 / tabDll64) being\ndownloaded by TrickBot that has not been seen in the wild before this time.\n\nIt appears that the TrickBot authors are still attempting to leverage MS17-010 and other\nlateral movement methods coupled with this module in an attempt to create a new\nmonetization scheme for the group.\n\n## You can teach an old bot older tricks\n\n**Analyzed samples**\n\n0058430e00d2ea329b98cbe208bc1dad – main sample (packed)\n\n0069430e00d2ea329b99cbe209bc1dad – bot 32 bit\n\n**Downloaded Modules**\n\n711287e1bd88deacda048424128bdfaf – systeminfo32.dll\n58615f97d28c0848c140d5e78ffb2add – injectDll32.dll\n\n\n-----\n\n30fc6b88d781e52f543edbe36f1ad03b – wormDll32.dll\n5be0737a49d54345643c8bd0d5b0a79f – shareDll32.dll\n88384ba81a89f8000a124189ed69af5c – importDll32.dll\n3def0db658d9a0ab5b98bb3c5617afa3 – mailsearcher32.dll\n**311fdc24ce8dd700f951a628b805b5e5 – tabDll32.dll**\n\n### Behavioral Analysis\n\nUpon execution, this iteration of TrickBot will install itself into the %APPDATA%\\TeamViewer\\\ndirectory. If the bot has not been executed from its installation directory, it will restart itself\nfrom this directory and continue operation. Once running from its installation directory,\nTrickBot will write to the usual group_tag and client_id files along with creating a “Modules”\nfolder used to store the encrypted plug and play modules and configuration files for the bot.\n\n_Image 1: TrickBot’s plug and play modules used to extend the bots functionality_\n\nMany of the modules shown above have been previously documented. The systeminfo and\ninjectDll module have been coupled with the bot since its inception. The mailsearcher\n[module was added in December 2016 and the worm module was discovered in late July](https://www.flashpoint-intel.com/blog/new-version-trickbot-adds-worm-propagation-module/)\n2017. The module of interest here is tabDll32 as this module has been previously\nundocumented. Internally, the module is named spreader_x86.dll and exports four functions\nsimilar to the other TrickBot modules.\n\n\n-----\n\n_Image 2a: Peering inside tabDll.dll_\n\n_Image 2b: Abnormally large .rdata section_\n\nThe file has an abnormally large rdata section which proves to be quite interesting because it\ncontains two additional files intended to be used by spreader_x86.dll. The spreader module\ncontains an additional executable SsExecutor_x86.exe and an additional module\nscreenLocker_x86.dll. Each module will be described in more detail in its respective section\nbelow.\n\n\n-----\n\n**Spreader_x86.dll**\n\nWhen loading the new TrickBot module in IDA, you are presented with the option of loading\nthe debug symbol filename.\n\n_Image 3: Debug symbol filename of the downloaded module tabDll.dll_\n\nThis gives us a preview of how the TrickBot developers structure new modules that are\ncurrently under development. When digging deeper into the module, it becomes evident that\nthis module is used to spread laterally through an infected network making use of MS17-010.\n\n_Image 4: String references to EternalRomance exploit used for lateral movement_\n\nThis module appears to make use of lateral movement in an attempt to set up the embedded\nexecutable as a service on the exploited system. Additionally, the TrickBot authors appear to\nbe still developing this module as parts of the modules reflective dll injection mechanism are\nstolen from GitHub.\n\n\n-----\n\n_[Image 5: Copied code from ImprovedReflectiveDLLInjection](https://github.com/dismantl/ImprovedReflectiveDLLInjection/blob/master/inject/src/LoadLibraryR.c)_\n\n_Image 6: Printf statements from the_ _[copied project on GitHub](https://github.com/dismantl/ImprovedReflectiveDLLInjection/blob/master/inject/src/LoadLibraryR.c)_\n\n**SsExecutor_x86.exe**\n\nThe second phase of the new module comes in the form of an executable meant to run after\npost exploitation. Again, it was very nice of the TrickBot authors to give us a look at the\ndebug symbols file path.\n\n\n-----\n\n_Image 7: Debug symbol filename of the embedded PE file._\n\nWhen run, this executable will iterate over the use profiles in registry and goes to each profile\nto add a link to the copied binary to the start up path. This occurs after lateral movement\ntakes place.\n\n_Image 8: Iterate over user profiles and create_\n\n\n-----\n\n_Image 9: Execution of the copied binary_\n\n**ScreenLocker_x86.dll**\n\nSimilarly, to the other TrickBot modules, this module was written in Delphi. This is the first\ntime TrickBot has shown any attempt at “locking” the victims machine.\n\n_Image 10: Peering inside screenLocker_x86.dll_\n\n\n-----\n\nThis Module exports two functions, MyFunction and a reflective DLL loading function.\n“MyFunction” appears to be the work in progress:\n\n_Image 11: Peering inside “MyFunction”_\n\n\n-----\n\n_Image 12: Creation of the Locker Window_\n\nIf the TrickBot developers are attempting to complete this locking functionality, this generates\ninteresting speculation around the group’s business model. Locking a victim’s computer\nbefore you are able to steal their banking credentials alerts the victim that they are infected,\nthus limiting the potential for credit card or bank theft. However, extorting victims to unlock\ntheir computer is a much simpler monetization scheme.\n\nIt is notable that this locking functionality is only deployed after lateral movement, meaning\nthat it would be used to primarily target unpatched corporate networks. In a corporate setting\n(with unpatched machines) it is highly likely that backups would not exist as well. The\nauthors appear to be getting to know their target audience and how to best extract money\nfrom them. On a corporate network, where users are unlikely to be regularly visiting targeted\nbanking URLs, exfiltrating banking credentials is a less successful money-making model\ncompared to the locking of potentially hundreds of machines.\n\n\n-----\n\nThe TrickBot authors continue to target various financial institutions across the world, using\nMS17-010 exploits in an attempt to successfully laterally move throughout a victim’s network.\nThis is being coupled with an unfinished “screenLocker” module in a new possible attempt to\nextort money from victims. The TrickBot banking trojan remains under continual development\n[and testing in a constant effort by its developers to stay one step ahead of cybersecurity](https://www.webroot.com/us/en/business)\nprofessionals.\n\n\n-----\n\n### About the Author\n\n**[Jason Davison](https://www.webroot.com/blog/author/jdavison/)**\n\nAdvanced Threat Research Analyst\n\nJason is a Malware Threat Researcher, investigating the latest techniques used in modern\nmalware. Working for Webroot, he researches and reverses the latest malware families\nidentifying new functionality and TTP’s.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-03-21 - TrickBot Banking Trojan Adapts with New Module.pdf"
    ],
    "report_names": [
        "2018-03-21 - TrickBot Banking Trojan Adapts with New Module.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535936,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653693265,
    "ts_modification_date": 1653693265,
    "files": {
        "pdf": "https://archive.orkl.eu/2ff8e3425515608c5ba424c7cc6d220a3814d0b1.pdf",
        "text": "https://archive.orkl.eu/2ff8e3425515608c5ba424c7cc6d220a3814d0b1.txt",
        "img": "https://archive.orkl.eu/2ff8e3425515608c5ba424c7cc6d220a3814d0b1.jpg"
    }
}