{
    "id": "fd28d949-192d-4fe0-9c71-ec89bbcaa7fd",
    "created_at": "2023-01-12T15:03:36.607328Z",
    "updated_at": "2025-03-27T02:05:31.514142Z",
    "deleted_at": null,
    "sha1_hash": "d5dd85fe70d2ac13432da5aefc92a477dbecea61",
    "title": "2020-12-17 - Onboarding Threat Indicators into Splunk Enterprise Security- SolarWinds Continued",
    "authors": "",
    "file_creation_date": "2022-05-28T19:57:13Z",
    "file_modification_date": "2022-05-28T19:57:13Z",
    "file_size": 726440,
    "plain_text": "# Onboarding Threat Indicators into Splunk Enterprise Security: SolarWinds Continued\n\n**splunk.com/en_us/blog/security/smoothing-the-bumps-of-onboarding-threat-indicators-into-splunk-enterprise-**\nsecurity.html\n\nDecember 17, 2020\n\nSECURITY\n\n\n-----\n\nBy [John Stoner December 17, 2020](https://www.splunk.com/en_us/blog/author/jstoner.html)\nAs your team responds to the SolarWinds security advisory, we wanted to provide additional\nguidance to help you more effectively ingest threat indicators to combat the Sunburst\n[Backdoor malware in Splunk Enterprise Security (ES). After applying these tips, you can](https://www.splunk.com/en_us/software/enterprise-security.html)\n[jump into this blog, \"Using Splunk to Detect Sunburst Backdoor,\" and take action.](https://www.splunk.com/en_us/blog/security/sunburst-backdoor-detections-in-splunk.html)\n\nWhile the existing method of downloading indicators into Splunk Enterprise has been in\nplace for a long time whether you’re running ES 6.4 or older versions like ES 4.5, we have a\nfew tips and tricks to share that will hopefully smooth out some bumps you may have\n\n\n-----\n\nencountered in the past.\n\n## The Issues with Fields\n\nOne of the greatest pain points encountered when ingesting threat indicators is the naming\nof fields. The threat intelligence framework expects that specific header field values are\n[being utilized. The reference for this can be found here.](https://docs.splunk.com/Documentation/ES/latest/Admin/Supportedthreatinteltypes)\n\nFor example, if I am pulling a list of IP addresses in, the framework is expecting the field\nthat contains the IP address to be called “IP” – not dest, src, source_ip or anything else, just\n“IP”. Similarly, for a domain name, it is looking for the field domain. Below is an example\nfrom the link above.\n\n[To illustrate this, we are going to use the GitHub repository for Sunburst Backdoor that](https://github.com/davisshannon/Splunk-Sunburst)\nShannon Davis created as an example. I started off by creating two intelligence downloads\ncalled SunburstDomain and SunburstIP. I have configured the type, description and the\nURL that it is pulling from.\n\nWhen I click on each one and scroll down, I can see parsing options. Notice in Fields we\nare looking in the first column of the csv file for values that will populate the ip field and the\ndescription column will be filled with a constant of SunburstIPListing.\n\n\n-----\n\nSimilarly in our domain download, the domain values are in the first position on the list,\nwhich is why we are using $1 to denote where to look. We are also using a constant again\nto describe the list. This time, I have ignored the wisdom of using the supported type of\nthreat intel and instead of calling my first field domain, I am calling it “url_domain”.\n\nWhile the threat intel download will save and the file will download, I find myself to be\ndisappointed because these domains are not populating my lookups. How can I try to\ntroubleshoot this?\n\nThe good news is there are a number of places that can be reviewed along the way to\ndetermine what is going wrong.\n\n## Tips and Tricks\n\nStart by ensuring that the Intelligence Downloads are enabled.\n\nFrom there, check and see if the file has been downloaded by going to Audit – Threat\nIntelligence Audit in Enterprise Security. The download_status should show that the threat\nlist has been downloaded. If it didn’t, chances are that the URL is not correct.\n\n\n-----\n\nFor skeptics like me, knowing where the threat intelligence files have been downloaded to is\na nice piece of information to have. From the command line, go to\n$SPLUNK_HOME/etc/apps/SA-ThreatIntelligence/local/data/threat_intel/ directory. If the\nfiles have been successfully downloaded, both the SunburstDomain and SunburstIP files\ncan be viewed in the file system. The naming convention of the files are based on the name\nspecified in the Intelligence Downloads.\n\nNow that I know the files are there, how do I know that they are being parsed and loaded to\nlookups?\n\nThe lower half of the Threat Intelligence Audit dashboard has all of the audit logs pertaining\nto parsing the threat intelligence and loading of it so that is another nice place to look. That\nsaid, it is limited to the last 1000 events and if I want to focus on my two downloads,\nopening it and then adding my own file names might be a good choice.\n```\neventtype=threatintel_internal_logs (SunburstIP.csv OR SunburstDomain.csv)\n\n```\nIf I look closely at these two events, I want to highlight what the thrill of victory and the\nagony of defeat looks like. (Hopefully that resonates with a few of you who grew up\nwatching the Wide World of Sports.) The second event in the image below shows that the\nIP addresses have been written to the collection. IP addresses are loaded!!!\n\n\n-----\n\nThe first event has thrown an error and this is due to the use of url_domain instead of\ndomain for our field name and this has caused an exception in processing the file. The\nframework doesn’t know what to do with the downloaded data so it throws an error and\nmoves on. This is definitely something to look for in events and if this error is seen, check\nthe parsing options to ensure the field names used are defined by ES.\n\nAt this point I am going to set the domain indicators aside and finish up with the IP address.\nThere are a few intermediate steps that happen that I won’t bore you with, the \"Enterprise\nSecurity Biology\" from .conf2017 covers that in gory detail, but what we are striving for is\nthat the data gets loaded to the KVStore into the various threat collections, depending on\nthe type of indicator.\n```\n| inputlookup ip_intel | search description=SunburstIPListing\n\n```\nIn this case, I can search the ip_intel table to see if the indicators have been loaded.\nBecause I want to focus on the SunburstIPListing, which if you recall is the description that I\nadded into the parsing options, I can use a | search to narrow my results set to just that list.\n\nFrom there, the threat intelligence framework takes over and a series of savedsearches run\non an on-going basis to correlate events with the different threat collections and write the\ndata to the threat activity datamodel The correlation search will then run on a scheduled\n\n\n-----\n\nbasis and pluck the new items out of the datamodel and create notables out of them.\n\nI hope this has been helpful and will streamline your onboarding of these threat indicators\n[into your Splunk Enterprise Security instance.](https://www.splunk.com/en_us/software/enterprise-security.html)\n\nPosted by\n\n**[John Stoner](https://www.splunk.com/en_us/blog/author/jstoner.html)**\n\n\n-----\n\nI grew up in Virginia, graduated from Penn State and came back to Virginia where I have\nworked with databases and cyber for over 20 years. A job or two felt like I really was a cast\nmember of The Office or Office Space, but every one of them taught me something new.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-17 - Onboarding Threat Indicators into Splunk Enterprise Security- SolarWinds Continued.pdf"
    ],
    "report_names": [
        "2020-12-17 - Onboarding Threat Indicators into Splunk Enterprise Security- SolarWinds Continued.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535816,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1653767833,
    "ts_modification_date": 1653767833,
    "files": {
        "pdf": "https://archive.orkl.eu/d5dd85fe70d2ac13432da5aefc92a477dbecea61.pdf",
        "text": "https://archive.orkl.eu/d5dd85fe70d2ac13432da5aefc92a477dbecea61.txt",
        "img": "https://archive.orkl.eu/d5dd85fe70d2ac13432da5aefc92a477dbecea61.jpg"
    }
}