{
    "id": "fd6294e5-87b3-40b5-9881-4cc09b4b2578",
    "created_at": "2023-01-12T15:04:32.191553Z",
    "updated_at": "2025-03-27T02:15:26.15662Z",
    "deleted_at": null,
    "sha1_hash": "6dbe948d7d91594ef81c88f62373ca439885f5d1",
    "title": "2022-01-27 - Threat Assessment- BlackCat Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T21:45:25Z",
    "file_modification_date": "2022-05-28T21:45:25Z",
    "file_size": 1891290,
    "plain_text": "# Threat Assessment: BlackCat Ransomware\n\n**unit42.paloaltonetworks.com/blackcat-ransomware/**\n\nAmanda Tanner, Alex Hinchliffe, Doel Santos January 27, 2022\n\nBy [Amanda Tanner,](https://unit42.paloaltonetworks.com/author/amanda-tanner/) [Alex Hinchliffe and](https://unit42.paloaltonetworks.com/author/alex-hinchliffe/) [Doel Santos](https://unit42.paloaltonetworks.com/author/doel-santos/)\n\nJanuary 27, 2022 at 6:00 AM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Ransomware](https://unit42.paloaltonetworks.com/category/ransomware/)\n\nTags: [ALPHV,](https://unit42.paloaltonetworks.com/tag/alphv/) [BlackCat ransomware,](https://unit42.paloaltonetworks.com/tag/blackcat-ransomware/) [conti ransomware,](https://unit42.paloaltonetworks.com/tag/conti-ransomware/) [Cybercrime,](https://unit42.paloaltonetworks.com/tag/cybercrime/) [DDoS,](https://unit42.paloaltonetworks.com/tag/ddos/) [Hive,](https://unit42.paloaltonetworks.com/tag/hive/) LockBit\n2.0, [threat assessment](https://unit42.paloaltonetworks.com/tag/threat-assessment/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/blackcat-ransomware/)\n\n## Executive Summary\n\nBlackCat (aka ALPHV) is a ransomware family that surfaced in mid-November 2021 and\nquickly gained notoriety for its sophistication and innovation. Operating a ransomware-as-aservice (RaaS) business model, BlackCat was observed soliciting for affiliates in known\ncybercrime forums, offering to allow affiliates to leverage the ransomware and keep 80-90%\nof the ransom payment. The remainder would be paid to the BlackCat author.\n\n\n-----\n\nBlackCat has taken an aggressive approach to naming and shaming victims, listing more\nthan a dozen on their leak site in a little over a month. The largest number of the group’s\nvictims so far are U.S. organizations, but BlackCat and its affiliates have also attacked\norganizations in Europe, the Philippines and other locations. Victims include organizations in\nthe following sectors: construction and engineering, retail, transportation, commercial\nservices, insurance, machinery, professional services, telecommunication, auto components\nand pharmaceuticals.\n\nUse of BlackCat ransomware has grown quickly for a variety of reasons (for comparison,\n[AvosLocker had only listed a handful of victims publicly within two months of becoming](https://unit42.paloaltonetworks.com/emerging-ransomware-groups/)\nknown). Effective marketing to affiliates is a likely factor – in addition to offering an enticing\nshare of ransom payments, the group has solicited affiliates by posting ads on forums such\nas Ransomware Anonymous Market Place (RAMP).\n\nThe malware itself is coded in the Rust programming language. Though this is not the first\npiece of malware to use Rust, it is one of the first, if not the first, piece of ransomware to use\nit. By leveraging this programming language, the malware authors are able to easily compile\nit against various operating system architectures. Given its numerous native options, Rust is\nhighly customizable, which facilitates the ability to pivot and individualize attacks.\n\nThe threat actors leveraging BlackCat, often referred to as the \"BlackCat gang,” utilize\nnumerous tactics that are becoming increasingly commonplace in the ransomware space.\nNotably, they use multiple extortion techniques in some cases, including the siphoning of\nvictim data before ransomware deployment, threats to release data if the ransom is not paid\nand distributed denial-of-service (DDoS) attacks.\n\nPalo Alto Networks detects and prevents BlackCat ransomware with the following products\nand services: [Cortex XDR and](https://www.paloaltonetworks.com/cortex/cortex-xdr) [Next-Generation Firewalls (including cloud-delivered security](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\n[subscriptions such as WildFire).](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\n\nDue to the surge of this malicious activity, we’ve created this threat assessment for overall\nawareness. Full visualization of the techniques observed, relevant courses of action and\n[IOCs can be viewed in the Unit 42 ATOM viewer.](https://unit42.paloaltonetworks.com/atoms/blackcat-ransomware/)\n\nTypes of Attacks Covered [Ransomware,](https://unit42.paloaltonetworks.com/category/ransomware/) [DDoS](https://unit42.paloaltonetworks.com/tag/ddos/)\n\nRansomware Families Discussed [BlackCat](https://unit42.paloaltonetworks.com/tag/blackcat-ransomware/)\n\nRelated Unit 42 Topics [Cybercrime,](https://unit42.paloaltonetworks.com/tag/cyber-crime/) [Conti,](https://unit42.paloaltonetworks.com/tag/conti-ransomware/) [LockBit 2.0,](https://unit42.paloaltonetworks.com/tag/lockbit-2-0/) [Hive,](https://unit42.paloaltonetworks.com/tag/hive/) [Avos](https://unit42.paloaltonetworks.com/tag/avos/)\n\n## Table of Contents\n\nBlackCat Ransomware Overview\n\nTechnical Details\n\n- BlackCat Config\n\n\n-----\n\n- Associated Tools\nPost-compromise Activities\nCourses of Action\nConclusion\nAdditional Resources\nAcknowledgments\n\n## BlackCat Ransomware Overview\n\nSoliciting via known cybercrime forums, BlackCat is seeking affiliates to deploy its\nransomware. Affiliates keep an 80-90% share of the ransom payment, with the remainder\ngoing to the BlackCat author. These affiliates are interviewed and vetted before being\naccepted into the RaaS group. Once the affiliate is confirmed, they are given unique access\nto a Tor-based control panel that hosts the affiliate’s access.\n\nWritten in the Russian language, the control panel gives the affiliate updates and\nannouncements about deploying and operating the ransomware as well as troubleshooting\ntips to help the affiliate be more successful in their campaigns. Along with the control panel,\na name and shame blog is also hosted, targeting victims who have either ignored or refused\nto pay the ransom. This site has been regularly updated with new victims since the initial\ndiscovery of the group.\n\nAs shown in Figure 1 below, many RaaS operators use the double-extortion technique of\nexfiltrating data prior to encryption, which provides them greater leverage in negotiating\nransom funds. As of December 2021, BlackCat has the seventh largest number of victims\nlisted on their leak site among ransomware groups tracked by Unit 42 – impressive\nconsidering that this group has only been publicly known since November 2021. While Conti\n(ranked second) has been around in various guises for almost two years, it is surrounded at\nthe top of the chart by [emerging families. LockBit 2.0 and Hive both have at least six months’](https://unit42.paloaltonetworks.com/emerging-ransomware-groups/)\nhead start on BlackCat, but this highlights a worrying trend that newcomers (or reformed\ngroups) can attack many victims in a short space of time.\n\n\n-----\n\nFigure 1. Leak site/name and shame blog statistics, December 2021.\nUsing the leak site information, we can understand the location and types of victims affected\nby BlackCat attacks. Victims include organizations in the following sectors: construction and\nengineering, retail, transportation, commercial services, insurance, machinery, professional\nservices, telecommunication, auto components and pharmaceuticals. Figure 2 breaks down\nthe victims by country. However, the so-far sporadic spread of the attacks may indicate a\nsomewhat opportunistic approach, as with most contemporary ransomware families.\n\n\n-----\n\nFigure 2. BlackCat leak site victims by country.\n\n## Technical Details\n\nBlackCat is positioned to pivot to individualized, customized attacks due to the numerous\noptions available when coding in Rust (Figure 3). Rust programming has gained momentum\ndue to its fast and high performance, powerful web application development, low overhead\nfor embedded programming, and memory management resolution. Rust also facilitates the\nBlackCat author due to its efficiency regarding algorithms that power the encryption\ncapability of the ransomware. Because of its efficiency and adaptability, BlackCat has been\nseen targeting both Windows and Linux systems.\n\n\n-----\n\nFigure 3. BlackCat execution options.\nIn an effort to maintain longevity, the use of the --access-token flag is required to execute the\nransomware, which can make it harder to analyze in sandboxed environments.\n\n### BlackCat Config\n\nWhile analyzing the ransomware configurations, we observed numerous evasion tactics\ndeployed. These evasion techniques are used in an effort to impair or disable system\ndefenses as well as to stop certain applications that may lock files open on disk, causing\nproblems when trying to encrypt them. BlackCat attempts to kill several processes and\nservices to hinder or prevent security solutions and backups. The process list checked is as\nfollows:\n\nagntsvc, dbeng50, dbsnmp, encsvc, excel, firefox, infopath, isqlplussvc, msaccess, mspub,\nmydesktopqos, mydesktopservice, notepad, ocautoupds, ocomm, ocssd, onenote, oracle,\noutlook, powerpnt, sqbcoreservice, sql, steam, synctime, tbirdconfig, thebat, thunderbird,\nvisio, winword, wordpad, xfssvccon, *sql*, bedbh, vxmon, benetns, bengien, pvlsvr, beserver,\nraw_agent_svc, vsnapvss, CagService, QBIDPService, QBDBMgrN, QBCFMonitorService,\nSAP, TeamViewer_Service, TeamViewer, tv_w32, tv_x64, CVMountd, cvd, cvfwd, CVODS,\nsaphostexec, saposcol, sapstartsrv, avagent, avscc, DellSystemDetect, EnterpriseClient,\nVeeamNFSSvc, VeeamTransportSvc, VeeamDeploymentSvc\n\nThe services running on the compromised system are checked against the following list:\n\nmepocs, memtas, veeam, svc$, backup, sql, vss, msexchange, sql$, mysql, mysql$, sophos,\nMSExchange, MSExchange$, WSBExchange, PDVFSService, BackupExecVSSProvider,\nBackupExecAgentAccelerator, BackupExecAgentBrowser, BackupExecDiveciMediaService,\n\n\n-----\n\nBackupExecJobEngine, BackupExecManagementService, BackupExecRPCService, GxBlr,\nGxVss, GxClMgrS, GxCVD, GxCIMgr, GXMMM, GxVssHWProv, GxFWD, SAPService, SAP,\nSAP$, SAPD$, SAPHostControl, SAPHostExec, QBCFMonitorService, QBDBMgrN,\nQBIDPService, AcronisAgent, VeeamNFSSvc, VeeamDeploymentService,\nVeeamTransportSvc, MVArmor, MVarmor64, VSNAPVSS, AcrSch2Svc\n\nIn an effort to maintain persistence, the BlackCat ransomware excludes key system and\napplication folders – as well as key components – from encryption so as not to render the\nsystem and ransomware inoperative. The folders excluded are as follows:\n\nsystem volume information, intel, $windows.~ws, application data, $recycle.bin, mozilla,\n$windows.~bt, public, msocache, windows, default, all users, tor browser, programdata, boot,\nconfig.msi, google, perflogs, appdata, windows.old\n\nExcluded file names are as follows:\n\ndesktop.ini, autorun.inf, ntldr, bootsect.bak, thumbs.db, boot.ini, ntuser.dat, iconcache.db,\nbootfont.bin, ntuser.ini, ntuser.dat.log\n\nAny file with an extension matching the following list will also be avoided:\n\nthemepack, nls, diagpkg, msi, lnk, exe, cab, scr, bat, drv, rtp, msp, prf, msc, ico, key, ocx,\ndiagcab, diagcfg, pdb, wpx, hlp, icns, rom, dll, msstyles, mod, ps1, ics, hta, bin, cmd, ani,\n386, lock, cur, idx, sys, com, deskthemepack, shs, ldf, theme, mpa, nomedia, spl, cpl, adv,\nicl, msu\n\nHardcoded credentials stored within the BlackCat ransomware config lend credence to the\nlikelihood that specific victims are being targeted. The credentials also allow BlackCat to\nmove laterally within the victim’s system and/or network, often with administrative privileges.\nCredential access permits the ransomware to deploy additional tools that further propagate\n[the attack. These observations have also been confirmed by Symantec.](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/noberus-blackcat-alphv-rust-ransomware)\n\n### Associated Tools\n\nBlackCat has been observed using multiple – often legitimate – tools throughout their\nattacks, such as Mimikatz, LaZagne and WebBrowserPassView to recover stored\npasswords, as well as GO Simple Tunnel (GOST) and MEGAsync to exfiltrate data.\nAdditionally, anti-forensics tools like fileshredder, an application to securely delete unwanted\nfiles beyond recovery, have also been leveraged during some BlackCat ransomware attacks\ninvestigated by Unit 42.\n\n## Post-compromise Activities\n\n\n-----\n\nOnce candidate systems have been identified for encryption by the threat actors, the\nransomware deployment occurs and all viable files will be encrypted. This process often\ninvolves renaming files to include another or a different file extension, such as wpzlbji, in the\nexample shown in Figure 4. As is commonplace with other ransomware strains, BlackCat\nransomware will drop ransom notes on the compromised system(s) to inform the victim of\nwhat has happened and how to go about getting their data restored. Text files with the name\nRECOVER-[RANDOM]-FILES.txt (where [RANDOM] refers to the aforementioned file\nextension name) will be found on the compromised system containing information and\ninstructions such as those in the example below:\n\nFigure 4. An example of a BlackCat ransom note dropped on a compromised system.\nBlackCat utilizes a unique onion domain with a victim-specific access key for the victim to\nuse to learn more about the attack, their data, and what the threat actors want the victim to\ndo next. The following example URL highlights the notation used by BlackCat ransomware:\n\nhttp://2cuqgeerjdba2rhdiviezodpu3lc4qz2sjf4qin6f7std2evleqlzjid[.]onion/?accesskey=${ACCESS_KEY}\",\"note_short_text\":\"Important\n\nOnce the victim navigates to the onion site provided, they will see something similar to\nFigure 5 below. This site reiterates the problem and that the actor's Decrypt App private key\nis the only way to get their data back. The portal also provides chat facilities, the ransom\n\n\n-----\n\namounts – which can differ depending on when the payment is sent – how to pay, and a way\nto test that the decryption works.\n\nFigure 5. Example onion site information for BlackCat victims.\n\nUnit 42 has observed BlackCat affiliates asking for ransom amounts of up to $14 million,\nthough they offered to discount this demand to $9 million if paid before the established time.\nInterestingly, the ransom demand gives the victim the option to pay not only in Bitcoin (the\nmost common option) but also in Monero.\n\nIn some cases, BlackCat operators use the chat to threaten the victim, claiming they will\nperform a DDoS attack on the victims' infrastructure if the ransom is not paid. When it\nappears in addition to the use of a leak site, this practice is known as triple extortion, a tactic\n[that was observed being used by groups like Avaddon and](https://unit42.paloaltonetworks.com/ransomware-threat-report-highlights/) [Suncrypt in the past.](https://unit42.paloaltonetworks.com/ransomware-threat-report-highlights/)\n\n\n-----\n\nOne unique feature of BlackCat ransomware is that negotiation chats can only be accessed\nby those holding an access token key or ransom note – the group has made efforts to avoid\nthird-party snooping.\n\n## Courses of Action\n\nThis section documents the relevant tactics, techniques and procedures (TTPs) used by\nBlackCat ransomware and operators, mapping them directly to the Palo Alto Networks\nproduct(s) and service(s) protecting against them. It also further instructs customers on how\nto ensure their devices are appropriately configured.\n\n**_Product / Service_** **_Course of Action_**\n\n**_Discovery_**\n\n_The below courses of action mitigate the_\n_following techniques:_\n\n_[Process Discovery [T1057], File and Directory](https://attack.mitre.org/techniques/T1057)_\n_[Discovery [T1083]](https://attack.mitre.org/techniques/T1083)_\n\n_CORTEX XDR PREVENT_ _Configure Behavioral Threat Protection_\n_under the Malware Security Profile_\n\n**_Lateral Movement_**\n\n_The below courses of action mitigate the_\n_following techniques:_\n\n_[Lateral Tool Transfer [T1570]](https://attack.mitre.org/techniques/T1570)_\n\n_THREAT PREVENTION†_ _Ensure that antivirus profiles are set to_\n_block on all decoders except 'imap' and_\n_'pop3'_\n\n_Ensure an anti-spyware profile is configured to_\n_block on all spyware severity levels, categories_\n_and threats_\n\n_Ensure a secure antivirus profile is applied to all_\n_relevant security policies_\n\n**_Command and Control_**\n\n\n-----\n\n_The below courses of action mitigate the_\n_following techniques:_\n\n_[Multi-hop Proxy [T1090.003]](https://attack.mitre.org/techniques/T1090/003)_\n\n_THREAT PREVENTION†_ _Ensure passive DNS monitoring is set_\n_to enabled on all anti-spyware profiles_\n_in use_\n\n_Ensure an anti-spyware profile is configured to_\n_block on all spyware severity levels, categories_\n_and threats_\n\n_Ensure a secure anti-spyware profile is applied_\n_to all security policies permitting traffic to the_\n_internet_\n\n_Ensure that antivirus profiles are set to block on_\n_all decoders except 'imap' and 'pop3'_\n\n_Ensure DNS sinkholing is configured on all anti-_\n_spyware profiles in use_\n\n_Ensure a secure antivirus profile is applied to all_\n_relevant security policies_\n\n_ADVANCED URL FILTERING†_ _Ensure that URL Filtering uses the_\n_action of “block” or “override” on the_\n_URL categories_\n\n_Ensure secure URL filtering is enabled for all_\n_security policies allowing traffic to the internet_\n\n_Ensure that Advanced URL Filtering is used_\n\n_Ensure that access to every URL is logged_\n\n_Ensure all HTTP Header Logging options are_\n_enabled_\n\n_CORTEX XSOAR_ _Deploy XSOAR Playbook - PAN-OS_\n_Query Logs for Indicators_\n\n_Deploy XSOAR Playbook - Palo Alto Networks -_\n_Hunting And Threat Detection_\n\n_NEXT-GENERATION FIREWALLS_ _Ensure 'SSL Forward Proxy Policy' for_\n_traffic destined to the internet is_\n_configured_\n\n\n-----\n\n_Ensure 'SSL Inbound Inspection' is required for_\n_all untrusted traffic destined for servers using_\n_SSL or TLS_\n\n_Ensure application security policies exist when_\n_allowing traffic from an untrusted zone to a more_\n_trusted zone_\n\n_Ensure 'Service setting of ANY' in a security_\n_policy allowing traffic does not exist_\n\n_Ensure 'Security Policy' denying any/all traffic_\n_to/from IP addresses on Trusted Threat_\n_Intelligence Sources exists_\n\n_Ensure that the Certificate used for Decryption is_\n_Trusted_\n\n**_Exfiltration_**\n\n_The below courses of action mitigate the_\n_following techniques:_\n\n_[Exfiltration to Cloud Storage [T1567.002]](https://attack.mitre.org/techniques/T1567/002)_\n\n_URL FILTERING†_ _Ensure secure URL filtering is enabled_\n_for all security policies allowing traffic_\n_to the internet_\n\n_Ensure all HTTP Header Logging options are_\n_enabled_\n\n_Ensure that URL Filtering uses the action of_\n_‘block’ or ‘override’ on the URL categories_\n\n_Ensure that access to every URL is logged_\n\n_Ensure that Advanced URL Filtering is used_\n\n**_Impact_**\n\n_The below courses of action mitigate the_\n_following techniques:_\n\n_[Data Encrypted for Impact [T1486], Service Stop](https://attack.mitre.org/techniques/T1486)_\n\n_[[T1489], Inhibit System Recovery [T1490]](https://attack.mitre.org/techniques/T1489)_\n\n\n-----\n\n_CORTEX XSOAR_ _Deploy XSOAR Playbook -_\n_Ransomware Manual for incident_\n_response._\n\n_Deploy XSOAR Playbook - Palo Alto Networks_\n_Endpoint Malware Investigation_\n\n_Table 1. Courses of Action for BlackCat ransomware.†These capabilities are part of the NGFW security subscriptions service_\n\n## Conclusion\n\nBlackCat is an innovative and sophisticated ransomware family that is rapidly forming a\nreputation for its highly customized and individualized attacks. By leveraging the Rust\nprogramming language, the malware authors are able to easily compile it against various\noperating system architectures, which facilitates the group’s ability to pivot from one victim to\nthe next. As seen with other ransomware families, BlackCat operates with a RaaS model and\nutilizes multiple extortion techniques, then publishes a leak site to further pressure victims\ninto paying the ransom.\n\nPalo Alto Networks detects and prevents BlackCat ransomware in the following ways:\n\n[WildFire: All known samples are identified as malware.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n[Cortex XDR with:](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n\nIndicators for BlackCat.\nAnti-Ransomware Module to detect BlackCat encryption behaviors on Windows.\nLocal Analysis detection for BlackCat binaries on Windows.\nBTP rule prevents Ransomware activity on Linux.\n[Next-Generation Firewalls: DNS Signatures detect the known command and control](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\n[(C2) domains, which are also categorized as malware in URL Filtering.](https://www.paloaltonetworks.com/products/threat-detection-and-prevention/web-security)\n\n[Indicators of compromise and BlackCat-associated TTPs can be found in the BlackCat](https://autofocus.paloaltonetworks.com/#/tag/Unit42.BlackCat)\nATOM.\n\nIf you think you may have been compromised or have an urgent matter, get in touch with the\n[Unit 42 Incident Response team or call North America Toll-Free: 866.486.4842](http://start.paloaltonetworks.com/contact-unit42.html)\n(866.4.UNIT42), EMEA: +31.20.299.3130, APAC: +65.6983.8730, or Japan:\n+81.50.1790.0200.\n\nPalo Alto Networks has shared our findings, including file samples and indicators of\ncompromise, in this report with our fellow Cyber Threat Alliance (CTA) members. CTA\nmembers use this intelligence to rapidly deploy protections to their customers and to\n[systematically disrupt malicious cyber actors. Learn more about the Cyber Threat Alliance.](http://www.cyberthreatalliance.org/)\n\n## Additional Resources\n\n\n-----\n\n## Acknowledgements\n\nWe would like to thank Simon Conant for his help with sample collection, and malware and\ninfrastructure analysis.\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-27 - Threat Assessment- BlackCat Ransomware.pdf"
    ],
    "report_names": [
        "2022-01-27 - Threat Assessment- BlackCat Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535872,
    "ts_updated_at": 1743041726,
    "ts_creation_date": 1653774325,
    "ts_modification_date": 1653774325,
    "files": {
        "pdf": "https://archive.orkl.eu/6dbe948d7d91594ef81c88f62373ca439885f5d1.pdf",
        "text": "https://archive.orkl.eu/6dbe948d7d91594ef81c88f62373ca439885f5d1.txt",
        "img": "https://archive.orkl.eu/6dbe948d7d91594ef81c88f62373ca439885f5d1.jpg"
    }
}