{
    "id": "fd992942-b7e0-4a7c-b908-2c249b6ab3fc",
    "created_at": "2023-01-12T15:05:22.696897Z",
    "updated_at": "2025-03-27T02:05:52.900768Z",
    "deleted_at": null,
    "sha1_hash": "058628b37b708f5358d303ac071eac7635f38492",
    "title": "2015-09-23 - Quaverse RAT- Remote-Access-as-a-Service",
    "authors": "",
    "file_creation_date": "2022-05-28T15:54:17Z",
    "file_modification_date": "2022-05-28T15:54:17Z",
    "file_size": 1003163,
    "plain_text": "# Quaverse RAT: Remote-Access-as-a-Service\n\n**[trustwave.com/Resources/SpiderLabs-Blog/Quaverse-RAT--Remote-Access-as-a-Service/](https://www.trustwave.com/Resources/SpiderLabs-Blog/Quaverse-RAT--Remote-Access-as-a-Service/)**\n\n_***UPDATE as of September 28, 2015 - see the bottom of this post for removal_\n_instructions***_\n\n[Quaverse RAT or QRAT is a fairly new Remote Access Tool (RAT) introduced in May 2015.](https://www.youtube.com/watch?v=kD1wKljeuqc)\nThis RAT is marketed as an undetectable Java RAT. As you might expect from a RAT, the\ntool is capable of grabbing passwords, key logging and browsing files on the victim's\ncomputer. On a regular basis for the past several months, we have observed the inclusion\nof QRAT in a number of spam campaigns.\n\nBelow you'll see an example of one spam message that claimed to be a \"limited purchase\norder\" (LPO). Attached to it was a .zip attachment containing an executable .JAR file.\n\n\n-----\n\n**Analysis**\n\nQRAT is a Java-based remote access Trojan or RAT that was designed to work only in\nWindows environments with Java-runtime installed.\n\nTo avoid being detected by antivirus scanners, it uses a \"Russian-doll\" method with 2 layers\nof Java encryption. The illustration below shows the levels of encryption used to hide the\nQRAT server executable.\n\n\n-----\n\nIn the infected system, the configuration files, plugins and Java executables are dropped in\nthe %AppData%\\syslogdata folder (e.g., \"C:\\Documents and Settings\\User\\Application\nData\\syslogdata\\\").\n\nIt adds an auto run registry key to keep it persistent in the target's system:\n\n\n-----\n\nThe RAT connects to its host quaverse.com at port 1777. It may also connect to the\ndomain name schelbye.com that points to the same IP address as quaverse.com. It also\nuses a list of backup domain names as follows:\n\nValtce.co\nFrecarn.co\nGtfoods.com.ru\nSoqda.com\n\nPlugins are also available to extend the functionality of the QRAT agent. These\nfunctionalities are not as sophisticated as other RATs we've seen before like DarkComet or\nAlienSpy, however this is still a very capable RAT that gives the intruder full control of the\nvictim's computer once infected. The plugins are readily available from the slick Quaverse\nRAT website shown here:\n\n\n-----\n\nQRAT is sold as a software-as-a-service with prices ranging from $85 for a one month\nsubscription up to $300 for a one year subscription. Purchasing a service subscription\nrequires the purchaser to submit his or her computer's MAC address to be used as a\ncustomer identifier.\n\nWe've extracted the MAC ID and unique identifier of the intruder from the spam email\nsample:\n\nTo satisfy our curiosity, we tracked the intruder's MAC address/ID from Quaverse's website\nand found the RAT server. It seems the intruder bought a one year subscription that will\nexpire on June 20, 2016. Following that logic, the spam campaign started on June 20,\n2015.\n\n\n-----\n\n**Conclusion**\n\nRemote Access Trojans are some of the more accessible tools that allow intruders to gain\ncomplete access to a target system. They are GUI- based and very easy to use, hence their\nseeming popularity with novice cybercriminals that spread their wares through email. In fact,\nwe're observing an increase in Java-based Remote Access Trojans showing up in our\nspam-traps over the last couple of months. The chart below shows the volume of related\nspam volume per day since late August 2015:\n\nThe email subject lines usually mention an \"Invoice.\" Here's the top subject lines we've\nobserved:\n\n\n-----\n\nIf you come upon subject lines like those listed or derivatives of them, and you see a .Jar\nattachment, there is a good chance it includes a malicious Remote Access Trojan. We\nrecommend blocking inbound Java files outright at the email gateway, much like any other\nexecutable. The Trustwave Secure Email Gateway blocks such e-mails by default thanks to\nit including Java Class files in its executables category.\n\n_***UPDATE as of September 28, 2015***_\n\n**Removal Instructions**\n\nListed below are manual removal instructions for QRAT:\n\n**Manual Removal Steps:**\n\n1. Disconnecting the infected computer from the internet is highly recommended.\n[2. Identify the malicious Java process. We recommend Sysinternal's Process Explorer](https://technet.microsoft.com/en-us/sysinternals/bb896653.aspx)\n\ntool to search for the malicious process.\n\n1. Download and run Process Explorer from this page\n\n[https://technet.microsoft.com/en-us/sysinternals/bb896653.aspx](https://technet.microsoft.com/en-us/sysinternals/bb896653.aspx)\n2. Find the process named \"javaw.exe\"\n3. Right click on the process then click Properties\n4. In the Javaw.exe process, click the Image tab\n5. Check the command line path if it points to a .Jar file named\n\n%appdata%\\syslogdata\\syslog-Agent.jar (e.g.\n\"C:\\Users\\UserName\\AppData\\Roaming\\syslogdata\\syslog-Agent.jar\")\n6. Kill that process\n\n\n-----\n\n3. Remove QRAT s autorun registry key\n\n1. Click Start->Run then type \"regedit\" in the textbox without the quote\n2. In the left pane, locate this registry path:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n3. In the right pane, locate and delete this registry key: \"QRat-StartUp-Command\"\n\n= \"C:\\Program Files\\<Java Bin Path>\\javaw.exe\" -jar\n\"C:\\%Appdata%\\syslogdata\\syslog-Agent.jar\" manageragent\" /f\n4. Delete the QRAT files and folder\n\n1. Click Start->Run then type in \"%Appdata%\" the textbox without the quote\n2. Locate the folder named \"syslogdata\"\n3. Delete all the files in the folder and lastly delete the folder itself.\n5. Restart computer\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-09-23 - Quaverse RAT- Remote-Access-as-a-Service.pdf"
    ],
    "report_names": [
        "2015-09-23 - Quaverse RAT- Remote-Access-as-a-Service.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535922,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1653753257,
    "ts_modification_date": 1653753257,
    "files": {
        "pdf": "https://archive.orkl.eu/058628b37b708f5358d303ac071eac7635f38492.pdf",
        "text": "https://archive.orkl.eu/058628b37b708f5358d303ac071eac7635f38492.txt",
        "img": "https://archive.orkl.eu/058628b37b708f5358d303ac071eac7635f38492.jpg"
    }
}