{
    "id": "fddaf522-b50e-4acc-a3a3-08d01fc4bb6c",
    "created_at": "2023-01-12T15:04:27.827187Z",
    "updated_at": "2025-03-27T02:10:09.998499Z",
    "deleted_at": null,
    "sha1_hash": "ccf0778324891bedf519b5b20d120e9bc0b2df45",
    "title": "2020-08-06 - The Secret Life of an Initial Access Broker",
    "authors": "",
    "file_creation_date": "2022-05-28T05:03:32Z",
    "file_modification_date": "2022-05-28T05:03:32Z",
    "file_size": 5191981,
    "plain_text": "# The Secret Life of an Initial Access Broker\n\n**ke-la.com/the-secret-life-of-an-initial-access-broker/**\n\n## Bottom Line Up Front\n\n\nAugust 6, 2020\n\n\nRecently, ZDNet exclusively reported a leak posted on a cybercrime community\n**containing details and credentials of over 900 enterprise Secure Pulse servers**\nexploited by threat actors\nSince this leak represents an ever-growing ransomware risk, KELA delved into both\n**the leak’s content and the actors who were involved in its inception and circulation**\nThis short research targets a specific tier of cybercriminal actors – Initial Access\n**Brokers. These are mid-tier actors who specialize in obtaining initial network**\n**access from a variety of sources, curating and grooming it into a wider network**\n**compromise – and then selling them off to ransomware affiliates**\nWith the affiliate ransomware network becoming more and more popular and affecting\nhuge enterprises as well as smaller ones, initial access brokers are rapidly\n**becoming an important part of the affiliate ransomware supply chain**\n**The list leak mentioned above seems to have been circulating between several**\n**initial access brokers in cybercrime forums, and have been exposed by a LockBit**\naffiliate who regarded the actors as unprofessional\nThis event showcases the breadth of information that’s exchanged on cybercrime\ncommunities and, in KELA’s eyes, emphasizes the need for scalable and targeted\n**monitoring of underground communities**\n\n## RaaS Ecosystem 101\n\nFor the past year or so, the threat intelligence community has been closely tracking the\nongoing changes to the ransomware landscape – noting the shift in business models and\nTTPs employed by ransom actors. While vendors may choose different terms – “humanoperated”, “multi-stage”, “targeted” and more – they all carry the same meaning: ransomware\nactors are opting to go for targets that have more means and more incentive for payment, so\nthey can demand higher ransom amounts.\n\nOne major aspect of this trend, commonly mentioned in the media for its inherent flare and\noptics, is the [naming-and-shaming leveraging tactics used to further push ransomware](https://www.zdnet.com/article/heres-a-list-of-all-the-ransomware-gangs-who-will-steal-and-leak-your-data-if-you-dont-pay/)\nvictims to pay.\n\nAnother aspect is the cooperation between actors facilitated by the rise of targeted\n**ransomware: in order to support work in scale, ransomware operators turn to partners and**\naffiliates to fulfill their remote access needs. This cooperation results in two distinct\n\n\n-----\n\nstakeholders in the targeted ransomware-as-a-service supply chain: the ransomware\ndevelopers who supply the infrastructure, and the partners who supply the network intrusion\nopportunities and deployment of the ransomware itself.\n\nThe affiliate model employed by GandCrab in 2019. Source: McAfee\n\nGenerally speaking, the affiliates working directly with ransomware operators are highly\nvetted, professional actors. At any given moment, most ransomware developers are\nrecruiting only a handful of affiliates – essentially creating a pyramid-like hierarchy; some\nRaaS developers are very keen on their affiliates’ KPIs, with underperforming affiliates being\nremoved from the program.\n\n\n-----\n\n_Post from a cybercrime forum (accessible and translatable through DARKBEAST) where a NetWalker_\n_ransomware recruitment ad shows a very specific criteria for affiliates_\n\nEssentially, affiliates may be perceived as mid-level management. Facing constant scrutiny\nfrom the developers and commission-based salary that’s dependent on successful network\nintrusions, the affiliates’ needs to constantly gain more network access gave rise to another\nactor type: the initial access broker.\n\n## Initial Access Brokers\n\n**Initial access brokers are generally lower-tier, opportunistic actors supplying the**\n**affiliates with** **[access-as-a-service: they obtain initial access to organizations and then](https://ke-la.com/access-as-a-service-remote-access-markets-in-the-cybercrime-underground/)**\noffer it for sale on the same underground forums occupied by RaaS affiliates. Affiliates then\n**buy these initial accesses, pivot and move laterally until enough control is obtained so the**\nransomware can be spread and computers be locked.\n\nBrokers and affiliates are not necessarily differentiated by their level of skill or expertise, but\nrather by the monetization channels they choose to employ. While affiliates or ransomware\nactors monetize networks by locking them and demanding ransom, initial access brokers are\nuse-case agnostic: they sell network access to any actor – financially-motivated APTs (such\nas FINx groups), ransomware actors, data brokers, nation state actors trawling the\ncybercrime underground for leads or essentially any threat actor that has a way to monetize\nsaid access.\n\n\n-----\n\nA handle used by an actor associated with the access broker collective known as FXMSP, offering network\naccess to multiple organizations on the now-defunct KickAss Forum\n\n**Monetizing network access in the cybercrime financial ecosystem is nothing new, and**\ninitial access brokers existed long before the rise of targeted ransomware. However, they\ntended to have less clients. Monetizing network access can be hard, since fraud actors –\nwho make up the lion’s share of active actors on most communities – are more interested in\ncredentials that can be easily converted to cash in hand, whereas sophisticated actors who\ncan monetize access to an obscure network were not, up until lately, in abundance. The\nrecently-established RaaS programs have simplified the process and provided easy\n**monetization channels for network access. These programs have enabled the entire**\nchain of actors to increase profits, as high demand for network access (by affiliates) creates\na higher supply of brokers dedicated to gaining network access.\n\n**In 2019, due the rising tide of RaaS operators, threat intelligence research efforts**\n**started shifting towards access brokers as well. One of the notable actors to attract**\n[major attention was the loose collective known as FXMSP, which operated across multiple](https://www.advanced-intel.com/post/top-tier-russian-hacking-collective-claims-breaches-of-three-major-anti-virus-companies)\n[handles and communities. Others, such as “bc.monster” or “sheriff”, are currently becoming](https://www.recordedfuture.com/network-access-analysis/)\nincreasingly active across Russian-speaking communities. Initial access brokers are, in fact,\nbecoming exponentially more prevalent in cybercrime communities; the amount of posts and\noffers dedicated to monetizing network access has risen drastically in 2020.\n\n\n-----\n\n[Remote access offering on cybercrime forums over time. Source: Positive Technologies](https://www.ptsecurity.com/ww-en/analytics/access-for-sale-2020/)\n\n## The Value Proposition of Access Brokers\n\n**Key enabling factors for the prevalence of access brokers (and, indirectly, to the rapid**\n[rise in targeted ransomware) are the automation and servitization of cybercrime.](https://ke-la.com/access-as-a-service-remote-access-markets-in-the-cybercrime-underground/)\n\n[Let’s take Remote Desktop Protocol – a key vector in targeted ransomware. A few years](https://www.bleepingcomputer.com/news/security/ransomwares-big-jump-ransoms-grew-14-times-in-one-year/)\nago, threat actors needed to employ a wide variety of tools to get access to a valuable,\nfunctioning RDP server belonging to a corporation – including much time spent on\nreconnaissance, brute forcing and nitpicking victims.\n\nToday, one only needs to obtain an invite to one of the many Remote Access Markets and\nbrowse the continuously-updated selection of compromised machines offered for sale. One\nof the major RDP markets has lately also added a “CORP” flag – servers that are part of a\ncorporate network are marked (and priced) differently, so actors can easily spot them and get\nthe most bang for their RDP buck.\n\n\n-----\n\n_An RDP server belonging to an organization offered for sale on an automated market for USD 40_\n\n**This wide selection of goods allows actors a higher volume of work. For a few hundred**\ndollars, initial access brokers can acquire multiple RDP corporate servers; from that selection\nthey can “groom” the ones that look interesting – perform some reconnaissance, escalate\nprivileges or install further tooling. Once a target is ripe and ready, it can be offered for\nthousands of dollars on cybercrime markets where ransomware affiliates can acquire it and\nmove forward with the final attack.\n\n\n-----\n\nThis model creates different stakeholders in the supply chain – each with their own expertise,\nscale of operations and profit margins. During each step of the process both the scope and\nprice of the access get bigger – yielding profits to each stakeholder, and creating small, selfcontained ecosystems that can support large-scale cybercrime efforts.\n\nOn August 4, 2020, ZDNet, in collaboration with KELA’s tools, [exclusively reported on a](https://www.zdnet.com/article/hacker-leaks-passwords-for-900-enterprise-vpn-servers/)\nthreat actor exposing a list of over 900 compromised Secure Pulse VPN servers – including\ncredentials, session keys and other sensitive information being exposed. This was an\ninteresting event for several reasons. First and foremost, the actual leakage provided\nvisibility into targeted servers being used as potential ransomware targets – which has great\nintelligence monitoring value. Second, the leak – and the story behind it – provides an\ninteresting behind-the-scenes look into the activity on an initial access broker.\n\nFirst, in order to understand the story behind the recent leak, one needs to get familiar with\nthe threat actors involved. The first – a man from Ukraine who, according to his posts,\nstarted his hacking activities in 2016 – goes by the handle “Bassterlord”. According to the\nactor’s own accounts, after launching spam campaigns designed to deliver trojans and\ninfostealers, he switched to targeting organizations under the mentorship of an unknown\nthreat actor who hired him in 2019 and provided counselling.\n\nIn a competition of hacking-related articles held on a Russian-speaking underground forum,\nBassterlord shared a writeup of his original story, of how his mentor offered him around $300\na month to send spam emails containing malicious attachments to banking and financial\norganizations. The actors have targeted 12,000 companies over almost one year, though\nthey managed to infect only two of them. “Nothing worked for me, I was desperate,” shared\nBassterlord in this write-up. This was when his mentor taught him how to compromise\norganizations via RDP. At the same time, Bassterlord claims that his mentor “got access to\nSodinokibi” – probably referring to the mentor becoming a Sodinokibi affiliate, showcasing\nthe typical relationship between an affiliate and a soon-to-be initial access broker. Eager to\nget more money, Bassterlord switched to another TTP.\n\n[Bassterlord’s current primary TTP involves the use of an automated script weaponizing CVE-](https://github.com/BishopFox/pwn-pulse)\n2019-11510, an arbitrary file read vulnerability affecting Pulse Connect Secure SSL VPN,\n[which has lately become popular with ransomware actors. Moreover, he states that he](https://us-cert.cisa.gov/ncas/alerts/aa20-010a)\ncontinues to work with his mentor and former employer, which is apparently still involved in\nSodinokibi operations.\n\n\n-----\n\nAnother threat actor involved in the story is named “uhodiransomwar” (from Russian – “Go\naway, ransomware”), previously known as “m1x”. He is a veteran actor, active since 2009\n(though freshly banned) on the same underground forum as Bassterlord. A major part of\nuhodiransomwar’s latest activity is small-scale ransomware: he mostly shares data from\norganizations he claimed to breach once no payment is received. It seems that he\nsometimes acts independently, and is also self-associated with known RaaS actors – such\nas [LockBit.](https://www.cynet.com/blog/threat-report-lockbit-ransomware/)\n\n_A comment in the official LockBit affiliate recruitment thread by uhodiransomwar, claiming to have access_\n_to the affiliates panel_\n\n\n-----\n\nIn the last few weeks, Bassterlord and uhodiransomwar have been publicly clashing in the\nforum – showing the contrasting views of a novice initial access broker and a ransomware\naffiliate, respectively. These ongoing clashes have led to the credentials leak mentioned\nabove.\n\n## Setting the Stage: a Not-So-Great Initial Access Broker\n\nOn July 27, 2020, Bassterlord offered network access to a US-based, state-level government\norganization for USD 8,000. The post claimed that the initial vector was VPN access which\nthen was leveraged into RDP. First responder to the thread was uhodiransomwar, who\nclaimed that the infiltrated network was shared between a few different actors – implying that\nthe backdoor Bassterlord was offering wasn’t exclusive and that he himself has access to the\nserver already, and therefore may be worth less than the price asked.\n\n_Google-translated post where Bassterlord recently posted access to a government entity in the US for_\n_sale._\n\nThe actors continued their public discussion, with Bassterlord admitting that the initial VPN\naccess was indeed public knowledge – implying that multiple actors knew about it to begin\nwith. He later made the case that even though multiple actors may be aware of the access\nitself, he’s not aware of the inner workings on the network – only to his own access,\nleveraged into RDP. He also claims that in his eyes, network access – even if shared –\n\n\n-----\n\nshould be first come, first serve : the first actor to leverage it into a full-blown attack gets the\nspoils. This exemplifies the role of an initial access broker in the ransomware supply\n**chain: they are the function that can take an initial lead to a vulnerability, and work it into a**\nfull blown network access. Thus, several actors working on the same initial access may\ncome up with different results – creating an arms race between brokers and the affiliates who\ndrive them.\n\nThis dialogue, though appears to be superficial, showcases that uhodiransomwar was able\nto identify the victim only through Bassterlord’s description of it – meaning he had actual\naccess to it as well. This fact implies that, somewhere, initial access brokers and affiliates\n**may have access to some shared database of breached entities.**\n\nVery quickly this proved to indeed be the case, as on August 3, 2020, uhodiransomwar\npublished the aforementioned Pulse Secure leak. In his main post, the actor claimed to be\ntired of other actors posing these so-called “public” compromises as private access to\ncorporations and trying to profit off of them – hinting towards Bassterlord’s latest offers.\n\n## Bassterlord’s Little Black Book\n\nUpon investigating the content of the leak, KELA was quickly able to match against several\nnetwork accesses offered by the actor – proving that the leak indeed was the source of\nmultiple (if not all) of Bassterlord’s offers as an initial access broker. Specifically, we were\n**able to trace servers back to the government entity mentioned in the paragraph above**\n– as well as another of Bassterlord’s victims: a university to which he sold access for\n**USD 12,000 on July 12.**\n\nAfter identifying several victims, we tried to get to the bottom of the list; where did it originate,\nand was it really passed between actors who were discreetly sharing compromises? Digging\na bit back into previous posts by the actor, we found a reference in which Bassterlord\n**stated that he has potential access to at least 77 organizations known to be vulnerable.**\nIn this thread, Bassterlord, somewhat braggingly, likened himself to Andrey Turchin – the\nmain figure behind the notorious initial access broker FXMSP – stating that “in the news,\nthey write that he [FXMSP – KELA] got access to more than 130 corporations. So… I’m\nalmost caught up with him”. To this post, Bassterlord attached a heavily redacted screenshot\nof an Excel file that seems to contain dozens of entries, each one representing an initial entry\nvector (assumed to be a vulnerable Pulse Secure server) to an organization.\n\n\n-----\n\n_Bassterlord’s post and a snapshot of his access list_\n\nThe fact that Bassterlord was maintaining an active list of VPN-based accesses, coupled\nwith the fact that uhodiransomwar claimed to have knowledge and access to it, implies that\nsome version of this list was being shared or circulated internally between actors.\n\n**At times it seems that Bassterlord was trying to break out of the initial access broker**\n**cage and monetize his network accesses via direct extortion demands. A now-deleted**\ntweet from July 11 by the actor taunts a Spain-based firm to pay within 5 days, or risk GDPR\nfines. However, it’s unclear whether this claimed attack was carried out via actual\nransomware or manual extortion. Another hint to Bassterlord’s attempts to deploy\nransomware is his post from July 12, where he discontinued the sale of access to a Thailand\nmedia company because it was “locked by me [him] personally”.\n\n\n-----\n\n## What’s in a List?\n\nThe full files leaked by uhodiransomwar and covered by ZDNet were in fact an archive,\ncontaining over 900 txt files – each pertaining to an exploited Secure Pulse server, and\naccompanied with notes taken by the actor who compiled the archive.\n\nFor example, 49 of the 900+ servers are noted to require two factor authentication in order to\nlogin to the admin panel:\n\n\n-----\n\n_Raw notes from the leaked archive, mentioning servers with 2FA_\n\nOf the remaining servers, around 250 are noted to be “bad”, “invalid” or otherwise\ninaccessible – and over 150 are noted as “need hash” (probably referring to a lack of a key\ndata point – a password hash or a key – within the data obtained from the server, probably\nrendering it not as easily accessible).\n\nOverall, it seems that around 400 of the servers included in the list are potentially valid and\ncan be leveraged to deploy ransomware. Of these, some have notes mentioning the name of\nthe company and, quite commonly, the organization’s revenue as well:\n\n_Notes mentioning potential victims’ revenue in a shortened notation. For example, “17m” (row 7) means_\n_USD 17 million, and “3b” means USD 3 billion_\n\n\n-----\n\nSifting through these notes, one can easily trace several multi-million dollar companies –\nseveral of them public – as well as a few with over a billion USD in revenue. These findings\n**showcase the threat level that big, seemingly well-protected organizations may face**\n**from relatively novice actors acting as initial access brokers.**\n\nResearching victims’ revenue is a very common practice for initial access brokers, whose\nposts lately tend to mention revenue of their victims in order to entice potential buyers –\nbased on an assumption that organizations with higher revenues would have the potential for\na multi-million dollar ransom.\n\n_Sales posts made by initial access brokers noting their victims’ revenues_\n\nThe real question to try and answer is: How many of the entries in the archive made it\n**past initial access brokers to ransomware affiliates – suffering a full-blown**\n**ransomware attack. Here, the main obstacle in finding an answer is the sheer amount of**\nransomware attacks that go unreported by the victims.\n\nStill, we were able to track leads to several companies that are publicly known to have\nsuffered a breach that were mentioned in the files. For example, the file contains a mention\nof a company known to have impacted by a naming-and-shaming ransom actor; while we\n\n\n-----\n\ncan t corroborate a direct cause-and-effect relationship here, this leak still serves as a\nreminder that monitoring cybercrime sources can prove crucial for organizations.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-06 - The Secret Life of an Initial Access Broker.pdf"
    ],
    "report_names": [
        "2020-08-06 - The Secret Life of an Initial Access Broker.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "312b7781-5501-4c1e-a9d5-9b75e9ad8455",
            "created_at": "2022-10-25T16:07:24.488292Z",
            "updated_at": "2025-03-27T02:02:10.251188Z",
            "deleted_at": null,
            "main_name": "Fxmsp",
            "aliases": [
                "ATK 134",
                "TAG-CR17"
            ],
            "source_name": "ETDA:Fxmsp",
            "tools": [
                "RDP",
                "Remote Desktop Protocol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ab5dc2a3-16dc-421e-af45-d60c8b4aafac",
            "created_at": "2023-01-06T13:46:39.012588Z",
            "updated_at": "2025-03-27T02:00:02.977037Z",
            "deleted_at": null,
            "main_name": "Fxmsp",
            "aliases": [],
            "source_name": "MISPGALAXY:Fxmsp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535867,
    "ts_updated_at": 1743041409,
    "ts_creation_date": 1653714212,
    "ts_modification_date": 1653714212,
    "files": {
        "pdf": "https://archive.orkl.eu/ccf0778324891bedf519b5b20d120e9bc0b2df45.pdf",
        "text": "https://archive.orkl.eu/ccf0778324891bedf519b5b20d120e9bc0b2df45.txt",
        "img": "https://archive.orkl.eu/ccf0778324891bedf519b5b20d120e9bc0b2df45.jpg"
    }
}