{
    "id": "fde8cb6b-3ec5-4a5e-a361-9201764f61a5",
    "created_at": "2023-01-12T15:03:43.190794Z",
    "updated_at": "2025-03-27T02:16:11.645471Z",
    "deleted_at": null,
    "sha1_hash": "26da7da25e72f640a270e8a1fc0a1a64899e8f79",
    "title": "2022-02-15 - New Evidence Linking Kwampirs Malware to Shamoon APTS (Technical Blog)",
    "authors": "",
    "file_creation_date": "2022-05-27T23:00:27Z",
    "file_modification_date": "2022-05-27T23:00:27Z",
    "file_size": 3570322,
    "plain_text": "# New Evidence Linking Kwampirs Malware to Shamoon APTS (Technical Blog)\n\n**[resources.cylera.com/new-evidence-linking-kwampirs-malware-to-shamoon-apts](https://resources.cylera.com/new-evidence-linking-kwampirs-malware-to-shamoon-apts)**\n\nBy Pablo Rincón Crespo, Vice President, Cybersecurity\n\n14 min read\n\n\n-----\n\n-----\n\n-----\n\n-----\n\n## New Discoveries Linking Kwampirs Malware to Shamoon APTS\n\nCylera Labs has been investigating the Kwampirs malware actively since August 2018, and\nwas the first to identify the similarities with Shamoon. In 2019, Pablo Rincón Crespo, vice\npresident of Cybersecurity and lead researcher of Cylera Labs, released the first public\nfindings pointing to important code similarities between Shamoon and Kwampirs at the XIII\nSTIC conference held in Madrid on December 11th, 2019.\n\nBut having similarities in the tool doesn’t necessarily mean the same threat actors are behind\nboth malware families. Therefore, further investigation was necessary to discard the\npossibilities of potentially stolen code, or false flag operations. Shortly after Rincón’s\npresentation at XIII STIC conference, two FBI Flashes and one FBI Private Industry\nNotification (PIN) were released, alerting about Kwampirs (January 6, February 5, and March\n30, 2020), and some researchers have also tweeted about similarities between both malware\nfamilies.\n\n### Cylera Labs Summary\n\n\n-----\n\nAt that point we had all the known campaigns sinkholed, many victims identified (from small\nhospitals to “medical cities,” and gov institutions of Middle East countries), had already found\nthe template system and were already trying to understand the evolution of all the Kwampirs\nartifacts available for download via public malware repositories (mainly VirusTotal and Hybrid\nAnalysis). Our differential analysis was done with the help of radiff2 (part of radare2 toolkit)\nand diaphora+IDA, and then reviewing manually the full sets of differences between every\nsingle version to understand all the divergence between the two malware families. During\nthis process we also identified some additional components that went unnoticed for some\ntime but that link the two families even more closely together.\n\n[The newly issued, in-depth Cylera Labs Kwampirs Shamoon Technical Report explains](https://resources.cylera.com/hubfs/Cylera%20Labs/Cylera%20Labs%20Kwampirs%20Shamoon%20Technical%20Report.pdf)\nextensively, with artifacts, the different phases of the investigation, analysis and findings\nrelated to the evolution of Kwampirs and its connections with Shamoon 1 and 2 - where\nKwampirs starts its activity between both Shamoon versions.\n\nAt Cylera Labs we assess with medium-high confidence that Shamoon and Kwapirs are the\nsame group or really close collaborators, sharing updates, techniques and code over the\ncourse of multiple years, and this blogpost summarizes some of the key findings of our\ninvestigation:\n\n### From Shamoon 1 to Kwampirs\n\nDuring the investigation, Cylera discovered a malware artifact (dubbed “886e7” in the\ntechnical report) that is an intermediate version between Shamoon and Kwampirs. It’s\nbasically a Shamoon Dropper in which the destructive components were not included, but\n\ninstead, only computer and network exploration code in the form of two reporters, probably in\nthe middle of a refactor of the code.\n\nDropper sample:\n[886e7271b1a0b0b6c8b2a180c2f34b1d08d899b1e4f806037a3c15feee604d7b](https://www.virustotal.com/gui/file/886e7271b1a0b0b6c8b2a180c2f34b1d08d899b1e4f806037a3c15feee604d7b)\nWhat are the key properties of 886e7 similar to Shamoon 1?\n\nThe main architecture of the Dropper is similar to Shamoon 1.\nThere's some dead code, unreachable by default, indicating that this sample was\nprobably compiled in the middle of a refactor (or repurpose process).\nPayloads are embedded in the resources, which are named PKCS12 and PKCS7,\nsimilar to the first Shamoon\n\n\n-----\n\nThere are two reporter modules in this sample. One of these Reporter modules sends\ndata similar to the data sent by Shamoon 1, including a similar format and similar\nvalues (i.e., tick count for cache busting).\n\nThe C2s are hardcoded in clear text within the binary, just like Shamoon 1.\nThe propagation and infection code is similar to Shamoon 1. It is almost the same, just\nlike Kwampirs, with nearly a one by one correspondence of the code. But then both\nKwampirs and 886e7 share a small propagation method addition, in a separate thread,\nwith a slightly more aggressive strategy that we explain a bit later.\n\nOk… But what about the 886e7 link with Kwampirs?\n\nThe resources are executables, similar to Shamoon, but the downloaded components\nare DLLs, with exactly the same loader code as Kwampirs.\n\nBoth reporters use “ItIsMe” as the user agent, like the early Kwampirs samples. It\nseems like a continuation of the one used by Shamoon (“you”). We found requests with\nthis user-agent at the sinkhole server, indicating that there is still some activity of early\nkwampirs-infected hosts. See for example the Kwampirs sample:\n[a5e5b4e6caf7ac3ac8d9b7b3527f767ff011d138246686822fea213a3b0597fc.](https://www.virustotal.com/gui/file/a5e5b4e6caf7ac3ac8d9b7b3527f767ff011d138246686822fea213a3b0597fc)\n\nThe Dropper resources contain only “Reporter” modules. The reporters are the main\npayloads. No wiper, just like Kwampirs.\n\n\n-----\n\nIn Kwampirs, when the reporter executes the downloaded component (DLL), it will\nsearch for an exported function called “CF”. Turns out this 886 Reporter uses the same\nDLL loader code and searches the callback string “cmdFunc” for the same purpose, so\n“CF” is probably the acronym in which it evolved, maybe to evade antivirus signatures\nbased in static strings.\n\nThe second reporter reduces the number of parameters in the URL format and\nencodes everything into a base64 string, except the value of GetTickCount() as a\ncache busting value, in a very similar way as Kwampirs does. Kwampirs evolves on top\nof this second Reporter, taking out the cache parameter, leaving only one parameter\nthat packs multiple values inside. Shamoon 2 will inherit this format too.\n\nThe C2 returns data in the format of the Kwampirs C2, not like Shamoon 1. We know\nthis because the sample explicitly looks for “911:” in the messages received (Figure\n47), which is a string used by the Kwampirs C2 while downloading additional modules.\nLater versions remove the check of the “911:” string, but add cryptographic signature\nchecks.\n\n\n-----\n\nThe sample uses GetExtendedTcpTable(), similar to Kwampirs’ use of GetTcpTable().\nBoth functions allow Kwampirs (and 886e7) to propagate more aggressively over the\nnetwork, allowing intents of propagation over windows-based networks even if they are\nnot in the same IPv4 range, which is ideal for supply chain explorations and infection\nintents over manufacturer VPN connections. On the other hand, Shamoon versions do\nnot use any of these propagation methods. Some hypotheses for this limitation are\nexplained in the Shamoons usage section of the report, but summarizing it, they would\njust limit the damage of the destructive components (wipers) this way, but they use\nthem in Kwampirs to perform more aggressive propagations while doing\nreconnaissance operations.\n\n### From Kwampirs to Shamoon 2\n\nWe found and identified a common template system between Kwampirs and Shamoon 2,\nthat with the known timeline was first developed for Kwampirs, then implemented in\nShamoon 2.\n\n**The Kwampirs Unrendered Template:**\n\n\n-----\n\nFirst, we found a Kwampirs artifact embedding an extra component that was a Kwampirs\ntemplate itself, with unrendered labels (placeholders).\n\nThe binary template of this table can be found in the dropper with hash\n\n[1314a078a06d1dc528014715d229b173ed5fbdff42ccde33fb933cdb0b82727e](https://www.virustotal.com/gui/file/1314a078a06d1dc528014715d229b173ed5fbdff42ccde33fb933cdb0b82727e)\n[Inside, there is the resource named 102, that contains the hash](https://www.virustotal.com/gui/file/1314a078a06d1dc528014715d229b173ed5fbdff42ccde33fb933cdb0b82727e)\n\n[bbd346e70b3858682f9f54ff9a3aa86dd286a98ff2386fbaa929edf86bb6d3f2](https://www.virustotal.com/gui/file/bbd346e70b3858682f9f54ff9a3aa86dd286a98ff2386fbaa929edf86bb6d3f2)\nAnd also you can find the rendered DLL at resource 101 with hash\n\n[3c51cc159d604627e8e0d53373b49453d80b200e8cc4ffe1552574e4aeb8a3a3](https://www.virustotal.com/gui/file/3c51cc159d604627e8e0d53373b49453d80b200e8cc4ffe1552574e4aeb8a3a3)\n\nThis template was likely embedded by mistake by either the developers or the operators\nconfiguring an artifact for a new attack campaign (if any different). There are a few more\ndroppers carrying unrendered templates (listed in the report). We have documented the\nvariables of the template in the following table:\n\n\n-----\n\nWhy do we believe it was not present in Shamoon 1?\n\nShamoon 1 definitely didn’t have this template system. This system adds auxiliary code\npreprocessing the values of the rendered placeholders. This auxiliary code is simply not\npresent in Shamoon 1. It includes the preprocessing and building arrays based on data\npresent in buffers with new lines as separators for multiple configuration parameters (in\nexample, the C2 lists and options are built this way).\n\n\n-----\n\nAnd also there are traces that the values are embedded in ASCII, even for the numbers,\nbecause you can see the use of atoi() to convert them to integer format. The size of buffers,\nnumber of items, etc, are processed by atoi() function calls, which doesn’t happen in\nShamoon 1.\n\n\n-----\n\nAnd guess why they use atoi()...? Because in order to get the placeholders into the binary\nthey inserted the placeholders as string literals, to let the project compile with those\nunrendered placeholders (ASCII, not numbers yet) without failing the compilation. And this\nalso indicates that the template system was designed and implemented at a source code\nlevel, not overwriting values directly at binary executables.\n\nHow does this template system link with Shamoon 2?\nLooking closely at Shamoon 264bit Dropper,\n\n(the one with sha256 hash\n[61c1c8fc8b268127751ac565ed4abd6bdab8d2d0f2ff6074291b2d54b0228842), in example,](https://www.virustotal.com/gui/file/61c1c8fc8b268127751ac565ed4abd6bdab8d2d0f2ff6074291b2d54b0228842)\nthe one used against GACA, one can find the following unrendered placeholders:\n\n###AV1### and ###AV2###\n\nThese placeholders are related to the resource embedding parameters needed to access the\npayload to drop, which is the Reporter component, with the difference that Kwampirs will also\nadd a simple steganographic layer on top, to hide the payload a bit more. But both of the\n\n\n-----\n\nplaceholders match the format of Kwampirs placeholders. With this we get a better picture of\nthe full process.\n\nFirst the reporters are rendered, then they are embedded into the droppers which also use\nanother template for the Dropper, with the correct parameters of the payloads to drop. The\nonly difference is that Shamoon has more components (the Wiper executable plus driver),\nand has a 32bit version of all its components as well as a 64bit version of all them, packed in\na 64bit Dropper which goes embedded in the 32bit Dropper.\n\nUsing a template system with a builder just makes sense to avoid steps of failure in the\nconfiguration of new campaigns. The rendering process of both malware families would look\nlike the following diagrams:\n\nShamoon 2 New Campaign Building Process:\n\nKwampirs New Campaign Building Process:\n\n\n-----\n\nBut This is Not a Template. Why are Shamoon 2 Placeholders Unrendered?\n\nIt’s complex to control mistakes when you have too many components carrying other\ncomponents and different architectures carrying other architecture components.. and maybe\nthe luck aligns to not even let you know. Shamoon has 32-bit and 64-bit components, but\nthey don’t duplicate the code such as they have one codebase for 32-bit and another for 64bit.\n\nWe believe they share the same code and use C macros, preprocessor options for the\ncompiler, to enable and disable things specific to the architecture. One of these things is the\nprocess of checking the architecture and dropping and executing the 64-bit Dropper\ncomponent, which only happens when the execution detects that the system is 64-bit based.\n\nBut when the 64-bit Dropper starts its execution, it shouldn’t perform the same checks and it\nshouldn’t drop any other payload. And it doesn’t, but the template system mistakenly\nembedded part of the code related to the 64-bit dropper, and at the auxiliary code of the\ntemplate system it leaves the placeholders unrendered, which are not really used, and that’s\n\n\n-----\n\nwhy the program doesn t crash during execution. This way, the developers probably didn t\nrealize they were embedding unrendered placeholders, leaking their format.\nSummarizing, ###AV1### and ###AV2### are related to the payload dropping of the 64-bit\nversion of the Dropper, which is not used by the 64-bit version itself (otherwise it would drop\nyet another copy of itself!), and they didn’t wrap correctly with architecture based macros so\nthey got embedded in the template systems’ auxiliary code…and this became a fingerprint of\nthemselves! Oops - problem now!\n\n### And Why Kwampirs before Shamoon 2 and not the opposite?\n\nTraces of the auxiliary code, as well as the placeholders, were identified in Shamoon 2 (in all\n\"Shamoon 2\" campaigns), with a flow graph slightly different, probably to bypass Antivirus\nsignatures and automated clustering systems, but it still can be easily identified with the\nauxiliary code of the template system.\n\nWe believe Shamoon 2 inherited all this code from Kwampirs, and not the opposite, because\nShamoon 1 didn’t have this template system back in 2012, and it was first seen in Kwampirs\nartifacts dated (and uploaded to VirusTotal) before Shamoon 2 attacks of November 2016.\n\nFor example, the sample with hash\n\n[6f7173b7ae87b5f3262e24a5177dbbd4413d999627f767754f08d8289f359bb3 belongs to](https://www.virustotal.com/gui/file/6f7173b7ae87b5f3262e24a5177dbbd4413d999627f767754f08d8289f359bb3)\n\nKwampirs campaign E, and it was uploaded to VirusTotal with a first submission date of\n2016-06-23 15:40:12, 6 months before “the known return of Shamoon 2”, which happened in\nNovember 2016 (as far as OSINT tells us).\n\nWe could not find evidence that the template system was yet correctly identified by other\ninvestigators in either Kwampirs or Shamoon 2 malware families. A few researchers said the\nthreat actors were probably using a builder, because of unused values, or filled with dumb\ndata, which is right. But this association with Kwampirs has not yet been referenced that\nwe've seen.\n\n\n-----\n\nKwampirs and Shamoon 1, 2, 3 Timelines:\n\n### Any Other Shared Updates Apart From the Template System?\n\nShamoon 2 developers based many changes on Kwampirs improvements. Both, Shamoon 2\nand Kwampirs Reporters, collect the same initial set of data to build the first request to their\nCommand & Control servers:\n\nMAC Address\nSystem and version information\nKeyboard layout list\n\nShamoon 2 Reporter:\n\n\n-----\n\n**Kwampirs Reporter:**\n\n\n-----\n\nThe data is customarily packed using the same procedures as Kwampirs, using a field\nseparator specified with the template system, then the full buffer is encrypted with an xorcyclic algorithm and then encoded with base64.\n\nIn Kwampirs the final URL will look like:\n\nhxxp://18.25.62[.]70/groupgroup/default.php?q=[base64_string]\n\nAnd in Shamoon 2 URLs will look like:\n\nhxxp://server/category/page.php?shinu=[base64_string]\n\n### What Else is in the Technical Report?\n\n\n-----\n\nWe identified a malware component that was created independently and embedded in\nthe Reporter resources, acting as a proxy, taking advantage of the user token of the\n_explorer.exe process, ala mimikatz style. This functionality was later embedded as part_\nof Kwampirs dropper, adding different runmodes to the Kwampirs dropper components.\nThe communication with this component (which as we said is later the dropper itself) is\nperformed using Pipes.\nWe further give some details about a C2 misconfigured with an Open Directory Listing,\nand what we were able to gather from it.\nWe explain some technical reasons why we believe Kwampirs is not based on OpenShamoon, a reverse-engineered version of Shamoon that has been around for a while.\nWe also talk about some live-hunting samples found in VirusTotal using Yara rules, and\nabout some allegedly Iranian APTs that have been historically associated with\nShamoon activity.\n\n**_All these details and more are well-covered in the more expanded_** **_Cylera Labs_**\n**_Kwampirs Technical Report._**\n\n### And What About Attributions and Our Final Conclusions?\n\nWe believe with medium-high confidence that Kwampirs and Shamoon 2 are maintained by\nthe same group. But Shamoon 2 is already attributed to a set of actors based on the code,\nvictims, and common infrastructure, which is a subgroup of APT33/APT34/Magic Hound,\nwhich seems to be no different than Shamoon 1. If one day Shamoon 2 is said to be a false\nflag operation from a different country or APT group, then Kwampirs attribution would also\nneed to be reevaluated as well.\n\nWith the data we have gathered right now, Kwampirs is very likely an Iranian APT that has\nbeen targeting healthcare and supply chains of multiple countries around the globe since at\nleast 2015, with no clear intention, controlling the position for pivoting over these artifacts\n(even if they don’t take it in a destructive direction yet).\n\nCybercriminals of all types and with a range of attack vectors and malware variants are\ntargeting the healthcare industry and supply chains. Motivations can vary from just industrial\nespionage (intellectual property, scientific research), exfiltration and exposure of PHI records\n(of dissidents or key personalities), to the damaging extreme of enabling the creation of a\ncrippling cyber-physical impact through wiper attacks if things get really ugly in a cyberwar\nscenario. The healthcare industry is a valuable, priority target and needs attention to assure\ndefensive measures are in place, just as for any other critical infrastructure.\n\nFor the General, [Non-Technical Blog or more information go to www.cylera.com/cylera-labs](https://resources.cylera.com/new-evidence-linking-kwampirs-malware-to-shamoon-apts-1)\n\nFull Report (PDF): **_[Cylera Labs Kwampirs Technical Report](https://resources.cylera.com/hubfs/Cylera%20Labs/Cylera%20Labs%20Kwampirs%20Shamoon%20Technical%20Report.pdf)_**\n\n[Blog](https://resources.cylera.com/tag/blog) [Cylera Labs](https://resources.cylera.com/tag/cylera-labs)\n\n\n-----\n\n## Get Updates\n\n**Sign up to receive the**\n**latest news from Cylera.**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-15 - New Evidence Linking Kwampirs Malware to Shamoon APTS (Technical Blog).pdf"
    ],
    "report_names": [
        "2022-02-15 - New Evidence Linking Kwampirs Malware to Shamoon APTS (Technical Blog).pdf"
    ],
    "threat_actors": [
        {
            "id": "ce10c1bd-4467-45f9-af83-28fc88e35ca4",
            "created_at": "2022-10-25T15:50:23.458833Z",
            "updated_at": "2025-03-27T02:00:55.475188Z",
            "deleted_at": null,
            "main_name": "APT34",
            "aliases": null,
            "source_name": "MITRE:APT34",
            "tools": [
                "netstat",
                "Systeminfo",
                "PsExec",
                "SEASHARPEE",
                "Tasklist",
                "Mimikatz",
                "POWRUNER",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9fe49a5b-f3e6-4fbf-99a1-db15dad460c3",
            "created_at": "2024-05-01T02:03:08.045004Z",
            "updated_at": "2025-03-27T02:05:17.325038Z",
            "deleted_at": null,
            "main_name": "COBALT TRINITY",
            "aliases": [
                "Elfin ",
                "HOLMIUM ",
                "MAGNALIUM ",
                "Peach Sandstorm ",
                "Refined Kitten ",
                "TA451 ",
                "APT33 "
            ],
            "source_name": "Secureworks:COBALT TRINITY",
            "tools": [
                " Cadlotcorg",
                " Dello RAT",
                " Imminent Monitor",
                " KDALogger",
                " Koadic",
                " NanoCore",
                " NetWire",
                " POWERTON",
                " PoshC2",
                " Poylog",
                " PupyRAT",
                " Schoolbag",
                "AutoCore"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535823,
    "ts_updated_at": 1743041771,
    "ts_creation_date": 1653692427,
    "ts_modification_date": 1653692427,
    "files": {
        "pdf": "https://archive.orkl.eu/26da7da25e72f640a270e8a1fc0a1a64899e8f79.pdf",
        "text": "https://archive.orkl.eu/26da7da25e72f640a270e8a1fc0a1a64899e8f79.txt",
        "img": "https://archive.orkl.eu/26da7da25e72f640a270e8a1fc0a1a64899e8f79.jpg"
    }
}