{
    "id": "fdf26c62-3184-472b-956f-c12567ae3ba1",
    "created_at": "2023-09-07T02:07:05.511819Z",
    "updated_at": "2025-03-27T02:16:22.77725Z",
    "deleted_at": null,
    "sha1_hash": "4327200896b233b2e8d62b33d99929f7d96ffb72",
    "title": "BlueCharlie, Previously Tracked as TAG-53, Continues to Deploy New Infrastructure in 2023",
    "authors": "",
    "file_creation_date": "2023-08-02T13:20:33Z",
    "file_modification_date": "2023-08-03T09:07:34Z",
    "file_size": 3966635,
    "plain_text": "##### CYBER\n\n THREAT\n\n ANALYSIS By Insikt Group®\n\n**RUSSIA**\n\nAugust 2, 2023\n\n# BlueCharlie, Previously Tracked as TAG-53, Continues to Deploy New Infrastructure in 2023\n\n\n-----\n\n## Executive Summary\n\nSince at least March 2023, Insikt Group has tracked new infrastructure that we attribute as associated\nwith the threat activity group BlueCharlie, a group that has overlaps with the Russia-nexus group\npublicly known as Callisto/Calisto, COLDRIVER, and Star Blizzard/SEABORGIUM. Insikt Group previously\ntracked this threat activity under the temporary designator TAG-53. We are now graduating this threat\ncluster to the cryptonym BlueCharlie due to overlapping tactics, techniques, and procedures (TTPs) and\nour increased confidence that the activities we have observed are conducted by a Russia-based threat\nactor.\n\nInsikt Group has observed BlueCharlie build new infrastructure, which includes 94 new domains.\nSeveral of the TTPs currently seen in the recent operation depart from past activity, suggesting that\nBlueCharlie is evolving its operations, potentially in response to public disclosures of its operations in\n[industry reporting (1,](https://www.recordedfuture.com/exposing-tag-53-credential-harvesting-infrastructure-for-russia-aligned-espionage-operations) [2, 3). Since Insikt Group’s initial tracking of the group in September 2022, we have](https://www.pwc.com/gx/en/issues/cybersecurity/cyber-threat-intelligence/blue-callisto-orbits-around-us.html)\nobserved BlueCharlie engage in several TTP shifts. These shifts demonstrate that these threat actors\nare aware of industry reporting and show a certain level of sophistication in their efforts to obfuscate or\nmodify their activity, aiming to stymie security researchers. Some of the changes in TTPs were also\nlikely precipitated by the threat group’s increased awareness of operations security (OPSEC).\n\nWhile Insikt Group was unable to determine victimology or targeting for this campaign at the time of this\nwriting, BlueCharlie has in the past targeted entities in the government, higher education, defense, and\npolitical sectors, as well as non-governmental organizations (NGOs), activists, journalists, think tanks,\nand national laboratories. Potential victims in those sectors should improve their phishing defenses,\nimplement FIDO2-compliant multi-factor authentication, use threat intelligence and attack surface\nintelligence for rapid and complete information, and educate third-party vendors on the risks involved.\nFailure to do so may result in the loss of credentials to business-critical resources, leaking of\nproprietary information related to business or national security, and damage to brand reputation for\nsuffering a breach.\n\n## Key Findings\n\n  - BlueCharlie continues to build new infrastructure in the pursuit of phishing campaigns and\ncredential harvesting, and it continues to favor certain elements such as the use of preferred\nregistrars, ASNs, and a certificate authority.\n\n  - While the group uses relatively common techniques to conduct attacks (such as the use of\nphishing and a historical reliance on open-source offensive security tools), its likely continued\nuse of these methods, determined posture, and progressive evolution of tactics suggests the\ngroup remains formidable and capable.\n\n  - Given the group’s observed operational tempo and willingness to adapt to public reporting on its\nactivity, we expect to see BlueCharlie continue operations for the foreseeable future. We\nsimilarly expect the group to continue to evolve its TTPs based on precedent.\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n## Background\n\n[BlueCharlie is a Russia-linked threat activity group that has links to groups that have been active since](https://techcrunch.com/2023/02/08/seaborgium-cold-river-hacking/)\nat least 2017. BlueCharlie conducts operations focused on information gathering to enable further\nespionage, but also for use in hack-and-leak operations. BlueCharlie targets individuals and\norganizations in North Atlantic Treaty Organization (NATO) nations, entities in Ukraine, and institutions\n[like government, higher education, defense, and political sectors, non-governmental organizations](https://techcrunch.com/2023/02/08/seaborgium-cold-river-hacking/)\n[(NGOs), activists, journalists, think tanks, and](https://techcrunch.com/2023/02/08/seaborgium-cold-river-hacking/) [national laboratories. Past incidents include a](https://www.reuters.com/world/europe/russian-hackers-targeted-us-nuclear-scientists-2023-01-06/)\nhack-and-leak operation that tried to build a narrative around high-level Brexit proponents planning a\ncoup as well as a cyberespionage [campaign targeting Brookhaven National Laboratory, Argonne](https://www.reuters.com/world/europe/russian-hackers-targeted-us-nuclear-scientists-2023-01-06/)\nNational Laboratory, and Lawrence Livermore National Laboratory between August and September\n2022. In January 2023, cybersecurity firm Nisos [observed](https://www.nisos.com/blog/coldriver-group-report/) personally identifiable information related to\ntechnical details of COLDRIVER campaigns, and found ties to a Russian national, Andrey Korinets, as a\npotential member of the group. Insikt Group has not independently verified Korinets’s affiliation with\nBlueCharlie activity at this time.\n\nBlueCharlie has carried out persistent phishing and credential theft campaigns that further enable\nintrusions and data theft. The group likely uses open sources to conduct extensive reconnaissance in\nadvance of intrusion operations in order to improve the likelihood that its spearphishing operations will\n[succeed. In at least one case, Star Blizzard/SEABORGIUM created fraudulent profiles on various social](https://www.microsoft.com/en-us/security/blog/2022/08/15/disrupting-seaborgiums-ongoing-phishing-operations/)\nmedia platforms, including LinkedIn, to conduct reconnaissance on targeted entities. Some of the\nmessages included resources that spoofed pages from prominent organizations to build credibility.\n[Campaigns between 2015 and 2020 relied on emails purporting to come from popular mail services and](https://blog.google/threat-analysis-group/tracking-cyber-activity-eastern-europe/)\noften contained malicious links or attachments.\n\n## Threat and Technical Analysis\n\n[Following public reporting (1, 2, 3, 4,](https://blog.sekoia.io/calisto-show-interests-into-entities-involved-in-ukraine-war-support/) [5, 6), including our own, we observed that BlueCharlie changed its](https://blog.google/threat-analysis-group/update-on-cyber-activity-in-eastern-europe/)\nTTPs as of at least mid-December 2022 — shortly after our report and other industry reporting\nexposed its credential harvesting infrastructure.\n\n#### Domain Name Structure\n\n[Since the release of our initial report describing TAG-53 activity, the threat group has shifted its use of](https://www.recordedfuture.com/exposing-tag-53-credential-harvesting-infrastructure-for-russia-aligned-espionage-operations)\ncertain words in its domains to a new pattern.\n\nIn our previous report, all but 1 of the 38 domains discovered via BlueCharlie tracking used similarly\nstructured domain names, primarily made up of 2 terms (depicted in Figure 1 below) separated by a\nhyphen, such as “cloud-safety[.]online”. The exception to the above rule was proxycrioisolation[.]com.\nWhile the structure has changed for the most recent activity, the new naming convention is consistent\nand highly similar across all 94 observed domains. Prior activity relied on a trailing URL structure for\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n1 https[:]//github[.]com/kgretzky/evilginx2/blob/511860ca993b73e0d412c372c8aaa4b70ba5a7e1/core/config.go\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n- check/checker\n\n- dns\n\n- cloud\n\n- control/controls\n\n- docs\n\n- document\n\n- network\n\n- of\n\n- protect/protected/protector\n\n- safety\n\n- storage\n\n- transfer\n\n- web\n\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n#### Registrars\n\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n#### Autonomous Systems\n\nIn our previous reporting, we identified the Autonomous System Numbers (ASNs) where the BlueCharlie\nIP addresses were most commonly found, shown in Table 1 below.\n\n**ASN** **AS Name** **BlueCharlie Domain Count**\n\nAS52000 MIRhosting 11\n\nAS54290 Hostwinds 10\n\nAS44094 WEBHOST1-AS 4\n\nAS62240 Clouvider 4\n\nAS62005 BV-EU-AS 3\n\nAS44477 STARK-INDUSTRIES 2\n\nAS16276 OVH 1\n\nAS20278 NEXEON 1\n\nAS206446 CLOUDLEASE 1\n\nAS43624 STARK-INDUSTRIES-SOLUTIONS-AS 1\n\n**Table 1: ASN detail breakdown for previous BlueCharlie-linked domains (Source: Recorded Future)**\n\nIn our current observations of BlueCharlie ASNs in use, we highlight the reuse of the following:\n\n|ASN|AS Name|BlueCharlie Domain Count|\n|---|---|---|\n|AS52000|MIRhosting|11|\n|AS54290|Hostwinds|10|\n|AS44094|WEBHOST1-AS|4|\n|AS62240|Clouvider|4|\n|AS62005|BV-EU-AS|3|\n|AS44477|STARK-INDUSTRIES|2|\n|AS16276|OVH|1|\n|AS20278|NEXEON|1|\n|AS206446|CLOUDLEASE|1|\n|AS43624|STARK-INDUSTRIES-SOLUTIONS-AS|1|\n\n\n**Figure 5: Breakdown of Autonomous Systems (AS) used by BlueCharlie in the previous and current campaign**\n\n\n(Source: Recorded Future)\n\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n**Table 2 contains a further breakdown of the most recently observed ASNs in use by BlueCharlie:**\n\n|ASN|AS Name|BlueCharlie Domain Count|\n|---|---|---|\n|AS36352|ColoCrossing|35|\n|AS62005|BlueVPS OU|32|\n|AS54290|Hostwinds LLC|14|\n|AS62240|Clouvider|12|\n|AS44477|MIRhosting/Stark Industries|7|\n|AS52000|MIRholding/MIRhosting|8|\n|AS22612|Namecheap|8|\n|AS43624|PQ HOSTING S.R.L.|2|\n|AS44094|Webhost LLC|2|\n|AS49392|LLC Baxet|2|\n|AS62904|Eonix Corporation|2|\n|AS3257|GTT Communications Inc.|1|\n\n\n**Table 2: ASN detail breakdown for current BlueCharlie-linked domains (Source: Recorded Future)**\n\nAdditionally, [industry reporting](https://www.team-cymru.com/post/a-blog-with-noname) suggests that Stark Industries, MIRhosting, and Perfect Quality (PQ)\nHosting (all present in the current activity) are related to Ivan Neculiti, a Moldovan national.\nCybersecurity firm Team Cymru stated that it frequently observes “all three hosting companies being\nused to host malicious content, or … used directly for attack infrastructure”, specifying that “the website\nhucksters[.]net, which amongst other things seeks to expose individuals involved in fraud and spam,\nhas previously [profiled NECULITI”.](https://hucksters.net/person/neculiti-ivan)\n\n#### X.509 TLS Certificates\n\nPreviously, all identified BlueCharlie domains were found to host corresponding X.509 TLS certificates\nprovided by Let’s Encrypt. The prevalent use of Let’s Encrypt TLS certificates allows for further\ncorrelations between BlueCharlie domains and infrastructure, strengthening the clustering of this\nactivity. The group continues to rely almost exclusively on Let’s Encrypt security certificates. The only\n[exception to this rule that we identified was the domain bittechllc[.]net, which used the ZeroSSL](https://crt.sh/?id=8784745615)\n[Certificate Authority. The remainder relied on Let’s Encrypt certificates. See, for example, the](https://crt.sh/?id=8784745615)\ncloudrootstorage[.]com domain’s certificate as found at [crt.sh](https://crt.sh/?id=9121759905) and depicted in Figure 6 below.\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n## Mitigations\n\nPhishing and spearphishing from state-sponsored advanced persistent threat (APT) groups presents an\nimminent threat to organization networks and personal information. Phishing allows a threat actor\naccess to privileged material or the ability to install their own exploit software, such as ransomware or\ncommand-and-control software.\n\n  - Implement multi-factor authentication (MFA) on all internet-facing web applications and\nappliances, especially webmail. MFA is something you know (a password) and something you\nhave (a text message or code from a MFA application). This way, if a threat actor has your\npassword, they are likely unable to authenticate as they lack the MFA code.\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n  - Use a FIDO2-compliant MFA token.\n\n  - Train employees, contractors, and third-party vendors to protect against phishing,\nspearphishing, and social engineering. Refreshing employees, vendors, contractors and\nthird-party entities with this phishing training often (at least annually) is critical to prevent\ncredential harvesting and unwanted intrusions to your network.\n\n  - Disable all macros, particularly macros loading by default, in Microsoft Office products.\n\n  - Ensure that all attachments are scanned for malicious artifacts and behavior.\n\n  - Enforce a frequent password reset policy and strong password requirements for all\ninternet-facing web applications and internal applications, especially webmail/email.\n\n  - Use a stand-alone password manager (such as BitWarden or 1Password) to generate strong\npasswords, and use unique passwords for each service. Passwords should not be reused across\nservices/websites.\n\n  - Configure your intrusion detection systems (IDS), intrusion prevention systems (IPS), or any\nnetwork defense mechanisms in place to alert on — and upon review, consider blocking\nconnection attempts to and from — the external IP addresses and domains listed in the\nappendix.\n\n## Outlook\n\nBlueCharlie has demonstrated the ability to adapt and evolve over time to public reporting, and will\nlikely continue to change their TTPs based on past precedent. Given the group’s historical use of\nphishing (which is likely occurring in the new activity), we recommend network defenders employ\nrobust anti-phishing training and highly encourage the use of a FIDO2-compliant multi-factor\nauthentication token, such as a Yubikey. Recorded Future [Threat Intelligence (TI),](https://www.recordedfuture.com/platform/threat-intelligence) [Third-Party](https://www.recordedfuture.com/platform/third-party-intelligence)\n[Intelligence, and SecOps Intelligence modules users can monitor real-time output from Network](https://www.recordedfuture.com/platform/third-party-intelligence)\nIntelligence analytics to identify suspected targeted intrusion activity involving your organization or key\nvendors and partners.\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n## Appendix A — IOCs\n\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----\n\n## Appendix B — Mitre ATT&CK Techniques\n\n|Tactic: Technique|ATT&CK Code|\n|---|---|\n|Reconnaissance: Phishing for Information|T1598|\n|Resource Development: Stage Capabilities|T1608|\n\n\nAbout Insikt Group[®]\n\nRecorded Future’s Insikt Group, the company’s threat research division, comprises analysts and security researchers with deep government, law\nenforcement, military, and intelligence agency experience. Their mission is to produce intelligence that reduces risk for clients, enables tangible\noutcomes, and prevents business disruption.\n\nAbout Recorded Future[®]\n\nRecorded Future is the world’s largest intelligence company. Recorded Future’s cloud-based Intelligence Platform provides the most complete\ncoverage across adversaries, infrastructure, and targets. By combining persistent and pervasive automated data collection and analytics with\nhuman analysis, Recorded Future provides real-time visibility into the vast digital landscape and empowers clients to take proactive action to\ndisrupt adversaries and keep their people, systems, and infrastructure safe. Headquartered in Boston with offices and employees around the\nworld, Recorded Future works with more than 1,600 businesses and government organizations across more than 70 countries.\n\nRecorded Future[®] | www.recordedfuture.com | Distribution: Public, from Insikt Group\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://go.recordedfuture.com/hubfs/reports/cta-2023-0802.pdf"
    ],
    "report_names": [
        "cta-2023-0802.pdf"
    ],
    "threat_actors": [
        {
            "id": "4b076dcb-516e-42fb-9c8f-f153902cd5e9",
            "created_at": "2022-10-25T16:07:23.708745Z",
            "updated_at": "2025-03-27T02:02:09.935617Z",
            "deleted_at": null,
            "main_name": "Hidden Lynx",
            "aliases": [
                "Aurora Panda",
                "Group 8",
                "Hidden Lynx",
                "Operation SMN"
            ],
            "source_name": "ETDA:Hidden Lynx",
            "tools": [
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "BlackCoffee",
                "HiKit",
                "MCRAT.A",
                "Mdmbot.E",
                "Moudoor",
                "Naid",
                "PNGRAT",
                "Trojan.Naid",
                "ZoxPNG",
                "gresim"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "68d50d91-7569-4e09-b155-98b23b23918a",
            "created_at": "2023-01-06T13:46:38.877268Z",
            "updated_at": "2025-03-27T02:00:02.941236Z",
            "deleted_at": null,
            "main_name": "Cold River",
            "aliases": [
                "Nahr Elbard",
                "Nahr el bared"
            ],
            "source_name": "MISPGALAXY:Cold River",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d06d270-acfd-4db8-83a8-4ff68b9b1ada",
            "created_at": "2022-10-25T16:07:23.477794Z",
            "updated_at": "2025-03-27T02:02:09.824281Z",
            "deleted_at": null,
            "main_name": "Cold River",
            "aliases": [
                "Blue Callisto",
                "BlueCharlie",
                "Calisto",
                "Cobalt Edgewater",
                "Nahr Elbard",
                "Nahr el bared",
                "Seaborgium",
                "Star Blizzard",
                "TA446",
                "TAG-53",
                "UNC4057"
            ],
            "source_name": "ETDA:Cold River",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "DNSpionage",
                "SPICA"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3fad11c6-4336-4b28-a606-f510eca5452e",
            "created_at": "2022-10-25T16:07:24.346573Z",
            "updated_at": "2025-03-27T02:02:10.183211Z",
            "deleted_at": null,
            "main_name": "Turbine Panda",
            "aliases": [
                "APT 26",
                "Black Vine",
                "Bronze Express",
                "Group 13",
                "JerseyMikes",
                "KungFu Kittens",
                "PinkPanther",
                "Shell Crew",
                "Turbine Panda",
                "WebMasters"
            ],
            "source_name": "ETDA:Turbine Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Hurix",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mivast",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "Sogu",
                "StreamEx",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon",
                "ffrat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "79bd28a6-dc10-419b-bee7-25511ae9d3d4",
            "created_at": "2023-01-06T13:46:38.581534Z",
            "updated_at": "2025-03-27T02:00:02.865836Z",
            "deleted_at": null,
            "main_name": "Callisto",
            "aliases": [
                "GOSSAMER BEAR",
                "BlueCharlie",
                "Star Blizzard",
                "TAG-53",
                "UNC4057",
                "COLDRIVER",
                "TA446",
                "IRON FRONTIER",
                "Blue Callisto",
                "SEABORGIUM"
            ],
            "source_name": "MISPGALAXY:Callisto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a7aefdda-98f1-4790-a32d-14cc99de2d60",
            "created_at": "2023-01-06T13:46:38.281844Z",
            "updated_at": "2025-03-27T02:00:02.792526Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "G0025",
                "AURORA PANDA",
                "Group 72",
                "G0001",
                "HELIUM",
                "Group 8",
                "Hidden Lynx",
                "Tailgater Team",
                "BRONZE KEYSTONE"
            ],
            "source_name": "MISPGALAXY:APT17",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3a057a97-db21-4261-804b-4b071a03c124",
            "created_at": "2024-06-04T02:03:07.953282Z",
            "updated_at": "2025-03-27T02:05:17.406598Z",
            "deleted_at": null,
            "main_name": "IRON FRONTIER",
            "aliases": [
                "BlueCharlie ",
                "CALISTO ",
                "COLDRIVER ",
                "Callisto Group ",
                "Gossamer Bear ",
                "Gossamer Bear ",
                "SEABORGIUM ",
                "Star Blizzard ",
                "TA446 ",
                "Blue Callisto "
            ],
            "source_name": "Secureworks:IRON FRONTIER",
            "tools": [
                " Galileo RCS",
                " SPICA",
                "Evilginx2"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3aedca2f-6f6c-4470-af26-a46097d3eab5",
            "created_at": "2024-11-01T02:00:52.689773Z",
            "updated_at": "2025-03-27T02:00:55.508065Z",
            "deleted_at": null,
            "main_name": "Star Blizzard",
            "aliases": [
                "Star Blizzard",
                "SEABORGIUM",
                "Callisto Group",
                "TA446",
                "COLDRIVER"
            ],
            "source_name": "MITRE:Star Blizzard",
            "tools": [
                "Spica"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1694052425,
    "ts_updated_at": 1743041782,
    "ts_creation_date": 1690982433,
    "ts_modification_date": 1691053654,
    "files": {
        "pdf": "https://archive.orkl.eu/4327200896b233b2e8d62b33d99929f7d96ffb72.pdf",
        "text": "https://archive.orkl.eu/4327200896b233b2e8d62b33d99929f7d96ffb72.txt",
        "img": "https://archive.orkl.eu/4327200896b233b2e8d62b33d99929f7d96ffb72.jpg"
    }
}