{
    "id": "fe1f0b87-9439-4d24-87e4-53b30ca9870a",
    "created_at": "2022-10-25T16:48:17.870222Z",
    "updated_at": "2025-03-27T02:05:33.177514Z",
    "deleted_at": null,
    "sha1_hash": "bb58d1d3088a6b7af64f9cda10046c06ddf0b5ae",
    "title": "Microsoft Word - AN2015-08_2-2_20150817.docx",
    "authors": "",
    "file_creation_date": "2015-08-17T10:05:54Z",
    "file_modification_date": "2015-08-17T10:05:54Z",
    "file_size": 202093,
    "plain_text": "## Application Note AN2015-08\n\n# Understanding When to Use LDAP or RADIUS for Centralized Authentication\n\nBen Herrmann\n\n#### INTRODUCTION\n\nLightweight Directory Access Protocol (LDAP) and Remote Authentication Dial-In User Service\n(RADIUS) protocol are two commonly used protocols for authenticating and authorizing users.\nBoth protocols perform similar tasks, making it hard to determine which to use. This application\nnote describes the differences between both protocols as well as security considerations for\nimplementation.\n\n#### PROBLEM\n\nLDAP and RADIUS are typically used to authenticate and authorize users, but choosing which\nprotocol to use for certain tasks can be difficult. In addition, setting up these services can be timeconsuming and confusing. The two protocols operate differently, which leads to varying levels of\nsecurity and network traffic.\n\n#### SOLUTION\n\nUnderstanding the difference between the protocols can help users select the right protocol for the\nright task. This application note also provides general security information on SEL\nimplementations of LDAP and RADIUS. For information about specific applications, contact the\nSEL Engineering Services cybersecurity team.\n\n##### What Is LDAP? \n\nLDAP is a directory service that is used to search and modify directories over a network, such as\nthose created by Microsoft[®] Active Directory[®] service. An LDAP server contains the directory of\nusers in an LDAP directory tree. LDAP clients who wish to gain information about entries in the\ntree or perform modifications to these entries contact the server. These servers can be replicated\nto allow for faster, more reliable access to the directory across a network. LDAP servers can store\nvarious user attributes, such as telephone numbers, emails, and locations, as well as\nauthentication information. This gives network administrators flexibility when implementing\nservices such as single sign-on.\n\n##### What Is RADIUS?\n\nRADIUS is a protocol that allows for centralized authentication, authorization, and accounting\n(AAA) for user and/or network access control. RADIUS clients contact the server with user\ncredentials as part of a RADIUS Access-Request message, and the server responds back with a\nRADIUS Access-Accept, Access-Reject, or Access-Challenge message. Authentication and\nauthorization are generally performed in one step to minimize traffic flow, although RADIUS can\n\n\n-----\n\nsupport multifactor (or two-factor) authentication using one or more Access-Challenge messages.\nAccounting is then performed via additional messages from the client to the server. RADIUS also\nsupports more complex forms of authentication, such as those described by the Extensible\nAuthentication Protocol (EAP).\n\n##### Design Differences\n\n**LDAP**\n\nLDAP provides a means of interfacing to a directory. LDAP does not require any security\nbetween the client and server. However, through the use of Transport Layer Security (TLS),\nLDAP can encrypt user sessions between the client and server. This keeps all information\ntransferred in LDAP transactions over the network secure. LDAP also benefits from a simple\nimplementation process that is easy for network users to access. However, LDAP does not\ndirectly support user accounting. Many implementations provide server-side accounting that\nvaries in scope. Other user activity can be captured by additional protocols, such as Syslog. These\nadditional protocols allow an LDAP server to provide user authentication services. Figure 1\nshows a basic LDAP network.\n\n**Figure 1 Basic LDAP Network**\n\n**RADIUS**\n\nRADIUS typically acts as an intermediate service that only handles AAA. It can contact a\ndirectory service, either its own or that of a different server, and authenticate and authorize the\nuser. This process alleviates some of the performance issues with large directory structures by\nallowing the caching of user data on the RADIUS server. It also allows the server to integrate\nwith dedicated authentication servers. The RADIUS server talks to other services using other\nprotocols, such as LDAP or Simple Object Access Protocol (SOAP). This adds considerable\nfunctionality and security but can complicate setup.\n\nRADIUS protocol lacks encryption on all attributes except for the password field, which can be a\ncause for concern to network administrators. However, other protocols described later in this\napplication note can alleviate security issues. RADIUS can also perform accounting services,\nensuring that sensitive user information is properly tracked. Services such as one-time password\n(OTP) generation can also be attached to RADIUS servers. These services are supported through\nthe use of Access-Challenge messages. Figure 2 shows a basic RADIUS network structure.\n\n**Figure 2 Basic RADIUS Network Using OTPs**\n\n\n-----\n\n##### Operational Differences\n\nLDAP and RADIUS have some small differences in how they operate. This leads to varying\nlevels of security and network traffic.\n\nLDAP and RADIUS have several differences in how they interact over the network. LDAP uses\nTransmission Control Protocol (TCP) in order to ensure reliable connection across the network.\nTCP ensures a connection, but does require more network overhead. RADIUS uses User\nDatagram Protocol (UDP), which minimizes network overhead but does not ensure a connection.\nDepending on implementation, this may cause lost packets, errors in packets, and lengthy\ntimeouts. It may also make the network vulnerable to replay attacks if implemented improperly.\n\nBy default, RADIUS packets lack encryption, except on the password field, meaning that\nsensitive user information is sent in clear text over the network. To combat this, users need to\nimplement additional security mechanisms, such as a virtual private network, between RADIUS\nservers and clients if all RADIUS attributes need to be encrypted. For additional security,\nRADIUS is also flexible enough to allow for other forms of authentication, such as those\nimplemented using EAP.\n\nBy itself, LDAP is unable to support multifactor authentication. Several enterprise solutions are\navailable, but many require additional resources. These solutions often implement other protocols\nas well, including RADIUS. RADIUS can support services that query directory services for user\ninformation as well as additional services, such as OTP servers, for enhanced security. For\ngeneral security information on SEL implementations of LDAP and RADIUS, see Table 1.\n\n**Table 1 SEL LDAP and RADIUS Security**\n\n**Credential** **Server Identity** **Full Tunnel**\n**Protocol**\n**Confidentiality** **Verification** **Encryption**\n\nRADIUS with Password\nYes Shared key No\nAuthentication Protocol (PAP)\n\nShared key and\nRADIUS with EAP Yes Partial\nX.509 validation\n\nLDAP with TLS Yes X.509 validation Full\n\nLDAP without TLS No No None\n\nNetwork resources used by the two protocols are also quite different (see Table 2). LDAP\nsessions often require multiple transactions between the server and the client, which can cause\nsignificant delays during user authentication attempts. RADIUS can cache user information from\nthe directory server to decrease login times. RADIUS is a simpler, less verbose protocol than\nLDAP, which increases the speed of authentication transactions for large databases of users.\nHowever, because RADIUS uses UDP, requests may time out and have to be retried if the\nnetwork quality is poor. Authentication client load is reduced when using RADIUS because the\nnetwork load is minimized and there is no need for complex settings or directory searches to take\nplace between the user and the directory service.\n\n|Protocol|Credential Confidentiality|Server Identity Verification|Full Tunnel Encryption|\n|---|---|---|---|\n|RADIUS with Password Authentication Protocol (PAP)|Yes|Shared key|No|\n|RADIUS with EAP|Yes|Shared key and X.509 validation|Partial|\n|LDAP with TLS|Yes|X.509 validation|Full|\n|LDAP without TLS|No|No|None|\n\n\n-----\n\n|Col1|Table 2 Resource Differences|Col3|\n|---|---|---|\n|Resource|RADIUS|LDAP|\n|Transport method|UDP|TCP|\n|Network load|Minimal|Moderate|\n|Client processing|Minimal|Minimal|\n|Server processing|Major|Moderate|\n\n\nWhile RADIUS can offer considerable functionality, it can be difficult to maintain. Managing\nmultiple backend services can be confusing for network administrators. RADIUS servers often\ncommunicate using multiple protocols, quickly making troubleshooting difficult. LDAP provides\nbasic network authentication with minimal hardware requirements and a simpler interface. This\ncan reduce maintenance and overhead costs as well as reduce stress on network administrators.\n\n#### CONCLUSION\n\nThis brief overview of LDAP and RADIUS provides insight into how these protocols are\ncommonly implemented. RADIUS and LDAP both allow for centralized authentication services.\nLDAP can allow for single sign-on services in the network, but it lacks built-in tools for session\naccounting. LDAP can easily be encrypted using TLS as a wrapper. The simplicity of LDAP also\nallows for easy setup and integration with an already established network, such as a Microsoft\nActive Directory server. RADIUS allows for flexibility in services offered because it can connect\nto almost any other network service. RADIUS often allows for faster speed in network\ntransactions due to its simplicity. However, setup of these services can be time-consuming and\nconfusing. In short, LDAP excels in situations where simple password authentication is needed\nwhile RADIUS offers additional services for authentication but increased complexity during the\nsetup and management of the network.\n\n#### REFERENCES\n\n[1] Microsoft, “What is LDAP?” 2015. Available: https://msdn.microsoft.com.\n\n[2] Microsoft, “Lightweight Directory Access Protocol,” 2015.\nAvailable: https://msdn.microsoft.com.\n\n[3] Microsoft, “RADIUS Server,” March 29, 2012. Available: https://msdn.microsoft.com.\n\n[4] Microsoft, “RADIUS Protocol Security and Best Practices,” January 17, 2002.\nAvailable: https://msdn.microsoft.com.\n\n\n© 2015 by Schweitzer Engineering Laboratories, Inc.\nAll rights reserved.\n\n### *LAN2015-08*\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://cdn.selinc.com/assets/Literature/Publications/Application%20Notes/AN2015-08_20150817.pdf?"
    ],
    "report_names": [
        "AN2015-08_20150817.pdf?"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1439805954,
    "ts_modification_date": 1439805954,
    "files": {
        "pdf": "https://archive.orkl.eu/bb58d1d3088a6b7af64f9cda10046c06ddf0b5ae.pdf",
        "text": "https://archive.orkl.eu/bb58d1d3088a6b7af64f9cda10046c06ddf0b5ae.txt",
        "img": "https://archive.orkl.eu/bb58d1d3088a6b7af64f9cda10046c06ddf0b5ae.jpg"
    }
}