{
    "id": "feb013f5-e5e2-4c2c-aa3d-8ade75e4111c",
    "created_at": "2023-01-12T15:00:19.125663Z",
    "updated_at": "2025-03-27T02:08:33.338989Z",
    "deleted_at": null,
    "sha1_hash": "f572c7ff8b351ea2ac2c774bb38598895d96b7e9",
    "title": "2021-07-23 - AvosLocker enters the ransomware scene, asks for partners",
    "authors": "",
    "file_creation_date": "2022-05-28T02:33:01Z",
    "file_modification_date": "2022-05-28T02:33:01Z",
    "file_size": 1754687,
    "plain_text": "# AvosLocker enters the ransomware scene, asks for partners\n\n**[blog.malwarebytes.com/threat-analysis/2021/07/avoslocker-enters-the-ransomware-scene-asks-for-partners/](https://blog.malwarebytes.com/threat-analysis/2021/07/avoslocker-enters-the-ransomware-scene-asks-for-partners/)**\n\nThreat Intelligence Team July 23, 2021\n\n_This blog post was authored by Hasherezade_\n\nIn mid-July we responded to an incident that involved an attack on a Microsoft Exchange\nserver. The threat actor used this entry point to get into a Domain Controller and then\nleveraged it as a springboard to deploy ransomware.\n\nWhile examining the ransomware payload, we noticed it was a new variant which we had not\nheard of before. In this blog we will take a look at AvosLocker a solid, yet not too fancy new\nransomware family that has already claimed several victims.\n\nThis type of ransomware attack is unfortunately all too common these days and has wreaked\nhavoc across many industries. With the disappearance of the infamous REvil, it is possible\nnew threat actors are actively looking to fill the void.\n\n## New ransomware, looking for partners\n\n[Avos is a relatively new ransomware, that was observed in late June and early July. Its](https://twitter.com/RakeshKrish12/status/1409406222114058244?s=20)\nauthors started searching for affiliates through various underground forums. They announced\na recruitment for “pentesters with Active Directory network experience” and “access brokers”\n\n\n-----\n\nwhich suggests that they want to cooperate with people who have remote access to hacked\ninfrastructure.\n\nIn the other advert they describe the product they offer: a multi-threaded ransomware written\nin C++:\n\n\n-----\n\nThey offer not only the malware, but also help in managing the communication with the\n[victim, and hosting of the data stolen during the operation. Soon, some victims of this](https://www.bleepingcomputer.com/forums/t/754311/avoslocker-ransomware-avos-support-topic/)\nransomware started to emerge.\n\n## Behavioral Analysis\n\nAvosLocker is ran manually by the attacker who remotely accessed the machine. For this\nreason, it is not trying to be stealthy during its run. In default mode, it works as a console\napplication reporting details about its progress on screen.\n\n\n-----\n\nExample: Avos in action\nA sample log from the run (shortened):\n```\n drive: C:\n drive: D:\n Threads init\n Map: C:\n Searching files on: C:*\n file: C:\\autoexec.bat\n Map: D:\n Searching files on: D:*\n FindFirstFileA: INVALID_HANDLE_VALUE\n drive D: took 0.002000 seconds\n Start encryption on C:\n Encrypting C:\\autoexec.bat - ext bat - capped YES\n Searching files on: C:_pin*\n file: C:_pin\\pinadx-vsextension-3.17.98314-g0c048d619.bat\n Start encryption on C:\n Encrypting C:_pin\\pinadx-vsextension-3.17.98314-g0c048d619.bat - ext bat - capped\nYES\n[...]\nSearching files on: C:\\Documents and Settings*\n FindFirstFileA: INVALID_HANDLE_VALUE\n Searching files on: C:\\$Recycle.Bin*\n […]\n drive C: took 52.590000 seconds\n Done!!\n 64.620000 seconds\n\n```\nLooking at the log, we can see that the ransomware first “maps” the accessible drives by\nlisting all their files. After that it goes to the encryption. The files are selected for encryption\ndepending on their extensions.\n\n\n-----\n\nThe files that have been encrypted by AvosLocker can be identified with .avos extension\nappended to the original filename. While the content is unreadable, at the end we find a\nBase64-encoded block added:\n\nWe can assume that this Base64-encoded data contains RSA-protected AES key that was\nused for encrypting this file. Each attacked directory has a ransom note dropped in it, named\n_GET_YOUR_FILES_BACK.txt:_\n\nInterestingly, the ID is not generated during the deployment, but hardcoded in the sample\n(which we can see easily by viewing the sample strings). This may mean that the distributors\ngenerate a sample per victim.\n\nThe link given in the ransom note guides to the Onion website, requesting the ID, that was\nalso in the note:\n\n\n-----\n\nUpon the ID submission, the victim is presented with the individual panel:\n\n\n-----\n\nIn addition to the casual threats about increasing the price after the deadline has passed, this\nransomware adds blackmail by doxing. The additional website titled “Press releases” is\nprovided to prove that those aren’t just empty threats:\n\n\n-----\n\n### Visual analysis\n\nVisualizing the content of the encrypted files shows their high entropy. No patterns from the\noriginal file content were preserved. Example:\n\n\n-----\n\nVisualization of the original file (before encryption)\n\nVisualization of the same file, encrypted by Avos\n\nThose properties suggest that a strong encryption algorithm was used, probably in a CBC\nmode (Cipher Block Chaining).\n\nAlso, the same plaintext files have been encrypted into different ciphertext output. This\nsuggests that for each file a new key (or at least a new initialization vector) was generated.\n\n## Inside\n\nThis ransomware is dedicated to be deployed by the attacker manually on the hacked\nmachines. This purpose is reflected in the design. In contrast to most malware, AvosLocker\ncomes without any protective (crypter) layer. Yet, it’s not completely defenseless: all the\nstrings, and some of the APIs, are obfuscated in order to evade static detection. Yet, during\nits execution, it yells out on the console the logs of the performed actions, so that the\nattacker could observe in the real time what the program is doing.\n\n### Execution flow\n\nThe execution starts in the main function:\n\n\n-----\n\nFirst, the malware checks if it was provided with the optional commandline arguments. By\nsupplying them, the attacker can enable/disable some of the features.\n\nThen, the mutex name is decoded (“ievah8eVki3Ho4oo”), and its presence is checked. It is\ndone in order to prevent the ransomware from being run more than once at the time. If the\nmutex already exists, the execution terminates.\n\nThis malware may come with a hardcoded RSA Public Key of the attacker. This key will be\nfurther used for encrypting individual AES keys, used for encrypting files. Yet, the presence\nof the Public Key is optional. In case if it wasn’t provided, the application will generate a new\nkey pair.\n\nAfter this preparation, the malware proceeds to encrypt files. Depending on the argument\ngiven, it may encrypt network resources. Then, unconditionally, it encrypts drives. The\nencryption operations are run in new threads.\n\n\n-----\n\nAfter the encryption was done, it prints information for the attacker. Then, all the running\nthreads are finalized. At the end the malware prints the summary about how long it took to\nencrypt available resources.\n\n### Arguments\n\nBy default it runs as a console application, yet the console can be hidden by supplying a\nspecific commandline argument: ‘h’ (hide). There is also a commandline argument allowing\nto opt out encryption of network resources: ‘n’ (network).\n\n\n-----\n\n### String obfuscation\n\nAs mentioned before, Avos uses string obfuscation. All the strings are obfuscated by XOR\nwith the given key, and deobfuscated just before use. Although the algorithm is simple, the\nway it implements it is especially tedious to counteract. Rather than having one, central\ndeobfuscating function, each of such operations is done inline. Examples:\n\n\n-----\n\ndeobfuscating Mutex name\n\nbefore use deobfuscating debug string before use\n\n### API obfuscation\n\nAs well as the strings, some of the APIs used by the malware are obfuscated. Functions are\nretrieved by their checksums, which is a common trick used by malware, in order to avoid\nhardcoding names of the functions which may rise suspicions. Which is lesser common\nthough, is that the function resolving the API is also used as an inline.\n\n\n-----\n\nExample: calling a function just after searching it\nThis way of obfuscating API calls not only hides the used functions, but also adds volume to\nthe code, making it more unreadable and difficult to follow.\n\n[Yet, it is easy to reveal the used function names with the help of tracing and tagging.](https://github.com/hasherezade/tiny_tracer/wiki/Using-the-TAGs-with-disassemblers-and-debuggers)\nExample – the above obfuscated function resolved to GetLogicalDrives:\n\n\n-----\n\n### Attacked targets\n\nThe ransomware encrypts all attached drives.\n\nAdditionally, unless the argument (‘n’) was given from the commandline, the ransomware\nproceeds to encrypt network shares. Available resources are being enumerated in a loop:\n\n\n-----\n\nThe accessible network shares are getting encrypted:\n\nFrom each medium, the files are first added to the list. Then, the created list is processed by\nthe encryption routine.\n\nFiles with the following extensions are being attacked:\n```\nndoc docx xls xlsx ppt pptx pst ost msg eml vsd vsdx txt csv rtf wks wk1 pdf dwg\nonetoc2 snt jpeg jpg docb docm dot dotm dotx xlsm xlsb xlw xlt xlm xlc xltx xltm pptm\npot pps ppsm ppsx ppam potx potm edb hwp 602 sxi sti sldx sldm sldm vdi vmdk vmx gpg\naes ARC PAQ bz2 tbk bak tar tgz gz 7z rar zip backup iso vcd bmp png gif raw cgm tif\ntiff nef psd ai svg djvu m4u m3u mid wma flv 3g2 mkv 3gp mp4 mov avi asf mpeg vob mpg\nwmv fla swf wav mp3 sh class jar java rb asp php jsp brd sch dch dip pl vb vbs ps1\nbat cmd js asm h pas cpp c cs suo sln ldf mdf ibd myi myd frm odb dbf db mdb accdb\nsql sqlitedb sqlite3 asc lay6 lay mml sxm otg odg uop std sxd otp odp wb2 slk dif stc\nsxc ots ods 3dm max 3ds uot stw sxw ott odt pem p12 csr crt key pfx der dat\n\n### How the encryption works\n\n```\n\n-----\n\nAvos uses two strong encryption algorithms. Symmetric: AES – to encrypt files, and\nasymmetric: RSA – to encrypt the generated AES keys. This is a very common combo which\nprovides strong data protection. It is also often used by variety of ransomware.\n\n**The RSA Key**\n\nAs mentioned before, the RSA Public key may be hardcoded in the Avos sample. In the\nanalyzed case, the following Public Key was hardcoded:\n\nIn case of lack of thereof, a new keypair is generated. The Public Key is stored for the further\nuse, and the private key is logged on the screen, as the information for the attacker.\n\n\n-----\n\nExample: in case\n\nif no Public Key was hardcoded in the sample, a new keypair is generated. A Private Key is\ndisplayed.\nThe same Private Key is also dumped in each ransom note, instead of the ID:\n\n\n-----\n\nThis suggests that this mode was created only for testing purposes, and it not intended to be\nused on victims. Only the mode with the Public Key hardcoded is usable in real attack\nscenarios.\n\n**File encryption**\n\nBefore the malware proceeds to encrypt particular file, it first retrieves a list of associated\nprocesses, that may be blocking the access:\n\nThe list is retrieved with the help of RmGetList:\n\n\n-----\n\nIf any processes has been found, they are being terminated. Then the malware proceeds\nwith encryption.\n\nFor each file, an AES key generated by a previously deployed routine is retrieved and used\nto initialize AES context.\n\nAfter that, the AES encryption is applied on the file content.\n\nThe file is encrypted in-place (without creating additional copy), in 64-byte long chunks. A\nchunk of a plaintext is read, encrypted, and written back to the original file.\n\nAs we observed during the behavioral analysis, the block with the RSA encrypted, base64encoded AES key is written at the end.\n\n**AES key generation**\n\n\n-----\n\nThe generation of random keys is deployed in the function enumerating the files of a\nparticular directory, prior to the encryption. For each listed file a new key and Initialization\nVector are generated, and stored for further use.\n\nAs default, the cryptographically strong random generator is used. However, if for some\nreason this strong generator fails, it falls back to the naive generator (based on the standard\n_rand() function)._\n\nThis may render a flaw in the full encryption scheme. However, the chance of the strong\nrandom generator failing is too small to consider worth the attention in real life scenarios.\n\nThe malware fetches a buffer of 512 random bytes per each file, and then generates out of\nthis a 64-character long string for the key, and a 32-characters long string for the Initialization\nVector.\n\n\n-----\n\nExample of the generated data:\n\nthe key: “6584cd273625ee121e330a981cc04e1f1d312356c9cccdb62932ea7aad53a731”\n\nthe IV: “cf0c2513b6e074267484d204a1653222”\nThis key and the initialization vector are further passed to a function initializing AES context.\nAlthough the created key is 64 bytes long, we must note that only 32 first characters are\ngoing to be used. Similarly, in the case of the Initialization Vector, only first 16 bytes matter.\nBoth strings are treated as ASCII.\n\nPreview of the file encrypted with the presented key/IV set:\n\nExample – a [ChyberChief recipe decrypting the aforementioned file, using the key and](https://gchq.github.io/CyberChef/#recipe=AES_Decrypt(%7B'option':'Latin1','string':'6584cd273625ee121e330a981cc04e1f'%7D,%7B'option':'Latin1','string':'cf0c2513b6e07426'%7D,'CBC','Hex','Raw',%7B'option':'Hex','string':''%7D,%7B'option':'Hex','string':''%7D)&input=OTUgNjIgQzQgOTggNzQgQTMgQjYgQjkgNTAgMTQgMzUgNjQgQzggODYgRTQgM0QgNTcgQTUgREYgOTEgREMgQ0EgOTIgODMgM0YgQzcgRjkgQjAgREMgRTggNkIgNTIgNTUgNUYgMDQgRTAgRjggQUMgMzIgNkIgN0UgMTQgMDcgRjMgNUMgRjQgNEIgRTUgNTMgQUMgQTIgMzUgODcgNTEgNkMgRTggNzMgNzEgQUUgM0IgQTEgNkYgMzggMkQgMDQgOEYgQzEgRDcgN0IgRDQgMDcgNjQgMjIgN0YgREEgREEgQjggRTQgNzkgOUIgNjIgMzcgQTIgNDggM0EgMjMgNDAgRjggODUgNDggNzAgQ0EgMkEgRUQgNzcgNEYgRjkgOUQgMEQgRUMgMzggM0EgNDYgNjUgM0IgMEMgRUEgQTEgMDcgMjYgODcgRUYgMzcgRTcgRUUgRUYgRjEgNEEgNzAgRkQgMEQgQzYgNzIgMjEgNEQgMDEgNkIgMjQgMUQgOUIgMzcgRkMgMTAgQzEgMjIgQjMgRTkgNkEgQjggM0IgMzAgRjYgNkUgOEYgRjQgQUUgMTggNjUgOTEgNDIgMzcgMTEgOTMgRTkgNjYgMjkgN0MgQzUgM0YgNzUgNzMgM0IgNDcgNjcgRjAgOEEgQkIgNkUgOTYgMzEgMjEgREQgMDUgQjMgM0EgM0EgRkMgMTcgNTUgNzMgNTEgNkEgQzUgQjMgOTAgNjIgQkQgOTIgNzMgRjUgMTkgNDkgODMgRTEgNEEgQTMgNDcgNDMgNDkgQ0IgNTYgM0EgRjIgNTMgOEUgQjQgN0IgOTQgQTggMjEgODMgN0MgNkIgNTQgNzggRDMgQTYgRjggQjcgRTcgQTIgNUUgOEEgQjEgMjAgMDggQ0YgRTcgNjAgMTMgNDUgMzAgNzAgOUEgQjQgMEIgMTEgMzAgQTEgMUQgQzEgNjEgN0UgRTEgMzUgNTkgNjUgODEgNEUgRDEgQUYgMDMgQ0UgMUQgRTkgMTkgNTMgQkUgRjcgMjEgNDkgQkUgNjggMzkgNDUgRDIgNzkgRTYgQ0YgREUgOEIgQUIgOTYgQUYgNjkgMjIgRjkgQjIgOTUgN0MgNkEgMTQgRkQgQjggNUQgMkIgMzEgMjIgQ0EgQzMgRjMgOEEgMTIgQzYgOTkgREEgQjkgRDkgNTcgOEMgNkIgNDggNjIgNkQgMzcgMTYgRUQgMjAgQkYgRDEgMUUgQUEgMkUgMEUgNzEgMTQgNUYgRjcgMTIgQTUgODkgNjIgMkEgOTcgODAgQjIgODAgQzAgQzEgQTIgMDQgODIgNkUgMTAgMTAgODcgQjIgQTUgQTggNTAgQTkgRDkgNUIgRjYgNUUgQkIgNkEgQjIgNDkgQjEgRjcgRjggNEIgMDIgRjQgODYgNkUgRUYgNTMgNjggNEMgMTQgQjEgQTAgRkYgOTggMTggNEIgNzkgMzIgNzggQTcgMDUgREIgRjAgQ0UgMzUgQjggRDAgNzMgODYgOUUgQ0MgMEUgNDYgMzIgODIgREQgMjggQkYgMTkgRkEgM0QgMEYgODYgRkIgOTYgMTggMTMgRjEgMjEgNzcgODIgMDYgOTEgMDIgRUEgRkEgRDUgRkQgOUYgNDggNDkgRjggNTEgRjYgMUMgRkIgNTggQTggNTkgRTcgQkYgRkYgOTUgNjUgMjUgMkYgODQgM0QgQUMgNkIgOUQgMjggRDYgQ0MgMjggRjAgODAgMUIgRkUgOEMgNjIgQjcgNDYgRjYgRTAgQjAgM0EgMEEgMTYgNjIgM0QgMjYgNTMgMUUgRDkgM0UgNzggREYgMkEgRTUgNzggMTIgQjQgOTAgOEQgMTEgOTkgNDUgNTAgMkUgQjIgQjIgQzggQkUgOUIgNDIgOTAgOUQgQUUgMDMgQzEgMUQgQ0EgNEUgRDYgNjEgMjcgMUYgQTQgQTMgNEEgNzIgNTYgNEYgOEQgQjAgNDEgNDEgMTEgNzggODEgOTkgNDMgMEUgRTUgNUQgOTcgQjYgQzYgOEYgRTcgM0IgMUMgMjIgNjcgNUUgN0UgOTkgMkEgRDMgRjIgQzEgQzMgMkUgOTggMUMgOUQgRjkgOTcgMjQgQTggRTUgMkIgQjIgQkUgMkMgNUMgMDEgQjUgQTAgNkMgNDQgRTEgNEEgOTUgOTggMEYgRkMgMzIgN0UgMjkgN0YgNkIgOTcgMjcgNUQgM0YgM0QgNTQgNTMgRDEgODAgNzUgREYgODggRjIgQjMgRTkgQUEgQkUgRkYgMkYgQzggOEUgODggRjQgOEUgQjMgMUEgQ0EgNEQgNjYgMDkgNjkgMzkgRkIgOUQgODYgQjQgQ0UgMkIgNDMgODUgMjYgNzcgODEgNDYgMUUgNEMgMjggNDcgQkYgQjEgRkIgOTUgMDggRUQgNjIgNDMgNTMgNTkgNUIgRTIgRkUgNjMgMzYgNzggMkUgMTcgMkMgNzEgRkUgODEgQTEgODEgMUEgMzMgMUYgMkQgQTQgODkgNEIgNUMgNTggNzcgQUQgODMgMkMgRDIgNjYgMTIgQzMgODkgMDQgMkEgRjQgMzMgNjggN0UgQjkgM0IgQjcgMkMgQTggOUEgQUMgQUMgQTAgN0YgNUYgM0UgRkQgREQgMkQgQjkgRTUgNTQgQTIgODIgMTEgODIgOEUgMjAgMTAgMjAgNTIgNkYgNTAgODAgRjIgODQgRUIgQUIgQzAgNzcgRTQgRUYgMjggRkIgMkQgN0IgQjUgMEYgMTQgM0MgQkQgN0YgRDggMDggNDUgMTQgNDUgNzcgQ0MgMUMgRUIgRkUgMzEgMUUgRkMgQ0EgNzcgNkMgQjkgNzEgRjQgNUUgRjggM0YgOTQgOTUgMEIgNjYgRTQgNDEgMzMgREQgMUYgMUQgQkMgQzggRUYgMDAgRjMgQTMgMzYgNzAgQ0EgQUQgMkQgNzAgOUYgRDQgNEEgN0QgODUgODAgMEQgREYgMEEgMjMgODkgMDYgNzggNkEgQzYgMjAgQUMgMzUgQUUgNTkgODcgRDUgQkUgNDcgNUQgQzIgOTUgQzQgMEIgMUUgOTYgQkQgRDAgMzUgNTEgRTYgRUUgQTcgNDggRkQgOTMgNjUgN0IgQTAgQ0MgMjMgREUgOTIgMTQgQ0QgOTcgMTUgODEgODIgMjYgNzggMzIgOEQgMTQgM0MgMkEgOEQgRjYgRkMgMTIgMjMgMDMgREYgNTggQjYgMjMgMjEgM0YgMzAgOUYgODMgMkQgOUYgQTkgMzUgREMgMUEgNEMgRjMgNTggQTAgRjkgRkQgMDkgREIgNjEgMjkgODkgNDkgODAgQTUgMDcgMzEgQkEgOUYgNjUgMEYgMjggNjggMTUgNEUgRUMgRDIgQzcgQTIgRDUgRjkgQUEgRDggNzIgQjkgNzAgRTAgMkYgOTggOTUgOTEgRDEgRDQgQzQgNkIgMTYgMDkgRkUgM0UgRDMgN0EgMzQgNkMgODYgQjYgMDcgRDIgNUQgNDIgOTIgMjcgRjYgQzkgOUMgRjcgQkUgNzcgRTIgQzUgMDUgNUIgNzYgOEMgRDggQTggREQgNDEgMTIgMDQgNkUgMTUgOEMgQTIgNDQgREYgMTMgMDggM0MgMEYgNjggQjMgM0MgREMgRDEgNzggQ0QgMzcgQjkgQzAgRUIgODggQkMgRUUgNzIgQjQgODMgQjYgQzkgN0QgODAgMEUgRjUgOTYgQkEgQUIgQzAgQ0MgNkEgNzMgQTkgQjUgRkUgODIgRkUgNkYgMDYgMDggMDcgQkEgQUUgNTUgQUYgOUQgMEYgMjkgN0EgQTYgNzkgQkEgM0YgRjEgQTUgOTQgMzAgMTkgRTUgN0EgQkIgQjcgQTAgOTAgNTYgMjAgOTAgRDkgNTEgMTggMUYgREYgM0QgRDggQjQgNTQgMUIgNTggMkEgRkYgM0UgQjkgMjkgREIgRTQgMzggRkMgQUYgQkUgRUMgODIgQTAgNDggQkIgMEYgQzAgNUEgMUIgN0UgMzQgRTUgQ0UgQTQgOUUgOUUgQjIgNDUgNTAgNkMgNEEgQjEgQjUgQ0YgNEYgOTUgMjggOTMgNzAgMDcgMTggREMgMDUgNkIgQzUgRkQgQkMgMDEgMzcgN0QgQjggNDAgMEMgODQgNjAgMUQgNkQgMzQgMUQgNjEgN0QgM0MgN0QgQ0EgRjcgQTQgMUQgRkEgQkUgRUUgN0MgQjMgNzIgQzAgRjcgQTggODMgOUMgNzcgOUIgRDEgNEQgMEMgQkQgQzQgNTcgQTcgOTAgNEQgMDMgNDIgQjAgMUUgQzYgNDQgODggOTIgRjMgRkUgRDIgQzkgOUEgRTkgMEIgQzMgQUEgM0QgNjAgRjIgQTUgRkYgNzAgMTIgRTMgNzkgOEIgMjkgNDkgQzEgQ0QgRDEgODEgRUQgMDcgNTAgQzkgQ0YgREEgQjggNjcgQzcgNTQgREMgNzIgRTMgMEUgREMgNDQgMUEgQzEgMUIgODIgNjMgNTcgMDMgOUEgMUQgM0YgMTggOTAgMzAgMTAgNUMgNEMgMTkgNzEgRjMgMzMgREUgNUIgREMgNzQgOTcgQTggNTggRkYgREIgRUQgRkIgREIgOEMgODMgQUQgNjMgQUQgMDcgRkEgMEEgNzkgNzAgRUMgNUUgMzMgMkEgRDEgODcgREQgNjYgQUMgMzYgMzQgNTIgRjMgMEUgMzggNDQgNEUgOTEgNTAgQkMgNTAgNUEgQ0UgNDMgQzYgRDggNjIgRDIgQUQgRTcgQjcgNkMgMDYgMUIgNkYgRUQgRkUgQkIgMzAgQ0QgMEYgMTggM0MgQzkgMDIgNjc)\ninitialization vector dumped from the memory:\n\n\n-----\n\n## Valid implementation, unimpressive design\n\nAvosLocker does not distinguish itself much from other ransomware (apart from being\nunusually noisy). All its features are average. Its encryption scheme seems implemented\ncorrectly, so recovering the data is not possible without obtaining the original Private Key for\na particular sample. It also uses a well-established pair of algorithms: RSA and AES.\nAlthough it contains some inconsistencies in the implementation, they do not impact the main\ngoals of this malware.\n\nWe didn’t find in the sample any routines responsible for uploading the stolen files. Yet, since\nthe model of the delivery of this ransomware assumes manual access, it is possible that the\ndata exfiltration is done manually by the attackers.\n\nAvosLocker meets its objective by being a simple tool assisting in the manual attacks, and\ncreating the expected damage.\n\n## Protection and recommendations\n\nKeep software up-to-date and turn on automatic updates whenever possible\nEnforce strong password policies and multi-factor authentication (MFA)\nPerform backups and periodically test restoring them\nReduce attack surface by removing unused or unnecessary services\nMitigate brute-force attacks (this is a feature in our Nebula product)\n\n\n-----\n\nEnable tamper protection to prevent attackers from uninstalling your security software\n(this is a feature in our Nebula product)\n\nAvosLocker is detected without specific signatures by Malwarebytes’ anti-ransomware\ntechnology:\n\n## Indicators of Compromise\n\n[43b7a60c0ef8b4af001f45a0c57410b7374b1d75a6811e0dfc86e4d60f503856](https://www.virustotal.com/gui/file/43b7a60c0ef8b4af001f45a0c57410b7374b1d75a6811e0dfc86e4d60f503856/detection)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-23 - AvosLocker enters the ransomware scene, asks for partners.pdf"
    ],
    "report_names": [
        "2021-07-23 - AvosLocker enters the ransomware scene, asks for partners.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535619,
    "ts_updated_at": 1743041313,
    "ts_creation_date": 1653705181,
    "ts_modification_date": 1653705181,
    "files": {
        "pdf": "https://archive.orkl.eu/f572c7ff8b351ea2ac2c774bb38598895d96b7e9.pdf",
        "text": "https://archive.orkl.eu/f572c7ff8b351ea2ac2c774bb38598895d96b7e9.txt",
        "img": "https://archive.orkl.eu/f572c7ff8b351ea2ac2c774bb38598895d96b7e9.jpg"
    }
}