{
    "id": "fed3e0d6-0350-443d-8ce5-53cf986fd12c",
    "created_at": "2023-01-12T15:10:47.203348Z",
    "updated_at": "2025-03-27T02:16:08.462988Z",
    "deleted_at": null,
    "sha1_hash": "d759c2b6af0f454f006a01e9566c0ab59db1ec46",
    "title": "2020-07-20 - Golden Chickens- Evolution Oof the MaaS",
    "authors": "",
    "file_creation_date": "2022-05-28T17:49:06Z",
    "file_modification_date": "2022-05-28T17:49:06Z",
    "file_size": 889884,
    "plain_text": "# GOLDEN CHICKENS: Evolution of the MaaS\n\n**[quointelligence.eu/2020/07/golden-chickens-evolution-of-the-maas/](https://quointelligence.eu/2020/07/golden-chickens-evolution-of-the-maas/)**\n\nJuly 20, 2020\n\n## Latest Golden Chickens MaaS Tools Updates and Observed Attacks\n\n Executive Summary\n\n[Throughout March and April, QuoIntelligence (QuoINT) observed four attacks utilizing](https://quointelligence.eu/)\nvarious tools from the Golden Chickens (GC) Malware-as-a-Service (MaaS) portfolio.\nWe are now declassifying our findings for the general public.\nOverall, we attribute the separately conducted campaigns with confidence varying from\nlow to moderate to GC05, GC06.tmp, and FIN6.\nDuring our analysis of the attacks, we uncovered the GC MaaS Operator,\n**Badbullzvenom, created new variants of three existing tools in the service portfolio**\nwith notable code updates to TerraLoader, VenomLNK, and more_eggs.\nTerraLoader. A multipurpose loader written in PureBasic.\n\nUpdates – the new variant uses different string de/obfuscation, brute-forcing\nimplementation, and anti-analysis techniques.\nVenomLNK. A Windows shortcut file likely generated by a newer version of the\nVenomKit building kit.\n\nUpdates – the new variant uses a new volume serial number, an evolved\nexecution scheme, and only the local path to the Windows command prompt.\nmore_eggs. A backdoor malware written in JavaScript (JS)\n\nUpdates – the new variant includes a minimum delay before executing or retrying\nan action, and cleans up memory after using it.\nIn April, we detected two new attacks sharing similar characteristics of previously\nobserved attack activity attributed to FIN6 – a financially-motivated threat actor group.\nBased on our analysis of the new campaigns, we assess attribution to FIN6 with low to\nmoderate confidence.\n\n\n-----\n\nThe uncovered campaigns highlight that Badbullzvenom is still highly active in the\nbusiness of its MaaS, and that FIN6 is still one of Badbullzvenom’s recurrent\ncustomers.\n\n## Introduction\n\nThroughout March and April, QuoIntelligence (QuoINT) observed four attacks (i.e. sightings)\nutilizing various tools from the Golden Chickens (GC) Malware-as-a-Service (MaaS) portfolio\n– we are now declassifying our findings, after first notifying clients on 22 May . Further,\nduring our analysis of the sightings, we confirmed the GC MaaS Operator, Badbullzvenom,\nreleased improved variants with code updates to three tools in the service portfolio:\n\n**TerraLoader. A multipurpose loader written in PureBasic. TerraLoader is a flagship**\nproduct of GC MaaS service portfolio.\n**more_eggs. A backdoor malware capable of beaconing to a fixed command and**\ncontrol (C2) server and executing additional payloads downloaded from an external\nWeb resource. The backdoor is written in JavaScript (JS).\n**VenomLNK. A Windows shortcut file likely generated by a newer version of the**\nVenomKit building kit.\n\n_Figure 1: Timeline of sightings using various GC MaaS Tools during March & April 2020_\n\n## The Golden Chickens\n\nSince 2018, QuoINT has tracked the evolution of the GC MaaS, the activities of its Operator\n_Badbullzvenom, as well as the different threat actors using the MaaS – including top-tier,_\nfinancially-motivated threat actors such as FIN6 and the Cobalt Group. The GC MaaS\nremains as a preferred service provider for top-tier e-crime threat actor groups due to\nBadbullzvenom/the Operator’s consistent updates and improvements of tools and its ability\n\n\n-----\n\nto maintain underlying network infrastructure. Although GC tools have primarily been used to\ncompromise organizations in the retail and financial sector, one notable outlier includes a\npotentially targeted attack against a chemical company.\n\n## Technical Analysis\n\n### Latest Sightings Related to GC MaaS\n\nThroughout March and April, QuoINT has observed four sightings utilizing various tools from\nthe GC MaaS portfolio. Overall, we attribute the separately conducted campaigns with\nconfidence varying from low to moderate to GC05, GC06.tmp, and FIN6. To clarify GC05 and\nGC06.tmp, we categorize the multiple GC MaaS clients as GCxx based on their overall\nmotives, means, and opportunities. Additionally, we append .tmp to the GC categorization to\nrepresent that we are investigating their exact singular attribution.\n\n### Sighting 1 GC06.tmp: Excel 4.0 Macro Sheet Used to Deliver GC MaaS Infection Chain\n\nOn 6 March, QuoINT [detected a new malicious Microsoft Excel document leading to the](https://twitter.com/malz_intel/status/1235964282921275393)\ndownload of GC MaaS tools. Following our preliminary analysis, we confirmed the malicious\ndocument (maldoc) leads to an attack kill-chain which entirely relies on GC MaaS tools.\nBased on our telemetry, we assess with moderate to high confidence this targeted attack\nwas against a large German chemical company.\n\nUpon further analysis, we do not attribute the maldoc to the GC MaaS toolset as it is clear\nthe employed technique is a well-documented abuse of a legacy functionality in Microsoft\n[Office known as Excel 4.0 Macro Sheet. The Macro Sheet was obviously adapted to use the](https://malware.pizza/2020/05/12/evading-av-with-excel-macros-and-biff8-xls/)\ndownloaded .ocx file – the typical file extension of TerraLoader.\n\n_Figure 2: Output of tools to parse Microsoft document OLE objects_\n\nThe Macro Sheet contains formulas in cells to perform actions, including Run on open\n(Auto_Open) and execute shell commands and web requests. Once the document is\nopened, the Macro Sheet’s code is triggered, and it initiates the infection routine to download\nand execute the next stage payload which is a TerraLoader variant.\n\nThe attack chain consists of multiple known GC tools which are:\n\n**TerraLoader. A multipurpose loader, written in PureBasic. TerraLoader is essentially a**\nflagship product of GC MaaS service portfolio.\n\n\n-----\n\n**lite_more_eggs. A lite version of more_eggs used as a loader, written in JavaScript.**\n**more_eggs. A backdoor malware capable of beaconing to a fixed command and**\ncontrol (C2) server and executing additional payloads downloaded from an external\nWeb resource. The backdoor is written in JavaScript.\n**TerraStealer. An information stealer (also known as SONE, StealerOne) written in**\nPureBasic.\n\n_Figure 3 – Kill-Chain of Sighting 1_\n\n[Consistent with our earlier observation, attacks relying on lite_more_eggs result in a variant](https://quointelligence.eu/2020/01/the-chicken-keeps-laying-new-eggs-uncovering-new-gc-maas-tools-used-by-top-tier-threat-actors/)\nof more_eggs dropped on the victim’s the system. In this case, neither TerraLoader nor\nmore_eggs were digitally signed, and the observed more_eggs variant version is the older\n“2.0b”.\n\n_Figure 4 – configuration of more_eggs delivered by the lite_more_eggs sample_\n\nWe have observed three occurrences involving the same highlighted attack kill-chain of GC\nattributed tools, resulting specifically in the older “2.0b” variant of more_eggs. Although this\nactivity is not distinct enough, we are temporally attributing these sightings to GC06.tmp.\n\n### Sighting 2 – GC05: A New Campaign with Familiar Tactics, Techniques, and Procedures (TTPs)\n\nOn 10 April, QuoINT detected a new VenomLNK variant. The VenomLNK file is contained\nwithin a Zip archive; both themed as a financial document, and likely delivered to a targeted\nuser as an email attachment or link. While the observed filenames indicate the exploitation of\na financial theme, we cannot confirm the victimology at this time.\n\n\n-----\n\n_Figure 5 –Financial themed Zip archive and extracted VenomLNK variant_\n\nThe attack’s kill-chain involves an obfuscated JS scriptlet dropping a TerraLoader variant and\ndecoy Microsoft Word document. While the decoy document appears in the screen on the\nuser’s system, the TerraLoader is running and dropping a more_eggs variant. Finally, the\nmore_eggs delivers a final payload of the information-stealer tracked by QuoINT as\nTerraStealer, two tools already attributed to the GC MaaS.\n\n_Figure 6 –Sighting 2 – Kill-Chain_\n\nPivoting on our initial sample, we obtained additional VenomLNK files which are all similar\nexcept for the C2 URLs and contain slight modifications from earlier known variants. Further,\nwe determined that our initial sighting was part of a campaign which likely began on 11\nMarch through 14 April. Based on our observations, the campaign aligns with activities and\nTTPs we previously attributed to GC05; a threat actor we have tracked since September\n2019 who leverages the GC MaaS extensively, especially VenomLNK, more_eggs, and\nTerraStealer.\n\n### FIN6: A Familiar and Returning GC MaaS Customer\n\nIn April, we processed two sightings of attacks sharing similar characteristics of previously\nobserved activity attributed to the financially-motivated threat actor group known as FIN6.\nSince 2018, QuoINT was able to attribute with high confidence the use of GC MaaS tools\nsuch as more_eggs, TerraLoader, and TerraTV to FIN6 campaigns. Based on our analysis of\nthe new campaigns, it is evident that FIN6 remains a customer of the GC MaaS. Although\nFIN6 is known to primarily target the financial and retail sectors, we cannot confirm the\nvictimology of these campaigns at this time.\n\n\n-----\n\n### Sighting 3 – Fake Job Spearphishing Delivering VenomLNK\n\nOn 8 April, we became aware of a new variant of VenomLNK and its original Zip archive.\nBoth filenames aligned with the theme for the known fake job campaign attributed to FIN6,\n[by both researchers at IBM-X Force and](https://securityintelligence.com/news/threat-actor-using-fake-linkedin-job-offers-to-deliver-more_eggs-backdoor/) [Proofpoint, conducted since at least the middle of](https://www.proofpoint.com/us/threat-insight/post/fake-jobs-campaigns-delivering-moreeggs-backdoor-fake-job-offers)\n2018. The original Zip archive, named assistant_buyer.zip, contained the VenomLNK variant\nnamed Job Offering.lnk. During analysis, the C2 URL was not serving the next stage payload\nof the kill-chain. Based on our telemtry, the first alleged execution of the attack occurred on 7\nand 8 April, suggesting the sighting was likely part of new activity. However, due to lack of\nfurther pieces of evidence on the kill-chain, we currently attribute the sighting to FIN6 with\nlow confidence.\n\n### Sighting 4 – TerraLoader Directly Injecting Metasploit’s Meterpreter\n\nOn 27 April, QuoINT detected a new variant of TerraLoader having a modified payload\ndelivery mechanism which decrypts the included payload (shellcode) and loads it directly into\nmemory. During analysis, we identified two DLLs in memory – one very likely OpenSSL and\nthe other highly likely Meterpreter, which is a full-featured backdoor. The Meterpreter uses\nHTTPS to callback to an attacker-controlled asset. Further aligning with the detection\ntimeframe, the TerraLoader variant included a kill-switch of year 2020 – a feature which\ndisallows the execution of a malware sample beyond a hardcoded date, time, or year value.\n[As we have already noted, the kill-switch is a common feature of the Operator’s arsenal](https://quointelligence.eu/2020/01/the-chicken-keeps-laying-new-eggs-uncovering-new-gc-maas-tools-used-by-top-tier-threat-actors/)\naimed at enforcing his own licensing with his customers.\n\n_Figure 7 –Sighting 4 – TerraLoader direct memory injection_\n\nPreviously in April 2019, we identified FIN6 as the only GC MaaS customer using a variation\nof the approach described above. Further to the attribution of the April 2019 case, the\ninvolved C2 domain, registered in January 2019, is also a domain we observed in attack\nactivity we already attributed earlier, with high confidence to FIN6. In April 2020, we detected\nanother attack with the same approach from 2019. The activity of all three cases are\ndescribed as follows:\n\n\n-----\n\n**April 2019: Involves initially generating an apparent stager executable, likely with**\nMetasploit tools, for use by TerraLoader to inject into another process and download\nMeterpreter.\n**April 2020: Similarly, this activity involves a generated stager executable used by**\nTerraLoader to inject into another process (wermgr.exe) and download the next stage\npayload, which is a Meterpreter.\n\n_Figure 8 – April 2019 & 2020 – TerraLoader process injection_\n\n**April 2020: Differently, this activity involves TerraLoader loading obfuscated shellcode**\ndirectly into the memory of itself, already including the Meterpreter payload, and\nexecuting it. Both TerraLoader variants detected in April included a kill-switch of year\n2020, indicating recent or ongoing activity.\n\nA reasonable hypothesis for the new approach of using obfuscated shellcode, instead of\ninjecting into another process, could likely be to increase stealth and evade detection by\nsecurity solutions such as Anti-Virus. As such, TerraLoader is known to be fully undetectable,\nso decrypting and executing code within the same memory space will increase the likelihood\nof being undetected by most Anti-Virus solutions.\n\n## GC MaaS Toolset Updates\n\n### TerraLoader\n\nThe TerraLoader variant observed in Sighting 2, spanning from 11 March to 14 April,\ncontains some notable feature changes, which we previously observed only twice in\nDecember 2019. The new variant uses a different string de/obfuscation, brute-forcing\nimplementation, and anti-analysis techniques.\n\n**String de/obfuscation**\n\nThe latest variants store strings RC4 (a stream cipher) encrypted as raw bytes and\nseems to entirely use the same stream cipher for decryption. In early variants,\ndeobfuscation was achieved through XOR-decryption on strings stored as hex\nstreams.\n\n\n-----\n\n**Brute-forcing Implementation**\n\nIn new variants, only the first half of the string encryption key is stored in the malware.\nThe second half of the string encryption key is brute-forced – calculated at runtime by\ncounting up from zero until it is found. As soon as the bruteforcing is able to decrypt a\nspecific ciphertext to a specific plaintext, which are both stored in the malware, the key\nis successfully found.\nFrom an analysis perspective, earlier variants used XOR obfuscation which can be\nbypassed quickly, however, the latest variants use RC4 so the same bruteforce search\nfor the actual key needs to be performed to successfully decrypt all strings.\n\n**Anti-analysis Techniques**\n\nChecks where in memory ntdll.dll (a Microsoft file that contains NT kernel functions) is\nloaded.\nChecks hash of executable (exe) name against a whitelist (pre-calculated hashes)\nincluding regsvr32.exe, using ZwQueryInformationProcess.\nChecks hash of loaded DLLs against a blacklist. (pre-calculated hashes)\nCompares hash of Dynamic-link library (DLL) extension, expects .ocx, and exe name\n(expects regsvr32.exe) against pre-calculated hash values. To do so, Process\nEnvironment Block (PEB) is used to know where a process exists in memory.\nUses NtQueryInformationProcess to check if a debugger is present on the system.\nDynamic function address resolution continues to perform lookup by hash (CRC32),\nbut additionally uses an XOR value to make direct hash value comparison impractical.\n\n### more_eggs\n\nOn 29 April, we detected a new variant of TerraLoader which contains a msxml.exe (a\nWindows command line utility that invokes the Microsoft XML Parser for transformation) and\nnew more_eggs version, “6.6b”, embedded in its .data section.\n\n_Figure 9 – more_eggs configuration of the latest variant_\n\n\n-----\n\nThe latest variant of more_eggs is 6.6b, one iteration above the last known version 6.6a,\nwas observed during the campaign from 11 March through 14 April. Besides the typical\ncustomized more_eggs configuration variables (version number BV, C2 address Gate, and\npart of the ciphering key used to encrypt C2 communications, Rkey), the latest variant\ncontains two notable main code changes:\n\nIntroduces minimum delay before executing or retrying an action.\nAttempts to cleanup memory by assigning empty values to variables after using them.\nIn general, it is not clear how effective this approach is in JavaScript; however, this\ndoes at least hinder a JavaScript debugger.\n\n### VenomLNK\n\n_Sighting 3 utilized an updated variant of VenomLNK as an initial attack vector in a targeted_\ncampaign. We have observed VenomLNK used in various campaigns involving different\ninfection chains.\n\nMetadata analysis of the LNK file allows key information to be extracted about the direct link\nto another file and the execution process. In general, LNK files have a small file size but\ncontain valuable information such as shortcut target file, file location and name, and the\nprogram that opens the target file.\n\nThe VenomLNK files obtained from the campaign were all similar and contain slight\nmodifications from earlier known samples which are:\n\nUses a new volume serial number: 0xcae82342. The Serial Number is dependent of\nthe hard drive the LNK file was created on.\nEvolution of the execution scheme: /v /c set “z1=times”. The command line input places\nthe first variable in double quotes, which can often break detection-based security\nsolutions.\nOnly uses the Local Path (C:\\Windows\\System32\\cmd.exe) to the Windows command\nprompt, dissimilar from earlier variant which also included the Relative Path\n(……..\\Windows\\System32\\cmd.exe)\n\n## Conclusion\n\nThe GC MaaS continues to offer a versatile catalog of attack tools and underlying C2\ninfrastructure to fulfill the entire attack kill-chain. The Operator continues to regularly evolve\nand improve the toolset within his service portfolio, and adapt new techniques over time,\nsuch as in the campaign leveraging TerraLoader to directly inject a payload into memory. We\nexpect the MaaS will continue to prove its success and profitability, through at least its\nreturning customers and the known top-tier e-crime threat actors who have utilized the\navailable services.\n\n\n-----\n\nDo you want to know more about Golden Chickens MaaS through exclusive and\nunpublished intelligence? Have information to share about about our findings?\n\n[Get in touch!](https://quointelligence.eu/talk-to-an-expert/)\n\n## Join Our Newsletter!\n\nSubscribe to our newsletter to receive Weekly Intelligence Summaries, cyber news, and\nexciting updates!\n\nOnly valid business emails will be approved.\n\n## Appendix I\n\n### Indicators of Compromise\n\n\n-----\n\n```\nSighting 1 \n2ec3639c055d1951eb0149e3bc903bc127a4ae6f9e31cf6761c0df847f764cf7 \n7122cf59f8a59f9a44f20fd4c83451c5c4313e0021d3f1ba9c2b1a4f39801db1 \n0aee265a022ee84e9c8b653e960559c9761a7362e1c345019a552188114b7e80 \nhxxps://origin[.]cdn77[.]kz/api/json\nhxxps://origin[.]cdn77[.]kz/api/json[.]txt\nhxxp://download[.]sabaloo[.]com/css/libatk-1[.]0-0[.]dat\n5[.]255[.]96[.]203\nSighting 2\n19c2f16334fe30296299ca92f716c1e074c16e6a7b9ee6a74bedec7ccfdcd6f0\n4e562916eb56c7a2c9336c82e49c3a1285ccd95a74a5d1ab881e1d3dd8fba8e9\n60914099428861a8aeeb361359035e11feb464fa291772eb0b45805802d96d7d\n686b279d282c9794dcecbd8b6164ec8b12f6b4617df0eb0fa72149cedd215ac8\n831537fff141897aee0fea5f03f4ffa7fb7a3598568da58dc27ddd0aa8473809\nb33ca728423df9873bff43fea7c02755a1efeac8e1d013653a6ab706d5d09af5\nb479f1beb42a8784862381a38b023ce009acfac79770b3ad7cc2245a56320bb8\nb7431497f682697968ddcbdafc510350aaf04697bda1e0bc638d89a972e9461d\nb95637122a540083d7a5a7063a4b97ad7fdd0bb22ddb301ed3859a394b35b3a0\nCitibank_statement_08_03_2020.lnk\nCitibank_statement_08_03_2020.Zip\nfbe753e22f80486e80dc764cfc60a87ed08548f76cefbfae0c38b19f36552fa0\nfcffcc8511483f3dbeb8e2eaa3184a866cfadc11a98f05d5f97f800e970b4aba\nff50be3fe471cbda1d2ce980f82659efe3a07d8266b93474bd8b0aa3ae372988\nhxxp://json[.]digebuy[.]com/demo[.]txt\nhxxp://json[.]digebuy[.]com/english[.]txt\nhxxp://web[.]rossnnam[.]com/readme[.]txt\ndoaglas[.]com\n162[.]255[.]119[.]21\noffice[.]fielnnam[.]com\n91[.]92[.]109[.]59\nScottBank_01_04_2020.lnk\nScottBank_01_04_2020.Zip\nScottBank_05_04_2020.lnk\nScottBank_05_04_2020.Zip\nScottBank_statem_23.04.2020.lnk\nScottBank_statem_23.04.2020.Zip\nScottBank_statem_23.04.2020.Zip\nM&T_Bank_08_04_2020.Zip\n28bdd1dbd4a15f6b5142bb3170de6e69320c3c96ba74a33198b0559a896d472a\na7d4402917a32299b74d707efd81d7e1f3692a3871f4491691a45fc5e69ef19d\nM&T_Bank_08_04_2020.lnk\nM&T_Bank_08_04_2020.Zip\n931ff382b786e15b4bceaebd40ec61baa096a2f4ac873c28c50667ef2be6755a\naf0e95119ad9a56415e77ae4b6bab2081dccb1516f6f2c5dfd357c29f2e3259d\nScottBank_05_04_2020.lnk\nweb[.]rossnnam[.]com/readme[.]txt\n85[.]204[.]116[.]135\njson[.]digebuy[.]com/english[.]txt\njson[.]digebuy[.]com/demo[.]txt\n192[.]64[.]119[.]132\nhxxps://office[.]fielnnam[.]com/update/check\nhxxps://maps[.]doaglas[.]com/update/check\n\n```\n\n-----\n\n```\nSighting 3\neaf88363657b4989ceb9c4d7cde824cf62e10c2d6d05bfd80277464d4282da82\nf0bdf8e640ed3e5441675ab57e09f680ea41edd95c3cf87b82d742bead29ff36\nhxxp://18[.]221[.]151[.]210/21[.]odt\nSighting 4\n30cdbb1ff2e85502bd81bfe8547c95f735a120aa7547d42867f7bb5e8b91c405\nxo[.]mikeplein[.]com\nhxxps://xo[.]mikeplein[.]com:443/9XpHPVaMe23UyNXJim_0kwxeHtbpYrZo13FcMH30leL6Qcs0J\n8h6tklBPDDnPY1x66UU9L0FPPcOUStSycnI1UvIV/\n193[.]42[.]111[.]180\n1142282962fd60d51a6ab75a83696d6121442ebed1b24590b95409d6cf98c7ba\n255778a7f2ae8818b8a94eedb2eb1760843e6d2c9130a0a48d6995d1e66303ec\nsecure[.]jobscur[.]com \n\n```\n**Updated Tools**\n\n**TerraLoader**\n38f3a52e1ebd93db75f0fb6ce6172565cc0f27f0f86f32f470fa7a9c8de9f094\n1142282962fd60d51a6ab75a83696d6121442ebed1b24590b95409d6cf98c7ba\n\n**more_eggs**\n3d9baa8ffd350fb9d8ad7c2591c321a402b8e8f2e083dc83c941e1c9bb022549\n\n**VenomLNK**\n19c2f16334fe30296299ca92f716c1e074c16e6a7b9ee6a74bedec7ccfdcd6f0\n\n## MITRE ATT&CK\n\n**Toolkit** **Tactic & Technique** **Recommended Course of Action**\n\n\nTerraLoader **Execution**\n\n[T1117 Regsvr32](https://attack.mitre.org/techniques/T1117)\n\n**Defense Evasion**\n\n[T1116 Code Signing](https://attack.mitre.org/techniques/T1116/)\n\n[T1027 Obfuscated](https://attack.mitre.org/techniques/T1027/)\nFiles or Information\n\n[T1140](https://attack.mitre.org/techniques/T1140/)\nDeobfuscate/Decode\nFiles or Information\n\n\nAnti-Virus software and advanced End-Point\nsolution can significantly reduce the impact,\nand lessen the likelihood of successful\nexecution, of TerraLoader.\nOften, TerraLoader is digitally signed. Enforce\nsignature validation via Domain Group Policy.\nLog cmd.exe and regsvr.exe usage via\nDomain Group Policy.\n\n\n-----\n\nMore_eggs **Execution**\n\n[T1053 Scheduled](https://attack.mitre.org/techniques/T1053/)\nTask\n\n**Defense Evasion**\n\n[T1027 Obfuscated](https://attack.mitre.org/techniques/T1027/)\nFiles or Information\n\n[T1140](https://attack.mitre.org/techniques/T1140/)\nDeobfuscate/Decode\nFiles or Information\n\n**Discovery**\n\n[T1082 System](https://attack.mitre.org/techniques/T1082)\nInformation\nDiscovery\n\n[T1016 System](https://attack.mitre.org/techniques/T1016)\nNetwork\nConfiguration\nDiscovery\n\n[T1033 System](https://attack.mitre.org/techniques/T1033)\nOwner/User\nDiscovery\n\n**Lateral Movement**\n\n[T1105 Remote File](https://attack.mitre.org/techniques/T1105)\nCopy\n\n**Command and**\n**Control**\n\n[T1043 Commonly](https://attack.mitre.org/techniques/T1043/)\nUsed Port\n\n[T1071 Standard](https://attack.mitre.org/techniques/T1071)\nApplication Layer\nProtocol\n\n[T1032 Standard](https://attack.mitre.org/techniques/T1032/)\nCryptographic\nProtocol\n\n[T1041 Exfiltration](https://attack.mitre.org/techniques/T1041/)\nOver Command and\nControl Channel\n\n\nPerform HTTPS traffic inspection.\nLog exe and regsvr.exe usage via Domain\nGroup Policy.\nEndpoint solutions capable of, or configurable\nfor, detecting the combined use of msxsl.exe\nand Windows Management Instrumentation\n(WMI).\n\n\n-----\n\nVenomLNK **Execution**\n\n[T1204 User](https://attack.mitre.org/techniques/T1204/)\nExecution\n\n[T1059 Command-](https://attack.mitre.org/techniques/T1059)\nLine Interface\n\n[T1191 CMSTP](https://attack.mitre.org/techniques/T1191/)\n\n**Lateral Movement**\n\n[T1105 Remote File](https://attack.mitre.org/techniques/T1105)\nCopy\n\n**Command and**\n**Control**\n\n[T1043 Commonly](https://attack.mitre.org/techniques/T1043/)\nUsed Port\n\n[T1071 Standard](https://attack.mitre.org/techniques/T1071)\nApplication Layer\nProtocol\n\n\nLog exe and regsvr.exe usage via Domain\nGroup Policy.\n\n\nBlog updated on 21 July to fix error in Sighting 2 and Sighting 3 IOC order.\n\n**Want to learn more?**\nClick here to listen to the Podcast “What came first, the Golden Chickens or more_eggs?”\nmade in collaboration with The CyberWire.\n\n## Join Our Newsletter!\n\nSubscribe to our newsletter to receive Weekly Intelligence Summaries, cyber news, and\nexciting updates!\n\nOnly valid business emails will be approved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-20 - Golden Chickens- Evolution Oof the MaaS.pdf"
    ],
    "report_names": [
        "2020-07-20 - Golden Chickens- Evolution Oof the MaaS.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7a257844-df90-4bd4-b0f1-77d00ff82802",
            "created_at": "2022-10-25T16:07:24.376356Z",
            "updated_at": "2025-03-27T02:02:10.199451Z",
            "deleted_at": null,
            "main_name": "Venom Spider",
            "aliases": [
                "Golden Chickens",
                "Venom Spider"
            ],
            "source_name": "ETDA:Venom Spider",
            "tools": [
                "More_eggs",
                "PureLocker",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Taurus Loader Reconnaissance Module",
                "Taurus Loader Stealer Module",
                "Taurus Loader TeamViewer Module",
                "Terra Loader",
                "TerraCrypt",
                "TerraPreter",
                "TerraRecon",
                "TerraStealer",
                "TerraTV",
                "TerraWiper",
                "ThreatKit",
                "VenomKit",
                "VenomLNK",
                "lite_more_eggs"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88802a4b-5b3d-42ee-99e6-8a4f5fd231f6",
            "created_at": "2023-01-06T13:46:38.851345Z",
            "updated_at": "2025-03-27T02:00:02.935087Z",
            "deleted_at": null,
            "main_name": "GC01",
            "aliases": [
                "Golden Chickens",
                "Golden Chickens01",
                "Golden Chickens 01"
            ],
            "source_name": "MISPGALAXY:GC01",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2dfaa730-7079-494c-b2f0-3ff8f3598a51",
            "created_at": "2022-10-25T16:07:23.474746Z",
            "updated_at": "2025-03-27T02:02:09.822683Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "ATK 67",
                "Cobalt Gang",
                "Cobalt Spider",
                "Gold Kingswood",
                "Mule Libra",
                "TAG-CR3"
            ],
            "source_name": "ETDA:Cobalt Group",
            "tools": [
                "ATMRipper",
                "ATMSpitter",
                "Agentemis",
                "AmmyyRAT",
                "AtNow",
                "COOLPANTS",
                "CobInt",
                "Cobalt Strike",
                "CobaltStrike",
                "Cyst Downloader",
                "Fareit",
                "FlawedAmmyy",
                "Formbook",
                "Little Pig",
                "Metasploit Stager",
                "Mimikatz",
                "More_eggs",
                "NSIS",
                "Nullsoft Scriptable Install System",
                "Pony Loader",
                "Ripper ATM",
                "SDelete",
                "Siplog",
                "SoftPerfect Network Scanner",
                "SpicyOmelette",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Terra Loader",
                "ThreatKit",
                "VenomKit",
                "cobeacon",
                "win.xloader"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f5c90ccc-0f18-4e07-a246-b62101ab2f6f",
            "created_at": "2023-01-06T13:46:38.854407Z",
            "updated_at": "2025-03-27T02:00:02.935908Z",
            "deleted_at": null,
            "main_name": "GC02",
            "aliases": [
                "Golden Chickens",
                "Golden Chickens02",
                "Golden Chickens 02"
            ],
            "source_name": "MISPGALAXY:GC02",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f2fa9952-301f-4376-ac69-743d6f2bec1e",
            "created_at": "2023-01-06T13:46:39.122721Z",
            "updated_at": "2025-03-27T02:00:03.001801Z",
            "deleted_at": null,
            "main_name": "VENOM SPIDER",
            "aliases": [
                "badbullzvenom",
                "badbullz"
            ],
            "source_name": "MISPGALAXY:VENOM SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c11abba0-f5e8-4017-a4ee-acb1a7c8c242",
            "created_at": "2022-10-25T15:50:23.744036Z",
            "updated_at": "2025-03-27T02:00:55.537114Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "Cobalt Group",
                "GOLD KINGSWOOD",
                "Cobalt Gang",
                "Cobalt Spider"
            ],
            "source_name": "MITRE:Cobalt Group",
            "tools": [
                "Mimikatz",
                "More_eggs",
                "SpicyOmelette",
                "SDelete",
                "Cobalt Strike",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536247,
    "ts_updated_at": 1743041768,
    "ts_creation_date": 1653760146,
    "ts_modification_date": 1653760146,
    "files": {
        "pdf": "https://archive.orkl.eu/d759c2b6af0f454f006a01e9566c0ab59db1ec46.pdf",
        "text": "https://archive.orkl.eu/d759c2b6af0f454f006a01e9566c0ab59db1ec46.txt",
        "img": "https://archive.orkl.eu/d759c2b6af0f454f006a01e9566c0ab59db1ec46.jpg"
    }
}