{
    "id": "fefecab5-0379-40f0-8b46-509232b885d5",
    "created_at": "2022-10-25T16:48:13.395052Z",
    "updated_at": "2025-03-27T02:14:34.103605Z",
    "deleted_at": null,
    "sha1_hash": "36fdb5f263a2abc93ab50d345d3626aded73050e",
    "title": "Hacker Group Creates Network of Fake LinkedIn Profiles",
    "authors": "Secureworks",
    "file_creation_date": "2017-02-23T05:05:53Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 467816,
    "plain_text": "**secureworks.com/research/suspected-iran-based-hacker-group-creates-network-of-fake-linkedin-profiles**\n\n**Author: Dell SecureWorks Counter Threat Unit™ Threat Intelligence**\n\n**Date: 07 October 2015**\n\n## Summary\n\nWhile tracking a suspected Iran-based threat group known as Threat Group-2889 [1] (TG-2889), Dell SecureWorks Counter\nThreat Unit™ (CTU) researchers uncovered a network of fake LinkedIn profiles. These convincing profiles form a selfreferenced network of seemingly established LinkedIn users. CTU researchers assess with high confidence the purpose of\nthis network is to target potential victims through social engineering. Most of the legitimate LinkedIn accounts associated with\nthe fake accounts belong to individuals in the Middle East, and CTU researchers assess with medium confidence that these\nindividuals are likely targets of TG-2889.\n\n## Fake LinkedIn accounts\n\nThe 25 fake LinkedIn accounts identified by CTU researchers fall into two categories: fully developed personas (Leader) and\nsupporting personas (Supporter). The table in the Appendix lists details associated with the accounts. The level of detail in the\nprofiles suggests that the threat actors invested substantial time and effort into creating and maintaining these personas. The\nphotos used in the fake accounts are likely of innocent individuals who have no connection to TG-2889 activity.\n\n#### Leader personas\n\nProfiles for Leader personas include full educational history, current and previous job descriptions, and, sometimes, vocational\nqualifications and LinkedIn group memberships. Of the eight Leader personas identified by CTU researchers, six have more\nthan 500 connections (see Figure 1).\n\n\n-----\n\n_Figure 1. Example Leader LinkedIn profile created by TG-2889. (Source: Dell SecureWorks)_\n\nThe results of open-source research conducted by CTU researchers provided compelling evidence that the Leader profiles\nwere fraudulent:\n\nOne of the profile photographs is linked to multiple identities across numerous websites, including adult sites.\n\nThe summary section in one profile is identical to the summary in a legitimate LinkedIn profile, and the employment\nhistory matches a sample résumé downloaded from a recruitment website.\n\nIn another profile, a job description was copied from genuine Teledyne and ExxonMobil job advertisements.\n\nThe job description in yet another profile (see Figure 2) was copied from a legitimate job posting from a Malaysian\nbank (see Figure 3).\n\n\n-----\n\n_Figure 2. Job description from Leader persona profile. (Source: Dell SecureWorks)_\n\n_Figure 3. Malaysian bank job posting matching a job description associated with a fake Leader LinkedIn profile. (Source: Dell_\n_SecureWorks)_\n\nFive of the Leader personas purport to work for Teledyne, an American industrial conglomerate. In addition, one claims to work\nfor Doosan (an industrial conglomerate based in South Korea), one for Northrop Grumman (a U.S. aerospace and defense\ncompany), and one for Petrochemical Industries Co., (a Kuwaiti petrochemical manufacturing company).\n\n#### Supporter personas\n\nProfiles for Supporter personas are far less developed than for Leader personas. They all use the same basic template with\none simple job description, and they all have five connections (see Figure 4). Profile photographs for three of the Supporter\npersonas appear elsewhere on the Internet, where they are associated with different, seemingly legitimate, identities. As with\nthe Leader profiles, open-source research indicates that the Supporter profiles are also fake.\n\n\n-----\n\n_Figure 4. Example Supporter LinkedIn profile created by TG-2889. (Source: Dell SecureWorks)_\n\n#### Building credibility via endorsements\n\nThe purpose of the Supporter personas appears to be to provide LinkedIn skills endorsements for Leader personas, likely to\nadd legitimacy to the Leader personas. As shown in Figure 5, most of the Supporter accounts identified by CTU researchers\nhave endorsed skills listed on the profiles of the Leader personas. Although unable to view Leader personas' LinkedIn\nconnections, CTU researchers suspect the threat actors use the Supporter accounts to provide the Leader profiles with an\nestablished network, which also enhances credibility.\n\n\n-----\n\n_Figure 5. TG-2889 uses Supporter accounts (gray) to endorse the skills of Leader personas (green). (Source: Dell_\n_SecureWorks)_\n\n#### Novel technique\n\nAlthough CTU researchers identified eight Leader profiles, two appear to be duplicates that have different identities\nassociated with the same account. While CTU researchers were analyzing the profiles, the threat actors altered two of the\nLeader LinkedIn accounts. The original profile name and photograph were replaced with a new identity, and the current job\nwas updated: in one case replacing Teledyne with Northrup Grumman (see Figure 6) and in the second replacing Teledyne\nwith Airbus Group.\n\n_Figure 6. LinkedIn screenshots showing replacement of original Pamela McCoy persona with Christine Russell. The_\n_alphanumerical LinkedIn ID, a1/7b/955, remains the same. (Source: Dell SecureWorks)_\n\nChanging personas associated with existing profiles was a clever exploitation of LinkedIn functionality because the new\nidentities inherit the network and endorsements from the previous identity. These attributes immediately make the new\npersonas appear established and credible, and the transition may prevent the original personas from being overexposed.\n\n## Targeting LinkedIn users\n\nCreating a network of seemingly genuine and established LinkedIn personas helps TG-2889 identify and research potential\nvictims. The threat actors can establish a relationship with targets by contacting them directly, or by contacting one of the\ntarget's connections. It may be easier to establish a direct relationship if one of the fake personas is already in the target's\n\n\n-----\n\n2889 likely uses spearphishing or malicious websites to compromise victims, and established trust relationships significantly\nincrease the likelihood of these tactics being successful.\n\n#### Targets\n\nSeemingly legitimate LinkedIn users have also endorsed Leader personas. Endorsements are granted by connections,\nindicating that these legitimate users are part of the Leader personas' networks. Therefore, they are likely TG-2889 targets.\nExamination of the profiles associated with the endorsements revealed 204 potential TG-2889 targets. As shown in Figure 7,\nmost are based in the Middle East.\n\n_Figure 7. Legitimate endorsers of fake TG-2889 LinkedIn accounts by country. (Source: Dell SecureWorks)_\n\nA quarter of the targets work in the telecommunications vertical; Middle Eastern and North African mobile telephony suppliers\nfeature heavily. A focus on these types of targets may indicate that TG-2889 is interested in acquiring data held by these\norganizations or gaining access to the services they operate. A significant minority of identified targets work for Middle Eastern\ngovernments and for defense organizations based in the Middle East and South Asia.\n\n## Attribution\n\nBased on strong circumstantial evidence, CTU researchers assess that TG-2889 is linked to the activity that Cylance\n[described in its December 2014 Operation CLEAVER report. The report documented threat actors using malware disguised](http://www.cylance.com/assets/Cleaver/Cylance_Operation_Cleaver_Report.pdf)\nas a résumé application that appeared to allow résumés to be submitted to the industrial conglomerate Teledyne. Cylance\nreported the use of the following domains, which reference companies associated with many of the fake LinkedIn profiles\nidentified by CTU researchers:\n\nTeledyne-Jobs.com\n\nDoosan-Job.com\n\nNorthropGrumman.net\n\nCylance attributed the Operation CLEAVER activity to a threat group operating at least in part out of Iran. CTU researchers\nhave not uncovered any intelligence that contradicts this assessment. Furthermore, the strong focus suggested by the\nendorsement analysis on targets from Arab states in the Middle East and North Africa (MENA) region is in line with the\nexpected targeting behavior of a threat group operating out of Iran.\n\n\n-----\n\nUpdates to profile content such as employment history suggest that TG-2889 regularly maintains these fake profiles. The\npersona changes and job alterations could suggest preparations for a new campaign, and the decision to reference Northrup\nGrumman and Airbus Group may indicate that the threat actors plan to target the aerospace vertical.\n\nIt is likely that TG-2889 maintains personas that have not yet been identified, and that other threat groups also use this tactic.\nCTU researchers advise organizations to educate their users of the specific and general risks:\n\nAvoid contact with known fake personas.\n\nOnly connect to personas belonging to individuals they know and trust.\n\nAdopt a position of sensible caution when engaging with members of colleagues' or friends' networks that they have not\nverified outside of LinkedIn.\n\nWhen evaluating employment offers originating from LinkedIn, seek confirmation that the individual is legitimate by\ndirectly contacting the individual's purported employer.\n\nOrganizations may want to consider policing abuse of their brand on LinkedIn and other social media sites. If an organization\ndiscovers that a LinkedIn persona is fraudulently claiming an association with the company, it should contact LinkedIn.\nCreating false identities and misrepresenting an association with an organization is a breach of LinkedIn's terms and\nconditions.\n\n## Appendix — Fake LinkedIn personas created by TG-2889\n\nTable 1 lists details associated with Leader and Supporter personas created by TG-2889. The pairs shaded in dark gray are\ndifferent identities associated with the same LinkedIn account. The only difference in the profile links of the shared accounts\nis the persona name.\n\nType Name and profile link Role Country Connections Company\n\n\nLeader Jon Sam Park\nhttps://www.linkedin.com/pub/jong-sampark/a0/a46/3\n\nLeader Pamela McCoy\nhttps://www.linkedin.com/pub/pamelamccoy/a1/7b/955\n\nLeader Christine Russell\nhttps://www.linkedin.com/pub/christinerussell/a1/7b/955\n\nLeader Timothy Stokes\nhttps://www.linkedin.com/pub/timothystokes/a0/a75/b46\n\nLeader Matilda Aronson\nhttps://kr.linkedin.com/pub/matildaaronson/a1/4a5/227\n\nLeader Petra Hedegaard\nhttps://kr.linkedin.com/pub/petrahedegaard/a1/4a5/227\n\n\nNetwork\nAdministrator\n\nRecruitment\nConsultant\n\nInternational\nRecruitment\nConsultant\n\nRecruitment\nConsultant\n\nRecruitment\nConsultant\n\nRecruitment\nConsultant\n\n\nKorea 500 Doosan\n\n\nUnited\nStates\n\nUnited\nStates\n\nUnited\nStates\n\n\n500 Teledyne\nTechnologies\nIncorporated\n\n500 Northrop\nGrumman\n\n500 Teledyne\nTechnologies\nIncorporated\n\n\nKorea 500 Teledyne\nTechnologies\nIncorporated\n\nKorea 500 Airbus Group\n\n\n-----\n\nhttps://www.linkedin.com/in/hbaqeri and\nDevelopment\nManager\n\n\nLeader Raheleh Keramat\nhttps://www.linkedin.com/pub/rahelehkeramat/99/751/4b\n\nSupporter Ben Blamey\nhttps://uk.linkedin.com/pub/benblamey/a2/503/a79\n\nSupporter Brandon Mobley\nhttps://uk.linkedin.com/pub/brandonmobley/a2/45b/4b\n\nSupporter Broderick Huff\nhttps://www.linkedin.com/pub/broderickhuff/a1/a50/84\n\nSupporter Carolyne Mejia\nhttps://uk.linkedin.com/pub/carolynemejia/a1/443/17\n\nSupporter Edwin Grubbs\nhttps://www.linkedin.com/pub/pamelamccoy/a1/7b/955\n\nSupporter Eric Harvill\nhttps://uk.linkedin.com/pub/ericharvill/a2/5a5/77b\n\nSupporter Helen Albers\nhttps://uk.linkedin.com/pub/helenalbers/a2/73b/6b7\n\nSupporter Kristen Allen\nhttps://www.linkedin.com/pub/kristenallen/a1/a55/8b4\n\nSupporter Lee Chia\nhttps://www.linkedin.com/pub/leechia/a2/506/485\n\nSupporter *******\nhttps://www.linkedin.com/pub/*******/a2/600/940\n\nSupporter Merle Rogers\nhttps://uk.linkedin.com/pub/merlerogers/a2/378/30b\n\n\nIT\nInfrastructure\nManager\n\nSenior\nElectronics\nProject\nManager\n\nSenior\nElectronics\nDesign\nEngineer\n\nIT Technical\nand Security\nManager\n\nIT Support\nAnalyst\n\nIT\nRecruitment\nConsultant\n\nElectronics\nDevelopment\nEngineer\n\nElectronics\nHardware\nEngineer\n\nIT Solutions\nManager\n\nHardware\nDesign\nEngineer /\nElectronics\nDesign\n\nQuality\nManager\n\nIT Service\nDesk\nEngineer /\nSupport /\nWindows /\nMac OS /\nLi\n\n\nStates Technologies\nIncorporated\n\nKuwait 46 Petrochemical\nIndustries Co.\n\n\nUnited\nKingdom\n\nUnited\nKingdom\n\nUnited\nStates\n\nUnited\nKingdom\n\nUnited\nKingdom\n\nUnited\nKingdom\n\nUnited\nKingdom\n\nUnited\nStates\n\n\n5 General\nMotors\n\n5 General\nMotors\n\n5 Teledyne\nTechnologies\nIncorporated\n\n5 Teledyne\nTechnologies\nIncorporated\n\n5 Teledyne\nTechnologies\nIncorporated\n\n5 General\nMotors\n\n5 Teledyne\nTechnologies\nIncorporated\n\n5 Teledyne\nTechnologies\nIncorporated\n\n\nKorea 5 Doosan\n\n\nUnited\nKingdom\n\nUnited\nKingdom\n\n\n5 *******\n\n5 Doosan\n\n\n-----\n\nhttps://www.linkedin.com/pub/naomibrinson/a2/5b9/23a\n\nSupporter Peggy Gore\nhttps://uk.linkedin.com/pub/peggy-egore/a1/b60/a8b\n\nSupporter Raymond Reale\nhttps://uk.linkedin.com/pub/raymondreale/a1/497/689\n\nSupporter Ricky Furst\nhttps://www.linkedin.com/pub/rickyfurst/a1/967/84a\n\nSupporter *******\nhttps://www.linkedin.com/pub*******a67\n\nSupporter Steve Highsmith\nhttps://uk.linkedin.com/pub/stevehighsmith/a1/b57/4ab\n\n\nElectronics\nSystems\nEngineer DFM, NPI\n\nHead of IT\nServices and\nOperations\n\nProject and\nProgram\nManager\nAssistant at\nTeledyne\nTechnologies\nIncorporated\n\nIT Manager\nat Teledyne\nTechnologies\nIncorporated\n\nIT Support\nAnalyst at\nTeledyne\nTechnologies\nIncorporated\n\nIT\nOperations\nManager at\nDoosan\n\n\nKingdom\n\nUnited\nKingdom\n\nUnited\nKingdom\n\nUnited\nStates\n\nUnited\nStates\n\nUnited\nKingdom\n\n\n5 Doosan\n\n5 Teledyne\nTechnologies\nIncorporated\n\n5 Teledyne\nTechnologies\nIncorporated\n\n5 Teledyne\nTechnologies\nIncorporated\n\n5 Doosan\n\n\n_Table 1. Fake LinkedIn personas. Some potentially sensitive information has been redacted._\n\n## Endnote\n\n[1] The Dell SecureWorks Counter Threat Unit(TM) (CTU) research team tracks threat groups by assigning them four-digit\nrandomized numbers (2889 in this case), and compiles information from external sources and from first-hand incident\nresponse observations.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/w32vcrjpq3fj0fg0t8c5gwmy0olwnmnd"
    ],
    "report_names": [
        "Secureworks_HackerGroup-Creates-Network-Fake-LinkedIn-Profiles(10-07-2015)"
    ],
    "threat_actors": [
        {
            "id": "49f1ada0-181f-4e89-a449-e6bc13c8c6b1",
            "created_at": "2022-10-25T15:50:23.561511Z",
            "updated_at": "2025-03-27T02:00:55.499988Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Threat Group 2889",
                "TG-2889"
            ],
            "source_name": "MITRE:Cleaver",
            "tools": [
                "Net Crawler",
                "PsExec",
                "TinyZBot",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "217c588a-5896-4335-b9ec-a516ae2f9a7e",
            "created_at": "2022-10-25T16:07:23.513775Z",
            "updated_at": "2025-03-27T02:02:09.838687Z",
            "deleted_at": null,
            "main_name": "Cutting Kitten",
            "aliases": [
                "Cutting Kitten",
                "Operation Cleaver",
                "TG-2889"
            ],
            "source_name": "ETDA:Cutting Kitten",
            "tools": [
                "CsExt",
                "DistTrack",
                "IvizTech",
                "Jasus",
                "KAgent",
                "Logger Module",
                "MANGOPUNCH",
                "MPK",
                "MPKBot",
                "Net Crawler",
                "NetC",
                "PVZ-In",
                "PVZ-Out",
                "Pupy",
                "PupyRAT",
                "PvzOut",
                "Shamoon",
                "SynFlooder",
                "SysKit",
                "TinyZBot",
                "WndTest",
                "pupy",
                "zhCat",
                "zhMimikatz"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041674,
    "ts_creation_date": 1487826353,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/36fdb5f263a2abc93ab50d345d3626aded73050e.pdf",
        "text": "https://archive.orkl.eu/36fdb5f263a2abc93ab50d345d3626aded73050e.txt",
        "img": "https://archive.orkl.eu/36fdb5f263a2abc93ab50d345d3626aded73050e.jpg"
    }
}