{
    "id": "ff47095b-e1e3-440b-969c-dd4d90aa29e3",
    "created_at": "2023-01-12T15:06:39.216836Z",
    "updated_at": "2025-03-27T02:16:44.321867Z",
    "deleted_at": null,
    "sha1_hash": "a67557d53872beebc42cbe931d35907f60f15454",
    "title": "2018-01-23 - Uncovering 2017’s Largest Malvertising Operation",
    "authors": "",
    "file_creation_date": "2022-05-27T23:11:57Z",
    "file_modification_date": "2022-05-27T23:11:57Z",
    "file_size": 113008,
    "plain_text": "# Uncovering 2017’s Largest Malvertising Operation\n\n**[blog.confiant.com/uncovering-2017s-largest-malvertising-operation-b84cd38d6b85](https://blog.confiant.com/uncovering-2017s-largest-malvertising-operation-b84cd38d6b85)**\n\nJerome Dangu January 25, 2018\n\nJer\nome\n[Jerome Dangu](https://medium.com/@synku?source=post_page-----b84cd38d6b85--------------------------------)\n[Follow](https://medium.com/m/signin?actionUrl=https%3A%2F%2Fmedium.com%2F_%2Fsubscribe%2Fuser%2Fb695b22b2d84&operation=register&redirect=https%3A%2F%2Fblog.confiant.com%2Funcovering-2017s-largest-malvertising-operation-b84cd38d6b85&user=Jerome+Dangu&userId=b695b22b2d84&source=post_page-b695b22b2d84----b84cd38d6b85---------------------follow_byline-----------)\nJan 23, 2018\n\n\n10 min read\n\n## The Zirconium group successfully created and operated 28 fake ad agencies to distribute malvertising campaigns through 2017, buying an estimate of 1 billion ad views throughout the year, and reaching 62% of ad-monetized websites on a weekly basis.\n\n Forced redirects\n\nThrough 2016 and 2017, the prevalence of exploit kits in online advertising has decreased, as browsers became more secure. A\nfew drivers explain this evolution:\n\nThe standardization of browser sandboxes (not only Chrome/Safari but now Firefox and Edge)\n\n\n-----\n\nThe decline of Adobe Flash as a vector for exploit kits, accelerated by the ban of Flash ads in Google Chrome from\nSeptember 2015\nThe high profile demise of Angler Exploit Kit in June 2016\nThe rise of exploit detection and sophisticated telemetry that uncovers attacks in spite of evasion\n\nAs a consequence, many malvertising campaigns moved to “forced redirects” as the second best attack vector. A forced redirect\nis when a person is surfing the web on a computer or mobile device and through no action of their own gets redirected to a\ndifferent website. Usually the website they are redirected to is a vehicle for some form of affiliate fraud or malware.\n\nAlthough forced redirects require social engineering (tricking users into falling for a scam or infecting their computer), they can\ndurably stay under the radar by avoiding to trigger in situations that may correspond to security investigations.\n\n## Execution and chain of redirection\n\n_Fig. 1: Redirection flow_\n\nBeginads was only briefly used to establish relationships with ad platforms as a fake ad agency. Confiant observed it as a standalone ad server in March 2017, but it later became the domain that acts as the TDS (Traffic Direction System) on behalf of all the\ncampaigns running on all the fake agencies’ ad servers.\n\nZirconium established a well thought-out organization to maximize both Supply (user traffic) and Demand (landing pages).\n\nSupply is brought in by the fake agencies, establishing relationships with legitimate ad platforms, and buying traffic. Having\nmultiple relationships makes the operation more robust (in case an agency gets caught) and stealthier — as each agency poses\nas a long-tail small business agency and buys small amounts at a time.\n\nAggregating Demand is the other key component to Zirconium’s business model. Confiant established that Zirconium does not\noperate these landing pages on their own. Instead, they resell the traffic to affiliate marketing platforms.\n\n\n-----\n\nMaintaining those relationships at the agency level would have been cumbersome and inefficient. Beginads.com became the\ncentral gateway to manage the demand. Just like a legitimate advertising operation, this requires constant optimization and\ntesting to yield the most revenue. Beginads.com became the centralized place were Zirconium could rationalize its revenue.\n\n## MyAdsBro, the not-fake ad network by Zirconium\n\nConfiant found yet another level of redirection between Beginads / Horizon-media and the affiliate networks, going by the name\n“MyAdsBro” and operated by Zirconium.\n\nEssentially, Zirconium’s own campaigns run via MyAdsBro but anyone can also push traffic to it and leave a revenue commission\nto them. MyAdsBro claims to pay out in crypto-currencies.\n\nGoing as far as to build a black-hat affiliate network shows the level of sophistication that they reached in their operations.\n\n\n-----\n\n_Fig. 1: MyAdsBro home page (left) and customer web panel (right)_\n\n## Payloads\n\n\n-----\n\n-----\n\n_Fig. 2: Typical Fake flash update, as pushed by Zirconium on Mac (left) and Windows (right)._\n\n\n-----\n\n-----\n\n_Fig. 3: Fake Antivirus on Mac_\n\n\n-----\n\n_Fig.4: Tech support scam, as pushed by Zirconium. Note the now-classic ._\n\n\n-----\n\n_Fig. 5: Another scareware tech support scam via Zirconium’s “beginads” TDS_\n\nPrevious [research by](https://executemalware.com/?p=432) [@ExecuteMalware identified Zirconium’s PlaiMedia serving landing pages operated by the Kovter Group.](https://twitter.com/ExecuteMalware)\nAnother large malvertising operation, Kovter has embraced social engineering schemes in recent years. [Edit Jan 24] After\nreview and feedback from Kaffeine at ProofPoint, there is no evidence that ties Zirconium to Kovter.\n\n## ROI and Evasion\n\nJust like any other business, malvertising is driven by return on investment. But crucially, it needs to operate behind sophisticated\nevasion techniques. This means that only a small portion of the acquired traffic actually delivers a payload. Using Confiant’s\ntelemetry, we estimate the group served in the order of 1 billion ad impressions through 2017.\n\nStarting in October, the group became more aggressive at optimizing for ROI, at the risk of more overtly showing suspicious\nactivity, by using “fingerprinting”. Fingerprinting is the process of gathering data on the browser/device to target a subset of the\naudience. The goal is to evade detection, and this is typically done from within the browser in JavaScript. Attackers decrease\ntheir chances of delivering their payload to security scanners, which means they can trigger their payload more often and\nincrease their ROI. This is a risky endeavor because this javascript is visible to anyone paying attention.\n\n## Fingerprinting\n\nFingerprinting is a client-side mechanism (javascript) used by attackers to forge a signature of the browser / device, focusing on\nminute differences between a realistic user environment and a researcher / scanner / bot environment.\n\nAlternatively, server-side mechanisms are more evasive because they cannot be inspected by a security researcher, unless they\nactually trigger. Such mechanisms include detecting the type of connectivity used by the user, by looking up the “ASN” from the\nbrowser client’s IP. Datacenter IPs are commonly used in ad scanners and attackers will ensure that absolutely no payload\ntriggers under a datacenter IP.\n\n\n-----\n\nServer side is more wasteful than client side, it involves serving large volumes of ads that do not trigger their payload.\n\nClient-side brings more data to assess the user so allows for more aggressive payload triggers, but the mere fact of collecting\nthis data exposes the attacker and so is more risky.\n\nConfiant observed Zirconium switching to more javascript fingerprinting roughly from October. We believe this trend was\naccompanied by an increase in traffic.\n\n_Fig. 6: Javascript fingerprinting used in Zirconium’s AdTekMedia malvertising campaign_\n\nThis code snippet was found in one of the ads served by the “adtekmedia” agency. Note the odd “RegExp” override for matching\nthe user agent to expected browsers. Zirconium campaigns have been observed to exclusively target desktop browsers,\nexcluding mobile — not only targeting Windows, but also Mac, ChromeOS and even Linux.\n\nAside from very basic data points like the user agent, they also check:\n\nHardware concurrency: How many cores in the CPU?\nAvailability of webGL APIs\nAvailability of Chrome-specific objects in JavaScript\n\nVirtual machines typically don’t expose the full set of CPU cores available at the hardware level. This is true both in cloud\ncomputing (where scanners run) and on researchers virtual environments.\n\nWebGL is only available in “real” full-featured modern browser. Most importantly, WebGL leaks the GPU chipset powering the\ndevice’s graphics rendering. Cloud machines typically lack a GPU.\n\nIdentifying Chrome-specific javascript objects allows the attacker to identify potential user agent spoofing. When a Chrome\nbrowser declares itself as an IE browser for example, the attacker can pick up that inconsistency.\n\n\n-----\n\nBy checking these elements, the attackers can weed out the traffic that corresponds more to patterns found in researchers rather\nthan victims.\n\nBeyond evasion, malvertising actors want to keep fake traffic away from their campaigns, to maximize conversion rates. Similar\n[fingerprinting / anti-bot technique was very recently documented in the RIG Exploit Kit.](http://www.vkremez.com/2018/01/lets-learn-dissect-rig-exploit-kit-anti.html)\n\n## Clumsy beginnings\n\nOn March 15, 2017 IndiaOnClick made its entrance in online advertising exchanges.\n\nThe website was a poorly executed copy-cat of a large ad exchange.\n\n\n-----\n\n_Fig. 7: On the left, IndiaOnClick fake ad agency; on the right, legitimate ad exchange_\n\nIndiaOnClick was later revamped, with an original design and original content — just like the other 27 ad agencies that Zirconium\noperated.\n\n## Reaching a massive scale\n\nEverything is the same but everything is different: Each of the companies has been staged with a deliberate effort to\n\nFake CEO personas with LinkedIn presence like Ferdinand Konrad (98 connections), and countless others.\n\n\n-----\n\n_Fig. 8: Ferdinand Konrad’s LinkedIn profile, the founder and CEO at Grandonmedia, based in Stuttgart, Germany_\n\nStock business photos (laptop and a coffee, suits in a meeting room, …)\nRegular social media posts with seemingly machine-generated content.\nEfforts to generate unique content, especially branded photos with marketing messages.\n\nFrom a technical perspective, each fake company is operated by a completely independent infrastructure, from hosting to SSL\nservers to domain registration. Ad serving code is unique to each fake company.\n\n## Social Media content generation\n\nZirconium leverages a mysterious “marketing-o-tron” to generate automated content on social media via bots.\n\nAs of this writing, the bots are still active. Here’s a sample of deep marketing mantras for January 10, 2018, as found on Twitter:\n\n\n-----\n\n_There can t be any peak prices for your online campaigns_\n\n   - ElixMedia\n\n_“You must choose a valuable approach to all online campaigns”_\n\n  - DeshMedia\n\n_“The best way to solve online ad problems is to use quality packs from k5market“- K5Market_\n\n_“There must be an array of options to provide quality online services”_\n\n  - HoffmanBroker\n\n_“Without a doubt, it is very important to have a chance to take a credit at the beginning of the advertising”- Face2Trade_\n\n_“This company doesn’t make naked promises about the quality of provided services”- MediaParade_\n\n_“We always allow our clients to use our online services for free”_\n\n  - GrandonMedia\n\nZirconium’s concept is to build independant marketing brands from scratch, en-masse. The vast majority went live in March/April\n2017 according to Twitter account creation dates. At the date of this writing, 8 remain unused, ready to be leveraged when the\nones currently exploited dry out.\n\nIn each case, Confiant found that the attacker was acquiring/building a large amount of media at once to support their\nmalvertising campaigns, which then trickled down over months.\n\nLong tail ad agencies are numerous and widely embraced by the ad industry. Zirconium was extremely successful at replicating\nthe “small business” ad agency style. The attackers successfully built direct business relationships with as many as 16 ad\nplatforms.\n\nLeveraging a swarm of fake ad agencies gives a strong justification for running custom ad servers, a critical part of the scheme\nbecause it allows for javascript execution on websites running ads.\n\n## Dormant ad agencies\n\nOut of the 28 fake ad agencies, only 20 ever had any activity in advertising markets. We believe Zirconium was progressively\nrolling out their agencies to overcome occasional bans, as they progressively got caught. We observed a pace of 1 to 3 releases\nper month. Since the majority of agencies were created around February 2017, the dormant ones progressively built precious\nreputation (mostly history, and social media following) to pose as established companies and maximize their potential of striking\ndeals with more ad platforms.\n\nThe group had also recently started to come up with new agencies, like Big Shark Media (November 2017).\n\n\n-----\n\n_Fig. 9, Twitter, @BigsharkMedia, a dormant fake ad agency: “We’ll give you full advertising support in all your campaigns”_\n\n## A classic business model\n\n\n-----\n\n_Fig. 10: Zirconium business model_\n\n## A sophisticated legal structure\n\nThanks to cooperation with partners in the ad industry, Confiant identified the legal entity fronting the Zirconium activity as Cape\nDiamond LP, a shell company incorporated in Scotland with partners in the Seychelles — Damitra Group LTD and Lamen\nBusiness LTD.\n\nThe Zirconium business model is capital intensive and it makes sense that they would need to shield themselves behind an\nopaque offshore corporate structure.\n\nThrough 2017, both offshore companies have been extensively involved in online fraud activities, some of which crypto-currency\n[related, most notably btc-e.com — a crypto exchange shut down by the US authorities in June 2017.](https://www.theverge.com/2017/7/29/16060344/btce-bitcoin-exchange-takedown-mt-gox-theft-law-enforcement)\n\n\n-----\n\n_Fig. 11: Legal entities directed by Cape Diamond’s offshore partners. source:_\n\n## Conclusion\n\nThe Chrome team announced that forced redirects will be blocked in Chrome 64 scheduled for release on January 23. Google is\nfixing the hole that largely allows for this illegal business to thrive. They’ve already proven their adaptability and this will shift their\nefforts to some new threat vectors. Confiant will be here to greet them!\n\n## Appendix\n\n**Zirconium by the numbers**\n\n\n-----\n\n**List of fake ad agencies**\n\n\n-----\n\n_Dates and lifespans are based on actual activity in online advertising exchanges, last seen date populated as of Dec 21_\n\n## About Confiant\n\nConfiant is a cyber security company that came out of a recognition that the world’s most sophisticated advertisers aren’t Verizon\nor P&G, but criminals using the industry for their own, selfish ends. These criminals are hijacking programmatic advertising and\ngiving publishers a bad name.\n\nConfiant protects publishers’ and platforms’ reputations, revenue, and resources with always-on anti-malware software that\nprovides protection for desktop, mobile, and video ads. Our sole focus is on helping advertising platforms and publishers rid the\nworld of malware. This focus enables us to evolve quickly and meet our clients’ needs for defeating the bad actors trying to\nundermine the industry.\n\nWe are the first to come to market with a technology that does not just detect the malicious activity, but actively blocks it. We\nbelieve in the intelligent application of this new technology to fight back and make media safe for everyone.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-01-23 - Uncovering 2017’s Largest Malvertising Operation.pdf"
    ],
    "report_names": [
        "2018-01-23 - Uncovering 2017’s Largest Malvertising Operation.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "dc7ee503-9494-4fb6-a678-440c68fd31d8",
            "created_at": "2022-10-25T16:07:23.349177Z",
            "updated_at": "2025-03-27T02:02:09.748159Z",
            "deleted_at": null,
            "main_name": "APT 31",
            "aliases": [
                "APT 31",
                "Bronze Vinewood",
                "Judgment Panda",
                "Red Keres",
                "RedBravo",
                "TA412",
                "Violet Typhoon",
                "Zirconium"
            ],
            "source_name": "ETDA:APT 31",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "GrewApacha",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Roarur",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535999,
    "ts_updated_at": 1743041804,
    "ts_creation_date": 1653693117,
    "ts_modification_date": 1653693117,
    "files": {
        "pdf": "https://archive.orkl.eu/a67557d53872beebc42cbe931d35907f60f15454.pdf",
        "text": "https://archive.orkl.eu/a67557d53872beebc42cbe931d35907f60f15454.txt",
        "img": "https://archive.orkl.eu/a67557d53872beebc42cbe931d35907f60f15454.jpg"
    }
}