{
    "id": "ff594bd4-92ef-4dfa-a0f4-6e0e46538e57",
    "created_at": "2023-01-12T15:02:07.240732Z",
    "updated_at": "2025-03-27T02:08:36.173583Z",
    "deleted_at": null,
    "sha1_hash": "5a17db9a40da0d69372e33db2624580edec187d1",
    "title": "2021-09-14 - Flubot’s Smishing Campaigns under the Microscope",
    "authors": "",
    "file_creation_date": "2022-05-27T21:13:39Z",
    "file_modification_date": "2022-05-27T21:13:39Z",
    "file_size": 257105,
    "plain_text": "# Flubot’s Smishing Campaigns under the Microscope\n\n**[telekom.com/en/blog/group/article/flubot-under-the-microscope-636368](https://www.telekom.com/en/blog/group/article/flubot-under-the-microscope-636368)**\n\nBlog.Telekom\n\n09‑14‑2021\n[Thomas Barabosch](https://www.telekom.com/en/blog/592636-592636)\n\n3 Comments\n\nShare Share\nTwo clicks for more data privacy: click here to activate the button and send your\nrecommendation. Data will be transfered as soon as the activation occurs.\n\nPrint\n[Read out](https://app-eu.readspeaker.com/cgi-bin/rsent?customerid=4779&lang=en&readid=readspeakercontent&url=https://www.telekom.com/en/blog/group/article/flubot-under-the-microscope-636368)\n\nOur lives cannot be imagined without mobile phones. They know all our secrets and we use\nthem to accomplish tasks like online banking or cryptocurrency trading. Most of them run the\n[Android operating system resulting in billions of Android installations worldwide. Given](https://www.telekom.com/en/glossary#glossar381474)\nAndroid’s ubiquity and the kind of sensitive data Android devices handle, cybercriminals\nroutinely target them for financial gain.\n\nFlubot is so successful for a reason - unfortunately.\n\n\n-----\n\n[One of the tools such attackers utilize is Flubot, which is a botnet primarily targeting Android](https://malpedia.caad.fkie.fraunhofer.de/details/apk.flubot)\nmobile phones. Its first appearance was in late 2020. Flubot comprises information stealing\ncapabilities (exfiltrate contact list, SMS exfiltration), spamming capabilities (sending of\nsmishing SMS), and application manipulation capabilities (injecting HTML code in banking\nand cryptocurrency apps).\n\nThis botnet spreads by sending SMS like “Notification: (1) new voice message: LINK”, where\nLINK redirects the target to a lure server serving a website that convinces the target to install\na third-party APK. This behavior is known as smishing, an artificial word derived from “SMS”\nand “Phishing”. An infected device exfiltrates its contact list to the command and control\nserver, which commands it to try to infect hundreds or even thousands of other devices each\nday. Hence, the name “Flubot” as this botnet spreads like the flu. Since its inception in late\n2020, this botnet has become a serious threat to end users and an annoying problem for\ncarriers around the world.\n\nTelekom Security has detected thousands of Flubot infections of Deutsche Telekom’s clients\nthroughout 2021. Each infected client is notified and offered assistance during the cleaning\nprocess. The following figure shows the amount of unique infections per day from May 2021\nuntil September 2021. Note that the population of infections heavily fluctuates due to\ncontinued effort to notify our clients and consequently by them removing the malware from\ntheir devices. The plot shows a period during June and July where less infections were\ndetected. This is a typical seasonal fluctuation also known as “the threat actor’s summer\nbreak”. As of September 2021, we are noticing how the botnet activity is increasing and the\ncurrent infection level is converging against a level we noticed in May 2021.\n\nFigure 1 Unique Flubot infections per day of Deutsche Telekom customers\n\nFurthermore, the Flubot operators keep on working to maintain this status quo. They keep\nchanging their smishing SMS templates every couple of hours and change the links in these\nSMS every couple of minutes. In addition, they use mechanisms to circumvent simple SMS\ncontent filter engines. After several weeks, they usually switch the theme of their campaigns,\ne.g. from voicemail to parcel services as observed in the last week of August 2021. And\nnotably they implement a mechanism to shut out security researchers who are running bot\nemulations from their botnet: they verify if new bots can send out SMS!\n\nIn this blog post, we’ll see how the smishing SMS work, how Flubot utilizes social\nengineering to convince targets to install APKs, discuss the payloads that Flubot recently has\n[distributed (i.e. Flubot and Teabot), and show how the operators verify new bots. The goal of](https://malpedia.caad.fkie.fraunhofer.de/details/apk.anatsa)\nthis blog post is to give the reader a detailed insight in how Flubot’s smishing campaigns\nwork from end to end. It will not reiterate on the capabilities of the malware itself as there are\n[already very detailed write-ups by Incibe CERT,](https://www.incibe-cert.es/sites/default/files/contenidos/estudios/doc/incibe-cert_flubot_analysis_study_2021_v1.pdf) [SWITCH, and](https://securityblog.switch.ch/2021/06/19/android-flubot-enters-switzerland/) [ProDaft.](https://www.prodaft.com/m/reports/FluBot_4.pdf)\n\nIn [our Github repository, we share hashes of Flubot and Teabot payloads, YARA rules to](https://github.com/telekom-security/malware_analysis)\nhunt for the aforementioned malware families, as well as further analysis scripts.\n\n\n-----\n\n## It just starts with one SMS …\n\nIn general, the operators of a botnet (also known as botmasters) face at least two issues\nwhen running a botnet. First, users detect infections and clean up devices. This results in a\nloss of bots. Second, botmasters fully squeeze out bots by, for instance, steal all credentials,\nconduct wire fraud, etc. This is an indirect loss since it turns a valuable bot into a worthless\nbot. The solution to both problems is to acquire new bots.\n\nThe Flubot operators go to great lengths to acquire new bots: they are capable of\ncircumventing carrier SMS content filters to increase the spreading probability as well as\nkeep out security researchers from the botnet to minimize the scrutiny of their botnet.\n\nThe basis for this heavy SMS spamming are the contact lists of Flubot victims that the\nmalware exfiltrates to the command and control server. The command and control server\nregularly sends bots the command “GET_CONTACTS”. Bots respond with all names and\nphone numbers of their contact list. In one case, we could determine that the time from\ncontact exfiltration to the first smishing SMS is only a couple of hours. We utilized a phone\nnumber that was previously not known to the botnet. This example shows how fast the\nspamming machinery of Flubot is spinning.\n\nFlubot’s spreading just starts with just one innocently looking SMS that a target receives and\nwhich was typically sent by someone not known to the target. Such an SMS comprises an\ninformation (e.g. missed call) and a link to follow. The SMS texts changed their theme a\ncouple of times throughout the last months. In August 2021, they matched a voicemail theme\nby resembling messages that network carriers send on missed calls. This changed in\nSeptember 2021 when SMS texts started to abuse the DHL brand. Further changes of\nFlubot’s SMS themes are to be expected as its operators have an history of abusing various\nbrands such as FedEx and Correos (the Spanish postal service) in the past.\n\nThe next figure illustrates such a smishing SMS as received by the target. The SMS text\nstarts with random letters and numbers, which is a way to circumvent carrier SMS content\nfilters. This is followed by a text notifying the target that they missed a call, and a suspicious\nlink they should click on to listen to a voicemail. Links in these SMS fluctuate very often,\nwhich is another way of not getting blocked by SMS carriers. Each link is personalized. For\ninstance, the parameter “5bb0bxt93” of the “r.php” script is likely utilized to track campaign\nsuccess.\n\nFigure 2 Flubot smishing SMS telling a target about a missed called, followed by a\nsuspicious link to click on\n\nAn important piece of Flubot’s success is how it avoids carrier SMS content filters:\n\n-  (1) First, the operators have access to hundreds of hacked websites that they utilize as\nredirects. These hacked websites in their smishing SMS rotate around every ten minutes.\n\n-  (2) Second, they add random letters as prefix or postfix to their smishing SMS.\n\n\n-----\n\n-  (3) Third, they flip one or more letters in their smishing SMS. This may circumvent SMS\ncontent filters as it produces different messages but the messages are still readable by\nhuman beings. For instance, the word “Call” in “Missed Call” is changed to “Coll” as in\n“Missed Coll”.\n\n-  (4) Fourth, they change the capitalization of one or more words in their messages. For\ninstance, the word “demain” (French: tomorrow) will be capitalized to “DEMAIN”.\n\nThe following table illustrates these three circumvention mechanism with several example\nsmishing SMS.\n\n**Country** **SMS** **Method**\n\n\nAustralia New voice-message jecoived:\nhxxp://fyqz[.vip/m.php?REDACTED\n\nAustralia (!) New voice message rzcegved:\nhxxp://tantawy-group[.com/z.php?REDACTED\n\nThe Netherlands 8hd9 Inkomende voice oproep:\nhxxps://sachizi[.com/r.php?REDACTED\n\nAustria Eingehender Anruf:\nhxxps://www.internationalsengroup[.org/jcqsx9.php?\nREDACTED unqm\n\nItaly Notifdca: (1) nuovo messaggic vocale:\nhxxps://bitcoinsociety.passionland[.vn/c.php?\nREDACTED 7jbl6qc\n\n\n(1), (3)\n\n\n(1), (3)\n\n\n(1), (2)\n\n\n(1), (2)\n\n\n(1), (2),\n(3)\n\n\nGermany\n(sent to the\nNetherlands)\n\n\nU heeft 1 nieuwe voicemail. Ga naar\nhxxps://ospreymine[.co/k.php?REDACTED\n\n\n(1)\n\n\nBelgium Votre commande sera LIVREE par DHL DEMAIN\nentre\n11h26 et 14h26. Suivre le progres\nhxxps://bodrumenduro[.com/f.php?REDACTED\n\n\n(1), (4)\n\n\n-----\n\nThe botmasters sometimes utilize Flubot infections of neighboring countries to boost the\nspreading of Flubot in countries where not yet a strong bot base is established. For instance,\nTelekom Security observed how German Flubot infections sent SMS with Dutch texts to\nDutch phone numbers as well as Polish texts to Polish phone numbers in late August 2021.\nThis is in line with Flubot’s extension into these two countries around that time. As a rule of\nthumb, Telekom Security is observing that roughly ten percent of Flubot’s SMS traffic is sent\nto foreign destination phone numbers.\n\nThe spreading of Flubot may cause severe financial damages for Flubot victims as well as\nnetwork carriers. Infected devices may send a SMS message every couple of minutes, which\nmay add up to significant amounts after some days. Especially if SMS messages are sent\nacross borders, which is a typical tactic to boost the initial spreading rate in a new country.\nThe bot queries the rate at which it should send SMS with the command SMS_RATE (see\ntable of relevant commands). We observed values from 4 minutes up to 60 minutes. This\nvalue depends on the current spreading status of the botnet in a specific country. For\ninstance, when the Flubot operators start to spread Flubot in a country, they set the\n[SMS_RATE typically very low (less than 5 minutes). As of September 2021, Telekom](https://www.incibe-cert.es/sites/default/files/contenidos/estudios/doc/incibe-cert_flubot_analysis_study_2021_v1.pdf)\nSecurity observes a daily average of 1000 SMS per day per infected client. However, there\nare some extreme cases of up to 3000 SMS per day.\n\n**Command** **Description**\n\nGET_SMS Query the command and control server for\nsmishing task, consisting of a telephone number\nand a SMS text\n\nSMS_RATE Query the command and control server for the\ndelay time when sending mass SMS\n\nLOG Response of the bot to log data to the command\nand control server. The subcommand LOG, SMS\nlogs individual SMS.\n\nGET_CONTACTS Asks the bot to exfiltrate all names and phone\nnumbers of the victim’s contact list.\n\n## Social Engineering with Lures\n\nThe links of the smishing SMS forward targets to a lure server. The following figures show a\ngenerated website using the Voicemail theme that was presented to targets in August 2021\nand a website using a DHL brand abuse that was presented to targets in September 2021.\nThe lure is generated per target as it shows the real phone number (“Your phone number”) to\n\n\n-----\n\nincrease credibility and hence the probability for the target to fall for this scam. A message\ninstructs the target to download a third-party application by clicking a download button. As of\nSeptember 2021, these downloads are either Flubot or in some cases Teabot. The\nsecondary payload is often distributed through on another (hacked) server as a proxy.\n\nThe lure servers are just hacked WordPress instances. The Flubot gang has access to a\nconsiderable amount of hacked websites that they utilize in their smishing SMS campaigns.\nBlocking the domains of these websites is not feasible as they may change as often as every\nten minutes. Additionally, these are legit blogs that may be cleaned up in the future, which\nwould require a timely unblocking. Telekom Security verified in more than 300 cases that the\nhacked websites were WordPress blogs. Furthermore, it seems that these domains are not\nshared across their geographical campaigns, i.e. the sets of domains per country they\noperate in are likely to be disjoint.\n\nThe lure servers host a heavily obfuscated PHP file (e.g. called “[a-z].php”). Its main task is\nto contact another server of the Flubot infrastructure, generate the lure, and forward the\ntarget to the payload APK once they’ve pressed the download button. As stated in the\nprevious section, there is a personalized ID in the links: hxxps://some-url[.com/k.php?\nPERSONALIZED_ID. On the one side, this personalized ID serves as a way to show the\ncorrect phone number of the target in the lure website. On the other side, it likely serves to\ntrack campaign success. The download is proxied through another server.\n\nFigure 3 Lure website with Voicemail theme presented to targets in August 2021.\n\nFigure 4 Lure website with DHL brand abuse as presented to targets in September 2021\n\n## Overview of the Payload Distribution\n\nAs of September 2021, Telekom Security has observed how Flubot distributed two different\n[malware families: Flubot itself in most of the cases and sometimes Teabot (also known as](https://malpedia.caad.fkie.fraunhofer.de/details/apk.anatsa)\nToddler or Anatsa), another Android banking Trojan.\n\nThe names of the distributed APKs – be it Flubot or Teabot – consistently follow the same\npattern for several weeks. Most time of August 2021 the distributed APKs had a Voicemail\ntheme, which was in line with the smishing SMS the victims received (e.g. “Notification: (1)\nnew voice message:” as observed on 2021-08-24 in Ireland). Each APK was called\n“Voicemail{SMALL_INTEGER}.apk”, where SMALL_INTEGER was in the range of 1 to 100\ntypically. In late August 2021, Telekom Security observed another shift in the lure theme.\nThey shifted back to the parcel theme (e.g. “Visit LINK to manage your delivery. Your order\nORDER_NUMBER will BE delivered SOON.”), which they utilized during the first and second\nquarters of 2021 mostly. Distributed APKs were called “DHL{SMALL_INTEGER}.apk”.\n\n\n-----\n\nFlubot s distribution servers utilizes hash busting. This applies to Flubot and Teabot\npayloads. Hashes of the packed APKs change every hour up to a couple of days as of\nAugust 2021. However, there are counter-examples where hashes where distributed on one\nday and then on another day. There could be several explanations for this behavior like the\ngeneration of a set of binaries and rotating them or caching issues. Hashes appear to be\nalways different in each country they operate in. For instance, the hashes of APKs\ndistributed in Germany and the Netherlands were always different. The following table\nillustrates this using examples from several countries. The two examples of Germany and\nIreland show how hashes reappear within an hour. However, the Australian example serves\nas a counter-example that hash busting is conducted every hour since one hash appeared\non two different days.\n\n**Country** **Hash** **Date**\n\nGermany ecd12174b28729a0b8c708c14c0a086b 2021-08-21-02:13:47\n\nGermany ecd12174b28729a0b8c708c14c0a086b 2021-08-21-03:04:13\n\nIreland 6a75deb9e909ae8a6ef836cf232ae8f2 2021-08-24-17:31:31\n\nIreland 6a75deb9e909ae8a6ef836cf232ae8f2 2021-08-24-17:56:20\n\nAustralia ff772d18979f1e9d70f3324b3e1a25e6 2021-08-22-16:08:05\n\nAustralia ff772d18979f1e9d70f3324b3e1a25e6 2021-08-22-17:14:31\n\nAustralia ff772d18979f1e9d70f3324b3e1a25e6 2021-08-24-03:00:28\n\nHowever, the hashes of the unpacked payloads do not change that often. The unpacked\npayloads are regenerated every couple of hours up to a couple of days per country. Let’s\nvisualize this with an example from Australia. We obtained 62 packed payloads with unique\nhashes from within Australia during the period from 2021-08-19 until 2021-08-24. The\nunpacked payloads have only a handful of unique hashes. We were able to observe only\nsome of them within a couple of hours. However, we observed the hash\nacb9cc224edb2c834a58912ed5e97a31 for more than one day. Another interesting fact is\nhow the unpacked hashes acb9cc224edb2c834a58912ed5e97a31 and\n867329419ab81b51ded9040352ba8717 were distributed during the same time period.\n\n\n-----\n\n**Unpacked MD5 hash** **From** **Until**\n\n81777f62d66f59a1aba5d006836ef080 2021-08-19-18:19:58 2021-08-20-10:17:06\n\n062847f8333e235813ca0fdc3a50650a 2021-08-20-14:04:30 2021-08-21-07:09:56\n\nc6e0f2808d9a5062a4b8ed64445ca36d 2021-08-21-09:38:04 2021-08-22-11:10:15\n\nacb9cc224edb2c834a58912ed5e97a31 2021-08-22-16:08:05 2021-08-24-03:00:28\n\n867329419ab81b51ded9040352ba8717 2021-08-22-20:29:34 2021-08-23-18:57:40\n\nbd72a3dcd754d36cc097563a7b65b7d5 2021-08-24-12:18:09 2021-08-24-14:05:51\n\n## Keeping the Botnet Running BUT Without Security Researchers\n\nFrom a botmaster’s point of view, security researchers are an unnecessary evil who threaten\ntheir operation. What they really hate but hardly can thwart are bot emulations, i.e. partial\nemulations of a bot’s networking protocol that query real command and control servers, for\ninstance, for commands and secondary payloads.\n\nBotmasters implement several mechanisms to thwart security researcher analysis attempts.\nThese mechanisms can be on the client side or on the server side. An example for client side\nanti-analysis mechanisms is application packing. And an example for server side antianalysis mechanisms is a long wait time before the first task is served to a bot in order to\nshut out short running sandboxes from receiving tasks immediately.\n\nApart from the usual application packing that Flubot’s operators utilize (as seen in the\nprevious sections), they’ve implemented a particularly interesting way to check if a new bot\ncan send SMS and hence it isn’t a bot emulation. But how does this exactly work?\n\nPeriodically, bots query the command and control (CC) server for new smishing SMS tasks\nvia the GET_SMS command. The CC server responds with a destination phone number and\na SMS text (e.g. “New voice-message jecoived: hxxp://fyqz[.vip/m.php?REDACTED”).\nHowever, Telekom Security observed how this behavior changed in August 2021. Instead of\nreceiving smishing tasks from the beginning, new bots that queried the CC with GET_SMS\nfor the first time received something else.\n\n\n-----\n\nIn place of a valid SMS text that included a link to a lure server, the SMS text became a\nrandom string consisting of lower ASCII characters and numbers (e.g.\n“xxqgx323550k09yhdplziqnuwkv58r17cmtqe838475r4ynbmgm4qsz9yg7”). In case a bot is\nblocked from sending out SMS but requests new tasks via GET_SMS, then it’ll receive\nanother task with such a random string but never a valid smishing task.\n\nThe destination phone numbers of these invalid smishing tasks are an interesting piece of\ninformation here. Looking up several of them in who-called-me portals reveals that most of\nthese numbers are known to send out smishing SMS. The following figure shows two\nexample lookups. The user comments in these screenshots sound like a general description\nof a Flubot infection (e.g. “text with a link”). So let’s assume that these destination phone\nnumbers are indeed Flubot infections.\n\nSo what’s the point of sending a SMS with some random gibberish to a destination phone\nnumber that is likely to be infected with Flubot as well? Well, if we don’t think of the string as\ngibberish but as of some form of token, then this is clearly a verification protocol. It verifies if\na bot can send out SMS to another bot in the botnet. The CC server detects this because the\nbot of the destination phone number logs SMS to the CC server with the LOG,SMS\ncommand on incoming SMS. This enables the CC server to verify that the destination phone\nnumber indeed received the token sent out by the source phone number. Once a bot\ncompletes this verification protocol, it receives valid smishing tasks via the GET_SMS\ncommand.\n\nIn conclusion, the Flubot operators use their botnet infrastructure to verify if new bots can\nsend out real SMS to already known bots. This proves that new bots are not a bot emulation.\nAs a consequence, the bot is deemed valuable to receive valid SMS tasks via GET_SMS.\n\nFigure 5 Screenshots from www.phonenumbers.ie and www.wemgehoert.at with comments\non two Flubot infections that the botnet utilized to verify further infections.\n\n## Conclusion\n\nIn this blogpost, we’ve seen how Flubot’s smishing campaigns work, how the operators\ncircumvent simple SMS content filters, and what countermeasures (e.g. geo-fencing, bot\nverification, application packing) they keep on adding to increase the analysis difficulty of the\nbotnet for security researchers. This threat is a huge but often overlooked problem for a\nvariety of stakeholders including but not limited to the users, the carriers, the Android\necosystem, and law enforcement. One could say that Flubot is for SMS what Emotet was for\nemail: a spam kingpin!\n\n## Further information:\n\n[Android FluBot enters Switzerland](https://securityblog.switch.ch/2021/06/19/android-flubot-enters-switzerland/)\n\n\n-----\n\n[Incibecert flubot analysis study 2021](https://www.incibe-cert.es/sites/default/files/contenidos/estudios/doc/incibe-cert_flubot_analysis_study_2021_v1.pdf)\n\n[Prodaft report Flubot](https://www.prodaft.com/m/reports/FluBot_4.pdf)\n\n© iStock\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-14 - Flubot’s Smishing Campaigns under the Microscope.pdf"
    ],
    "report_names": [
        "2021-09-14 - Flubot’s Smishing Campaigns under the Microscope.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535727,
    "ts_updated_at": 1743041316,
    "ts_creation_date": 1653686019,
    "ts_modification_date": 1653686019,
    "files": {
        "pdf": "https://archive.orkl.eu/5a17db9a40da0d69372e33db2624580edec187d1.pdf",
        "text": "https://archive.orkl.eu/5a17db9a40da0d69372e33db2624580edec187d1.txt",
        "img": "https://archive.orkl.eu/5a17db9a40da0d69372e33db2624580edec187d1.jpg"
    }
}