{
    "id": "ffccccaf-2697-438e-8965-7031740ec1b8",
    "created_at": "2023-01-12T15:10:04.730902Z",
    "updated_at": "2025-03-27T02:17:05.599894Z",
    "deleted_at": null,
    "sha1_hash": "6764f2f59f07fb09f7bf29ae65c80ca356259fb1",
    "title": "2022-02-01 - Inside Trickbot, Russia’s Notorious Ransomware Gang",
    "authors": "",
    "file_creation_date": "2022-05-27T22:05:19Z",
    "file_modification_date": "2022-05-27T22:05:19Z",
    "file_size": 5855850,
    "plain_text": "# Inside Trickbot, Russia’s Notorious Ransomware Gang\n\n**[wired.com/story/trickbot-malware-group-internal-messages/](https://www.wired.com/story/trickbot-malware-group-internal-messages/)**\n\nMatt Burgess February 1, 2022\n\nWhen the phones and computer networks went down at Ridgeview Medical Center’s three\n[hospitals on October 24, 2020, the medical group resorted to a Facebook post to warn its](https://www.facebook.com/ridgeviewhospitalsandclinics/posts/3602349299816921)\n[patients about the disruption. One local volunteer-run fire department said ambulances were](https://www.facebook.com/permalink.php?story_fbid=3672210586176490&id=286134231450826)\nbeing diverted to other hospitals; officials [reported patients and staff were safe. The](https://www.swnewsmedia.com/chanhassen_villager/news/local/unusual-network-activity-at-ridgeview-medical-center/article_5fc12f6e-c320-59d4-9ad4-24f5cb985a36.html)\n[downtime at the Minnesota medical facilities was no technical glitch; reports quickly linked](https://krebsonsecurity.com/2020/10/fbi-dhs-hhs-warn-of-imminent-credible-ransomware-threat-against-u-s-hospitals/comment-page-1/)\nthe activity to one of Russia’s most notorious ransomware gangs.\n\nThousands of miles away, just two days later members of the Trickbot cybercrime group\nprivately gloated over what easy targets hospitals and health care providers make. “You see,\nhow fast, hospitals and centers reply,” Target, a key member of the Russia-linked malware\ngang, boasted in messages to one of their colleagues. The exchange is included in\npreviously unreported documents, seen by WIRED, that consist of hundreds of messages\nsent between Trickbot members and detail the inner workings of the notorious hacking\ngroup. “Answers from the rest, [take] days. And from the ridge immediately the answer flew\nin,” Target wrote.\n\n\n-----\n\nAs Target typed, members of Trickbot were in the middle of launching a huge wave of\nransomware attacks against hospitals across the United States. Their aim: to force hospitals\nbusy responding to the surging Covid-19 pandemic to quickly pay ransoms. The series of\n[attacks prompted urgent warnings from federal agencies, including the Cybersecurity and](https://www.cisa.gov/uscert/ncas/alerts/aa20-302a)\nInfrastructure Security Agency and the Federal Bureau of Investigation. “Fuck clinics in the\nusa this week,” Target said as they gave the instruction to start targeting a list of 428\nhospitals. “There’s gonna be a panic.”\n\nThe documents seen by WIRED include messages between senior members of Trickbot,\ndated from the summer and autumn of 2020, and expose how the group planned to expand\nits hacking operations. They lay bare key members’ aliases and show the ruthless attitude of\nmembers of the criminal gang.\n\nThe messages were sent in the months before and shortly after US Cyber Command\ndisrupted much of Trickbot’s infrastructure and temporarily stopped the group’s work. Since\n[then the group has scaled up its operations and evolved its malware, and it continues to](https://www.zdnet.com/article/trickbot-will-now-try-to-crash-researcher-pcs-to-stop-reverse-engineering-attempts/)\ntarget businesses around the world. While Russia’s  Federal Security Service has recently\n[arrested members of the REvil ransomware gang—following diplomatic efforts between](https://www.wired.com/story/russia-revil-ransomware-arrests-ukraine/)\npresidents Joe Biden and Vladimir Putin—Trickbot’s inner circle has so far been left relatively\nunscathed.\n\n“They're trying to infect as many people as possible.”\n\nLimor Kessem, IBM Security\n\nThe Trickbot group evolved from the banking trojan Dyre around the end of 2015, when\nDyre’s members [were arrested. The gang has grown its original banking trojan to become an](https://www.forbes.com/sites/thomasbrewster/2016/02/08/russia-arrests-dyre-malware-masterminds/?sh=63e2f942227f)\nall-purpose hacking toolkit; individual modules, which operate like plugins, allow its operators\nto deploy Ryuk and Conti ransomware, while other functions enable keylogging and data\ncollection. “I don't know any other malware families that have so many modules or extended\nfunctionalities,” says Vlad Pasca, a senior malware analyst at security company Lifars who\nhas decompiled Trickbot’s code. That sophistication has helped the gang, also known as\nWizard Spider, collect millions of dollars from victims.\n\nA core team of around half a dozen criminals sits at the heart of Trickbot’s operations,\naccording to the documents reviewed by WIRED and security experts who track the group.\nEach member has their own specialities, such as managing teams of coders or heading up\nransomware deployments. At the head of the organization is Stern. (Like all the monikers\nused in this story, the real-world name, or names, behind the handles are unknown. They\nare, however, the identities the group uses when talking to each other.)\n\n“He is the boss of Trickbot,” says Alex Holden, who is CEO of cybersecurity firm Hold\nSecurity and has knowledge of the workings of the gang. Stern acts like a CEO of the\nTrickbot group and communicates with other members who are at a similar level. They may\n\n\n-----\n\nalso report to others who are unknown, Holden says. Stern does not get into the technical\nside as much,” he says. “He wants reports. He wants more communication. He wants to\nmake high-level decisions.”\n\nOn August 20, 2020, the chat logs—provided by a cybersecurity source with knowledge of\nthe group—show Target briefing Stern on how the group would expand in the coming weeks.\n“There will be 6 offices for sure and 50-80 people by the end of September,” Target said in\none of a flurry of 19 messages. These offices are believed to be based in Russia’s secondlargest city, Saint Petersburg. Kimberly Goody, director of cybercrime analysis at security firm\nMandiant, says the group “most likely” has a significant presence there. Current estimates\nsay Trickbot has anywhere from 100 to 400 members, making it one of the largest\ncybercrime groups in existence.\n\nMessages between Target and Stern show that in mid-2020 the group was spending money\non three main areas. Two offices—“one main and one new for training”—were being used for\nthe current operators’ expenses and expansion. “Hacker offices,” where 20-plus people\nworked, would be used for interviews, equipment, servers, and hiring, Target said. And\nfinally, there would be an office for “programmers” and their equipment. “A good team leader\nhas already been hired, and he will help gather the team,” Target continued. “I’m sure that\neverything will pay off, so I’m not nervous.”\n\nThroughout the conversations viewed by WIRED, the group makes various references to\n“senior managers” working as part of Trickbot and its businesslike structure. “There is\ngenerally a core team of developers,” Goody explains. “There's a manager who oversees\ndevelopment work, and they have coders that work under them on specific projects.”\nMembers of the group are encouraged to propose ideas, such as new scripts or malware,\nthat developers could work on, Goody says, and generally the lower-level workers don’t talk\nto their senior colleagues. Most of the group’s internal conversations, according to various\nsources—including US court documents—happen through instant messages on Jabber\nservers.\n\nA gang member going by the moniker Professor oversees much of the ransomware\ndeployment work, Goody says. “Professor, who we believe also goes by the name Alter,\nseems to be a relatively significant player in terms of managing these specific ransomware\ndeployment operations,” Goody says, “as well as requesting development of specific tools\nthat would help enable those.” She adds that Professor has been linked to Conti ransomware\noperations in the last year and “appears to lead multiple sub-teams or has multiple team\nleaders” that report to them.\n\nThat wouldn’t be the only working relationship Trickbot’s team has with outside parties. In the\nconversations seen by WIRED, Target says the group will “learn to collaborate” with those\nbehind the Ryuk ransomware, indicating that the two organizations are largely separate. And\nwhile the Trickbot group hasn’t been linked to hacking operations run by the Russian state—\n[such as the activities of Sandworm—the core members of the gang make reference to](https://www.wired.com/story/sandworm-kremlin-most-dangerous-hackers/)\n\n\n-----\n\nKremlin-backed activities. Stern mentioned setting up an office for government topics in\n[July 2020. In response, Professor said the hacking group Cozy Bear is “working their way](https://www.wired.com/story/cozy-bear-dukes-russian-hackers-new-tricks/)\ndown the list” of potential Covid-19 targets.\n\nIn one set of internal conversations, Target answers questions from a group member who is\nconcerned about being caught. The person is worried that colleagues could expose their\nlocations, through leaking their IP addresses, when they don’t use a VPN to mask their\nwhereabouts. Target says IP address exposure shouldn’t be a problem: “Here it is\nguaranteed that no one will touch you and you are probably not going to fly somewhere\nanyway.”\n\nPrior to the REvil arrests, the Kremlin and Russian authorities spent years allowing\nransomware groups believed to be based in the country to operate with relative impunity.\n“There seems to be very deliberate separation and non-attacks of any Russian interests by\nTrickbot, Ryuk, Emotet, and Conti because they don’t want confrontation with the\ngovernment,” Holden says. However, not all of Trickbot’s members are in Russia. The\nconversations among the group viewed by WIRED reveal at least two members appear to be\n[based in Belarus—during the summer of 2020 when Belarus shut down the internet Stern](https://www.wired.co.uk/article/belarus-protests-telegram)\nsaid that one member, a coder called Hof, would not be online until “the internet problem in\nBelarus is solved.”\n\nThese exchanges likely comprise only a small element of the group’s interactions. Some\ndetails of TrickBot’s inner workings were also revealed in June and October 2021, when the\nUS Department of Justice unsealed and unredacted charges against two alleged Trickbot\nmembers, Alla Witte and Vladimir Dunaev. The indictment, which also covers other unnamed\nmembers of the Trickbot group, focuses on the group’s hacking and money laundering but\nalso provides snippets of conversations. Goody says some private communication channels\ncan contain dozens of members of the group.\n\nCoders and developers recruited by Trickbot are drawn in from job postings on dark web\nforums but also on open web Russian-language freelancer websites, the DOJ indictment\nsays. While many of the job ads are hiding in plain sight, they don’t explicitly say successful\napplicants will be working for one of the world’s most ruthless cybercriminal groups. One job\nad the indictment points to calls for someone who is an experienced reverse engineer and\nknows the coding language C++. The ad, which has long-since expired, says the job was\nfocused around web browsers on Windows, involved working remotely, and had a budget of\n$7,000. A long-term position would potentially be possible if the work was completed\nsuccessfully, the ad says.\n\nHolden says Trickbot uses multiple layers during its hiring process in an effort to weed out\nthose without the technical skills needed, and also cybersecurity companies trying to gather\nintelligence. Anyone applying for work has to pass an initial screening before moving on to\n\n\n-----\n\ntough skills tests, he says. The questions are very complex technologically, he explains.\nGoody adds that penetration testers working for the group can be paid $1,500 per month,\nplus a cut of ransoms that are paid.\n\nDuring the recruitment process, Holden says, it is “acknowledged” that these aren’t everyday\nroles. Holden says he has seen ads that tell potential recruits they will be working for a\nstartup involved in bug bounties, and that most of its funding comes from abroad. “The\nmajority understand that this is blackhat and asking for the commercial target,” Trickbot\nconversations within the DOJ indictment say, referring to criminal hacking activities. “We\nneed to stop communicating with idiots.”\n\nThe two alleged members of Trickbot named by the DOJ—Witte and Dunaev—were arrested\nby law enforcement outside of Russia. Witte, a 55-year-old Latvian national who lived in\nSuriname, was arrested in June 2021 while traveling to Miami and is charged with 19 counts\nthat range from identity theft to bank fraud. She’s [accused of being one of Trickbot’s malware](https://www.justice.gov/opa/pr/latvian-national-charged-alleged-role-transnational-cybercrime-organization)\ndevelopers and allegedly exposed herself after hosting Trickbot’s malware on her personal\ndomain name. Dunaev, 38, was extradited from the Republic of Korea to Ohio in October\n[2021 and is also accused of developing Trickbot’s malware.](https://www.justice.gov/opa/pr/russian-national-extradited-united-states-face-charges-alleged-role-cybercriminal)\n\nDespite the arrests and wider ransomware crackdowns in Russia, the Trickbot group has not\nexactly gone into hiding. Toward the end of last year, the group [boosted its operations, says](https://securityintelligence.com/posts/trickbot-gang-doubles-down-enterprise-infection/)\nLimor Kessem, an executive security advisor at IBM Security. “They're trying to infect as\nmany people as possible by contracting out the infection,” she says. Since the start of 2022,\nthe IBM security team has seen Trickbot increase its efforts to evade security protections and\n[conceal its activity. The FBI also formally linked the use of the Diavol ransomware to Trickbot](https://securityintelligence.com/posts/trickbot-bolsters-layered-defenses-prevent-injection/)\nat the beginning of the year. “Trickbot doesn't seem to be targeting very specifically; I think\nwhat they have is numerous affiliates working with them, and whoever brings the most\nmoney is welcome to stay,” Limor says.\n\nHolden too says he has seen evidence that Trickbot is ramping up its operations. “Last year\nthey invested more than $20 million into their infrastructure and growth of their organization,”\nhe explains, citing internal messages he has seen. This money, he says, is being spent on\neverything Trickbot does. “Staffing, technology, communications, development, extortion” are\nall getting extra investment, he says. The move points to a future where—after the takedown\nof REvil—the Trickbot group may become the primary Russia-linked cybercrime gang. “You\nexpand in the hope of getting that money back in spades,” Holden says. “It’s not like they are\nplanning to close the shop. It’s not like they are planning to downsize or run and hide.”\n\nMore Great WIRED Stories\n\n📩 The latest on tech, science, and more: [Get our newsletters!](https://www.wired.com/newsletter?sourceCode=BottomStories)\n[The quest to trap CO in stone—and beat climate change2](https://www.wired.com/story/the-quest-to-trap-carbon-in-stone-and-beat-climate-change/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[The trouble with Encanto? It twerks too hard](https://www.wired.com/story/disney-encanto-twerks-too-hard/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n\n\n-----\n\n[Here s how Apple s iCloud Private Relay works](https://www.wired.com/story/how-apple-icloud-private-relay-works/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\nThis app gives you a tasty way to [fight food waste](https://www.wired.com/story/too-good-to-go-app-food-waste/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[Simulation tech can help predict the biggest threats](https://www.wired.com/story/simulation-tech-global-threats-prediction/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[👁 Explore AI like never before with our new database](https://www.wired.com/category/artificial-intelligence/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n✨ Optimize your home life with our Gear team’s best picks, from [robot vacuums to](https://www.wired.com/gallery/best-robot-vacuums/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[affordable mattresses to](https://www.wired.com/gallery/best-mattresses/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc) [smart speakers](https://www.wired.com/gallery/best-google-speakers-buying-guide/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-01 - Inside Trickbot, Russia’s Notorious Ransomware Gang.pdf"
    ],
    "report_names": [
        "2022-02-01 - Inside Trickbot, Russia’s Notorious Ransomware Gang.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536204,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653689119,
    "ts_modification_date": 1653689119,
    "files": {
        "pdf": "https://archive.orkl.eu/6764f2f59f07fb09f7bf29ae65c80ca356259fb1.pdf",
        "text": "https://archive.orkl.eu/6764f2f59f07fb09f7bf29ae65c80ca356259fb1.txt",
        "img": "https://archive.orkl.eu/6764f2f59f07fb09f7bf29ae65c80ca356259fb1.jpg"
    }
}